{
    "id": "0209a2398de48ff258881b42e6483c65",
    "messages": [
        "b07211a0c7cb119232799d2119cea90f (22:38): hmm, the TAG don't really think document.write() will ever go away, do they?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:39): b07211a0c7cb119232799d2119cea90f: Oh, probably they do think it will.",
        "b07211a0c7cb119232799d2119cea90f (22:39): I was hoping DanC wouldn't think that, really...",
        "ab7faae5d7b250ea8606486575f8f79c (22:42): The need to use document.write() when writing new content may go away",
        "ab7faae5d7b250ea8606486575f8f79c (22:42): which seems a much more realistic goal",
        "ab7faae5d7b250ea8606486575f8f79c (22:43): and arguably a useful one since document.write() is crazy and confusing and so it'd be nice if alternatives were provided so that all use cases could be solved without document.write()",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:44): ab7faae5d7b250ea8606486575f8f79c: there's no way browser vendors would pull document.write() support, though, so it needs to be specified and implmented",
        "ab7faae5d7b250ea8606486575f8f79c (22:44): b8810fee2f4a71f849f3f7409546d1d9: Indeed",
        "b25b6b77a0087ff8385941e5545d32ea (22:44): ab7faae5d7b250ea8606486575f8f79c: Authors seem to like document.write which suggestss that they just avoid the crazy bits",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:45): yeah. It's not too crazy when there's only one level of it",
        "b25b6b77a0087ff8385941e5545d32ea (22:45): (much as I dislike document.write, I guess it is one of the most successful parts of the DOM in terms of usage)",
        "ab7faae5d7b250ea8606486575f8f79c (22:46): There's the &quot;I don't want to switch my site to XHTML because it'll break all my (ad provider's) document.write code&quot; which could be solved if more people didn't think document.write was a useful/necessary feature",
        "ab7faae5d7b250ea8606486575f8f79c (22:46): *the &quot;...&quot; argument",
        "ab7faae5d7b250ea8606486575f8f79c (22:47): which is relevant in terms of the everyone-should-gradually-migrate-to-XHTML view of the future",
        "b25b6b77a0087ff8385941e5545d32ea (22:47): You seem to have misse out the word dystopian somewhere",
        "b25b6b77a0087ff8385941e5545d32ea (22:48): decides it is time to go home",
        "ab7faae5d7b250ea8606486575f8f79c (22:49): Hmm, now I remember why it's a bad idea to provide test results",
        "ab7faae5d7b250ea8606486575f8f79c (22:49): I want to make some minor updates to my tests, but I don't want the published results to be out of sync with the tests, but I don't want to run the tests in ten different browsers again :-(",
        "ab7faae5d7b250ea8606486575f8f79c (22:50): I guess I'll leave the updates offline for now, until I get non-lazy enough to do another iteration of the whole process",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:56): b8810fee2f4a71f849f3f7409546d1d9: yeah, it's intentional to eat all end tags, and &quot;all other&quot; is just for consistency with the rest of the spec, though i guess i should make that clear. i've noted your e-mail on the subject.",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:00): 69b0d3dfe919a6b860a9fac82de52a7e: ok. thanks. Did you notice that deferring tag eating until after head (as opposed to in head) makes error situations a bit weird?",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:00): i noticed you noticing it, i don't recall it being intentional",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:01): 69b0d3dfe919a6b860a9fac82de52a7e: ok. might be worth fixing if it doesn't cause badness with comments and whitespace. (I haven't investigated if that is the case.)",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:01): you sent mail right?",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:01): I didn't.",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:01): ah ok",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:01): send mail :-)",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:02): right now i'm so far from caring about hte parser section that it's not even funny :-)",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:02): too deeply stuck in the mud that is uris",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:05): 69b0d3dfe919a6b860a9fac82de52a7e: I filed a bug.",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:06): that works too",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:06): 69b0d3dfe919a6b860a9fac82de52a7e: should I send mail to whatwg about SVG &lt;defs&gt;&lt;font&gt; or does the remark in the middle of a public-html email count?",
        "ab7faae5d7b250ea8606486575f8f79c (23:09): It's already in http://canvex.lazyilluminati.com/misc/cgi/issues.cgi/message/%3C14B846F4-08C1-4A5D-8E19-B4ECCF25122F%40iki.fi%3E",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:09): thanks",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:13): b8810fee2f4a71f849f3f7409546d1d9: the remark counts",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:13): b8810fee2f4a71f849f3f7409546d1d9: however i don't know what to do about it",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:14): b8810fee2f4a71f849f3f7409546d1d9: the svg &lt;font&gt;s overwhelm the html &lt;font&gt;s in my data, so visual inspection doesn't work",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:14): b8810fee2f4a71f849f3f7409546d1d9: and i'm not sure how else to distinguish them",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:14): ooh, maybe attributes",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:15): I was thinking that a &lt;defs&gt; parent would reduce the probability of &lt;font&gt; being a cargo cult HTML &lt;font&gt;",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:16): right but i still have to test it",
        "ab7faae5d7b250ea8606486575f8f79c (23:19): What the children of &lt;font&gt;? If a child is an HTML element or plain text, then presumably it's an HTML &lt;font&gt;; otherwise the children are probably SVG elements",
        "ab7faae5d7b250ea8606486575f8f79c (23:19): *What about the",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:19): hmm. looks like valid SVG can have &lt;font&gt; outside &lt;defs&gt; :-(",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:20): ab7faae5d7b250ea8606486575f8f79c: making a decision based on children would seriously suck in the tree builder",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:20): ab7faae5d7b250ea8606486575f8f79c: because you haven't seen the children when you need to deal with &lt;font&gt;",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:20): inspecting attributes seems like a much better idea",
        "ab7faae5d7b250ea8606486575f8f79c (23:21): b8810fee2f4a71f849f3f7409546d1d9: The &lt;font&gt; could always be interpreted as an SVG &lt;font&gt;, and the tree builder could break out of SVG mode once it's realised a child is wrong",
        "ab7faae5d7b250ea8606486575f8f79c (23:21): which would slightly break the formatting of the HTML content, since the &lt;font&gt; would no longer be an HTML &lt;font&gt;",
        "ab7faae5d7b250ea8606486575f8f79c (23:22): but that's only a minor formatting problem, not a make-the-whole-rest-of-the-page-invisible problem",
        "f5af272b5b04154c260eec46f4deb905 (23:25): wonders if Google Adsense provides an XHTML-friendly way to include Adsense ads in pages (as opposed to the document.write methods). And if not, is 69b0d3dfe919a6b860a9fac82de52a7e talking with those folks?",
        "ab7faae5d7b250ea8606486575f8f79c (23:27): imagines they might have concerns about what to do when people use the XHTML-AdSense inside text/html pages",
        "ab7faae5d7b250ea8606486575f8f79c (23:28): and I guess they'd prefer not to serve code for both HTML and XHTML insertion and dynamically choose between them, since that makes the ads bigger and slower",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:29): IIRC, the conspiracy theory was that Google couldn't figure out how to make AdSense work with XHTML, so they hired 69b0d3dfe919a6b860a9fac82de52a7e to write HTML5 and kill XHTML",
        "ab7faae5d7b250ea8606486575f8f79c (23:29): and the risk of confusing the tens of percent of people who think they're using XHTML, just to benefit the zero percent who are really using XHTML, doesn't seem great :-(",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:29): (I don't recall the source of the conspiracy theory)",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:31): ab7faae5d7b250ea8606486575f8f79c: presumably, a single piece of code could assemble ads in both XHTML and HTML and use if (document.createElementNS) to decide whether to use createElementNS or createElement",
        "ab7faae5d7b250ea8606486575f8f79c (23:32): b8810fee2f4a71f849f3f7409546d1d9: That code would be more bytes, so the ads would be bigger and slower",
        "ab7faae5d7b250ea8606486575f8f79c (23:33): Only a tiny bit, but a tiny bit multiplied by billions of views per day makes the viewers unhappy"
    ],
    "person_ids": [
        "b07211a0c7cb119232799d2119cea90f",
        "a11aabeeceeae6b8cb5d12ea06b56554",
        "ab7faae5d7b250ea8606486575f8f79c",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "b25b6b77a0087ff8385941e5545d32ea",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "f5af272b5b04154c260eec46f4deb905"
    ]
}