{
    "id": "023e1252ed28cf980f5cb59ea4069d7d",
    "messages": [
        "3c1a153d81002878b83df957ee534f47 (00:14): 88a816211805ad37db9062d4c1d342a7 there's been a lot of work on hListing, and it's still considered a relatively &quot;new&quot; format",
        "3c1a153d81002878b83df957ee534f47 (00:14): I'd suggest also joining the microformats-new mailing list",
        "3c1a153d81002878b83df957ee534f47 (00:14): and sending a posting out saying you'd like to help contribute to it",
        "3c1a153d81002878b83df957ee534f47 (00:14): so that folks who have worked on it so far can get to know you and you can all work together",
        "3c1a153d81002878b83df957ee534f47 (00:15): http://microformats.org/mailman/listinfo/microformats-new/",
        "88a816211805ad37db9062d4c1d342a7 (00:15): tantek: ok - I'm coding up some hlistings now in BBedit - just to get my head around it .. I'll join now, thanks.",
        "3c1a153d81002878b83df957ee534f47 (00:15): excellent - I use BBEdit as well",
        "3c1a153d81002878b83df957ee534f47 (00:16): just saw your /wiki/to-do additions, looks good",
        "88a816211805ad37db9062d4c1d342a7 (00:16): I've refrained from upgrading from 8.x to 9.x (BBedit) - but am tempted to - not sure how much of a shock it will be.",
        "88a816211805ad37db9062d4c1d342a7 (00:19): thanks - need to try and keep up to date with work on the wiki - the more I use microformats - the deeper I'll get into the site, really well organised tantek .",
        "3c1a153d81002878b83df957ee534f47 (00:25): I'm still using BBEdit 7.1.4 - works fine, is compatible with Classic etc. ;)",
        "3c1a153d81002878b83df957ee534f47 (00:26): thanks for your kind words. and the wiki can still be improved a lot - welcome on board!",
        "88a816211805ad37db9062d4c1d342a7 (00:36): Cheers ! I still have an old Titanium Powerbook (550Mhz G4) - Good for classic :) - keep wondering what I should do with it.",
        "88a816211805ad37db9062d4c1d342a7 (00:37): Anyhow - I've just sent an email to microformats-new - lets see what happens next.",
        "3c1a153d81002878b83df957ee534f47 (00:37): great - that should work",
        "3c1a153d81002878b83df957ee534f47 (00:38): and definitely encourage folks to join you in IRC to discuss things more quickly",
        "3c1a153d81002878b83df957ee534f47 (00:38): there's quite a bit of interest in hListing",
        "88a816211805ad37db9062d4c1d342a7 (00:40): cool - I've not seen anything from mailman yet - maybe google has filed it in spam (checking)",
        "3c1a153d81002878b83df957ee534f47 (00:40): be sure to set your client to send as plain text",
        "3c1a153d81002878b83df957ee534f47 (00:40): and send from the address you signed up with",
        "3c1a153d81002878b83df957ee534f47 (00:41): looks like it made it to the archives:",
        "3c1a153d81002878b83df957ee534f47 (00:41): http://microformats.org/discuss/mail/microformats-new/2009-September/002093.html",
        "3c1a153d81002878b83df957ee534f47 (00:41): that's you right?",
        "88a816211805ad37db9062d4c1d342a7 (00:41): yup",
        "3c1a153d81002878b83df957ee534f47 (00:41): great. add yourself to http://microformats.org/wiki/irc-people also",
        "88a816211805ad37db9062d4c1d342a7 (00:41): so its been filed as spam in gmail - fixing that now.",
        "3c1a153d81002878b83df957ee534f47 (00:41): since you have more than one alias and it will help people correlate usernames :)",
        "88a816211805ad37db9062d4c1d342a7 (00:42): hmmm thought about changing my irc nick",
        "88a816211805ad37db9062d4c1d342a7 (00:43): originally I returned to IRC (after a long break) purely for one thing to do with the company (hence 88a816211805ad37db9062d4c1d342a7)",
        "88a816211805ad37db9062d4c1d342a7 (00:44): I might create/ a new ID for irc - tally's more with my online id .. in fact the more I think of it .. signing up for a new freenode nick now :)",
        "06bd2e4f0601355183c4fd48df65f54b (00:46): tantek: could we open a page dedicated to the &quot;at-most-one-required&quot; concept?  Perhaps it's already opened, and I missed it?",
        "06bd2e4f0601355183c4fd48df65f54b (00:47): I'd like to explore one of the key concepts (Martin addressed it earlier today)",
        "06bd2e4f0601355183c4fd48df65f54b (00:47): where the choice is between nothing, and using a microformat, it is nearly self-evident that &quot;required&quot; fields are problematic",
        "3c1a153d81002878b83df957ee534f47 (00:50): 06bd2e4f0601355183c4fd48df65f54b - I'm convinced that it should be nothing required now.",
        "3c1a153d81002878b83df957ee534f47 (00:50): the root class alone should mean something",
        "3c1a153d81002878b83df957ee534f47 (00:50): and it makes it *much* easier for folks to get started with microformats",
        "3c1a153d81002878b83df957ee534f47 (00:51): (having run this by first-timers at workshops etc.)",
        "3c1a153d81002878b83df957ee534f47 (00:51): out for lunch",
        "3c1a153d81002878b83df957ee534f47 (00:51): bbiab",
        "06bd2e4f0601355183c4fd48df65f54b (00:52): however, when there is a gradient of choices, one that presents an increasingly specific expression, I think it's worth considering the exact opposite of that approach--in other words, in specialized derivatives of broad microformats, *nothing* should be optional.",
        "06bd2e4f0601355183c4fd48df65f54b (00:54): anything (and here, this might be exaggerated) worth capturing as &quot;optional&quot; should be promoted into the base.  I'm thinking here specifically of the news format to hatom, where the optional &quot;geo&quot; I believe should be promoted into hatom, and removed from the news format.",
        "06bd2e4f0601355183c4fd48df65f54b (00:57): tantek: for when you get back, I agree with you.  I wonder, however, if there isn't a bit of a false dilemma where the news format is concerned: if someone cannot produce the required fields, it isn't as if they can't produce a uF'd content.  In fact, they can: every news formatted story is first and foremost an hatom hentry.",
        "06bd2e4f0601355183c4fd48df65f54b (01:03): That way, there is value in even taking the first step (and simply producing hatom).  If the publisher, or anyone wanting to get started with microformats wants to start there, they can--and if there is any incentive to move to the stricter format, they can.",
        "06bd2e4f0601355183c4fd48df65f54b (01:13): Incidentally, the more I think about the &quot;nothing required&quot;, the more I like it.  The risk, it seems to me, is there isn't a single data point for you (as a consumer) to differentiate the information you're looking at.  It might be that in an effort to avoid the &quot;90210&quot; effect on data, we tumble into the &quot;wasteland&quot; effect, full of partially described and often indistinguishable points of data.",
        "06bd2e4f0601355183c4fd48df65f54b (01:15): I suppose the compensation for that then is that consumers can choose when to ignore content, deciding for themselves what is &quot;enough&quot;.  For instance, Google might decide to ignore certain hcalendar events that don't provide enough information for *them*.  Is that your intent?"
    ],
    "person_ids": [
        "3c1a153d81002878b83df957ee534f47",
        "88a816211805ad37db9062d4c1d342a7",
        "06bd2e4f0601355183c4fd48df65f54b"
    ]
}