{
    "id": "044fbe9353c1baed199bc074f4dcafbb",
    "messages": [
        "aab3a49c70927221217a805ccde30f58 (20:25): Guys, can't really somebody explain me how will Apache Tomcat work if we only unpack its files in &quot;C:\\Program Files\\Apache Software Fondation\\Tomcat&quot; and edit few values in &quot;server.xml&quot;? I mean how will the system recognize that it has Tomcat to pass to it HTTP-Requests? Please...   Waiting for your answer. Thanks.",
        "51f7ed43858cd2419f1b5359a7763eb9 (20:29): J-Pro: if you ask me .. it won't. (as long as 'unpacking' just means extracting files from an archive)",
        "aab3a49c70927221217a805ccde30f58 (20:31): swente, that's what I'm trying to prove here....   I've asked if I can do a silent install of Apache Tomcat 5.0.28, but people say that it's enough only to unpack it and it will work...",
        "aab3a49c70927221217a805ccde30f58 (20:32): Does anybody know what should I do more to make Apache fully working?",
        "51f7ed43858cd2419f1b5359a7763eb9 (20:32): J-Pro: i'm afraid that's a misapprehension",
        "aab3a49c70927221217a805ccde30f58 (20:32): Tomcat I meant",
        "aab3a49c70927221217a805ccde30f58 (20:32): swente, maybe you know how to help me? Maybe somebody else could help?",
        "51f7ed43858cd2419f1b5359a7763eb9 (20:34): J-Pro: i don't know how tomcat is &quot;usually&quot; registered as service. but i assume you might write sortof script which does minor config-tweaks, i needed, and call the &quot;service regsitrator&quot; with one click.",
        "51f7ed43858cd2419f1b5359a7763eb9 (20:34): s/i needed/if needed/",
        "84b77faa0f84c13d2f7b769359c19b05 (20:34): swente meant: J-Pro: i don't know how tomcat is &quot;usually&quot; registered as service. but i assume you might write sortof script which does minor config-tweaks, if needed, and call the &quot;service regsitrator&quot; with one click.",
        "51f7ed43858cd2419f1b5359a7763eb9 (20:35): *sigh* (smartass)",
        "aab3a49c70927221217a805ccde30f58 (20:42): swente, but if it will be not Windows?",
        "51f7ed43858cd2419f1b5359a7763eb9 (20:44): J-Pro: i'd say regardless of platform you need to do some steps after unpacking the tomcat-archive: if it's adding some init-scripts to /etc/&lt;whererver-the-distro-needs-them&gt; or executing a tool registering tomcat as system-service (or adding it to autostart-folder)",
        "cf21dd06d1eda7351c0080b683ba2cfb (20:44): Type safety: The cast from Object to HashMap&lt;String,String&gt; is actually checking against the  erased type HashMap &lt;- what does this mean?",
        "31cf935e8fa5e0cbf72107ef6437bf94 (20:45): that the interface or whatever declares HashMap and not HashMap&lt;String,String&gt;",
        "aab3a49c70927221217a805ccde30f58 (20:45): Did anybody from here ever do a silent install of Apache Tomcat on different platforms or at least on one?",
        "aab3a49c70927221217a805ccde30f58 (20:45): swente, thanks for help, I'll try to search the web for that question....",
        "31cf935e8fa5e0cbf72107ef6437bf94 (20:47): jpro: third time yes",
        "31cf935e8fa5e0cbf72107ef6437bf94 (20:48): jpro: tomcat or tomcat+apache",
        "31cf935e8fa5e0cbf72107ef6437bf94 (20:49): i have the feeling i have no voice on the channel....",
        "5247c06066d9263a1d0c88d6100b0cae (20:56): btw figureed out what the problems was if anyone wants to know",
        "5247c06066d9263a1d0c88d6100b0cae (20:56): javas security manager was on :P",
        "5247c06066d9263a1d0c88d6100b0cae (20:56): bye bye now",
        "aab3a49c70927221217a805ccde30f58 (20:56): dvayanu, Tomcat only",
        "aab3a49c70927221217a805ccde30f58 (20:59): dvayanu, sorry for asking, but I really need to know... In plus, it's very interesting for me...  Thanks in advance.",
        "51f7ed43858cd2419f1b5359a7763eb9 (21:00): J-Pro: do you know the steps you have to perform to install tomcat on a windows box, and register it to windows as a service?",
        "aab3a49c70927221217a805ccde30f58 (21:03): swente, I don't know it yet, :(",
        "aab3a49c70927221217a805ccde30f58 (21:03): can you help me with that?",
        "51f7ed43858cd2419f1b5359a7763eb9 (21:04): J-Pro: as i assume you know how to extract an archive, your next issue is &quot;How do I register Tomcat as a system-service on windows&quot;. (sorry, i can't help you with that as i do not know it. but i guess if you reduce your question to that central issue, others in the channel might help you)",
        "51f7ed43858cd2419f1b5359a7763eb9 (21:05): J-Pro: (besides the question if it really needs to become a system-service -- it might be sufficient to place the startup.bat into the autostart-folder)",
        "51f7ed43858cd2419f1b5359a7763eb9 (21:06): J-Pro: the difference between a system-service and an &quot;autostarted service&quot; is that a system-service is launched at system-startup (before login, regardless which user logs in), and an &quot;autostart-item&quot; is launched after a user has logged in",
        "aab3a49c70927221217a805ccde30f58 (21:09): swente, yes, I know the difference... Thanks for advise about startup folder. It's an alternative, but the last one. Maybe I need to check the Internet for solution about how to register Tomcat as a service. But how to be with Linux or Solaris?",
        "51f7ed43858cd2419f1b5359a7763eb9 (21:12): J-Pro: for linux and solaris there's usually a so-called &quot;init-script&quot;, but it might be distribution-dependant [for linux] where exactly they have to reside.",
        "51f7ed43858cd2419f1b5359a7763eb9 (21:13): J-Pro: for the &quot;unixens&quot;, i'd decide which flavours to support and search for &quot;specific&quot; information.",
        "6e39fc182cde48f018c30db6144125e4 (21:13): hey anyone arounds",
        "6e39fc182cde48f018c30db6144125e4 (21:13): * -s",
        "51f7ed43858cd2419f1b5359a7763eb9 (21:13): Lat: obviously not",
        "6e39fc182cde48f018c30db6144125e4 (21:13): :/",
        "51f7ed43858cd2419f1b5359a7763eb9 (21:13): :)",
        "6e39fc182cde48f018c30db6144125e4 (21:14): ok then",
        "6e39fc182cde48f018c30db6144125e4 (21:15): trying to start and stop webapps, from a java servlet..possible ?",
        "aab3a49c70927221217a805ccde30f58 (21:15): swente, thanks for your advises, I'll see what I can find in the Net. Thanks again",
        "51f7ed43858cd2419f1b5359a7763eb9 (21:15): Lat: i think so, as the &quot;manager-app&quot; is a servlet, too. so it might be a good starting point to dig it's sources",
        "aab3a49c70927221217a805ccde30f58 (21:16): bye all",
        "51f7ed43858cd2419f1b5359a7763eb9 (21:16): J-Pro: no problem, you're welcome. but you would help us if you would &quot;split&quot; your problems into small pieces,as shown above, and ask for those.",
        "a4b88438a9db86082488664c9bda1ae5 (21:16): Lat: also check out lambdaprobe",
        "aab3a49c70927221217a805ccde30f58 (21:17): swente, hmmm. ok, then I'll do it now",
        "6e39fc182cde48f018c30db6144125e4 (21:17): yep shall check that out, it appears the manager app only contains the class files, not the source :&lt;, will keep looking",
        "51f7ed43858cd2419f1b5359a7763eb9 (21:17): :) (help us to help you..)",
        "aab3a49c70927221217a805ccde30f58 (21:18): understood :)",
        "aab3a49c70927221217a805ccde30f58 (21:26): I have Apache Tomcat 5.0.28 archive and exe-setup. I'm making installation package of my web-app. It already can recognize if the system has JRE and if not - install it. I use IzPack tool to make this installation package. But to make my web-app working, I need Apache Tomcat installed. So I need to: 1. Someway check if it's already instlled or not. 2. Install(unpack and register somehow to be sure",
        "aab3a49c70927221217a805ccde30f58 (21:26): that it will work every day) it if it doesn't exist.",
        "a4b88438a9db86082488664c9bda1ae5 (21:27): Lat: a src ditro of tomcat will contain the source code. lambdaprobe is open source too.",
        "aab3a49c70927221217a805ccde30f58 (21:28): I know already how to run various applications from my installation, in plus I can pass to it arguments. But how to use it for sliently installing Apache Tomcat - I don't know yet, because always used ordinary exe-installation &quot;with questions&quot;",
        "6e39fc182cde48f018c30db6144125e4 (21:28): ahh thank you randrew",
        "aab3a49c70927221217a805ccde30f58 (21:28): that's my problems",
        "6e39fc182cde48f018c30db6144125e4 (21:28): is lambdaprobe the best out there?",
        "51f7ed43858cd2419f1b5359a7763eb9 (21:31): J-Pro: i'd suggest you get the archive-version of tomcat, not the .exe-installer.",
        "51f7ed43858cd2419f1b5359a7763eb9 (21:32): J-Pro: that should 'lauch' out of the box .. see if you need to customize it's configuration for your needs.",
        "51f7ed43858cd2419f1b5359a7763eb9 (21:32): launch . not lauch:)",
        "51f7ed43858cd2419f1b5359a7763eb9 (21:35): J-Pro: and *surprise* the archive contains a script for registering tomcat as a service .. might be interesting for you."
    ],
    "person_ids": [
        "aab3a49c70927221217a805ccde30f58",
        "51f7ed43858cd2419f1b5359a7763eb9",
        "84b77faa0f84c13d2f7b769359c19b05",
        "cf21dd06d1eda7351c0080b683ba2cfb",
        "31cf935e8fa5e0cbf72107ef6437bf94",
        "5247c06066d9263a1d0c88d6100b0cae",
        "6e39fc182cde48f018c30db6144125e4",
        "a4b88438a9db86082488664c9bda1ae5"
    ]
}