{
    "id": "051c284af7de922fdf32ab7e5b537b09",
    "messages": [
        "a924fb58d2c25874322f4e5126f608b9 (04:15): &quot;Taking out the alt requirement will remove any pressure on flikr to fix this.&quot; -- because four years is such a short time",
        "ab7faae5d7b250ea8606486575f8f79c (04:26): http://philip.html5.org/data/alt-lengths.svg - the ylabel on that is now quite horribly long, but I can't think of anything conciser or less confusing :-/",
        "69b0d3dfe919a6b860a9fac82de52a7e (04:27): heh",
        "ab7faae5d7b250ea8606486575f8f79c (04:28): Oh, the label falls off the top of the screen in Firefox - hooray for unpredictable text layout",
        "69b0d3dfe919a6b860a9fac82de52a7e (04:28): bit like the title of chapter 11 in the html5 spec",
        "a924fb58d2c25874322f4e5126f608b9 (04:29): ab7faae5d7b250ea8606486575f8f79c: What if you inverted the axes?",
        "ab7faae5d7b250ea8606486575f8f79c (04:29): Also the SVG fails to render most of its lines in Safari 3.0.something in Wine",
        "ab7faae5d7b250ea8606486575f8f79c (04:30): a924fb58d2c25874322f4e5126f608b9: Then the curve would point upwards, which would be ugly, so I don't want to do that",
        "a924fb58d2c25874322f4e5126f608b9 (04:30): Details :)",
        "ab7faae5d7b250ea8606486575f8f79c (04:30): and it wouldn't make the label text any shorter",
        "ab7faae5d7b250ea8606486575f8f79c (04:30): or any less confusing",
        "a924fb58d2c25874322f4e5126f608b9 (04:32): Well, make it &quot;Images with alt text at most this length&quot; and explain which images are considered in a sentence below the graph?",
        "ab7faae5d7b250ea8606486575f8f79c (04:32): Um, I'm not quite sure how to add sentences below the graph",
        "ab7faae5d7b250ea8606486575f8f79c (04:32): (in Gnuplot)",
        "69b0d3dfe919a6b860a9fac82de52a7e (04:33): use html",
        "a924fb58d2c25874322f4e5126f608b9 (04:33): Well, it could also be a box inside the plot, since it's mostly whitespace",
        "a924fb58d2c25874322f4e5126f608b9 (04:33): And you might want to bring out the old logarithmic y scale, like you did for content-type. It's awfully close to 100% most of the time :)",
        "ab7faae5d7b250ea8606486575f8f79c (04:33): 69b0d3dfe919a6b860a9fac82de52a7e: Then I'd need at least two files, because I can't put SVG inline in HTML, and it would become a Big Project instead of just throwing up a file generated by the tool",
        "ab7faae5d7b250ea8606486575f8f79c (04:34): a924fb58d2c25874322f4e5126f608b9: Putting a box inside the plot sounds even harder :-p",
        "ab7faae5d7b250ea8606486575f8f79c (04:34): I'd have to read the documentation, which is never easy",
        "a924fb58d2c25874322f4e5126f608b9 (04:35): ab7faae5d7b250ea8606486575f8f79c: How about generating it without the box and adding the box by hand? Just a textbox should be not too hard",
        "69b0d3dfe919a6b860a9fac82de52a7e (04:35): xhtml baby",
        "ab7faae5d7b250ea8606486575f8f79c (04:35): a924fb58d2c25874322f4e5126f608b9: It's meant to be close to 100% all the time, since it's just indicating that pretty much all alt text is below that length, and nobody really cares about the details of precisely how many pages use 128 vs 256 characters of alt text",
        "ab7faae5d7b250ea8606486575f8f79c (04:36): or at least that's my excuse",
        "ab7faae5d7b250ea8606486575f8f79c (04:36): Also log scales going up to 100 are ugly, because 100 doesn't have nice roots",
        "ab7faae5d7b250ea8606486575f8f79c (04:36): (A 0,10,100 scale would be rubbish, and anything else will have fractions)",
        "a924fb58d2c25874322f4e5126f608b9 (04:36): You do the inverse, 100 - x",
        "ab7faae5d7b250ea8606486575f8f79c (04:37): Anyway, I'm too lazy to even rename my file from charsets.gnuplot to alt-length.gnuplot, so I don't entirely feel like bothering with it too much :-p",
        "ab7faae5d7b250ea8606486575f8f79c (04:38): a924fb58d2c25874322f4e5126f608b9: Adding things by hand is a pain because I'd have to re-add them by hand every time I regenerated the graph",
        "ab7faae5d7b250ea8606486575f8f79c (04:39): and also I'd have to read the SVG documentation to work out how to do it",
        "a924fb58d2c25874322f4e5126f608b9 (04:39): Just google for svg text box, and make a script to sed the code block into the result file",
        "a924fb58d2c25874322f4e5126f608b9 (04:39): Yeah, yeah, I know. Not going to happen :)",
        "ab7faae5d7b250ea8606486575f8f79c (04:39): a924fb58d2c25874322f4e5126f608b9: That sounds suspiciously like hard work ;-)",
        "ab7faae5d7b250ea8606486575f8f79c (04:41): s/0,10,100/1,10,100/",
        "65325d50b2e25aca54bc871b89758c9c (04:42): log scales should obviously be marked with powers of 2",
        "ab7faae5d7b250ea8606486575f8f79c (04:42): hopes everybody's monitor is the same size as his, else the graph won't fit very well",
        "65325d50b2e25aca54bc871b89758c9c (04:42): what kind of loser would want powers of 10?",
        "65325d50b2e25aca54bc871b89758c9c (04:42): maybe a physicist or something",
        "65325d50b2e25aca54bc871b89758c9c (04:43): but we are computer scientists here",
        "ab7faae5d7b250ea8606486575f8f79c (04:43): 65325d50b2e25aca54bc871b89758c9c: When the range is 0..100, it's ugly if the scale doesn't end on 100",
        "ab7faae5d7b250ea8606486575f8f79c (04:43): and 2 doesn't divide into 100 much",
        "65325d50b2e25aca54bc871b89758c9c (04:44): 128 is close enough",
        "65325d50b2e25aca54bc871b89758c9c (04:44): gotta quit for a bit, brb",
        "ab7faae5d7b250ea8606486575f8f79c (04:44): Makes it impossible for people to see that the curve flattens out at very nearly 100%, if the only markings are 64 and 128",
        "ab7faae5d7b250ea8606486575f8f79c (04:45): and I can't add a horizontal line at 100% because I'd have to learn more Gnuplot",
        "f139aba52f9fa1394b4034a7954b2220 (04:50): given all this discussion about how trivial it is to perform history theft using :visited with various techniques, does anyone know if a real site has ever exploited it?",
        "042dd99eb0ff8653814e445ca0093427 (04:55): I don't know of any such case"
    ],
    "person_ids": [
        "a924fb58d2c25874322f4e5126f608b9",
        "ab7faae5d7b250ea8606486575f8f79c",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "65325d50b2e25aca54bc871b89758c9c",
        "f139aba52f9fa1394b4034a7954b2220",
        "042dd99eb0ff8653814e445ca0093427"
    ]
}