{
    "id": "05b2f440870effb8ec90d0b0f61f7fed",
    "messages": [
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:06): what is the opensolaris way of staying current with packages? There is the blastwave option - but really that's just for add-ons. From what I remember, the official solaris 10 had an auto-update feature, but I don't know if that extends to other software outside ON, either way it's not compatable with opensolaris right?",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:08): today's example is, updating to a working version of gaim. I'm having trouble compiling it, and missing my 'apt-get upgrade'/'emerge gaim' etc",
        "d29f7858616789349f2e17f17eaa3395 (14:09): try nexenta...",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:09): that's an option I guess, yeah",
        "d29f7858616789349f2e17f17eaa3395 (14:10): :)",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:10): there isn't a more native open thought?",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:10): -t",
        "d29f7858616789349f2e17f17eaa3395 (14:11): native? there's the suns companion cd, what do you mean for native?",
        "d29f7858616789349f2e17f17eaa3395 (14:12): people does various adaptations of other package systems, like pkgsrc, openpkg, sps, or even portage and so on, there's also pmpkg from oxygene",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:12): well I guess I find the answer to the question a bit curious. &quot;How do I do something with OS&quot;, &quot;Use something else&quot; :)",
        "d29f7858616789349f2e17f17eaa3395 (14:12): but I would not define them &quot;native&quot; since they are not integrated in the default nevada distribution...",
        "d29f7858616789349f2e17f17eaa3395 (14:12): yeah, that's not a frontend that $OS includes",
        "d29f7858616789349f2e17f17eaa3395 (14:13): you can compile it yourself or try another package management system :/",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:13): bugga, I was hoping you weren't going to say that",
        "d29f7858616789349f2e17f17eaa3395 (14:13): what's wrong with that?",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:13): what is included in nevada exactly, will a live upgrade also pull in newer versions of non-ON stuff?",
        "d29f7858616789349f2e17f17eaa3395 (14:14): nope, only /usr/sfw",
        "30304b9bc0a292e1440982ddf6a0c186 (14:14): nevada contains all the sun consolidations (eg. jds, x11, sfw, ..)",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:14): the management doesn't scale. I'm not going to sit here and recompile source for everything that's on this system in order to keep it up to date :)",
        "aac6faa59982955179bb909138afd162 (14:15): oxy: really?",
        "aac6faa59982955179bb909138afd162 (14:15): i thought nevada was just ON",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:15): how can I tell what that includes? By example, I'm trying to get a new version of gaim",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:15): at the moment the best I can come up with is 'pkginfo | grep foo'",
        "30304b9bc0a292e1440982ddf6a0c186 (14:15): twincest: nevada as in &quot;solaris 11/Next&quot; contains more than just ON afaics",
        "d29f7858616789349f2e17f17eaa3395 (14:15): Griffous: so go with another distro, belenix is about to include pkgsrc by default and nexenta as apt",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:16): twincest, are you sure you aren't thinking of bfu?",
        "25846df53fdce85bcaaa8eb3dc41873a (14:16): can solaris boot from zfs?",
        "d29f7858616789349f2e17f17eaa3395 (14:16): Griffous: look at nevada like... windows xp :P microsoft does a commercial os and provides you option to install like IIS and some other software from the windows cd, then all the other software that you want you should compile it or install it by hand by yourself, right? and it's a commercial os that's on like 90% of the computers of the planet... :P",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:16): brad`; not yet, or at least not easily",
        "30304b9bc0a292e1440982ddf6a0c186 (14:16): eventually, I guess, there will be third parties that offer commercially supported package sets with upgrade procedures for certain tasks (eg. webserving)",
        "aac6faa59982955179bb909138afd162 (14:17): griff: uh, yes",
        "d29f7858616789349f2e17f17eaa3395 (14:17): this feature of upgradable/manageable packages, is more a linux/bsd distro concept than a commercial os concept, look at it in this way :)",
        "30304b9bc0a292e1440982ddf6a0c186 (14:17): brad`: from zfs, definitely no.. but there are ways to have a zfs rootfilesystem (with a small ufs partition containing everything to get there)",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:20): sickness, heh as much as the windows reference made me shudder, you raise a good point. I've often found it an interesting mental exercise. On the plus side, installing software by hand is more involved and manual then the likes of linux package managment, however setup.exe &lt;next,next,next&gt; couldn't be easier. So linux has the upperhand in many respects there, which brings us to solaris. I do realise that other software is",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:20): just that, and I don't mind maintaining that separately to ON, but I'd still like it to be easy, like windows",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:21): I dove in into bfu 'cause you can ;), and quickly backed out when I found out what a manual world I was living in, so I'm sitting pretty in nevada, enjoying the updates, and live upgrade. I guess I'm now finding that I'm still a little lost though",
        "30304b9bc0a292e1440982ddf6a0c186 (14:21): would be nice if prodreg were capable of storing/executing an &quot;upgrade&quot; procedure (provided by the package maintainer, not prodreg - which would then request a cd/url/whatever to get the actual data) in addition to install and removal",
        "30304b9bc0a292e1440982ddf6a0c186 (14:21): that way there'd be a semi-official place to look for such things",
        "d29f7858616789349f2e17f17eaa3395 (14:22): yeah, maybe windows has a more standardized way of installing/removing software, but that's not always true, over the years, a lot of software rotten the windows install way and almost destroys your system and your registry :P so the crude answer to what packaging options are present in a standard solaris is &quot;only the pkg tools&quot; :/",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:22): Nevada uses package management, which is cool, and gaim came with it, so there must be a package for it somewhere, I just need to pull that down, and I'm away",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:22): I'm just missing that last part",
        "30304b9bc0a292e1440982ddf6a0c186 (14:22): Griffous: /usr/sbin/pkgchk -l -p /usr/bin/gaim",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:24): sickness, I'm trying hard not to advacate that windows is better, the installing part is, but you're right, the system hoses itself over time, much like I find running everything from source does. pkg is a far better system, we just need frontends, which is where pkg-get and friends come in I guess. Redhat/rpm has the same problem, and they haven't officially done much about it either... it's odd.",
        "d29f7858616789349f2e17f17eaa3395 (14:25): yeah",
        "d91102e790545be0a09c1f715ac4926b (14:25): As if building things from source hoses your system.",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:25): Gman will know the answer though!",
        "d29f7858616789349f2e17f17eaa3395 (14:25): I don't want to advocate  windows too, but it comes handy as an exampling thing :P",
        "d91102e790545be0a09c1f715ac4926b (14:25): Just stay on your toes. =)",
        "30304b9bc0a292e1440982ddf6a0c186 (14:26): Griffous: the issue with automatic updates is that it's very hard to get right",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:26): LeftWing, lol. Ok, well I hose my system with it then :), even when it's managed, my gentoo desktop after 2 years was a sinking ship",
        "d91102e790545be0a09c1f715ac4926b (14:26): That's because Gentoo is a sinking ship. =P",
        "d29f7858616789349f2e17f17eaa3395 (14:26): LeftWing: well, it doesn't? a lot of software packages does NOT have a &quot;make uninstall&quot; option so you'll have to find/record in some way all the files that it has spread on your system and remove them by hand...",
        "30304b9bc0a292e1440982ddf6a0c186 (14:26): sickness: gnu stow helps a lot there",
        "30304b9bc0a292e1440982ddf6a0c186 (14:26): (or xstow or any of the other clones)",
        "d91102e790545be0a09c1f715ac4926b (14:26): sickness: /opt/JMCpkgname/* =P",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:26): thanks oxygene, that's found my package, now I just need a sunfreeware-type website to pull down the latest nevada-included packages, and I'm away.... is there such a thing?",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:27): LeftWing, hehe",
        "d91102e790545be0a09c1f715ac4926b (14:27): sickness: Or, spend a few hours learning to make Solaris packages. It's really not hard.",
        "d29f7858616789349f2e17f17eaa3395 (14:27): LeftWing: heh, anyway, that's not standard! :) you have made a modification that's not in the base system anymore so it's not integrated... if I have to be picky :P",
        "30304b9bc0a292e1440982ddf6a0c186 (14:27): Griffous: the problem is that you'll likely have to update the other gnome parts, too.. on nevada, you can probably install vermillion, which is jds4 (gnome 2.14 or 2.16)",
        "d91102e790545be0a09c1f715ac4926b (14:27): sickness: Yes, but it still isn't hosed.",
        "d29f7858616789349f2e17f17eaa3395 (14:27): LeftWing: but no one seems to make them... maybe only oxygene :P",
        "30304b9bc0a292e1440982ddf6a0c186 (14:28): Griffous: vermillion is available from opensolaris.org",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:28): LeftWing, I'm reading through that now, you're right it's not REALLY terrible, but I'll be damned if I'm going to do that all my software",
        "d29f7858616789349f2e17f17eaa3395 (14:28): LeftWing: yeah, that's true",
        "d91102e790545be0a09c1f715ac4926b (14:28): Griffous: You can also use pkgbuild to make your own packages from RPM spec files.",
        "30304b9bc0a292e1440982ddf6a0c186 (14:28): sickness: I put everything in /opt/PM - no splitting down to package level. and joerg uses /opt/SCHILY iirc",
        "d29f7858616789349f2e17f17eaa3395 (14:29): oxygene: yeah, but you build a standard solaris package before installing, if I recall correctly...",
        "d91102e790545be0a09c1f715ac4926b (14:29): I put things in /opt/jmc when I make packages and /opt/JMC&lt;logicalgrouping&gt; when I just make install",
        "30304b9bc0a292e1440982ddf6a0c186 (14:30): sickness: yes",
        "d29f7858616789349f2e17f17eaa3395 (14:30): anyway, this is not handy imho :P I prefer to have all in /usr/bin and at most /usr/local/bin :P",
        "d91102e790545be0a09c1f715ac4926b (14:30): sickness: symlinks",
        "30304b9bc0a292e1440982ddf6a0c186 (14:30): I have no /usr/local at all",
        "30304b9bc0a292e1440982ddf6a0c186 (14:30): sickness: use gnu stow ;)",
        "d29f7858616789349f2e17f17eaa3395 (14:31): in openbsd I can install/uninstall/upgrade whatever package and I don't have to figure out or add paths every damn time I need something :P",
        "d29f7858616789349f2e17f17eaa3395 (14:31): &lt;/rant&gt;",
        "30304b9bc0a292e1440982ddf6a0c186 (14:31): sickness: it handles package directories and moves them into one namespace via symlinks",
        "d29f7858616789349f2e17f17eaa3395 (14:31): oxygene: scary",
        "30304b9bc0a292e1440982ddf6a0c186 (14:31): sickness: comfortable :)",
        "d29f7858616789349f2e17f17eaa3395 (14:31): all this symlinks things scares the hell out of me, I think that the system could implode =)",
        "30304b9bc0a292e1440982ddf6a0c186 (14:31): hmm.. openbsd - do they also recompile the whole package repository when you update perl (like netbsd does)?",
        "d29f7858616789349f2e17f17eaa3395 (14:32): mmm perl is integrated in the base system and is upgraded every 6 months as a version, or by security patches if there's need, I don't know if you can upgrade/change it by packages... lemme see...",
        "30304b9bc0a292e1440982ddf6a0c186 (14:33): well, or any other of the &quot;root&quot; packages in there",
        "d29f7858616789349f2e17f17eaa3395 (14:35): yeah, I'm checking... but perl does not appear to be in the ports system so you can not mess with it, there are a lot of packages/libs p5 and all, but I don't think that you can &quot;hose&quot; the integrated perl...",
        "30304b9bc0a292e1440982ddf6a0c186 (14:35): okay",
        "d29f7858616789349f2e17f17eaa3395 (14:36): yeah it's not upgradeable/removable",
        "c7ed1ee25e6c5b617593af5e8181d1d7 (14:43): I'm still chasing my tail for finding vermillion details here, is there a community page for it?",
        "13d302032f9ecb786adfb94061757afc (14:50): Griffous: there's one on opensolaris.org.",
        "13d302032f9ecb786adfb94061757afc (14:51): <a href=\"http://www.opensolaris.org/os/community/desktop/\">http://www.opensolaris.org/os/community/desktop/</a>",
        "13d302032f9ecb786adfb94061757afc (14:52): it doesn't seem to have that much detail on vermillion though, my mistake.",
        "74287088e072d7bf252ce205150cecd0 (15:08): Solaris 10 should run fine.  10 dropped support for a lot of older hardware, but not that one."
    ],
    "person_ids": [
        "c7ed1ee25e6c5b617593af5e8181d1d7",
        "d29f7858616789349f2e17f17eaa3395",
        "30304b9bc0a292e1440982ddf6a0c186",
        "aac6faa59982955179bb909138afd162",
        "25846df53fdce85bcaaa8eb3dc41873a",
        "d91102e790545be0a09c1f715ac4926b",
        "13d302032f9ecb786adfb94061757afc",
        "74287088e072d7bf252ce205150cecd0"
    ]
}