{
    "id": "0651dafe16af1275aee56a7aa444f28c",
    "messages": [
        "b8810fee2f4a71f849f3f7409546d1d9 (16:14): http://video.dld-conference.com/watch/dTMYg3z?t=dld09 at 20 minutes",
        "ab7faae5d7b250ea8606486575f8f79c (16:19): a11aabeeceeae6b8cb5d12ea06b56554: Do you mean something like http://philip.html5.org/data/charsets.html ?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:19): ab7faae5d7b250ea8606486575f8f79c: yes",
        "ab7faae5d7b250ea8606486575f8f79c (16:19): a11aabeeceeae6b8cb5d12ea06b56554: I don't think anyone has any data like that",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:20): ab7faae5d7b250ea8606486575f8f79c: That data there should be enough to work from",
        "ab7faae5d7b250ea8606486575f8f79c (16:20): Oh, right, I have data like that - that was convenient",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:21): ab7faae5d7b250ea8606486575f8f79c: :P",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:21): I'd be interested in a bigger less bias sample, though",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:21): (Seeming dmoz is bias towards English)",
        "ab7faae5d7b250ea8606486575f8f79c (16:22): I don't think the concept of &quot;less bias&quot; exists",
        "ab7faae5d7b250ea8606486575f8f79c (16:22): You can just choose the direction in which you want the bias to be",
        "ab7faae5d7b250ea8606486575f8f79c (16:22): Ooh, a blizzard",
        "ab7faae5d7b250ea8606486575f8f79c (16:23): (dmoz is definitely biased towards English, and I think it's also biased towards western European)",
        "ab7faae5d7b250ea8606486575f8f79c (16:24): (so it's really bad for e.g. Chinese sites)",
        "ab7faae5d7b250ea8606486575f8f79c (16:25): *.uk: 161279 pages",
        "ab7faae5d7b250ea8606486575f8f79c (16:25): *.de: 295359",
        "ab7faae5d7b250ea8606486575f8f79c (16:25): *.jp: 119322",
        "ab7faae5d7b250ea8606486575f8f79c (16:25): *.cn: 7582",
        "57d876083caf517f49e8cf5e03307450 (16:25): .zh?",
        "ab7faae5d7b250ea8606486575f8f79c (16:26): *.zh: 36",
        "ab7faae5d7b250ea8606486575f8f79c (16:27): Whoops",
        "ab7faae5d7b250ea8606486575f8f79c (16:27): That's because '.' was a regexp",
        "ab7faae5d7b250ea8606486575f8f79c (16:27): If I make it \\. then there's 0",
        "ab7faae5d7b250ea8606486575f8f79c (16:27): (The other numbers don't change much)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:28): ab7faae5d7b250ea8606486575f8f79c: Yeah, that's my problem.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:28): What's ZH?",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:28): b8810fee2f4a71f849f3f7409546d1d9, interesting",
        "99d799105c5630cb16b3a7b54e6ae26e (16:29): thinks those *.jp sites are years old",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:29): b8810fee2f4a71f849f3f7409546d1d9, didn't know he was CEO of CC",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:29): (that Flash player they are using is also really cool btw)",
        "ab7faae5d7b250ea8606486575f8f79c (16:30): a11aabeeceeae6b8cb5d12ea06b56554: Alexa's list might be better, since it's got ~20K for *.cn (and similar for *.jp and *.uk)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:31): ab7faae5d7b250ea8606486575f8f79c: But do you have data for that? :P",
        "ab7faae5d7b250ea8606486575f8f79c (16:31): a11aabeeceeae6b8cb5d12ea06b56554: (though it only lists sites rather than pages, so it's entirely biased towards the initial entry pages)",
        "ab7faae5d7b250ea8606486575f8f79c (16:32): a11aabeeceeae6b8cb5d12ea06b56554: No, but you could easily download the list and then download a few thousand .cn pages and search them for patterns :-)",
        "1f58faf0d058f303f30239a369808167 (16:39): ab7faae5d7b250ea8606486575f8f79c: there would be benefit of having separate sets for different countries. I had this discussion with 15acf9951f4c900b4605265783e17a5d about the mama too.",
        "1f58faf0d058f303f30239a369808167 (16:40): The issue is how to create these sets",
        "ab7faae5d7b250ea8606486575f8f79c (16:41): 1f58faf0d058f303f30239a369808167: The problem is that it would encourage comparison between datasets, and comparisons are very dangerous because you're usually comparing the bias of the samples rather than real differences",
        "1f58faf0d058f303f30239a369808167 (16:41): There is also all the invisible Web. The one behind passwd or intranets",
        "1f58faf0d058f303f30239a369808167 (16:42): ab7faae5d7b250ea8606486575f8f79c: yes indeed, you have to always give the context of your studies, plus a bit of error calculations.",
        "1f58faf0d058f303f30239a369808167 (16:42): There is nothing *true* in sample surveys, just giving you hints but not certainty",
        "1f58faf0d058f303f30239a369808167 (16:43): has suddenly a big wave of astrophysical studies and research coming back to his head",
        "15acf9951f4c900b4605265783e17a5d (16:44): With publicly available sets, the burden of determining the set is pretty much off the entity that is doing the analysis. Any other set requires a lot of extra legwork, both in getting and describing the additional URLs, examining its bias. Not to say that publicly available sets don't have bias, it is just that they are more easily documented.",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:45): can someone quickly tell me whether the character that e.g. &amp;euml; represents can have multiple Unicode representations?",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:45): e.g. its own character and one using two characters that combine into one?",
        "ab7faae5d7b250ea8606486575f8f79c (16:45): 1f58faf0d058f303f30239a369808167: Error calculations don't seem especially helpful here - I can say &quot;(4.56+/-0.07)% of pages in dmoz.org have property P&quot; based on the sample size, but that says nothing meaningful about other data sets (e.g. dmoz.org yesterday or tomorrow, or some other selection of pages)",
        "1f58faf0d058f303f30239a369808167 (16:47): ab7faae5d7b250ea8606486575f8f79c: again context‚Ä¶ and calculation of confidence depending on your data set.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:48): edb259c0e0038f38bb200bc20c8cbf7e: What is euml?",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:48): data:text/html,&amp;euml;",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:48): edb259c0e0038f38bb200bc20c8cbf7e: Yes, it has at least two representations",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:48): thx",
        "1f58faf0d058f303f30239a369808167 (16:49): U+000EB",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:49): 1f58faf0d058f303f30239a369808167: Yeah, I could find that. I don't however know Unicode codepoints off the top of my head. :)",
        "1f58faf0d058f303f30239a369808167 (16:50): neither",
        "15acf9951f4c900b4605265783e17a5d (16:56): So, is there a way to use available URL sets that is both reproduceable and has the ability to improve the set in ways that are statistically meaningful?",
        "1f58faf0d058f303f30239a369808167 (16:56): ah the combining diaresis is 0308",
        "1f58faf0d058f303f30239a369808167 (16:56): and the diaresis is 00A8",
        "1f58faf0d058f303f30239a369808167 (16:57): 15acf9951f4c900b4605265783e17a5d: as a downloaded set or as an accessible set ?",
        "1f58faf0d058f303f30239a369808167 (16:57): will have to explain that",
        "1f58faf0d058f303f30239a369808167 (16:59): an URL set is &quot;biological&quot;. It changes in time, because of the nature of the Web. So for example to compare the results of two different tools, we need a downloaded dated set of URIs and their content (and metadata going with it)",
        "15acf9951f4c900b4605265783e17a5d (17:00): 1f58faf0d058f303f30239a369808167: *nodding agreement*",
        "1f58faf0d058f303f30239a369808167 (17:01): Then there is the quality of the set‚Ä¶ and here same kind of issues than in astrophysics when I was doing star fields research. At a point you have to select the stars, because if you pick up randomly, you get many interesting stats, but not really usable in a scientific way",
        "15acf9951f4c900b4605265783e17a5d (17:02): What if you balance it between selected and random?",
        "1f58faf0d058f303f30239a369808167 (17:02): I guess the balanced set helps you to test the quality of the random",
        "1f58faf0d058f303f30239a369808167 (17:03): s/balanced/selected/",
        "1f58faf0d058f303f30239a369808167 (17:20): the selected set helps you to test hypothesis in a controlled environment. For example, new Web sites released by Web agencies (recent contracts) to see what are the new professional practices.",
        "1f58faf0d058f303f30239a369808167 (17:22): on a Japanese only set and on a few years, we could also see for example if people are switching to utf-8 or not.",
        "1f58faf0d058f303f30239a369808167 (17:22): without necessary knowing if it's a local choice or a constraints of the tools to produce Web sites.",
        "1f58faf0d058f303f30239a369808167 (17:24): 15acf9951f4c900b4605265783e17a5d: did you play with different user agent strings for the MAMA, faking the string to see the variability?",
        "15acf9951f4c900b4605265783e17a5d (17:28): That's been on my list of things to do. I played around with it once with the Alexa Top 1000 and had interesting results, but they were hard to interpret.",
        "15acf9951f4c900b4605265783e17a5d (17:28): I've never come up with the perfect way to compare the results between UA strings.",
        "15acf9951f4c900b4605265783e17a5d (17:28): I kept finding different things that were variable between versions.",
        "15acf9951f4c900b4605265783e17a5d (17:32): I pulled content using the latest UAs from Opera, FF, and MSIE, as well as the forthcoming Opera UA, as well as a UA called &quot;foo&quot; for comparison. 8-}",
        "1f58faf0d058f303f30239a369808167 (17:36): 15acf9951f4c900b4605265783e17a5d: hehe. The Power of Foo! known by old monks in China for generations. They tackle issues on bad Web pages.",
        "15acf9951f4c900b4605265783e17a5d (17:37): yes, they are the experts in Kung Foo",
        "15acf9951f4c900b4605265783e17a5d (17:38): I found that I had to ignore both IMG references and hyperlink HREFs, because many sites randomize the arguments for them to aid tracking...it just makes the analysis job harder. ;-}",
        "15acf9951f4c900b4605265783e17a5d (17:40): At a certain point I was really wondering if what I was deleting was too crucial to throw away. I'm not sure of the answer to that."
    ],
    "person_ids": [
        "b8810fee2f4a71f849f3f7409546d1d9",
        "ab7faae5d7b250ea8606486575f8f79c",
        "a11aabeeceeae6b8cb5d12ea06b56554",
        "57d876083caf517f49e8cf5e03307450",
        "edb259c0e0038f38bb200bc20c8cbf7e",
        "99d799105c5630cb16b3a7b54e6ae26e",
        "1f58faf0d058f303f30239a369808167",
        "15acf9951f4c900b4605265783e17a5d"
    ]
}