{
    "id": "0823aa502aa75941b8dec73181d12b59",
    "messages": [
        "0c2de4934c6d7fc96160344dec846df3 (13:39): You know, I can't help but think that the best way forward for Microsoft is to release their HTML 5 browser as a completely separate product. Make it have a new UA string, make it not respond to IE conditional comments (give it newname conditional comments if absolutely necessary), make it have a new navigator.useragent string. Effectively making this product a new entrant into the market....",
        "0c2de4934c6d7fc96160344dec846df3 (13:39): ...Position it as the upgrade path, but don't force that upgrade.",
        "0c2de4934c6d7fc96160344dec846df3 (13:39): Customers shouldn't do worse with it then with Firefox, while still having the option to use &quot;old-IE&quot; for legacy IE-only intranet apps. And it's not as if Microsoft hasn't done this before - just think of their ERP products.",
        "0c2de4934c6d7fc96160344dec846df3 (13:39): s/then/than/ (meh)",
        "0c2de4934c6d7fc96160344dec846df3 (13:42): I wonder if they'd ever buy into that line of reasoning...",
        "f6a47a638824180d57f0a561fd5843c6 (13:53): 0c2de4934c6d7fc96160344dec846df3, I agree with you. MS (or other vendor) should be able to build a whole new UA, for HTML5",
        "f6a47a638824180d57f0a561fd5843c6 (13:55): (that is what I hope to see next... a Mozilla branch for HTML5 only)",
        "f6a47a638824180d57f0a561fd5843c6 (13:55): it would easily become one of the reference implementation",
        "f6a47a638824180d57f0a561fd5843c6 (13:57): *cough* to &quot;easily&quot; :)",
        "0c2de4934c6d7fc96160344dec846df3 (14:01): f6a47a638824180d57f0a561fd5843c6: it wouldn't be necessary for Mozilla (or any other non-IE browser), as IE is the only one which is as consistently targeted by workarounds for bugs. Mozilla should just be able to follow the HTML5 specification and use it to render all of the current web as well.",
        "f6a47a638824180d57f0a561fd5843c6 (14:02): 0c2de4934c6d7fc96160344dec846df3, the problem is that in that case MS could only &quot;follow&quot;, I think.",
        "f6a47a638824180d57f0a561fd5843c6 (14:03): but, I'm not very into it",
        "0c2de4934c6d7fc96160344dec846df3 (14:03): and it wouldn't be a whole new UA for MS - it would be mostly the same rendering engine (assuming it can be extended and fixed to do HTML 5) - but just not responding to any of the current hacks anymore (and not needing to, as they'd be just as right at implementing the specs as everyone else)",
        "0c2de4934c6d7fc96160344dec846df3 (14:04): they'd even still do activeX and all their other extensions, so a lot of apps which exist right now as IE-only - but in a standards-compatible way - would continue to work.",
        "f6a47a638824180d57f0a561fd5843c6 (14:04): I really think they would better start from scratch.",
        "f6a47a638824180d57f0a561fd5843c6 (14:05): (given what they did not in IE7)",
        "0c2de4934c6d7fc96160344dec846df3 (14:05): they won't. They'll take one look at how long it took Mozilla, and consider it (rightly so) a bad idea to start from scratch.",
        "0c2de4934c6d7fc96160344dec846df3 (14:06): However, what I'm proposing would give them far more leeway to make radical changes than they had in IE7, as IE7 responded to most of the same workarounds IE6 did, and so had to remain compatible with them.",
        "f6a47a638824180d57f0a561fd5843c6 (14:06): but they have Avalon, now",
        "f139aba52f9fa1394b4034a7954b2220 (14:06): One of the reasons it took so long for Mozilla to start from scratch is because there was no spec that described how to implement a browser for the web",
        "0c2de4934c6d7fc96160344dec846df3 (14:07): see one of chris' early message where he wrote that it'd have been better for IE7 if it would've just been sent the same content as gecko got.",
        "0c2de4934c6d7fc96160344dec846df3 (14:08): f139aba52f9fa1394b4034a7954b2220: that's not the impression I've gotten from hearing the Mozilla devs talk about it. (Brought up recently again in the whole Mozilla 2 discussion - let me see if I can find the relevant post.)",
        "f139aba52f9fa1394b4034a7954b2220 (14:08): I'm sure much of their time would have been spent reverse engineering IE and NN4",
        "f6a47a638824180d57f0a561fd5843c6 (14:09): did not they started from a &quot;netscape5&quot; codebase?",
        "f6a47a638824180d57f0a561fd5843c6 (14:09): that is what I remember",
        "f139aba52f9fa1394b4034a7954b2220 (14:09): partly, yes, but a lot of it was rewritten",
        "0c2de4934c6d7fc96160344dec846df3 (14:09): f6a47a638824180d57f0a561fd5843c6: they did, and then scrathed the whole rendering engine in favour of &quot;NGLayout&quot;, which later become gecko",
        "f6a47a638824180d57f0a561fd5843c6 (14:09): I see",
        "0c2de4934c6d7fc96160344dec846df3 (14:10): that was a great decision for the web, but the effective death-knell for Netscape (remember Netscape 6?)",
        "f139aba52f9fa1394b4034a7954b2220 (14:11): NN6 was definately a welcomed improvement over NN4, but it far too unstable",
        "f6a47a638824180d57f0a561fd5843c6 (14:12): for MS, I think one way could be to hack some XAML renderer",
        "f6a47a638824180d57f0a561fd5843c6 (14:12): a &quot;XAML to Web Control&quot; converter for example",
        "f6a47a638824180d57f0a561fd5843c6 (14:13): (it could be even a OSS project)",
        "f139aba52f9fa1394b4034a7954b2220 (14:13): f6a47a638824180d57f0a561fd5843c6, what the?",
        "f139aba52f9fa1394b4034a7954b2220 (14:13): what does XAML have to do with the web?",
        "f6a47a638824180d57f0a561fd5843c6 (14:13): f139aba52f9fa1394b4034a7954b2220, XAML is the &quot;unified&quot; MS langauge for describing UI",
        "f6a47a638824180d57f0a561fd5843c6 (14:13): like XUL",
        "f139aba52f9fa1394b4034a7954b2220 (14:13): yeah, I know that",
        "f6a47a638824180d57f0a561fd5843c6 (14:13): I know :)",
        "f139aba52f9fa1394b4034a7954b2220 (14:14): I'm wondering what the relevance is",
        "f6a47a638824180d57f0a561fd5843c6 (14:14): I'm just pondering loudly :)",
        "f6a47a638824180d57f0a561fd5843c6 (14:15): I see some overlaps... just have to figure out better",
        "0c2de4934c6d7fc96160344dec846df3 (14:16): (Hmm, that mozilla 2 discussion post that I was thinking of wasn't very clear on that subject; probably only seemed so to me as I remembered earlier references.)",
        "f6a47a638824180d57f0a561fd5843c6 (14:22): btw, I think MS think XAML has *much* to do with web. But I'm really not a .NET person",
        "f6a47a638824180d57f0a561fd5843c6 (14:22): (can't elaborate)",
        "c5e3539121c4944f2bbe097b425ee774 (14:27): OMG!! WTF is wrong with people: &quot; Why even care about incompetent web developers?&quot; http://lists.w3.org/Archives/Public/public-html/2007Apr/0875.html",
        "d114be1698421a7cec050e2207d29631 (14:34): maybe it should be a design principal that we don't care about incompetents :)",
        "d114be1698421a7cec050e2207d29631 (14:34): course, i'd feel unloved then",
        "a924fb58d2c25874322f4e5126f608b9 (14:36): We don't really have to worry about the developers who write quirks mode pages, because quirks mode is already frozen",
        "0c2de4934c6d7fc96160344dec846df3 (14:36): I don't think it'd be physically possible to both keep backward compatibility and make the language have a high chance of being used right by &quot;incompetents&quot;. So, we shouldn't let their needs dictate what HTML 5 will look like - but we should still remember their existence, and - all other things being equal - choose the way that will make things easier for them.",
        "0c2de4934c6d7fc96160344dec846df3 (14:36): Otherwise we end up with incomprehensible and totally impossible to code for a novice things like XHTML namespaces.",
        "c5e3539121c4944f2bbe097b425ee774 (14:40): I don't understand how people can be so elitist. There is no reason why anyone should not be able to create a web page. It provides access to a publishing medium to millions of people with low literacy. If someone wants to code it like a pro and know about things like the DOM, good for them. I know my mom doesn't but I still think she should be able to code her own page.",
        "c5e3539121c4944f2bbe097b425ee774 (14:41): hates to use his mom as an example, because CW has also been using his mom as an example, but my mom is actually taking a web design course this week",
        "d114be1698421a7cec050e2207d29631 (14:44): writing a simple web page should be easy, and it would be if it wasn't for the bit before &lt;head&gt;, i think",
        "f6a47a638824180d57f0a561fd5843c6 (14:44): c5e3539121c4944f2bbe097b425ee774, I hate when I'm paid so low, because &quot;Hey! Just everyone can build a web page&quot; (customer often can't evaluate the 'quality' of the work)",
        "f6a47a638824180d57f0a561fd5843c6 (14:45): yes, we need to &quot;educate&quot; our very customers",
        "a924fb58d2c25874322f4e5126f608b9 (14:45): There are novice users (your mom) and incompetent users (many web designers), I don't think we should group those too closely",
        "f6a47a638824180d57f0a561fd5843c6 (14:45): right",
        "c5e3539121c4944f2bbe097b425ee774 (14:45): maybe",
        "d114be1698421a7cec050e2207d29631 (14:45): i'm not really thinking of someone like your mum when saying incompetants, i'm thinking of a 'professional' who willfully chooses to be rubbish because no-one cares and he can get away with it",
        "d114be1698421a7cec050e2207d29631 (14:46): yes, what a924fb58d2c25874322f4e5126f608b9 said",
        "a924fb58d2c25874322f4e5126f608b9 (14:46): When you make a trade out of something, you should be somewhat competent",
        "c5e3539121c4944f2bbe097b425ee774 (14:46): I've been teaching web for 7 years so I've unleashed about 1000 incompetent web designers :)",
        "a924fb58d2c25874322f4e5126f608b9 (14:46): Maybe we need a bar exam for web developers",
        "c5e3539121c4944f2bbe097b425ee774 (14:46): that could help",
        "0c2de4934c6d7fc96160344dec846df3 (14:47): wishes there was a hard line between those who're competent and those who aren't.",
        "d114be1698421a7cec050e2207d29631 (14:47): a diffinitive set of docs, written for certain levels would help",
        "d114be1698421a7cec050e2207d29631 (14:47): docs for the casual user",
        "d114be1698421a7cec050e2207d29631 (14:47): docs for the professional",
        "a924fb58d2c25874322f4e5126f608b9 (14:47): Sadly, user education doesn't help much unless you can enforce it",
        "c5e3539121c4944f2bbe097b425ee774 (14:48): has to go; later all",
        "d114be1698421a7cec050e2207d29631 (14:48): i dunno, i think it'd help",
        "a924fb58d2c25874322f4e5126f608b9 (14:49): The problem comes from those who don't take the education, though",
        "d114be1698421a7cec050e2207d29631 (14:49): can't help those people",
        "a924fb58d2c25874322f4e5126f608b9 (14:49): And unless you somehow prevent them from working, they will produce incompetent pages",
        "a924fb58d2c25874322f4e5126f608b9 (14:49): Cheaper than the pro too",
        "d114be1698421a7cec050e2207d29631 (14:50): google 'how to write html'",
        "d114be1698421a7cec050e2207d29631 (14:51): or 'beginners html'",
        "a924fb58d2c25874322f4e5126f608b9 (14:51): ?",
        "d114be1698421a7cec050e2207d29631 (14:52): well, if i was starting out, i don't think what you get there would help",
        "d114be1698421a7cec050e2207d29631 (14:53): but what do i know? it'd be nice to see an official w3c set of tutorials up there, but then i'd need to know who the w3c are...",
        "a924fb58d2c25874322f4e5126f608b9 (14:53): Well, I imagine most of it is aimed at novice users, not for becoming a professional designer"
    ],
    "person_ids": [
        "0c2de4934c6d7fc96160344dec846df3",
        "f6a47a638824180d57f0a561fd5843c6",
        "f139aba52f9fa1394b4034a7954b2220",
        "c5e3539121c4944f2bbe097b425ee774",
        "d114be1698421a7cec050e2207d29631",
        "a924fb58d2c25874322f4e5126f608b9"
    ]
}