{
    "id": "0a417ab2a0986fdaac1f519d14266b65",
    "messages": [
        "4e63bbbffbcaf12608512401eaf11240 (10:10): logging to http://www.w3.org/2008/10/20-css-irc",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:13): 72af1cb61d47fcc5d18402bf3d1c147d, plinss: i'm around; let me know if/when i should attend the css meeting, i have multiple clashing meetings but am happy to move from one to the other as needs warrant",
        "72af1cb61d47fcc5d18402bf3d1c147d (10:16): 69b0d3dfe919a6b860a9fac82de52a7e: sure thing ; how was discussion with tbl?",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:17): good, good",
        "72af1cb61d47fcc5d18402bf3d1c147d (10:21): wb e0ea5b093409d206f62668949287877a :)",
        "e0ea5b093409d206f62668949287877a (10:22): :)",
        "e0ea5b093409d206f62668949287877a (10:23): expects to float between webapps and css today. If there's anything you particularly want to smack me around on, let me know when.",
        "72af1cb61d47fcc5d18402bf3d1c147d (10:23): ok, cool",
        "72af1cb61d47fcc5d18402bf3d1c147d (10:23): we'll start with css system colors at 9:30",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:23): quick question about the media queries decisions yesterday -- do they imply any changes required to acid3? should i uncomment out any of the commented out tests?",
        "72af1cb61d47fcc5d18402bf3d1c147d (10:23): the accessibility guys want us to keep them",
        "72af1cb61d47fcc5d18402bf3d1c147d (10:24): 69b0d3dfe919a6b860a9fac82de52a7e: we did not make any MQ decision yesterday hixie",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (10:24): 69b0d3dfe919a6b860a9fac82de52a7e, media queries got published with changes that requires stuff to stay commented out",
        "72af1cb61d47fcc5d18402bf3d1c147d (10:24): we made changes during last call related to error recovery",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:24): oh sorry, was looking at last week's minutes",
        "72af1cb61d47fcc5d18402bf3d1c147d (10:24): yeah",
        "72af1cb61d47fcc5d18402bf3d1c147d (10:25): so, yes, that might trigger changes in acid3",
        "72af1cb61d47fcc5d18402bf3d1c147d (10:25): if acid3 checks error recovery in mdeia value",
        "72af1cb61d47fcc5d18402bf3d1c147d (10:25): media",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:25): ok i'll coordinate with e3fb62ebfa4f36acf5cbff6a6ed0f2e0",
        "72af1cb61d47fcc5d18402bf3d1c147d (10:25): ok",
        "72af1cb61d47fcc5d18402bf3d1c147d (10:31): http://wiki.csswg.org/planning/mandelieu-2008",
        "4f7b888020097eaa802a99e757c6dad7 (10:40): scribenick: 4f7b888020097eaa802a99e757c6dad7",
        "4f7b888020097eaa802a99e757c6dad7 (10:41): Topic: system colors",
        "4f7b888020097eaa802a99e757c6dad7 (10:41): Richard is presenting",
        "4f7b888020097eaa802a99e757c6dad7 (10:42): Richard, IBM accessibility",
        "4f7b888020097eaa802a99e757c6dad7 (10:43): richard  will explain why it is not a good idea to deprecate system clolors",
        "72af1cb61d47fcc5d18402bf3d1c147d (10:43): s/Richard/Richard Schwerdtfeger",
        "4f7b888020097eaa802a99e757c6dad7 (10:44): R: with rich internet apps, we can create objects that use system color settings like &quot;icon&quot;, &quot;menu&quot; etc.",
        "4f7b888020097eaa802a99e757c6dad7 (10:45): R: while system colors are available, accessibility can find colors and get idea of a role",
        "4f7b888020097eaa802a99e757c6dad7 (10:46): DB is trying to understand why we are talking about using things that look like system controls but are not system controls",
        "72af1cb61d47fcc5d18402bf3d1c147d (10:47): (attendance list monday morning TPAC: jdagget, plinss, alexm, fantasi, dbaron, szilles, bddfdb28870c5800d938fa0993c46d65, howcome, dino, 72af1cb61d47fcc5d18402bf3d1c147d + Richard Schwerdtfeger)",
        "72af1cb61d47fcc5d18402bf3d1c147d (11:03): aaaah",
        "4f7b888020097eaa802a99e757c6dad7 (11:12): R: actually it is to keep application colors in sync with system settings. e.g. if there is a system color for highlight it can be applied to tree widgets",
        "4f7b888020097eaa802a99e757c6dad7 (11:12): Hakon: do you know about personal stylesheet",
        "4f7b888020097eaa802a99e757c6dad7 (11:12): DB: does is have to lead to CSS system colors as a solution?",
        "4f7b888020097eaa802a99e757c6dad7 (11:12): Elika: ... ways to override colors based on Aria settings",
        "4f7b888020097eaa802a99e757c6dad7 (11:12): DB: points at the titlebar with a gradient in windows colors dialog",
        "4f7b888020097eaa802a99e757c6dad7 (11:12): DB: css system colors model system effect, but in a simpler way, as a set of colors rather than exact system effects like rounded borders or gradients",
        "4f7b888020097eaa802a99e757c6dad7 (11:12): DB: that is a big rationale for deprecation (colors don't represent exact system effect)",
        "4f7b888020097eaa802a99e757c6dad7 (11:12): DB: another rationale - these are very Windows specific",
        "4f7b888020097eaa802a99e757c6dad7 (11:12): DB: Windows controls are used in controls in multiple combinations that are hard to map to other systems",
        "4f7b888020097eaa802a99e757c6dad7 (11:12): ... more discussion",
        "4f7b888020097eaa802a99e757c6dad7 (11:12): JD: I'm concerned that we're going for checking items off a list rather than actually solving the problem",
        "4f7b888020097eaa802a99e757c6dad7 (11:12): Richard: My concern is mainly about giving the author the ability to ensure enough contrast.",
        "4f7b888020097eaa802a99e757c6dad7 (11:12): Richard: My suggestion is to pick a baseline set of colors: window bg, text color, highlight colors, and maybe a border color and draw the line there.",
        "4f7b888020097eaa802a99e757c6dad7 (11:12): Howcome: Can I show you what we do with Opera?",
        "4f7b888020097eaa802a99e757c6dad7 (11:12): Howcome projects Opera with high-contrast settings.",
        "4f7b888020097eaa802a99e757c6dad7 (11:12): DB: There are other ways to do this besides style sheets",
        "4f7b888020097eaa802a99e757c6dad7 (11:12): DB: Mozilla has the minimum size pref",
        "4f7b888020097eaa802a99e757c6dad7 (11:12): DB: We also have options to say that the browser should ignore colors set by the author.",
        "4f7b888020097eaa802a99e757c6dad7 (11:12): DB: When we do that, we also preserve transparency, which you can't do with an author style sheet.",
        "4f7b888020097eaa802a99e757c6dad7 (11:13): DB: When you start doing things like that, then you get to the point where a lot of applications will still work.",
        "4f7b888020097eaa802a99e757c6dad7 (11:13): DB: Even if you make government websites meet these requirements, users are going to want to visit other sites as well.",
        "4f7b888020097eaa802a99e757c6dad7 (11:13): DB: You have the option of solving the problem at one point, and you have the option of making all authors try to solve the problem.",
        "4f7b888020097eaa802a99e757c6dad7 (11:13): SZ: So what I'm hearing is that system colors doesn't solve the problem.",
        "4f7b888020097eaa802a99e757c6dad7 (11:13): SZ: Maybe the way of solving the problem is identifying ways the browser can enable a disabled person to view the web",
        "4f7b888020097eaa802a99e757c6dad7 (11:13): SZ: The catch is that the browser is only one aspect of using the computer.",
        "4f7b888020097eaa802a99e757c6dad7 (11:13): SZ: With system colors, the settings are system-wide",
        "4f7b888020097eaa802a99e757c6dad7 (11:13): DB: When you turn off author colors, usually the browser will use the system colors as the default.",
        "4f7b888020097eaa802a99e757c6dad7 (11:13): DB: The point I was making a few minutes ago, it seems when there's the possibility of solving this problem at one point vs. making each author solve them independently",
        "4f7b888020097eaa802a99e757c6dad7 (11:13): DB: It seems we're going for the high-cost approach.",
        "4f7b888020097eaa802a99e757c6dad7 (11:13): Richard: The browser doesn't know what the author intended.",
        "4f7b888020097eaa802a99e757c6dad7 (11:13): DB: I'm not saying that the approach I want would mean no work for the author.",
        "4f7b888020097eaa802a99e757c6dad7 (11:13): DB: For example, the author might have to use appropriate markup to cause the browser to do the right thing.",
        "4f7b888020097eaa802a99e757c6dad7 (11:13): Richard: That works for standard form controls.",
        "4f7b888020097eaa802a99e757c6dad7 (11:13): Richard: But when the author is making custom controls, the author needs to make the decisions the browser makes",
        "4f7b888020097eaa802a99e757c6dad7 (11:13): EE: Couldn't you make the browser style custom controls based on the ARIA attributes?",
        "4f7b888020097eaa802a99e757c6dad7 (11:13): EE: If the author uses the ARIA attributes correctly (which you're assuming anyway) then the browser can have a setting that forces system colors on those controls based on the ARIA attributes.",
        "4f7b888020097eaa802a99e757c6dad7 (11:13): EE: I note that if you make the authors do the coloring work, most of them will get it wrong.",
        "4f7b888020097eaa802a99e757c6dad7 (11:13): Howcome shows Opera's high-contrast and zoom settings on Yahoo Mail",
        "e0ea5b093409d206f62668949287877a (11:14): is it demo day already? ;)",
        "4f7b888020097eaa802a99e757c6dad7 (11:15): richard point at selection not being visible at yahoo inbox",
        "eeec0d609c419e554a2cc20a57bc6ff7 (11:15): - it's always demo day with Hakon around",
        "4f7b888020097eaa802a99e757c6dad7 (11:15): JD: how would system colors help here?",
        "4f7b888020097eaa802a99e757c6dad7 (11:16): Richard: because it uses highlight colors of the system",
        "4f7b888020097eaa802a99e757c6dad7 (11:18): EE: aria attributes have enough information to be able to render with the right colors",
        "4f7b888020097eaa802a99e757c6dad7 (11:18): AM: Aria has coarser granularity, not enough to represent UI elements",
        "72af1cb61d47fcc5d18402bf3d1c147d (11:19): e0ea5b093409d206f62668949287877a: you're in France, just thank Orange...",
        "72af1cb61d47fcc5d18402bf3d1c147d (11:19): because demos w/o connectivity...",
        "4f7b888020097eaa802a99e757c6dad7 (11:20): discussing tabs on Orange page example...",
        "4f7b888020097eaa802a99e757c6dad7 (11:21): DB: tabs are really really complicated. questioning if system colors will help",
        "4f7b888020097eaa802a99e757c6dad7 (11:22): EE: browser shoud be able to make things look like tabs...",
        "4f7b888020097eaa802a99e757c6dad7 (11:22): AM is not sure what it means",
        "4f7b888020097eaa802a99e757c6dad7 (11:23): Hakon reminds about mobile",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:27): Alex: So what I'm hearing is that you want system colors so that someone who has the budget to really do a lot of accessibility work they can make a really cool-looking app with system colors",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:28): EE: System colors don't give you access to the gradients, bitmaps, etc. that you need to make a modern-looking app",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:28): EE: If you want to use system colors, sure you can get enough contrast",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:28): EE: But your web app will look like a Windows 3.1 application",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:28): EE: That's the best you can do with system colors",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:29): EE: The browser can get access to all of that stylistic information and draw real-looking controls",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:29): EE: If it has a way of knowing what to draw where",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:31): Richard: ...",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:31): Richard: I'm proposing that you have four basic colors so you can draw controls with enough contrast",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:32): Peter: That won't be enough",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:32): DB: I'd like to point out that deprecated doesn't mean gone.",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:32): DB: Deprecated means there's a better solution",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:32): DB: It might be not quite ready yet, but this is not the right permanent solution",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:32): Richard: What's the better solution?",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:33): DB: Some combination of better markup for controls and the CSS 'appearance' property",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:39): EE: Deprecation means they shouldn't be used in favor of something else (the 'appearance' property), but they are still required to be supported.",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:39): DB: Mozilla has supported system colors for ages.",
        "bddfdb28870c5800d938fa0993c46d65 (11:40): QA definition of deprecated: http://www.w3.org/QA/glossary",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:40): PL: It uses them to render its own UI, so it has more capability for representing system-based UI than is in that spec",
        "bddfdb28870c5800d938fa0993c46d65 (11:40): &quot;An existing feature that has become outdated and is in the process of being phased out, usually in favor of a specified replacement. Deprecated features are no longer recommended for use and may cease to exist in future versions of the specification.&quot;",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:42): Richard: So I'd request that you add that wording to css3-color",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:42): DB: I've added it to my issues list",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:42): Richard: And we need to come up with a solution",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:42): JD: I think it needs to be at a higher semantic level",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:43): SZ: It would be nice if css3-color linked informatively to the 'appearance' property",
        "72af1cb61d47fcc5d18402bf3d1c147d (11:45): (***** slot for coffee break is 1hr starting 10:30 *****)",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:49): discussion about custom controls, HTML5, system colors, accessibility, etc",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:50): Richard: lotus Notes 4 had 200 custom controls",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:51): ...",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:52): Richard: So you're saying that these colors are supported in IE, Opera, Mozilla, and WebKit?",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:52): DB: more or less",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:52): DB: but I've had to go through and write implementation reports for these",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:53): DB: and I couldn't mark them all as passing",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:53): DB: Each time it was some bizarre judgement call",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:53): DB: about whether the system color approximated what it was supposed to approximate",
        "72af1cb61d47fcc5d18402bf3d1c147d (11:54): (****************** COFFEE BREAK TIME ; RETURN 11:10 ****************)",
        "3f21e54c5c5ffd50fe3680acc025bb1d (11:54): DB: whether or not that thing existed on the OS I was running the test on"
    ],
    "person_ids": [
        "4e63bbbffbcaf12608512401eaf11240",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "72af1cb61d47fcc5d18402bf3d1c147d",
        "e0ea5b093409d206f62668949287877a",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0",
        "4f7b888020097eaa802a99e757c6dad7",
        "eeec0d609c419e554a2cc20a57bc6ff7",
        "3f21e54c5c5ffd50fe3680acc025bb1d",
        "bddfdb28870c5800d938fa0993c46d65"
    ]
}