{
    "id": "0b7caeac445773f2fd3ab864fae5d134",
    "messages": [
        "f9b36de6c178d98ca2171bb653acb05e (09:30): b8810fee2f4a71f849f3f7409546d1d9: patch - http://bugzilla.validator.nu/attachment.cgi?id=115",
        "f9b36de6c178d98ca2171bb653acb05e (09:31): for http://bugzilla.validator.nu/show_bug.cgi?id=653",
        "f9b36de6c178d98ca2171bb653acb05e (09:32): seems like a dead-simple change, but just want to make sure I didn't miss anything elsewhere",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:53): MikeSmith: looks good",
        "65325d50b2e25aca54bc871b89758c9c (09:54): b8810fee2f4a71f849f3f7409546d1d9: what do you think of the PFWG idea of issuing a validator warning every time a &lt;table&gt; element is used (effectively)?",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:56): 65325d50b2e25aca54bc871b89758c9c: I think it doesn't make sense to issue a warning on every table especially if the PFWG position is along the lines that summary isn't always necessary but the feature must remain for use when the table is confusing enough to need it",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:57): 65325d50b2e25aca54bc871b89758c9c: as an aside, I haven't fully reviewed the proposed text yet, but I noticed that one of the sample summaries contains data that any screen reader that doesn't suck should be able to voice from the table model given headers marked up as &lt;th&gt;",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:58): suggesting that authors include such text because AT vendors don't get their act together seems to get Priority of Constituencies the wrong way",
        "65325d50b2e25aca54bc871b89758c9c (09:58): b8810fee2f4a71f849f3f7409546d1d9: Cynthia's comments about autogenerated summary seem to be related",
        "ab7faae5d7b250ea8606486575f8f79c (09:59): b8810fee2f4a71f849f3f7409546d1d9: Those people didn't have any way to verify Google's claims (until now), so it doesn't seem unreasonable for them to have assumed Google did something sane",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:00): ab7faae5d7b250ea8606486575f8f79c: maybe my default assumption in the absence of evidence to contrary was correct but more cynical than other people's",
        "65325d50b2e25aca54bc871b89758c9c (10:01): it seems to me that if we want to consider autogenerated summary, it's much better for the UA/AT side to generate it, than the authoring tool side",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:01): 65325d50b2e25aca54bc871b89758c9c: indeed",
        "65325d50b2e25aca54bc871b89758c9c (10:01): b8810fee2f4a71f849f3f7409546d1d9: anyway - would be good to have some level-headed mailing list feedback on this once you have reviewed the proposal enough",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:02): 65325d50b2e25aca54bc871b89758c9c: ok",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:02): ab7faae5d7b250ea8606486575f8f79c: note that I don't mean to disparage Google in any way. That's just my default assumption about *any* even vaguely Namespace-related software--that I assume it's not correct until shown correct",
        "ab7faae5d7b250ea8606486575f8f79c (10:04): b8810fee2f4a71f849f3f7409546d1d9: It seems reasonable to assume they'll have a few bugs, but it also seems reasonable to assume they'll have at least attempted to do something basically correct and not just totally ignored the whole specification",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:04): ab7faae5d7b250ea8606486575f8f79c: fair enough",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:05): ab7faae5d7b250ea8606486575f8f79c: indeed, I didn't expect the deviation from the spec to be as great as you have shown",
        "ab7faae5d7b250ea8606486575f8f79c (10:05): It seems kind of like whoever designed Google's RDFa support just read the RDFa Primer and didn't bother with the proper spec or with understanding RDF or namespaces at all",
        "65325d50b2e25aca54bc871b89758c9c (10:05): so they implemented RegexpDFa?",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:06): ab7faae5d7b250ea8606486575f8f79c: it's also possible that whoever designed it understood it and deemed the specced approach too complex",
        "ab7faae5d7b250ea8606486575f8f79c (10:06): doesn't mean to be personally offensive to whoever designed or implemented it, but maybe he does because it seems pretty rubbish :-p",
        "ab7faae5d7b250ea8606486575f8f79c (10:09): b8810fee2f4a71f849f3f7409546d1d9: Too complex to implement, or too complex to author?",
        "65325d50b2e25aca54bc871b89758c9c (10:09): the nested types bug is surprising",
        "65325d50b2e25aca54bc871b89758c9c (10:09): er, nested properties",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:10): ab7faae5d7b250ea8606486575f8f79c: to author, because I'd assume Google can get software implemented",
        "ab7faae5d7b250ea8606486575f8f79c (10:11): 65325d50b2e25aca54bc871b89758c9c: Doesn't seem too surprising giving that they seemingly don't support @datatype, and in the absence of @datatype RDFa says you shouldn't recurse into property elements (they should just be treated as XMLLiterals instead)",
        "65325d50b2e25aca54bc871b89758c9c (10:12): ab7faae5d7b250ea8606486575f8f79c: I see",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:12): ab7faae5d7b250ea8606486575f8f79c: whoa! does RDFa default to XMLLiterals as opposed to plain strings for property values?",
        "ab7faae5d7b250ea8606486575f8f79c (10:12): (You have to use datatype=&quot;&quot; to stop that XMLLiteral behaviour)",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:12): interesting!",
        "ab7faae5d7b250ea8606486575f8f79c (10:12): b8810fee2f4a71f849f3f7409546d1d9: Yes, though I think they're thinking of changing that in RDFa 1.1",
        "ab7faae5d7b250ea8606486575f8f79c (10:13): (Well, it defaults to XMLLiterals if there are any element children - if it's just text then it's an untyped string literal)",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:13): (I guess this reveals that I've never taken the time to be exhaustive in review of RDFa)",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:13): (I've stopped at earlier issues)",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:14): ab7faae5d7b250ea8606486575f8f79c: ok. that's reasonable in a way",
        "ab7faae5d7b250ea8606486575f8f79c (10:14): b8810fee2f4a71f849f3f7409546d1d9: If they wanted to make it easier to author, it seems there would be far better ways of doing that in a way that's still largely compatible with RDFa, e.g. do all the proper CURIE processing but then have a special hack for values with an undeclared prefix &quot;v&quot; or something",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:15): ab7faae5d7b250ea8606486575f8f79c: good point",
        "ab7faae5d7b250ea8606486575f8f79c (10:16): What's the longest it should take for a message to reach a W3C list (if the author's never posted before and it does the slow authorisation stuff)?",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:20): why does the spec suggest a weird Mood‚ÄìGrade table?",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:20): wouldn't the best way of making it accessible be making it non-weird?",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:20): is rather surprised to find the Mood‚ÄìGrade in the main spec",
        "65325d50b2e25aca54bc871b89758c9c (10:24): what's Mood-Grade?",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:24): 65325d50b2e25aca54bc871b89758c9c: see http://www.whatwg.org/specs/web-apps/current-work/#the-table-element",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:24): 65325d50b2e25aca54bc871b89758c9c: search string &quot;For instance, the following table:&quot;",
        "b9acb5df457f56156060d93d0827b8ac (10:25): b8810fee2f4a71f849f3f7409546d1d9: I think 69b0d3dfe919a6b860a9fac82de52a7e wanted a short but odd table",
        "b9acb5df457f56156060d93d0827b8ac (10:25): I agree it sucks though",
        "65325d50b2e25aca54bc871b89758c9c (10:26): that is a weird table",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:26): has trouble locating validator-sensitive text in the draft Cynthia posted",
        "b9acb5df457f56156060d93d0827b8ac (10:27): is disappointed but not too surprised that PFWG have retreated away from the compromise in the spec to something rather close to their originl position",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:28): b8810fee2f4a71f849f3f7409546d1d9: i needed a table that had table headers in the middle or that was otherwise not something that a brief scan of the table would show to be a simple table to understand",
        "65325d50b2e25aca54bc871b89758c9c (10:28): b8810fee2f4a71f849f3f7409546d1d9: http://dev.w3.org/html5/pf-summary/Overview.html#guidance-for-conformance-checkers-0",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:29): b8810fee2f4a71f849f3f7409546d1d9: if you have any better suggestions for a table that really needs summary, let me know",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:30): 65325d50b2e25aca54bc871b89758c9c: ooh. Thanks."
    ],
    "person_ids": [
        "f9b36de6c178d98ca2171bb653acb05e",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "65325d50b2e25aca54bc871b89758c9c",
        "ab7faae5d7b250ea8606486575f8f79c",
        "b9acb5df457f56156060d93d0827b8ac",
        "69b0d3dfe919a6b860a9fac82de52a7e"
    ]
}