{
    "id": "0f507f105296d6550106d0aae62c1d5d",
    "messages": [
        "66b0d785bfa15d051888c24dabba7342 (10:51): 69b0d3dfe919a6b860a9fac82de52a7e: mutually exclusive subtitles: this is the way virtually all software and hardware media players work. it seems useful to be able to mark up that certain tracks are mutually exclusive (&lt;tracktrack&gt;) so that the UI can create a sane menu.",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:52): having multiple subtitle tracks present at one time seems to be on the wrong side of 80/20",
        "66b0d785bfa15d051888c24dabba7342 (10:52): the other options are to make all tracks mutually exlcusive or all tracks &quot;parallel&quot;, both of which are broken",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:52): if you want to make English subtitles plus Japanese subtitles for language learners for anime, you can package them into one track",
        "66b0d785bfa15d051888c24dabba7342 (10:53): b8810fee2f4a71f849f3f7409546d1d9: I agree, but others  040342c014ffc1c11592948bd92e3721) insisted, and I think the current solution is fairly non-intrusive",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:53): FWIW, in movie theaters in Finland, there are subtitles in Finnish and in Swedish, but they aren't independent tracks",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:53): specifically, the Swedish subtitles aren't bought from Sweden",
        "2466054b396284f05e6f6e4e7d3c806d (10:53): wonders what it is that keeps leaking memory in FF.",
        "040342c014ffc1c11592948bd92e3721 (10:53): b8810fee2f4a71f849f3f7409546d1d9: you will not want to package two different languages in one file if you can avoid it",
        "66b0d785bfa15d051888c24dabba7342 (10:53): the most compelling argument (to me) is that if &lt;track&gt; is also used for e.g. extra audio tracks, clearly subtitles and the extra audio track aren't mutually exclusive",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:54): 040342c014ffc1c11592948bd92e3721: I think you do",
        "040342c014ffc1c11592948bd92e3721 (10:54): then you cannot turn one off",
        "66b0d785bfa15d051888c24dabba7342 (10:54): hi 040342c014ffc1c11592948bd92e3721",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:54): 040342c014ffc1c11592948bd92e3721: for the same reason Swedish subtitles in Finnish movie theaters aren't independent of the Finnish subtitles",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:54): 040342c014ffc1c11592948bd92e3721: the traslator to Finnish chooses the timing",
        "040342c014ffc1c11592948bd92e3721 (10:54): hi 66b0d785bfa15d051888c24dabba7342 :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:55): and then the translator to Swedish uses that timing",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:55): so the Finnish and Swedish subtitles always change at the same time",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:55): because having them change at different times would be annoying",
        "040342c014ffc1c11592948bd92e3721 (10:55): so you cannot reuse the subtitles in Finnish or Swedish separately?",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:56): 040342c014ffc1c11592948bd92e3721: but the Web is different from movie theaters in the sense that the Web experience is personal",
        "040342c014ffc1c11592948bd92e3721 (10:56): I think you can very well create them in different files but synchronised",
        "040342c014ffc1c11592948bd92e3721 (10:56): do you know whether in the production process they are actually in the same file and not just rendered on together?",
        "66b0d785bfa15d051888c24dabba7342 (10:56): I'd say that if parallel tracks don't impose too much complexity (in API, markup, code or UI) then it's a good feature",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:56): 040342c014ffc1c11592948bd92e3721: what's the use case on the Web except language learning?",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:56): IMO, language learning is way on the wrong side of 80/20",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:56): esp. since there's a workaround",
        "66b0d785bfa15d051888c24dabba7342 (10:57): current downside: it makes &lt;trackgroup&gt; mandatory boilerplate in most cases",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:57): multiple tracks means you need to stack them in layout...",
        "cc097e0d7183ae8436e7df709553c8c0 (10:57): b8810fee2f4a71f849f3f7409546d1d9: use case: watching a movie with a friend who doesn't know swedish",
        "040342c014ffc1c11592948bd92e3721 (10:57): chapter markers and subtitles and textual audio descriptions on together would be one need for multiple tracks active at the same time",
        "040342c014ffc1c11592948bd92e3721 (10:58): plus you saw the examples that 69b0d3dfe919a6b860a9fac82de52a7e cumulated together with multiple subtitles on at the same time",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:58): cc097e0d7183ae8436e7df709553c8c0: I suppose the Web experience can become unpersonal once movie rentals and TV move to the browser",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:59): 040342c014ffc1c11592948bd92e3721: the examples I saw suggested they were for learning Japanese",
        "040342c014ffc1c11592948bd92e3721 (10:59): I am not a big fan of having tracks of the same type on at the same time, but we definitely need it for different types",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:59): are there new examples?",
        "cc097e0d7183ae8436e7df709553c8c0 (10:59): b8810fee2f4a71f849f3f7409546d1d9: yeah, i'd expect Voddler-like apps to appear as web apps",
        "65325d50b2e25aca54bc871b89758c9c (10:59): if &lt;track&gt; was used for audio descriptions as well as subtitles, then you would want those to come from a separate mutually exclusive list",
        "66b0d785bfa15d051888c24dabba7342 (10:59): indeed",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:59): notes that Finnish TV broadcasts don't support Finnish and Swedish subtitles simultaneously",
        "040342c014ffc1c11592948bd92e3721 (10:59): that was my original design",
        "cc097e0d7183ae8436e7df709553c8c0 (11:00): doesn't know if Voddler supports multiple subtitles or indeed subtitles at all",
        "040342c014ffc1c11592948bd92e3721 (11:00): shot down by reality I was told :)",
        "040342c014ffc1c11592948bd92e3721 (11:01): goes checking out voddler",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:01): cc097e0d7183ae8436e7df709553c8c0: it would be an interesting market enabler if the Swedish audience had so good English listening comprehension that they could optimize subtitles away",
        "040342c014ffc1c11592948bd92e3721 (11:01): bah, not available in my country",
        "66b0d785bfa15d051888c24dabba7342 (11:02): lol, region coded internets suck",
        "cc097e0d7183ae8436e7df709553c8c0 (11:02): b8810fee2f4a71f849f3f7409546d1d9: personally i prefer english captions but most other people i know prefer swedish subtitles",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:03): cc097e0d7183ae8436e7df709553c8c0: why English captions?",
        "66b0d785bfa15d051888c24dabba7342 (11:03): I have the same preference as cc097e0d7183ae8436e7df709553c8c0, especially if the spoken language is English",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:03): interesting",
        "66b0d785bfa15d051888c24dabba7342 (11:03): and usually otherwise too, because the translation tends to be better",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:04): If the spoken language is English and I'm watching a movie alone, I turn subtitles off",
        "cc097e0d7183ae8436e7df709553c8c0 (11:04): b8810fee2f4a71f849f3f7409546d1d9: it's easier to follow what they say compared to no captions, and it's easier to mentally listen and read in english compared to listen in english and read in swedish",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:04): if I'm watching with other people, they want the Finnish subtitles anyway",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:05): or the other people opt to have no subtitles, too",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:06): wonders what's the current situation with the Voddler GPL violation story is",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:07): http://en.wikipedia.org/wiki/Voddler#Source_Code_Copyright_Violation_by_Voddler wikipedia to rescue",
        "2466054b396284f05e6f6e4e7d3c806d (11:15): Any suggestions for testing memory leaks in FF? Or should I just use binary search on the addons/plugins?",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:21): 2466054b396284f05e6f6e4e7d3c806d: have you already verified that the leak isn't present when all addons and plug-ins are disabled?",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:34): 66b0d785bfa15d051888c24dabba7342: why wouldn't the UI just let you pick one subtitle or caption track, and leave it at that?",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:34): 66b0d785bfa15d051888c24dabba7342: while still letting the JS enable/disable whatever it wants?",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:35): b8810fee2f4a71f849f3f7409546d1d9: supporting multiple tracks visible at once is basically free once you support multiple cues not overlapping",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:35): 69b0d3dfe919a6b860a9fac82de52a7e: even in terms of layout stacking?",
        "a924fb58d2c25874322f4e5126f608b9 (11:37): One thing I didn't see in the timed tracks examples was vertical text",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:38): b8810fee2f4a71f849f3f7409546d1d9: that's what i mean, once you have cues not stacking each other, making subtitles not stack each other is basically free",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:38): b8810fee2f4a71f849f3f7409546d1d9: is there anything else that would be non-trivial?",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:38): a924fb58d2c25874322f4e5126f608b9: one of the first examples has some vertical text",
        "a924fb58d2c25874322f4e5126f608b9 (11:39): Oh, must've missed it",
        "a924fb58d2c25874322f4e5126f608b9 (11:39): Wait, that isn't vertical text",
        "a924fb58d2c25874322f4e5126f608b9 (11:39): That's rotated text",
        "a924fb58d2c25874322f4e5126f608b9 (11:39): It's flipped 90 degrees",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:39): oh, so it is",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:40): i hadn't even noticed",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:40): anyway i'm treating it as vertical",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:40): for the purposes of this exercise",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:40): :-)",
        "a924fb58d2c25874322f4e5126f608b9 (11:40): kk",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:40): and not supporting rotated text :-P",
        "a924fb58d2c25874322f4e5126f608b9 (11:40): I think we can live without rotated text",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:40): which isn't really a particularly good use of the evidence :-P",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:40): if you have any other examples, please do put them up",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:40): vertical ones in particular",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:41): otherwise i will basically just have to go on my rather faulty knowledge of vertical text layout",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:42): i gotta say, the thing that most surprises me in all my standards work is how hard it is to get people to provide use case examples",
        "a924fb58d2c25874322f4e5126f608b9 (11:42): Here's one where the subtitles bounce in tune with the music... let's ignore that",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:43): from people not understanding what that means, to not understanding why we would want to even look at real-world examples rather than just base it on theory, to not believing that use case examples actually affect design...",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:44): many people have expressed the belief that when i ask them for use cases i'm just trying to dismiss them and that they are the only people from whom i ask for use cases",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:44): it's so crazy",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:44): 69b0d3dfe919a6b860a9fac82de52a7e: I think I'm not sure if I understood what it means to support multiple cues not overlapping",
        "66b0d785bfa15d051888c24dabba7342 (11:44): 69b0d3dfe919a6b860a9fac82de52a7e: I don't think a content manu UI for enabling multiple tracks would be very nice, so from a laziness point of view I could live with letting the native UI only enable one track, implicitly disabling all other.",
        "66b0d785bfa15d051888c24dabba7342 (11:45): context menu",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:45): b8810fee2f4a71f849f3f7409546d1d9: http://www.youtube.com/watch?v=xG9KluukpJI#t=2m40",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:45): 66b0d785bfa15d051888c24dabba7342: yeah i wouldn't want the native menu to enable multiple tracks",
        "66b0d785bfa15d051888c24dabba7342 (11:45): if &lt;track&gt; is only for text I could accept this",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:46): 69b0d3dfe919a6b860a9fac82de52a7e: looks like a totally gratuitous &quot;just because we can&quot; effect that in *waaayy* on the wrong side of 80/20",
        "66b0d785bfa15d051888c24dabba7342 (11:46): if we take &lt;track&gt; for e.g. commentators tracks seriously, then it's not so good",
        "66b0d785bfa15d051888c24dabba7342 (11:46): I don't feel strongly about this issue either way",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:46): 69b0d3dfe919a6b860a9fac82de52a7e: are you assuming the reuse of the line layout code of the CSS formatter?",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:46): b8810fee2f4a71f849f3f7409546d1d9: multiple cues with overlapping times are not that rare",
        "66b0d785bfa15d051888c24dabba7342 (11:46): 040342c014ffc1c11592948bd92e3721: thoughts?",
        "040342c014ffc1c11592948bd92e3721 (11:47): is reading email - have wasted a day in town today :(",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:47): 66b0d785bfa15d051888c24dabba7342: i think if we ever do multiple media resources in sync, the way to do it is to reuse &lt;video&gt;/&lt;audio&gt; and have them linked at that level",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:47): 66b0d785bfa15d051888c24dabba7342: i don't think we'd use &lt;track&gt; for that",
        "66b0d785bfa15d051888c24dabba7342 (11:47): 69b0d3dfe919a6b860a9fac82de52a7e: I would agree that that's cleaner",
        "a924fb58d2c25874322f4e5126f608b9 (11:47): http://dashiva.net/misc/vertical_karaoke.jpg",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:48): didn't know YouTube supported times in the fragment id",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:48): b8810fee2f4a71f849f3f7409546d1d9: if you mean inline box and line box layout, then yes, at least in UAs that want to do CSS-based styling of cues",
        "66b0d785bfa15d051888c24dabba7342 (11:48): &lt;track&gt; is still not a great name for an element though (the only upside is that I first suggested it)",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:48): 66b0d785bfa15d051888c24dabba7342: what's a better name?",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:48): a924fb58d2c25874322f4e5126f608b9: sweet lord man",
        "66b0d785bfa15d051888c24dabba7342 (11:48): I have no better name, I suggested the best I could think of :)",
        "2cc83be0233de2f6f7813e9af67fd5de (11:49): probably the wrong channel to ask in.. but you know how to read specs :P ARIA spec says default value of aria-haspopup is false, does that mean that &lt;li aria-haspopup&gt; is the same as &lt;li aria-haspopup=&quot;false&quot;&gt;?",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:49): &lt;track&gt; it is :-P",
        "66b0d785bfa15d051888c24dabba7342 (11:49): others have been &lt;itext&gt; and something else",
        "a924fb58d2c25874322f4e5126f608b9 (11:49): This is the full madness karaoke form, with animated fade in and fade out of characters",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:49): a924fb58d2c25874322f4e5126f608b9: addressing the actual &quot;current&quot; span is something i haven't worked out how to do",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:50): a924fb58d2c25874322f4e5126f608b9: and positioning the subtitles that precisiely is non-trivial",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:50): well it's very trivial if we do it pixel-based, but that's not an especially good idea for various reasons",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:50): a924fb58d2c25874322f4e5126f608b9: other than that i think we can do that",
        "a924fb58d2c25874322f4e5126f608b9 (11:50): Well, most of this probably falls on the wrong side of 80/20, so it's no big crisis",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:51): a924fb58d2c25874322f4e5126f608b9: assuming we go down the kind of route i'm thinking of",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:51): a924fb58d2c25874322f4e5126f608b9: yeah",
        "a924fb58d2c25874322f4e5126f608b9 (11:51): http://dashiva.net/misc/bouncing_karaoke.jpg",
        "66b0d785bfa15d051888c24dabba7342 (11:51): it would be quite acceptible to leve the most crazy styling/animations to JavaScript",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:51): i really need to figure out positioning, that's the main thing i'm spinning on",
        "040342c014ffc1c11592948bd92e3721 (11:53): re: multiple cues with overlapping times - that is actually really common on captions that position the spoken text close to the speaker - they leave the old text at the other speaker around for a bit so ppl can catch up on it",
        "040342c014ffc1c11592948bd92e3721 (11:53): it's a really useful feature and doesn't cost us much, I think",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:53): would be good to find some examples of that on youtube or something so i could study them &quot;in action&quot; as it were",
        "a924fb58d2c25874322f4e5126f608b9 (11:53): Not to mention when multiple people speaking simultaneously",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:54): right now i just have that one example",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:54): right, i'm off",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:54): later",
        "a924fb58d2c25874322f4e5126f608b9 (11:55): http://dashiva.net/misc/multiple_speakers.jpg",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:55): wonders if the people tagging http://labs.opera.com/news/2010/04/22/ as &quot;iphone&quot; on Delicious know the difference between Opera Mini and Opera Mobile",
        "a924fb58d2c25874322f4e5126f608b9 (11:56): Um, already examples for that, so no need I guess",
        "66b0d785bfa15d051888c24dabba7342 (11:58): SRT files often have overlapping times by mistake, because most (all?) player fix it during parsing",
        "040342c014ffc1c11592948bd92e3721 (11:58): also about having multiple media resources in sync: I think you need both - (1) the dependent ones like audio descriptions whose timeline is totally dependent on the main timeline - they would go into &lt;track&gt;  - (2) the compositions of multiple media resources that may build a multimedia experience of sorts - they would be linked on the full &lt;audio&gt;/&lt;video&gt; level",
        "040342c014ffc1c11592948bd92e3721 (11:59): 66b0d785bfa15d051888c24dabba7342: players don't &quot;fix&quot; it - they just remove the old element when the new one appears",
        "66b0d785bfa15d051888c24dabba7342 (11:59): 040342c014ffc1c11592948bd92e3721: internally syncing them is the same think regardless of the syntax, so I think it's mostly a question of picking a syntax which makes sense",
        "040342c014ffc1c11592948bd92e3721 (11:59): with srt that's the only thing you can do because they would be rendered in the same place",
        "2466054b396284f05e6f6e4e7d3c806d (12:00): b8810fee2f4a71f849f3f7409546d1d9: Was going to try that now.",
        "66b0d785bfa15d051888c24dabba7342 (12:00): 040342c014ffc1c11592948bd92e3721: in any event the overlapping is concealed, so SRT files have overlap which wasn't intended as such by the author",
        "040342c014ffc1c11592948bd92e3721 (12:01): the internal mechanism is only the same for some of it - e.g. if a dependent media resource is longer its overlength will never be played - if a synchronised media resource is longer, it will continue playing",
        "2466054b396284f05e6f6e4e7d3c806d (12:08): b8810fee2f4a71f849f3f7409546d1d9: seems to grow with all addons and plugins disabled as well. But lets see, 336 MB now. Will see what it uses after a few minutes of not touching.",
        "66b0d785bfa15d051888c24dabba7342 (12:09): 040342c014ffc1c11592948bd92e3721: true",
        "2466054b396284f05e6f6e4e7d3c806d (12:25): b8810fee2f4a71f849f3f7409546d1d9: doing nothing, now 466 MB and growing",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:26): 2466054b396284f05e6f6e4e7d3c806d: I suggest filing a bug",
        "2466054b396284f05e6f6e4e7d3c806d (12:31): b8810fee2f4a71f849f3f7409546d1d9: Yeah, just have my developer instincts taking over trying to nail it down. Managed to with the XHTML Ruby addon. :)"
    ],
    "person_ids": [
        "66b0d785bfa15d051888c24dabba7342",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "2466054b396284f05e6f6e4e7d3c806d",
        "040342c014ffc1c11592948bd92e3721",
        "cc097e0d7183ae8436e7df709553c8c0",
        "65325d50b2e25aca54bc871b89758c9c",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "a924fb58d2c25874322f4e5126f608b9",
        "2cc83be0233de2f6f7813e9af67fd5de"
    ]
}