{
    "id": "10b45ce6458df0f8ad05b8d2703d8bb0",
    "messages": [
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (16:55): a9b326df4e6da61c5b6f5e1058be83a2: well anyway, the APIs I like to list that make a positive difference to the CMS are now: Offline Webapps (localStorage, IndexedDB, App Cache), File API, Contenteditable, Drag &amp; Drop",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (16:55): 6 total, I think I'm going to list 10 total and then go into deeper detail on 3 or 5 (considering 10-15 mins is not long)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (16:55): sounds good",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (16:55): you maybe have any idea for another 4 ?",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (16:56): for a modern CMS system improved by HTML5",
        "a9b326df4e6da61c5b6f5e1058be83a2 (16:57): drag and drop interoperability is also not great yet",
        "e04aa5104d082e4a51d241391941ba26 (16:58): be51bd0bf909e7c2ce4328e2f9bb04b4, just do 5 -&gt; I can't imagine a 15 minute talk explaining 10 APIs",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (16:59): e04aa5104d082e4a51d241391941ba26: and then just go into deeper detail on those 5?",
        "e04aa5104d082e4a51d241391941ba26 (16:59): be51bd0bf909e7c2ce4328e2f9bb04b4, yes.",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (16:59): ok",
        "e04aa5104d082e4a51d241391941ba26 (16:59): either that or do a top 10 - but don't go really deep on any of them",
        "a9b326df4e6da61c5b6f5e1058be83a2 (16:59): I don't think you have time to go into deep detail on anything in that amount of time",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:00): yea thanks i think i might do this",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:00): yea 5 is even a lot if you want to go into deep detail",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:00): e04aa5104d082e4a51d241391941ba26: but you think those 5 represent a good potential presentation about what HTML5 APIs can improve in our CMS ?",
        "e04aa5104d082e4a51d241391941ba26 (17:00): is not usually a fan of very short talks for this reason",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:00): and localstorage and indexedDB are not strictly for offline apps only",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:01): no, but for example a CMS indexedDB could store the page rigths etc in tables and link this to page contents right?",
        "e04aa5104d082e4a51d241391941ba26 (17:01): be51bd0bf909e7c2ce4328e2f9bb04b4, ContentEditable is a key one",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:02): i mean, this would improve the CMS remarkeable right? making it offline compatible",
        "e04aa5104d082e4a51d241391941ba26 (17:03): be51bd0bf909e7c2ce4328e2f9bb04b4, well - for offline editing - like google docs type things",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:03): e04aa5104d082e4a51d241391941ba26: how you mean?",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:04): and drag &amp; drop i ment, that now for our pages we use a lib extension called jsTree",
        "e04aa5104d082e4a51d241391941ba26 (17:04): be51bd0bf909e7c2ce4328e2f9bb04b4, the offline stuff isn't particularly useful for the display side of a CMS - but it is quite useful for the editing",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:04): e04aa5104d082e4a51d241391941ba26: sorry i might sound dumb, but can you explain a bit?",
        "e04aa5104d082e4a51d241391941ba26 (17:05): be51bd0bf909e7c2ce4328e2f9bb04b4, what are the offline APIs (indexedDB, localStorage, App Cache) useful for in a CMS?",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:06): being able to work offline, have data stored in a more structured and efficient way than usually was possible with cookies, and being able to sync the data later",
        "936e36f7a71852e10a649295a6a9729f (17:11): be51bd0bf909e7c2ce4328e2f9bb04b4, would be nice to cover http caching in their too, it's v underestimated and underconsidered by most dev's",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:12): 936e36f7a71852e10a649295a6a9729f: you mean App Cache?",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:12): where you define which files should be cached",
        "936e36f7a71852e10a649295a6a9729f (17:13): in addition to app cache, serving static templates, populating them via content editable then PUTting them back to the server as static documents, it's v nice for cms users and ultimately optimized for the network",
        "936e36f7a71852e10a649295a6a9729f (17:14): localStorage for session stuff rather than using HTTP like it's stateful, indexeddb and app cache leveraged for offline usage etc etc",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:16): 936e36f7a71852e10a649295a6a9729f: you mean so you avoid to upload/process anything but the text filled in through CE ?",
        "936e36f7a71852e10a649295a6a9729f (17:17): yes, and if you use microdata/rdfa/data-* attributes in your templates you can have them entering the machine data (like product names and prices) right in to the template, then your server side apps just lifts the data right from the user-edited product view page as google rich snippets bot etc does.",
        "936e36f7a71852e10a649295a6a9729f (17:18): effectively, CMS's are a thing of the past, you don't really need them any more, you can just edit an HTML document in browser and PUT it back to the server, hell even shopping baskets etc can all be client side in js now - server apps are needed far less than people think",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:18): yep",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:19): but i think the conversion to this new style of content management won't go so fast i mean, look at how much companies edit their data through traditional CMS systems",
        "936e36f7a71852e10a649295a6a9729f (17:19): so perhaps show how to make a blog/cms using HTML5 and no server side app (other than something to serve and save files)",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:19): I think this would require to much detail",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:20): I also have some other subjects to discuss, like syntax / markup (in the light of parsing by search engines, mobile devices etc) which also should take a me some min utes to explain",
        "936e36f7a71852e10a649295a6a9729f (17:20): i don't.. just a static html page on the server, make the title and the article contenteditable, local storage to cache the draft, then ajax to PUT it back",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:20): thanks a lot for your input btw",
        "936e36f7a71852e10a649295a6a9729f (17:20): np",
        "936e36f7a71852e10a649295a6a9729f (17:20): said ajax, yuck - meant xhr (&amp; cors...)",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:23): I mean, its maybe something to optinally offer, but the essence now is presenting the above",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:23): File API pretty much speaks for itself and is not so hard to explain i think",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:24): same for content editable and drag/drop",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:24): actually, content editable, how do you think people create in the end the same user experience as with popular inline text editors like TinyMCE ?",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:24): people=developers",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:25): Given content editable offers good new functionality but not a rich text editing app",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:29): be51bd0bf909e7c2ce4328e2f9bb04b4: I think the File API is not quite so simple",
        "e9fe2a8ed6a64844a5c024b6f688d024 (17:29): 042dd99eb0ff8653814e445ca0093427: yt?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:30): it's three APIs really",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:31): a9b326df4e6da61c5b6f5e1058be83a2: i highlight FileReader",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:31): and it is quite a powerful API with some potentially pretty sophisticated applications",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:31): ok",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:31): a9b326df4e6da61c5b6f5e1058be83a2: you maybe have any other important things of the FileAPI that could bne explained for a CMS?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:33): no",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:36): like e04aa5104d082e4a51d241391941ba26 said, I'm not sure how much of any of this has specific relevance to a CMS",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:37): ok",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:37): which of it",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:38): hmm",
        "042dd99eb0ff8653814e445ca0093427 (17:38): e9fe2a8ed6a64844a5c024b6f688d024: email me, I gotta run",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:58): a9b326df4e6da61c5b6f5e1058be83a2: well, the dropping files from the normal file system browser to the CMS is at least 1",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:59): ok",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:59): and I think it could also be quite logical a CMS executes an operation on a batch of local files i think? i.e. tagging them one by one with canvas",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (17:59): (image files for example)",
        "936e36f7a71852e10a649295a6a9729f (18:11): be51bd0bf909e7c2ce4328e2f9bb04b4, you've seen aloha editor ya?",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (18:12): i didn't but im checking it out now",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (18:12): thnaks",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (18:14): 936e36f7a71852e10a649295a6a9729f: you think Aloha editor could be of any meaning ? apart from mentioning it as example ?",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (18:16): 936e36f7a71852e10a649295a6a9729f: i mean, could it be seriously considerable for example to write some beta CMS part with aloha as text editor implemented?",
        "be51bd0bf909e7c2ce4328e2f9bb04b4 (18:16): like TYPO and Drupal did?"
    ],
    "person_ids": [
        "be51bd0bf909e7c2ce4328e2f9bb04b4",
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "e04aa5104d082e4a51d241391941ba26",
        "936e36f7a71852e10a649295a6a9729f",
        "e9fe2a8ed6a64844a5c024b6f688d024",
        "042dd99eb0ff8653814e445ca0093427"
    ]
}