{
    "id": "1312a4eec191d4a45c13e5e890de4056",
    "messages": [
        "f4dfad803df83144a5be86d9bca87678 (16:19): Anyone care to comment? http://static.webvm.net/audio/test.html",
        "73eaf221abca1b8244e34b0b9e76ac46 (16:34): f4dfad803df83144a5be86d9bca87678: don't nest &lt;audio&gt;",
        "73eaf221abca1b8244e34b0b9e76ac46 (16:34): f4dfad803df83144a5be86d9bca87678: use &lt;audio&gt;&lt;source&gt;",
        "002fd66affb058c756926402acf97570 (16:34): http://www.w3.org/2001/tag/2009/10/08-minutes.html#item07",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:35): 002fd66affb058c756926402acf97570: I don't follow. Is LMM arguing against the TAG MIME Respect finding or for it?",
        "002fd66affb058c756926402acf97570 (16:35): I'm not sure I entirely follow either.",
        "f4dfad803df83144a5be86d9bca87678 (16:39): 73eaf221abca1b8244e34b0b9e76ac46: ok, updated... though i am not sure about codecs for mp3/wav",
        "b25b6b77a0087ff8385941e5545d32ea (16:44): b8810fee2f4a71f849f3f7409546d1d9: At the least I get the sense that someone is arguing against making the HTML/XHTML distinction a property of the MIME type",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:45): b25b6b77a0087ff8385941e5545d32ea: that ship sailed years ago",
        "65325d50b2e25aca54bc871b89758c9c (16:45): b25b6b77a0087ff8385941e5545d32ea: not everyone on the TAG has a clear view of the harbor",
        "b25b6b77a0087ff8385941e5545d32ea (16:46): I'm not suggesting it is a sane thing to be arguning :)",
        "b25b6b77a0087ff8385941e5545d32ea (16:46): *arguing",
        "65325d50b2e25aca54bc871b89758c9c (16:46): er, meant that comment for b8810fee2f4a71f849f3f7409546d1d9 but you guys know what I meant",
        "f4dfad803df83144a5be86d9bca87678 (16:51): I am little confused by audio loop http://www.whatwg.org/specs/web-apps/current-work/#attr-media-loop When combined with autoplay... should it just play continuously?",
        "65325d50b2e25aca54bc871b89758c9c (16:52): I don't think anyone suggested switching browser *behavior* for XHTML/HTML based on anything other than MIME type, but there was an argument that it's ok if some document that in some sense &quot;is&quot; XHTML as text/html, if processing as HTML is what you want",
        "65325d50b2e25aca54bc871b89758c9c (16:52): I think, anyway",
        "65325d50b2e25aca54bc871b89758c9c (16:52): minutes are muddled",
        "b25b6b77a0087ff8385941e5545d32ea (16:55): doesn't really understand the distinction between what a document is and how it behaves",
        "b25b6b77a0087ff8385941e5545d32ea (16:56): But that is some sort of philosophical position I guess",
        "65325d50b2e25aca54bc871b89758c9c (16:58): well, the spec introduces this distinction somewhat, when it says, &quot;XML documents that use elements or attributes from the HTML namespace and that are served over the wire (e.g. by HTTP) must be sent using an XML MIME type such as application/xml or application/xhtml+xml and must not be served as text/html.&quot;",
        "65325d50b2e25aca54bc871b89758c9c (16:58): so that raises the question whether a document &quot;is&quot; an XML document - particularly tricky in light of polyglot document support",
        "65325d50b2e25aca54bc871b89758c9c (16:59): the spec already says separately that anything sent as text/html will be treated as HTML",
        "a9b326df4e6da61c5b6f5e1058be83a2 (16:59): fwiw, I think the above paragraph is not necessary, or at least should be worded differently",
        "65325d50b2e25aca54bc871b89758c9c (17:00): I'm not sure I even know what that paragraph means",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:00): it should just say that documents in the HTML namespace served with an XML mime type must conform to the XML (XHTML) syntax",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:00): and that documents served as text/html must conform to the HTML syntax",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:00): and leave it at that",
        "65325d50b2e25aca54bc871b89758c9c (17:01): I think the MIME type registrations included in the document might already say that",
        "65325d50b2e25aca54bc871b89758c9c (17:01): (maybe not as to XML documents served as text/xml or application/xml instead of application/xhtml+xml)",
        "65325d50b2e25aca54bc871b89758c9c (17:02): but yeah, anything that doesn't form to the HTML syntax must not be served as text/html",
        "65325d50b2e25aca54bc871b89758c9c (17:02): anything that conforms to the XML syntax either is also valid HTML (in which case you can in fact send it as text/html), or it's not, in which case it's already invalid",
        "a924fb58d2c25874322f4e5126f608b9 (17:02): &quot;Definition: A data object is an XML document if it is well-formed, as defined in this specification.&quot; - What is a data object?",
        "65325d50b2e25aca54bc871b89758c9c (17:03): the sentence I cited superficially seems to forbid serving polyglot documents as text/html, which is inconsistent with the rest of the spec",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:04): yeah",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:05): I don't think it's necessary for it to have that prohibition nor anything similar",
        "65325d50b2e25aca54bc871b89758c9c (17:06): I don't think it even means to prohibit that",
        "65325d50b2e25aca54bc871b89758c9c (17:07): it seems like it assumes there's some platonic sense in which something is either an HTML document or an XML document (based on author's intent? I dunno) and thus can't really be checked",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:07): yeah, that's a good way to put it",
        "65325d50b2e25aca54bc871b89758c9c (17:08): it sort of seems like it's saying &quot;don't serve XHTML as HTML unless you know it's not really going to get processed as XML&quot;",
        "a924fb58d2c25874322f4e5126f608b9 (17:14): &quot;Don't serve XHTML as text/html unless it's also valid HTML&quot;",
        "65325d50b2e25aca54bc871b89758c9c (17:14): that would be a fine thing to say"
    ],
    "person_ids": [
        "f4dfad803df83144a5be86d9bca87678",
        "73eaf221abca1b8244e34b0b9e76ac46",
        "002fd66affb058c756926402acf97570",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "b25b6b77a0087ff8385941e5545d32ea",
        "65325d50b2e25aca54bc871b89758c9c",
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "a924fb58d2c25874322f4e5126f608b9"
    ]
}