{
    "id": "176b25f6b325352a33a59a2cffa15dea",
    "messages": [
        "65325d50b2e25aca54bc871b89758c9c (02:41): ef6f2287bae00ba79475fbf56c2b6fee: we definitely take requests for accessibility fixes in WebKit, of course",
        "65325d50b2e25aca54bc871b89758c9c (02:41): 03341ab0742a44ea0478cab05ca96cac: you could ask on #webapi on this server, or ask Lachy or anne, but I don't think there is an official test suite",
        "03341ab0742a44ea0478cab05ca96cac (02:42): nods",
        "65325d50b2e25aca54bc871b89758c9c (02:42): 03341ab0742a44ea0478cab05ca96cac: however, that spec is going into Last Call, I would suggest you should review and get others (Catfish_Man, maybe dethbakin and mitz) to try to review too",
        "03341ab0742a44ea0478cab05ca96cac (02:42): 65325d50b2e25aca54bc871b89758c9c: I was planning on it",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:42): 65325d50b2e25aca54bc871b89758c9c: Yeah I know (I've logged some). I need to find time to do some hacking myself for it too. :)",
        "65325d50b2e25aca54bc871b89758c9c (02:43): ef6f2287bae00ba79475fbf56c2b6fee: that is welcome as well",
        "65325d50b2e25aca54bc871b89758c9c (02:43): I need to schedule a meeting with the VoiceOver people to talk about ARIA",
        "65325d50b2e25aca54bc871b89758c9c (02:44): lemme know if you have other things that might be worth discussing with or mentioning to them",
        "65325d50b2e25aca54bc871b89758c9c (02:44): I think a lot of HTML5 elements will help with accessibility",
        "65325d50b2e25aca54bc871b89758c9c (02:44): proper use of &lt;section&gt; / &lt;article&gt; could allow for better navigation",
        "65325d50b2e25aca54bc871b89758c9c (02:44): I dunno how focused they are on accessibility in the browser though, relative to native apps",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:46): 65325d50b2e25aca54bc871b89758c9c: From a webkit perspective, I'd say making navigation from bit to bit around the page more predictable is the most important (but unfortunately probably the trickiest) thing.",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:46): 65325d50b2e25aca54bc871b89758c9c: Then there are some showstopper bugs like multiple selects being broken to the extent that they can't be read.",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:46): Table support of some sort would be good.",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:47): Another thing would be the ability to skip links.",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:47): VO users sometimes complain about not being able to get to the meat of pages quick enough.",
        "65325d50b2e25aca54bc871b89758c9c (02:47): I dunno what you mean about the multiple selects",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:47): I think being able to skip groups of links (as you can with JAWS and WE)",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:47): would help with that",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:48): (Obviously HTML5 nav could help in the future too.)",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:48): 65325d50b2e25aca54bc871b89758c9c: http://bugs.webkit.org/show_bug.cgi?id=15817",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:49): (for the multiple select bug)",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:50): 65325d50b2e25aca54bc871b89758c9c: Skipping links would also be good for non-VO users (keyboard/switch users)",
        "65325d50b2e25aca54bc871b89758c9c (02:51): ef6f2287bae00ba79475fbf56c2b6fee: what defines a &quot;group of links&quot;?",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:52): 65325d50b2e25aca54bc871b89758c9c: Good question :) In the case of WE and JAWS, you can set a threshold number of non-link characters between links for something to still count as a group of links (I assume that's to cope with pipe characters used in navigation)",
        "65325d50b2e25aca54bc871b89758c9c (02:53): &quot;you can set a threshold&quot; would probably not be an acceptable answer for Mac OS X human interface",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:53): so say you set 3 as a threshhold ... &lt;a href=&quot;...&quot;&gt;foo&lt;/a&gt; | &lt;a href=&quot;...&quot;&gt;baz&lt;/a&gt; is part of a group but &lt;a href=&quot;...&quot;&gt;foo&lt;/a&gt; and also &lt;a href=&quot;...&quot;&gt;baz&lt;/a&gt; is not.",
        "65325d50b2e25aca54bc871b89758c9c (02:53): but series of links w/ no more than some number of characters in between is sorta reasonable",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:53): 65325d50b2e25aca54bc871b89758c9c: Well you could devise some sort of algorithm to do something similar I guess.",
        "65325d50b2e25aca54bc871b89758c9c (02:53): I guess we could have a shortcut for that when tab to links is on",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:54): 65325d50b2e25aca54bc871b89758c9c: &quot;tab to links&quot; just switches the keybindings round",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:54): it doesn't actually change functionality",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:54): so I'm not sure why one would restrict the functionality to one keybinding scenario or another",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:55): (especially as that would complicate further a feature I've already had to attempt to explain more than once on macvisionaries)",
        "65325d50b2e25aca54bc871b89758c9c (02:55): I don't think it makes sense to have a &quot;tab skipping group of links&quot; shortcut when not in &quot;tab to links&quot; mode",
        "65325d50b2e25aca54bc871b89758c9c (02:56): (can't remember if full keyboard access still enables tabbing to links by default)",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:56): 65325d50b2e25aca54bc871b89758c9c: Why not have an option tab skipping group of links",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:56): when in option tab to links mode",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:56): 65325d50b2e25aca54bc871b89758c9c: I don't /think/ it does. I'm pretty sure I have to set that manually.",
        "65325d50b2e25aca54bc871b89758c9c (02:56): well, it would have to be an obscure shortcut",
        "65325d50b2e25aca54bc871b89758c9c (02:57): if you have one to suggest we can consider it",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:57): 65325d50b2e25aca54bc871b89758c9c: With JAWS you just press N",
        "65325d50b2e25aca54bc871b89758c9c (02:58): tab, option-tab, shift-tab and shift-option-tab are all taken",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:58): granted you can't use N in the main UI though!",
        "65325d50b2e25aca54bc871b89758c9c (02:58): I don't think we'd add a keyboard shortcut on an unmodified key in the default UI",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:58): yep ... my point is more that obscure is not necessarily better",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:59): 65325d50b2e25aca54bc871b89758c9c: I suppose one thing to discuss is whether you could use a VO-prefixed shortcut (ctrl option) in the main UI space",
        "65325d50b2e25aca54bc871b89758c9c (02:59): the real problems are first, having a good shortcut, second figuring out how to make it reasonable discoverable, and third, figuring out what to call the feature",
        "65325d50b2e25aca54bc871b89758c9c (02:59): &quot;skip group of links&quot; is not a very clear name",
        "65325d50b2e25aca54bc871b89758c9c (02:59): since the default setting in the normal UI is that focus navigation skips all links",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:59): 65325d50b2e25aca54bc871b89758c9c: It's a lot clearer than what the WE manual calls it!",
        "ef6f2287bae00ba79475fbf56c2b6fee (02:59): &quot;Skip to text&quot; IIRC",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:00): 65325d50b2e25aca54bc871b89758c9c: Skip navigation might be better.",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:00): (since that's the basic idea)",
        "65325d50b2e25aca54bc871b89758c9c (03:00): so this is supposed to be a heuristic to skip what are intended to be groups of navigation links?",
        "65325d50b2e25aca54bc871b89758c9c (03:00): to get to the main content faster?",
        "65325d50b2e25aca54bc871b89758c9c (03:01): I think a heuristic for voiceover to skip to main content might be the best solution for this use case",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:01): 65325d50b2e25aca54bc871b89758c9c: That's the main purpose (although you can also have subsidiary groups of links scattered through the page)",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:01): e.g. tag links following a blog entry",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:02): (or social media sharing links etc.)",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:03): I'd say getting to the main content is roughly 70% of the need.",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:04): (very roughly)",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:04): Getting to the main content may be even harder to create a reliable algorithm for, however.",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:12): 65325d50b2e25aca54bc871b89758c9c: Another thing would be fixing the context menu so it can be operated with VO as in other apps.",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:12): one of the reasons for that is so that users can add bookmarklets easily",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:13): (which requires activating the context menu and selecting Add Link",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:13): ... that's another thing that came up on macvisionaries",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:13): (sorry this list is a bit random)",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:13): there's a bug filed for context menu and it has a radar",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:15): 65325d50b2e25aca54bc871b89758c9c: oh another big thing: fix read all, so people can sit back, relax and have a webpage read to them :) http://bugs.webkit.org/show_bug.cgi?id=15487",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:22): 65325d50b2e25aca54bc871b89758c9c: This was another bug that came out of discussions on macvisionaries: http://bugs.webkit.org/show_bug.cgi?id=15310",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:22): (allow folks to select ranges of text with the keyboard)",
        "65325d50b2e25aca54bc871b89758c9c (03:23): does VoiceOver have a standard mechanism for keyboard selection of non-editable text?",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:24): 65325d50b2e25aca54bc871b89758c9c: Not sure. Where else do you find non-editable documents that you'd want to copy?",
        "65325d50b2e25aca54bc871b89758c9c (03:24): Mail",
        "65325d50b2e25aca54bc871b89758c9c (03:25): iChat",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:25): don't those both use WebKit for display too?",
        "65325d50b2e25aca54bc871b89758c9c (03:25): IRC clients",
        "65325d50b2e25aca54bc871b89758c9c (03:25): ironically all these things tend to use WebKit",
        "65325d50b2e25aca54bc871b89758c9c (03:25): but that's an implementation detail",
        "65325d50b2e25aca54bc871b89758c9c (03:26): many alerts also have the error text selectable",
        "65325d50b2e25aca54bc871b89758c9c (03:26): iChat didn't use WebKit before Leopard",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:28): 65325d50b2e25aca54bc871b89758c9c: As far as I can tell, in Tiger, text is selectable in a plain text msg in Mail but not an HTML msg.",
        "65325d50b2e25aca54bc871b89758c9c (03:29): ef6f2287bae00ba79475fbf56c2b6fee: really?",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:29): but I may be missing something",
        "65325d50b2e25aca54bc871b89758c9c (03:29): how do you start a selection with the keyboard?",
        "65325d50b2e25aca54bc871b89758c9c (03:29): (or do you just mean that selection modification shortcuts work once you have a mouse selection)",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:29): 65325d50b2e25aca54bc871b89758c9c: you get a normal character cursor when you focus on the plain text msg area",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:29): so you can use shift",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:29): shift + arrow keys",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:31): 65325d50b2e25aca54bc871b89758c9c: I think you need VO on for that to work though",
        "65325d50b2e25aca54bc871b89758c9c (03:32): ah",
        "65325d50b2e25aca54bc871b89758c9c (03:32): probably, yes",
        "ef6f2287bae00ba79475fbf56c2b6fee (03:39): 65325d50b2e25aca54bc871b89758c9c: Thinking about it, groups mode provides some of that skipping functionality already (or it would if VO announced &quot;navigation group&quot; rather than just &quot;group&quot;) ... it just doesn't handle the jumping to main content bit."
    ],
    "person_ids": [
        "65325d50b2e25aca54bc871b89758c9c",
        "03341ab0742a44ea0478cab05ca96cac",
        "ef6f2287bae00ba79475fbf56c2b6fee"
    ]
}