{
    "id": "17b8626d9d60878dc0680e908d0ae792",
    "messages": [
        "ab7faae5d7b250ea8606486575f8f79c (18:23): Hmm, &lt;iframe sandbox&gt; sounds like a handy way to make a Flash-blocker for browsers that don't provide one (like Chrome?)",
        "ab7faae5d7b250ea8606486575f8f79c (18:24): Just make a page that embeds a user-chosen URL in a sandbox that disables plugins",
        "1f8387eb43f131d7c309a90a4e36b5cb (18:28): ab7faae5d7b250ea8606486575f8f79c: Interesting.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:32): Chrome has a Flash-blocker extension by now, surely?",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:33): (also, I get the best possible Flash blocking from it, namely --disable-plugins, since if I don't use that then the browser crashes all the time)",
        "ab7faae5d7b250ea8606486575f8f79c (18:33): You should use Opera, it has a handy context menu for globally disabling plugins :-)",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:34): If you can find the option in a sea of three hundred and eighty-one other options.",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:34): globally disabling isn't what you normally want?",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:34): You want a whitelist",
        "ab7faae5d7b250ea8606486575f8f79c (18:37): 88d4d34a8064a4ff39fd5e144eea7762: The context menu only has 14 options",
        "ab7faae5d7b250ea8606486575f8f79c (18:37): Uh, probably not actually a context menu; it's just what you get when you hit F12",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:37): ab7faae5d7b250ea8606486575f8f79c, and how many of those open up to a whole other submenu of options?  Chrome's has eight, no submenus.",
        "ab7faae5d7b250ea8606486575f8f79c (18:38): 88d4d34a8064a4ff39fd5e144eea7762: 0",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:38): F12 doesn't do anything in Chrome, so it has zero of those.  :)",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:38): none, actually",
        "ab7faae5d7b250ea8606486575f8f79c (18:38): (unless you count &quot;Edit site preferences...&quot; which opens a whole dialog)",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:38): I've been wondering though, is Chrome too simple to be mainstream?",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:38): Oh, F12 is just Tools -&gt; Quick Preferences.",
        "ab7faae5d7b250ea8606486575f8f79c (18:38): 88d4d34a8064a4ff39fd5e144eea7762: Yes",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:38): Well, Chrome still has zero prefs in that menu, so it wins for simplicity.  ;)",
        "ab7faae5d7b250ea8606486575f8f79c (18:38): but quicker",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:38): I was spoken to a woman who was recently switched to Firefox and could no longer find her beloved File -&gt; Email to option (apparently IE has one of those)",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:39): How will she fare with Chrome and not even a menu bar?",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:39): *i was speaking",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:39): Opera has 16 options in context menus, two of which are submenus.",
        "1f8387eb43f131d7c309a90a4e36b5cb (18:40): Steve^: In my experience, most users have no idea their browser *has* options.",
        "1f8387eb43f131d7c309a90a4e36b5cb (18:40): To be honest, *I* have no idea what many of the options do, or at least don't care.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:40): Steve^, I suspect that mostly, people don't mind simplicity.  Niche features like that aren't as important as a) working consistently, b) being responsive.",
        "ab7faae5d7b250ea8606486575f8f79c (18:40): 88d4d34a8064a4ff39fd5e144eea7762: I'm not sure why you seem to be arguing that Chrome wins because of its simplicity, when you've already admitted you have to use command-line arguments just to stop it crashing :-)",
        "1f8387eb43f131d7c309a90a4e36b5cb (18:40): Which is why I use Chrome for daily browsing.  ^_^",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:40): ab7faae5d7b250ea8606486575f8f79c, well, I'm using the Linux beta, that doesn't count.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:40): Actually, I'm on the dev channel.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:41): It also crashes randomly when I leave it running for a while, although I can just restore, so it's not a big deal.",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:41): 1f8387eb43f131d7c309a90a4e36b5cb, but that isn't an option, its a function",
        "ab7faae5d7b250ea8606486575f8f79c (18:41): 88d4d34a8064a4ff39fd5e144eea7762: We should only count mythical browsers that don't have any problems?",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:41): ab7faae5d7b250ea8606486575f8f79c, no, you should only count the stable channel of Chrome, just like you shouldn't count Opera alphas.",
        "ab7faae5d7b250ea8606486575f8f79c (18:41): I'd prefer to count the browser versions that I would use :-)",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:41): pardon myself for using the word option before",
        "1f8387eb43f131d7c309a90a4e36b5cb (18:41): Steve^: Still something that I didn't even know IE had, nor, I suspect, do the majority of people know that it exists.",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:42): ok, how about the print button?",
        "1f8387eb43f131d7c309a90a4e36b5cb (18:42): Do browsers have a print button normally exposed?",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:42): 1f8387eb43f131d7c309a90a4e36b5cb, but there isn't a file menu to get to it either",
        "ab7faae5d7b250ea8606486575f8f79c (18:42): (and since there seemingly isn't a version of Chrome on Linux that claims to be stable, I'd have to count the beta/dev versions)",
        "1f8387eb43f131d7c309a90a4e36b5cb (18:42): The little paper-thingy menu gets you there.",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:43): there;s a &quot;paper with folded corner&quot; menu",
        "1f8387eb43f131d7c309a90a4e36b5cb (18:43): Since there's only two buttons that aren't obviously navigation-related, you'll find it pretty quick.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:43): ab7faae5d7b250ea8606486575f8f79c, if we're talking about us, then the relevant notion of simplicity is thoroughly different.",
        "475665979d3480ed6d11b4c590df7123 (18:43): Hello everyone",
        "475665979d3480ed6d11b4c590df7123 (18:43): is there any documentation/samples for using python html5lib?",
        "ab7faae5d7b250ea8606486575f8f79c (18:44): 88d4d34a8064a4ff39fd5e144eea7762: I was talking about us, since you said &quot;I&quot; and I said &quot;you&quot;",
        "475665979d3480ed6d11b4c590df7123 (18:44): http://code.google.com/p/html5lib/wiki/UserDocumentation : page not found",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:44): ab7faae5d7b250ea8606486575f8f79c, well, then there's nothing complicated about a command-like switch.  It's the GUI I care about, and that's horribly cluttered in Opera and *extremely* slick and well-designed in Chrome.",
        "ab7faae5d7b250ea8606486575f8f79c (18:44): 475665979d3480ed6d11b4c590df7123: http://html5lib.googlecode.com/svn/wiki/UserDocumentation.wiki is what ought to be on that page",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:44): Also, if we're talking about us, I prefer open-source browsers.  :P",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:44): 1f8387eb43f131d7c309a90a4e36b5cb, I hope so, I've just been wondering. Older users find the menu bar as a safe haven for finding this sort of stuff",
        "475665979d3480ed6d11b4c590df7123 (18:44): Oh, thanks",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:45): I quite like how Chrome still has a status bar at the bottom, when you hover a link. Unlike safari which I believe doesn't have one at all",
        "f9e12e0466f4d059b78bb3f863633092 (18:46): too",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:46): and my mum is happy that it logs her into Facebook, so maybe it does have a future",
        "1f8387eb43f131d7c309a90a4e36b5cb (18:46): Yeah, I've been thinking of putting my status bar back on my work machine's firefox.",
        "65325d50b2e25aca54bc871b89758c9c (18:46): Steve^: Safari does have a status bar, it's just off by default",
        "1f8387eb43f131d7c309a90a4e36b5cb (18:46): I like simplicity, so I removed it, and the link-icon thinger I have helps a lot, but still.",
        "65325d50b2e25aca54bc871b89758c9c (18:46): turning on the status bar is one of the very few changes I make to the default preference settings",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:46): I think we can agree &quot;off by default&quot; is almost identical to not having a feature",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:47): I didn't even consider looking for that",
        "65325d50b2e25aca54bc871b89758c9c (18:48): a transient hover overlay might be good, though Chrome's particular design looks kinda fugly to my eye",
        "65325d50b2e25aca54bc871b89758c9c (18:48): I do agree that most users don't change defaults at all",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:49): everyone on the web seems to agree that choice is bad",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:49): It is.  I've been meaning to write an essay.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:49): Chrome is really excellent about not giving people unneeded choices.",
        "65325d50b2e25aca54bc871b89758c9c (18:49): &quot;users don't change defaults&quot; isn't the same as &quot;choice is bad&quot;",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:50): That's one of the great things about it.  They don't say &quot;Well, status bars are cluttery but some people like them, so let's make it an option.&quot;  They find a compromise that works well for everyone.",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:50): just a few minutes ago people were comparing the number of menus they had in their browsers",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:50): 65325d50b2e25aca54bc871b89758c9c, it does mean that you should never have a choice as a substitute for putting work into finding just the right default.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:51): &quot;Give the users a choice&quot; is often a way to avoid making a decision.",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:51): Chrome has done well, which is why I gave it to my mum. She can type whatever she likes in that box and it'll browse the web for her",
        "65325d50b2e25aca54bc871b89758c9c (18:51): that is indeed a pathology that is common in open source projects",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:51): Since it shuts up all the people who don't like the default, since they're just told to change it.",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:51): But then I use Linux and Opera, I like the other side of the scale",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:51): 65325d50b2e25aca54bc871b89758c9c, not in closed-source projects?  I can name you examples from Windows, for sure . . .",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:51): Like a dialog box asking you whether you want help files indexed, for crying out loud.",
        "65325d50b2e25aca54bc871b89758c9c (18:52): almost every open source project I worked on that was supposed to be UI-oriented was very quick to reach for &quot;let's just add a preference&quot;",
        "65325d50b2e25aca54bc871b89758c9c (18:52): Apple is mostly at the opposite extreme",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:52): So is Google (including Chromium).",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:52): Apple is a step too far, I find it difficult to find settings I need to change",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:52): Also GNOME, although IMO GNOME doesn't do as good a job at it.",
        "65325d50b2e25aca54bc871b89758c9c (18:52): those are my only two experiences seeing major projects up close",
        "65325d50b2e25aca54bc871b89758c9c (18:53): Apple's design philosophy is that there should be no such thing as &quot;settings you need to change&quot;",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:53): GNOME gets the &quot;don't give a preference&quot; part right, but forgets the &quot;and make the default good&quot; part . . . and also doesn't make it obvious how to change things that *are* changeable.  I'm still trying to figure out how to make Document Viewer my default PDF reader instead of scribus.  The latter isn't even installed anymore AFAICT.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:53): Yeah, that's the right philosophy.",
        "1f8387eb43f131d7c309a90a4e36b5cb (18:53): I've been lucky to be dictator of all of my projects so far, so I get to decide what the best thing is and just leave it alone.",
        "3cd30a070a8cd420f1a52db2a8b12754 (18:54): 88d4d34a8064a4ff39fd5e144eea7762, simple, replace the scribus executable with a link pointing to evince :)",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:54): It should figure almost everything out somehow.  If there are settings, they should mostly be contextual, not in some big preferences menu.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:54): Steve^, haha.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:54): That would work.",
        "65325d50b2e25aca54bc871b89758c9c (18:56): is fixing an HTML parser bug to atone for time-wasting mailing list posts",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:59): Does WebKit have any plans to switch to an HTML5 parser like Gecko does?",
        "65325d50b2e25aca54bc871b89758c9c (19:01): we'll eventually have an HTML5-compliant HTML parser",
        "65325d50b2e25aca54bc871b89758c9c (19:02): I have no timeline to give on that however",
        "3cd30a070a8cd420f1a52db2a8b12754 (19:13): Does anyone know if Google Chromes recent blanket-advertising campaign in the UK has done much?",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:14): I'm sure Google knows.  :)",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:15): The UK will be affected by the ballot box rolling out soon, won't it?  That will probably increase Chrome market share massively in the EU.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:18): Why is David Hyatt listed as an editor in the W3C copy of HTML5?  He doesn't actually edit it, does he?",
        "ab7faae5d7b250ea8606486575f8f79c (19:21): 88d4d34a8064a4ff39fd5e144eea7762: To placate people who weren't happy with having Hixie be the sole editor",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:22): It's rather misleading.",
        "ab7faae5d7b250ea8606486575f8f79c (19:23): Sure",
        "3cd30a070a8cd420f1a52db2a8b12754 (19:26): I wonder what kind of web browser the iSlate will have",
        "3cd30a070a8cd420f1a52db2a8b12754 (19:26): if the fantasies of a reinvented personal computer experience are anything to go by, the browser is surely a part",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:27): I can't imagine it would be anything but Safari, of some stripe.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:27): Maybe modified, like the iPhone Safari, but still Safari, surely.",
        "3cd30a070a8cd420f1a52db2a8b12754 (19:28): indeed, the content will be the same"
    ],
    "person_ids": [
        "ab7faae5d7b250ea8606486575f8f79c",
        "1f8387eb43f131d7c309a90a4e36b5cb",
        "88d4d34a8064a4ff39fd5e144eea7762",
        "3cd30a070a8cd420f1a52db2a8b12754",
        "475665979d3480ed6d11b4c590df7123",
        "f9e12e0466f4d059b78bb3f863633092",
        "65325d50b2e25aca54bc871b89758c9c"
    ]
}