{
    "id": "17c99fbb155cc14c91f74daefc690f25",
    "messages": [
        "60659cfda992013e610f285c46692d28 (11:40): 139513027e8e90b5582cbc68fc733884, as far as I can tell, we had agreement of not having predefined vocabs in the spec (ISSUE-73), and to separate Microdata into a separate spec. Why does the separated out spec now contain stuff we removed from HTML5 earlier on?",
        "139513027e8e90b5582cbc68fc733884 (11:47): 60659cfda992013e610f285c46692d28: the prior decision was to move the vocabularies out of the HTML5 draft",
        "139513027e8e90b5582cbc68fc733884 (11:48): I don't think putting them in the same draft as Microdata violates the letter of how the issue was resolved; no real opinion on whether it violates the spirit",
        "139513027e8e90b5582cbc68fc733884 (11:49): 60659cfda992013e610f285c46692d28: I guess you raised the original issue, so perhaps you would know what you had in mind",
        "139513027e8e90b5582cbc68fc733884 (11:50): 60659cfda992013e610f285c46692d28: as far as I can tell, the various objections in the issue text either apply only to the HTML5 draft itself, not to any other draft, or they would apply to publishing the vocabularies even as one or more drafts by themselves",
        "139513027e8e90b5582cbc68fc733884 (11:51): 60659cfda992013e610f285c46692d28: I guess we never had an FPWD request for the original vocabularies draft, so I don't know for sure if you would have objected to it but I don't recall you having a problem with it as an Editor's Draft",
        "139513027e8e90b5582cbc68fc733884 (11:51): I will also add that I personally don't care if the Microdata predefined vocabularies are in the same spec as Microdata or in yet another separate spec",
        "60659cfda992013e610f285c46692d28 (11:54): Maciej: not having them in HTML5 resolves a few reasons for objection, but not all of them.",
        "139513027e8e90b5582cbc68fc733884 (11:55): are there any reasons for objection that would apply to having the vocabularies in the Microdata draft, but would not apply to publishing them as a separate draft by themselves?",
        "60659cfda992013e610f285c46692d28 (11:55): I recommend that the Call For Consensus clarifies that the standalone draft re-introduces these chapters we earlier removed by consensus.",
        "60659cfda992013e610f285c46692d28 (11:56): I certainly didn't notice until a few minutes ago, because I thought &quot;separating out&quot; means just that, not re-adding stuff.",
        "139513027e8e90b5582cbc68fc733884 (11:56): I can make sure that is included in the CfC",
        "60659cfda992013e610f285c46692d28 (11:56): please do so",
        "139513027e8e90b5582cbc68fc733884 (11:57): I don't think &quot;re-introduce&quot; is the right term, since they were put in a separate draft from HTML5, not just deleted",
        "139513027e8e90b5582cbc68fc733884 (11:57): and they have not been put back into HTML5",
        "139513027e8e90b5582cbc68fc733884 (11:57): it's just that the Microdata draft merges in the former Microdata Vocabularies draft",
        "60659cfda992013e610f285c46692d28 (11:57): yes there are objections; such as vocabularies should be able to evolve independently of the syntax, and the potential overlap with IETF work (which we never resolved because we agreed on removing those)",
        "139513027e8e90b5582cbc68fc733884 (11:57): you are correct that people may well not have noticed this",
        "60659cfda992013e610f285c46692d28 (11:57): it merges in something we removed by consensus",
        "139513027e8e90b5582cbc68fc733884 (11:58): I'm looking at the original message where you agreed to closing the issue",
        "139513027e8e90b5582cbc68fc733884 (11:58): What Mike said was:",
        "139513027e8e90b5582cbc68fc733884 (11:58): &quot 60659cfda992013e610f285c46692d28, as the commenter who initially raised issue-73, can you",
        "139513027e8e90b5582cbc68fc733884 (11:58): confirm if you are OK with closing that issue out? (With a",
        "139513027e8e90b5582cbc68fc733884 (11:58): resolution noting that the predefined vocabularies have now been",
        "139513027e8e90b5582cbc68fc733884 (11:58): moved out of HTML5 and into separate drafts, and noting that HTML5",
        "139513027e8e90b5582cbc68fc733884 (11:58): does not reference those drafts nor have any dependency on them.)&quot;",
        "60659cfda992013e610f285c46692d28 (11:58): so it's not exactly what it was advertised to be",
        "139513027e8e90b5582cbc68fc733884 (11:59): and you replied to that with &quot;Yes&quot;",
        "60659cfda992013e610f285c46692d28 (12:00): i didn't expect these drafts to become HTML WG deliverables",
        "139513027e8e90b5582cbc68fc733884 (12:00): really? I did",
        "139513027e8e90b5582cbc68fc733884 (12:00): they were checked into the html5 directory in w3c cvs",
        "60659cfda992013e610f285c46692d28 (12:00): Anyway, if the CfC makes clear that this stuff is back in, people can give their feedback even if they didn't notice before",
        "60659cfda992013e610f285c46692d28 (12:00): No, I didn't.",
        "60659cfda992013e610f285c46692d28 (12:01): My expectation was that work would continue in the WhatWG only.",
        "139513027e8e90b5582cbc68fc733884 (12:01): the message I'm referring to specifically included dev.w3.org links for the vocab specs",
        "139513027e8e90b5582cbc68fc733884 (12:02): so I'm not sure how you could have come to that expectation",
        "139513027e8e90b5582cbc68fc733884 (12:02): http://lists.w3.org/Archives/Public/public-html/2009Oct/0107.html",
        "139513027e8e90b5582cbc68fc733884 (12:02): http://lists.w3.org/Archives/Public/public-html/2009Oct/0114.html",
        "60659cfda992013e610f285c46692d28 (12:03): I'm accustomed to Editor's putting whatever they want into W3C CVS :-)",
        "139513027e8e90b5582cbc68fc733884 (12:04): well most spec drafts that they put in the html5 directory are eventually proposed as W3C Working Drafts...",
        "139513027e8e90b5582cbc68fc733884 (12:04): so I don't think your conclusion was reasonable",
        "60659cfda992013e610f285c46692d28 (12:04): I have no problem with them being proposed.",
        "139513027e8e90b5582cbc68fc733884 (12:05): that being said, it's fair to say that WG members may not expect or might not have noticed that the Microdata draft folds in the vocabulary drafts",
        "60659cfda992013e610f285c46692d28 (12:05): I have a problem with them being silently included into something else; but that will be resolved by clarifying it in the CfC.",
        "139513027e8e90b5582cbc68fc733884 (12:05): and it is fair to bring that to their attention",
        "139513027e8e90b5582cbc68fc733884 (12:05): ok",
        "60659cfda992013e610f285c46692d28 (12:05): +1",
        "139513027e8e90b5582cbc68fc733884 (12:05): I agree that it is fair to ask for that"
    ],
    "person_ids": [
        "60659cfda992013e610f285c46692d28",
        "139513027e8e90b5582cbc68fc733884"
    ]
}