{
    "id": "19a45898f29f5c5b29b68aa2f3171ee4",
    "messages": [
        "b8810fee2f4a71f849f3f7409546d1d9 (09:03): wow, &lt;h a='&amp;noti'&gt; is hard",
        "f47636673b14c54021a69dc06f6a19fb (09:23): http://boagworld.com/forum/comments.php?DiscussionID=2400",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:26): f47636673b14c54021a69dc06f6a19fb: how could the evidence part be communicated better?",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:27): (clearly, it hasn't been communicated clearly enough)",
        "f47636673b14c54021a69dc06f6a19fb (09:27): I intend to write a blog post. I think there is a problem of perception from some people added with a problem of tone on the list from the most vocal group.",
        "f47636673b14c54021a69dc06f6a19fb (09:27): challenging :)",
        "f47636673b14c54021a69dc06f6a19fb (09:28): b8810fee2f4a71f849f3f7409546d1d9:  I have to reply to your email",
        "f47636673b14c54021a69dc06f6a19fb (09:28): but I'm preparing slides for a conference on sunday in Tokyo. Days of Web standards",
        "f47636673b14c54021a69dc06f6a19fb (09:29): http://www.w3.org/News/2007#item149 - http://days2007.cssnite.jp/",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:33): Philip`: fix for &lt;h a='&amp;noti'&gt; checked in",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:37): hmm. what the commenter on the above forum sees as evidence supporting profile='' is exactly what 69b0d3dfe919a6b860a9fac82de52a7e sees as evidence that profile='' has failed",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:37): the commenter goes &quot;See WordPress uses it&quot; and 69b0d3dfe919a6b860a9fac82de52a7e goes &quot;See, it is almost always used incorrectly, like WP.&quot;",
        "77db19c1dd94414f199e58aa6ca1827f (09:41): analysis of existing web content is primarily applicable to studies of existing language features",
        "139513027e8e90b5582cbc68fc733884 (09:42): so it's not exactly right to say &quot;For something to become part of the HTML WG's recommendation it has to be in use.&quot;",
        "139513027e8e90b5582cbc68fc733884 (09:42): on the other hand, there is a presumption that features from existing specs that are almost never used or almost always used wrong are probably flawed",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:43): 139513027e8e90b5582cbc68fc733884: analysis of existing content also shows demand for certain use cases that could be addessed by the core spec instead of scripts and plugins",
        "139513027e8e90b5582cbc68fc733884 (09:43): sure",
        "139513027e8e90b5582cbc68fc733884 (09:43): it's a different kind of evidence",
        "139513027e8e90b5582cbc68fc733884 (09:44): obviously we do have things in the spec that aren't in use",
        "139513027e8e90b5582cbc68fc733884 (09:44): personally I don't see what profile gets you that you couldn't put in a &lt;meta&gt; or &lt;link&gt; tag, for something like GRDDL",
        "139513027e8e90b5582cbc68fc733884 (09:45): and for microformats profile is clearly unhelpful and indeed useless",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:45): 139513027e8e90b5582cbc68fc733884: if GRDDL does foo, anything that's not foo is an inconvenience to the GRDDL users",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:45): anything that's not foo but replaces foo that is",
        "139513027e8e90b5582cbc68fc733884 (09:45): there are so few GRDDL users that inconveniencing them is irrelevant",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:46): 139513027e8e90b5582cbc68fc733884: the interesting part is that the GRDDL reason to have profile is to deal with microformats but we've seen that otherwise profile is unhelpful and useless for microformats",
        "139513027e8e90b5582cbc68fc733884 (09:47): what exactly does wordpress do with the profile attribute anyway?",
        "139513027e8e90b5582cbc68fc733884 (09:47): I couldn't find it on the few wordpress blogs I looked at",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:47): to me this suggests that if GRDDL wants to be successfull at working with microformats *on the Web scale*, GRDDL should figure out how to do it without profile",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:48): 139513027e8e90b5582cbc68fc733884: profile=&quot;http://gmpg.org/xfn/11&quot; as seen on blog.whatwg.org",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:49): 139513027e8e90b5582cbc68fc733884: so basically, whenever a WP blog uses a non XFN microformat, the theory says that the other formats don't mean anything",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:50): 139513027e8e90b5582cbc68fc733884: so it would be useless to let the profile value constrain what microformats you look for",
        "139513027e8e90b5582cbc68fc733884 (09:51): GRDDL requires the document to have more markup in the document than just the profile attribute, right?",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:52): I don't know what exactly GRDDL requires",
        "139513027e8e90b5582cbc68fc733884 (09:52): it has to be, first of all, the GRDDL profile, not the relevant microformat profile(s)",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:52): whoa. that would be *so* not Web scale",
        "139513027e8e90b5582cbc68fc733884 (09:52): and then a &lt;link rel=&quot;transformation&quot; ...&gt; to the GRDDL xsl stylesheet",
        "139513027e8e90b5582cbc68fc733884 (09:52): http://www.w3.org/2004/01/rdxh/spec#grddl-xhtml",
        "139513027e8e90b5582cbc68fc733884 (09:52): if I'm reading this right",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:53): so the publisher has to participate in a GRDDL-specific way instead of merely using a microformat",
        "139513027e8e90b5582cbc68fc733884 (09:54): the profile attribute says that rel=&quot;transformation&quot; should be interpreted as a GRDDL transformation",
        "139513027e8e90b5582cbc68fc733884 (09:54): it doesn't say anything about what microformats you use and afaict GRDDL doesn't care about that",
        "139513027e8e90b5582cbc68fc733884 (09:54): but I could be misunderstanding this",
        "139513027e8e90b5582cbc68fc733884 (09:56): although one of them links to GRDDL transforms for FOAF, CC and Geo, without profile markup for any of those",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:56): I quick glance over the GRDDL spec suggests to me that we should just add transformation to the list of known rel values",
        "139513027e8e90b5582cbc68fc733884 (09:56): so yeah, the idea of GRDDL is that your document's data can only be extracted by GRDDL-aware processors if you have marked it up in several GRDDL-specific ways, the most relevant ones not being the profile attribute",
        "b8810fee2f4a71f849f3f7409546d1d9 (09:58): I wonder if there's a quotable about XSLT similar to the jwz regexp quotable...",
        "139513027e8e90b5582cbc68fc733884 (09:59): XSLT requires use of XPath as well, so you have at least three problems",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:00): :-)",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:24): b25b6b77a0087ff8385941e5545d32ea: in the html5lib test cases there's an error message &quot;mismatched body element end tag (premature end of file?)&quot; if html5lib itself emits this, it could be rephased to something that better reflects the situation. e.g. &quot;The body element closed but there were unclosed elements. (premature end of file?)&quot;",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:31): b25b6b77a0087ff8385941e5545d32ea: in the document fragment test cases, the harness would be greatly simplified if the fragment came before #data",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:31): b25b6b77a0087ff8385941e5545d32ea: will your harness break, if I reorder the test case chunks?",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:32): b25b6b77a0087ff8385941e5545d32ea: in general, I'm of the opinion, that the test format should be as simple to process as possible at the expense of format flexibility",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:38): b25b6b77a0087ff8385941e5545d32ea: since I'm writing Java, any buffering if the test stream chunks is a PITA so, I have an UntilHashInputStream that reads directly from the aggregate test stream. hence, I need to know the fragment context before I consume the fragment data",
        "a9b326df4e6da61c5b6f5e1058be83a2 (10:39): b8810fee2f4a71f849f3f7409546d1d9 - jwz regexp quotable?",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:40): a9b326df4e6da61c5b6f5e1058be83a2: &quot;Some people, when confronted with a problem, think ``I know, I'll use regular expressions.'' Now they have two problems.&quot;",
        "a9b326df4e6da61c5b6f5e1058be83a2 (10:40): heh",
        "a9b326df4e6da61c5b6f5e1058be83a2 (10:40): who's jwz?",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:41): a9b326df4e6da61c5b6f5e1058be83a2: XEmacs hacker, early Netscape employee",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:41): a9b326df4e6da61c5b6f5e1058be83a2: http://www.jwz.org/",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:43): s/buffering if/buffering of/",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:51): Hmm. if Dmitry's new email address is any indication, he is now doing CSS 4, too",
        "a9b326df4e6da61c5b6f5e1058be83a2 (10:52): we can perhaps hope for IPV7",
        "a9b326df4e6da61c5b6f5e1058be83a2 (10:52): think I'll suggest it to him",
        "a9b326df4e6da61c5b6f5e1058be83a2 (10:54): or IPVn+1 of whatever the hell the current not-deployed version of IP protocol is",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:55): a9b326df4e6da61c5b6f5e1058be83a2: is IPv6 really deployed in mobile networks in Japan and Korea?",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:56): (over here, I get told that IPv6 is already big in Japan)",
        "b25b6b77a0087ff8385941e5545d32ea (10:57): b8810fee2f4a71f849f3f7409546d1d9: The error message in the test case and the error message html5lib emits are not necessarily the same",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:58): b25b6b77a0087ff8385941e5545d32ea: ok",
        "b25b6b77a0087ff8385941e5545d32ea (11:00): b8810fee2f4a71f849f3f7409546d1d9: We currently have an assumption that testcases start with the string #data so moving #document-fragment to the start will cause problems",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:00): b25b6b77a0087ff8385941e5545d32ea: :-(",
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:02): b8810fee2f4a71f849f3f7409546d1d9 - I'm told there are some practical reasons why there's more of need for IPV6 in Japan and rest of Asia then elsewhere",
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:03): olivier mentioned something about IBM having more IPV4 addresses than all of Japan",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:03): a9b326df4e6da61c5b6f5e1058be83a2: yeah, and Helsinki University of Technology has more than Saudi Arabia",
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:03): heh",
        "139513027e8e90b5582cbc68fc733884 (11:04): IBM has a /8 , does Japan really have less than that?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:04): 139513027e8e90b5582cbc68fc733884 - dunno, actually",
        "139513027e8e90b5582cbc68fc733884 (11:04): HP has two /8s",
        "139513027e8e90b5582cbc68fc733884 (11:05): I would guess at some point IANA may take away address space for individual organizations who have more addresses allocated than they could ever need",
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:05): anyway, the mobile operators here are deploying support for IPV6, I believe ... but I don't know if that's because they really need -- if there is a real business need for it now -- or if it's because of other pressure",
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:05): the Japanese Ministry of Internal Affairs and Communications (Soumushou) heavily promotes IPV6 and has been putting a lot of money behind it, as has NTT ... and personal influence of Jun Murai (who still teaches here are Keio Univ. where I work) is a big factor in it getting extra attention here in Japan",
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:05): I think",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:29): hmm. I have lots of bugs relating to implicit head and body",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:29): or lots of test failures perhaps caused by one or two bugs",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:36): hohum. they are spec bugs",
        "b25b6b77a0087ff8385941e5545d32ea (11:37): b8810fee2f4a71f849f3f7409546d1d9: Where?",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:38): b25b6b77a0087ff8385941e5545d32ea: EOF in main phase",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:38): b25b6b77a0087ff8385941e5545d32ea: the spec says: &quot;This fails because it doesn't imply HEAD and BODY tags. We should probably expand out the insertion modes and merge them with phases and then put the three things here into each insertion mode instead of trying to factor them out so carefully.&quot;",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:39): b25b6b77a0087ff8385941e5545d32ea: the html5lib tests expect this spec bug to be fixed",
        "b25b6b77a0087ff8385941e5545d32ea (11:39): Ah, OK. I remember Anne made html5lib do the right thing here",
        "b25b6b77a0087ff8385941e5545d32ea (11:40): where &quot;right thing&quot; is defined to mean &quot;what the spec will presumably eventually say&quot;",
        "b25b6b77a0087ff8385941e5545d32ea (11:40): I suggest you copy us :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:40): yeah",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:44): b25b6b77a0087ff8385941e5545d32ea: you guys have some serious tail recursion going on there",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:45): doesn't know if tail recursion is Pythonic",
        "b25b6b77a0087ff8385941e5545d32ea (11:55): b8810fee2f4a71f849f3f7409546d1d9: I'm pretty sure it's not",
        "b25b6b77a0087ff8385941e5545d32ea (11:55): We should probably change it to iteration",
        "b25b6b77a0087ff8385941e5545d32ea (11:59): Though it's not a big perf issue compared to the slow-as-molasses inputstream/tokenizer",
        "b25b6b77a0087ff8385941e5545d32ea (11:59): has to run now",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:10): b25b6b77a0087ff8385941e5545d32ea: I think html5lib guess about EOF in InFramesetPhase has a bug (or then I just don't know the codebase well enough)",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:12): b25b6b77a0087ff8385941e5545d32ea: specifically, I think it should do parse error plus switch to after frameset",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:19): the live tokenstream thingy doesn't work in safari"
    ],
    "person_ids": [
        "b8810fee2f4a71f849f3f7409546d1d9",
        "f47636673b14c54021a69dc06f6a19fb",
        "77db19c1dd94414f199e58aa6ca1827f",
        "139513027e8e90b5582cbc68fc733884",
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "b25b6b77a0087ff8385941e5545d32ea",
        "69b0d3dfe919a6b860a9fac82de52a7e"
    ]
}