{
    "id": "1b952ed8ac11c8fad25fccd4996e1ee2",
    "messages": [
        "139513027e8e90b5582cbc68fc733884 (03:23): this versioning essay is pretty long",
        "6ce98a4a7b6e097946960dcb1f2d404b (03:24): the chris wilson one? http://lists.w3.org/Archives/Public/public-html/2007Apr/0612.html ?",
        "139513027e8e90b5582cbc68fc733884 (03:24): yes",
        "6ce98a4a7b6e097946960dcb1f2d404b (03:24): i agree, i'm still halfway through it",
        "f139aba52f9fa1394b4034a7954b2220 (03:26): that essay is nonsese!  I just finished reading it",
        "139513027e8e90b5582cbc68fc733884 (03:26): finally got through it",
        "6ce98a4a7b6e097946960dcb1f2d404b (03:26): how would you summarize it, lachy?",
        "139513027e8e90b5582cbc68fc733884 (03:27): I'm not sure he actually answered my question that partially triggered it",
        "139513027e8e90b5582cbc68fc733884 (03:27): the answer is sort of implied, but I would like him to state it clearly",
        "f139aba52f9fa1394b4034a7954b2220 (03:27): 6ce98a4a7b6e097946960dcb1f2d404b, politely or honestly?",
        "6ce98a4a7b6e097946960dcb1f2d404b (03:27): honestly",
        "f139aba52f9fa1394b4034a7954b2220 (03:27): then his suggestions are BS!",
        "6ce98a4a7b6e097946960dcb1f2d404b (03:27): (this is logged, so beware..PM if you wish)",
        "6ce98a4a7b6e097946960dcb1f2d404b (03:27): oops, late",
        "f139aba52f9fa1394b4034a7954b2220 (03:28): like his suggestion for using &lt;!DOCTYPE html5&gt; won't work because that triggers quirks mode",
        "a924fb58d2c25874322f4e5126f608b9 (03:28): He suggests we version the spec, when what he really argues for is versioning pages to a IE version",
        "f139aba52f9fa1394b4034a7954b2220 (03:29): and his suggestion to upgrade that to &lt;!DOCTYPE html6&gt;, &lt;!DOCTYPE html7&gt; and into infinity totally misses the point of Don't Break the Web",
        "a924fb58d2c25874322f4e5126f608b9 (03:29): There have been several suggestions like &lt;meta ie-version-support=&quot;7&quot;&gt; already, which should suit his needs just fine",
        "f139aba52f9fa1394b4034a7954b2220 (03:29): a924fb58d2c25874322f4e5126f608b9, those suggestions are equally silly",
        "139513027e8e90b5582cbc68fc733884 (03:30): I can see how spec versioning would be convenient for his IE versioning plan, but that doesn't seem like a sufficient justification in itself for versioning",
        "a924fb58d2c25874322f4e5126f608b9 (03:30): But they at the very least attempt to solve the right problem",
        "139513027e8e90b5582cbc68fc733884 (03:30): I'll have to read the replies and think about it",
        "f139aba52f9fa1394b4034a7954b2220 (03:30): must we be doomed to repeat the mistakes of browser sniffing?",
        "f139aba52f9fa1394b4034a7954b2220 (03:31): his example of the child selector html&gt;body breaking the web when they implemented it is based on the fact that they fixed the filter, but failed to fix the significant limitations that relied on it",
        "f139aba52f9fa1394b4034a7954b2220 (03:31): the same applies to * html",
        "cc097e0d7183ae8436e7df709553c8c0 (03:35): f139aba52f9fa1394b4034a7954b2220: authors shouldn't rely on one bug in order to fix another, as it might break in browser upgrades. but they do. ms cannot fix all bugs at the same time. it is problematic but it's not a reason to introduce another rendering mode",
        "cc097e0d7183ae8436e7df709553c8c0 (03:35): the real problem is that microsoft stopped developing ie for a few years",
        "a924fb58d2c25874322f4e5126f608b9 (03:36): They're willing to ship bugs, but not fixes. A cruel process for us all.",
        "f139aba52f9fa1394b4034a7954b2220 (03:37): cc097e0d7183ae8436e7df709553c8c0, they didn't even fix all the major well documented limitations, which is the problem...",
        "cc097e0d7183ae8436e7df709553c8c0 (03:37): yeah",
        "39446a94055a1d99d64ee4c4112d92bf (03:38): a924fb58d2c25874322f4e5126f608b9:  &lt;meta ie-version-support=&quot;7&quot;&gt; does not solve the problem. This problem is not IE-centric. Mozilla, Opera and Safari have bugs. All of them have or will have a &quot;big bug&quot; that will break the web if corrected. They will have to define a similar mecanism for opt-in (they all have already done it one time with doctype switching, they will do many time more in the future).",
        "39446a94055a1d99d64ee4c4112d92bf (03:38): We shouldn't have a proprietary ie-specific mecanism",
        "a924fb58d2c25874322f4e5126f608b9 (03:38): 39446a94055a1d99d64ee4c4112d92bf: Mozilla, Opera, Safari have all demonstrated will to fix bugs",
        "f139aba52f9fa1394b4034a7954b2220 (03:38): they need to completely remove hasLayout from their standards mode, it's nonsense.  They need to fix the bugs that made use of: * html  { height: 1%; }, which they didn't (yet they fixed * html)",
        "cc097e0d7183ae8436e7df709553c8c0 (03:39): 39446a94055a1d99d64ee4c4112d92bf: the other browser vendors don't want to introduce new rendering modes",
        "39446a94055a1d99d64ee4c4112d92bf (03:40): cc097e0d7183ae8436e7df709553c8c0, what they will do if some correction breaks the web (and not only a dozen of pages) ?",
        "cc097e0d7183ae8436e7df709553c8c0 (03:40): 39446a94055a1d99d64ee4c4112d92bf: change the spec",
        "39446a94055a1d99d64ee4c4112d92bf (03:40): 1- leave that bug ; 2- break the web ; 3- require an opt-in mecanism",
        "f139aba52f9fa1394b4034a7954b2220 (03:40): I know you can't always rely on them fixing both bugs (the one that let the filter work and the limitation), but the major, well documented ones should have been fixed",
        "cc097e0d7183ae8436e7df709553c8c0 (03:40): 1",
        "39446a94055a1d99d64ee4c4112d92bf (03:40): cc097e0d7183ae8436e7df709553c8c0, well change the spec is possible if all have the same bugs",
        "39446a94055a1d99d64ee4c4112d92bf (03:41): cc097e0d7183ae8436e7df709553c8c0, if Mozilla has an Opera doesn't, change the spec will introduce the opposite bug in Opera",
        "cc097e0d7183ae8436e7df709553c8c0 (03:41): 39446a94055a1d99d64ee4c4112d92bf: that's what we're aiming for (if all agree on the same set of bugs, we have interop)",
        "cc097e0d7183ae8436e7df709553c8c0 (03:42): 39446a94055a1d99d64ee4c4112d92bf: content generally doesn't rely on things where all browsers disagree",
        "f139aba52f9fa1394b4034a7954b2220 (03:42): if one browser does one thing and another does the opposite, then we standardise that one that is most compatible with the web.",
        "39446a94055a1d99d64ee4c4112d92bf (03:42): cc097e0d7183ae8436e7df709553c8c0, you're saying that what will be in the future will correspond exactly to what they want (is to say they won't do bug withou willing it)",
        "a924fb58d2c25874322f4e5126f608b9 (03:42): The whole SGML business showed some browsers are willing to break for fixes, even when they have no benefit whatsoever",
        "139513027e8e90b5582cbc68fc733884 (03:42): 39446a94055a1d99d64ee4c4112d92bf: representatives from Mozilla, Opera and Apple have all said that we don't want a switch for opt-in to web-breaking standards",
        "a924fb58d2c25874322f4e5126f608b9 (03:42): *SGML comment",
        "139513027e8e90b5582cbc68fc733884 (03:43): 39446a94055a1d99d64ee4c4112d92bf: so I think you are out on a limb saying we will want such a mechanism in the future",
        "139513027e8e90b5582cbc68fc733884 (03:43): 39446a94055a1d99d64ee4c4112d92bf: our preference is to fix the spec if something it requires would BTW",
        "39446a94055a1d99d64ee4c4112d92bf (03:43): 139513027e8e90b5582cbc68fc733884, I understand that, but I don't see what they will do if they are in front of a &quot;oups, we did somehting incompatible and it's used by many authors&quot;",
        "a924fb58d2c25874322f4e5126f608b9 (03:44): It doesn't get that far",
        "cc097e0d7183ae8436e7df709553c8c0 (03:44): a924fb58d2c25874322f4e5126f608b9: the intended benefit was increased interop. although there was a different way to achieve interop we found out later",
        "139513027e8e90b5582cbc68fc733884 (03:44): 39446a94055a1d99d64ee4c4112d92bf: most sites basically have one mode for IE and another for Firefox+Opera+Safari",
        "a924fb58d2c25874322f4e5126f608b9 (03:44): Relevant intercompatabilities are noticed and reported",
        "139513027e8e90b5582cbc68fc733884 (03:44): 39446a94055a1d99d64ee4c4112d92bf: since we are already closer to each other, it's less likely for browser-specific bugs to get widely locked in",
        "39446a94055a1d99d64ee4c4112d92bf (03:44): you have faith in future, I don't ;)",
        "139513027e8e90b5582cbc68fc733884 (03:44): anyway, most of these web breakage issues come up for CSS and DOM",
        "139513027e8e90b5582cbc68fc733884 (03:45): using an HTML version to trigger CSS and DOM changes seems like bad layering",
        "cc097e0d7183ae8436e7df709553c8c0 (03:45): would like to get interop with ie on css and dom, even if that meant changing the css and dom specs",
        "39446a94055a1d99d64ee4c4112d92bf (03:45): I agree",
        "139513027e8e90b5582cbc68fc733884 (03:45): I have never heard an example of a site depending on a browser-specific *HTML* bug (as opposed to DOM, JS or CSS)",
        "a924fb58d2c25874322f4e5126f608b9 (03:46): Conditional comments ;)",
        "39446a94055a1d99d64ee4c4112d92bf (03:46): you may be right with this on",
        "cc097e0d7183ae8436e7df709553c8c0 (03:47): should study the differences between almost standards mode and full standards mode a bit more, then propose to the css wg to spec almost standards mode so full can be dropped",
        "139513027e8e90b5582cbc68fc733884 (03:47): not saying it hasn't happened, but it seems less common, and I think there are structural reasons why that is so",
        "139513027e8e90b5582cbc68fc733884 (03:48): cc097e0d7183ae8436e7df709553c8c0: I think it would probably be good to have almost standards mode be the standard model",
        "cc097e0d7183ae8436e7df709553c8c0 (03:48): indeed",
        "a924fb58d2c25874322f4e5126f608b9 (03:49): As long as quirks mode is the default, every new document will be quirks mode if the author doesn't take care...",
        "cc097e0d7183ae8436e7df709553c8c0 (03:49): a924fb58d2c25874322f4e5126f608b9: indeed. new documents will be produced that rely on quirks mode",
        "cc097e0d7183ae8436e7df709553c8c0 (03:50): today, i think 50% or so doesn't have a doctype at all, and 90% or so use quirks mode",
        "cc097e0d7183ae8436e7df709553c8c0 (03:51): the rest use almost standards mode with only very few using full standards mode",
        "cc097e0d7183ae8436e7df709553c8c0 (03:51): according to the studies i've seen anyway",
        "cc097e0d7183ae8436e7df709553c8c0 (03:52): perhaps css 2.1 should spec what is required for quirks mode too",
        "39446a94055a1d99d64ee4c4112d92bf (03:52): wen I think about it I'm just scared about having multiple proprietary versionning mecanisms which aim specific versions of specific browsers, having to explicitly opt-in a version for each browser, and in consequence to always aim a series of version/brower and never the spec. (I know, I'm pessimist, I had bad experiences with all CSS hacks, doctype switching and conditionnal comments)",
        "a924fb58d2c25874322f4e5126f608b9 (03:54): The future we're offering contains a single &lt;!DOCTYPE html&gt; and eternal bliss ;)",
        "cc097e0d7183ae8436e7df709553c8c0 (03:58): nn"
    ],
    "person_ids": [
        "139513027e8e90b5582cbc68fc733884",
        "6ce98a4a7b6e097946960dcb1f2d404b",
        "f139aba52f9fa1394b4034a7954b2220",
        "a924fb58d2c25874322f4e5126f608b9",
        "cc097e0d7183ae8436e7df709553c8c0",
        "39446a94055a1d99d64ee4c4112d92bf"
    ]
}