{
    "id": "1c8c2da9fc2c6a97820d4a94767c5b51",
    "messages": [
        "ab7faae5d7b250ea8606486575f8f79c (16:41): looks at some bits of BGP and sees that it's much more of a disgusting hack than he imagined",
        "ab7faae5d7b250ea8606486575f8f79c (16:42): When a network is advertising a route to another network, it can include a 32-bit number which is conventionally interpreted as two 16-bit numbers, where the first number is effectively a namespace (corresponding to the AS number of some network)",
        "a924fb58d2c25874322f4e5126f608b9 (16:43): f139aba52f9fa1394b4034a7954b2220: You have to smile more while dancing :)",
        "ab7faae5d7b250ea8606486575f8f79c (16:44): And then there's a giant database of routing information (150MB gzipped text) which includes 'remarks' sections saying things like 'if you send a route with community value 6730:1x130 (where x is 1, 2 or 3) then we'll add a weight of x onto your route before advertising it to France Telecom'",
        "ab7faae5d7b250ea8606486575f8f79c (16:44): (except not really as a sentence like that - there's a table with a few dozen of these values)",
        "ab7faae5d7b250ea8606486575f8f79c (16:45): I suppose it sort of works in practice, but it just really doesn't seem very nice at all",
        "a924fb58d2c25874322f4e5126f608b9 (16:45): That sounds like most of the internet",
        "ab7faae5d7b250ea8606486575f8f79c (16:47): That feature was seemingly designed to provide distributed extensibility, but I can imagine it would be prettier if they gave you more than 16 bits to store all your data in",
        "ab7faae5d7b250ea8606486575f8f79c (16:49): Aww, how cute, there's one in this database with a little ASCII-art box around their table and a comment saying &quot;Net at Once offer these communities to make the life of our peers and customers more joyful.&quot;",
        "f139aba52f9fa1394b4034a7954b2220 (16:49): a924fb58d2c25874322f4e5126f608b9, did you just watch that old video of me dancing?",
        "f139aba52f9fa1394b4034a7954b2220 (16:49): or did you see some more recent photos or something?",
        "a924fb58d2c25874322f4e5126f608b9 (16:49): f139aba52f9fa1394b4034a7954b2220: Lastweek posted it",
        "f139aba52f9fa1394b4034a7954b2220 (16:50): oh. Took him long enough to discover it.",
        "ab7faae5d7b250ea8606486575f8f79c (16:51): Maybe I didn't want to post all the photos and videos of WHATWG members all at once, and wanted to spread them over time",
        "a924fb58d2c25874322f4e5126f608b9 (16:51): How sneaky of not you",
        "f139aba52f9fa1394b4034a7954b2220 (16:54): LOL",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:58): f139aba52f9fa1394b4034a7954b2220: To ask a more pressing question: Why is there a video of you dancing online?",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:58): my innerHTML impl still crashes. sigh",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:01): Pfff. Writing code that crashes. I just write code that causes the interpreter I use to crash.",
        "f139aba52f9fa1394b4034a7954b2220 (17:03): a11aabeeceeae6b8cb5d12ea06b56554, the video was created for a presentation I did on the video element in June 2007 at WebJam.",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:03): used a video of a groundhog eating. much less exciting",
        "f139aba52f9fa1394b4034a7954b2220 (17:03): it's interesting that Mr Last Week linked to the video in this user's account http://www.youtube.com/user/fredbezies instead of my own.",
        "cc097e0d7183ae8436e7df709553c8c0 (17:13): http://simon.html5.org/dump/clickjack.html - i guess ClearClick doesn't work here?",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:15): woohoo! I pass cc097e0d7183ae8436e7df709553c8c0's tests at http://simon.html5.org/test/html/parsing/fragment/content-model-flag/",
        "ab7faae5d7b250ea8606486575f8f79c (17:18): cc097e0d7183ae8436e7df709553c8c0: I thought the idea was that ClearClick would take a screenshot of the page, in which the iframe is invisible in your example, and a screenshot of the iframe content, and compare them",
        "ab7faae5d7b250ea8606486575f8f79c (17:19): Oh, but your thing makes it not invisible, but I was only testing it in Opera where your example doesn't seem to work at all",
        "b25b6b77a0087ff8385941e5545d32ea (17:20): I think clearclick work in cc097e0d7183ae8436e7df709553c8c0's example",
        "ab7faae5d7b250ea8606486575f8f79c (17:20): Presumably ClearClick doesn't prevent you having iframes that are smaller than their content",
        "ab7faae5d7b250ea8606486575f8f79c (17:21): so it can only be comparing the pixels that are within the iframe box",
        "cc097e0d7183ae8436e7df709553c8c0 (17:21): ab7faae5d7b250ea8606486575f8f79c: opera seems to have a bug where it doesn't send mousemove events properly on the demo",
        "ab7faae5d7b250ea8606486575f8f79c (17:21): Oh, but your iframe is 500x600 pixels so I guess it'll be comparing all of those pixels",
        "cc097e0d7183ae8436e7df709553c8c0 (17:22): hmm i guess i could make the iframe smaller but the scrollbars would be overlapping the content",
        "cc097e0d7183ae8436e7df709553c8c0 (17:22): is there a way to hide the scrollbars?",
        "cc097e0d7183ae8436e7df709553c8c0 (17:22): scrolling=no?",
        "cc097e0d7183ae8436e7df709553c8c0 (17:25): hmm actually i can't make the iframe smaller because then the button wouldn't be clickable",
        "cc097e0d7183ae8436e7df709553c8c0 (17:26): or is it possible to scroll the contents of an iframe? maybe there's an id=&quot;&quot; somewhere",
        "ab7faae5d7b250ea8606486575f8f79c (17:26): Can you make the iframe suddenly pop into visibility just before it's been clicked?",
        "cc097e0d7183ae8436e7df709553c8c0 (17:27): maybe",
        "cc097e0d7183ae8436e7df709553c8c0 (17:39): #installTrigger47072 worked for vertical scrolling, maybe that's good enough and i can have a 500x1 pixels iframe following the mouse",
        "cc097e0d7183ae8436e7df709553c8c0 (17:39): oh actually",
        "cc097e0d7183ae8436e7df709553c8c0 (17:40): if i make the iframe smaller it will scroll horizontally, too",
        "cc097e0d7183ae8436e7df709553c8c0 (17:40): sweet",
        "cc097e0d7183ae8436e7df709553c8c0 (17:43): at least in opera",
        "cc097e0d7183ae8436e7df709553c8c0 (17:47): uploaded a new version where the iframe is 3x3 pixels",
        "cc097e0d7183ae8436e7df709553c8c0 (17:47): but it doesn't seem to scroll to the right place in firefox :(",
        "cc097e0d7183ae8436e7df709553c8c0 (17:48): works in opera and safari, at least",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:48): &quot;the president of Rockstar North stated that the Lost and Damned would have a third of the number of missions as Grand Theft Auto IV, placing its length at approximately 10-15 hours&quot;",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:48): Hmm, I completed GTA IV in around 12 hours",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:48): And a third of that is four hours",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:48): (completed insofar as the storyline)",
        "ab7faae5d7b250ea8606486575f8f79c (17:49): cc097e0d7183ae8436e7df709553c8c0: I don't think the Firefox extension installation is going to work so well in Opera",
        "cc097e0d7183ae8436e7df709553c8c0 (17:50): ab7faae5d7b250ea8606486575f8f79c: obviously not, that's not the point of the demo :)",
        "ab7faae5d7b250ea8606486575f8f79c (17:53): If you don't have scripting enabled, you could still cover the screen in hundreds of tiny iframes",
        "ab7faae5d7b250ea8606486575f8f79c (17:53): and the user's bound to click on it",
        "ab7faae5d7b250ea8606486575f8f79c (17:54): wonders if cc097e0d7183ae8436e7df709553c8c0 has NoScript installed so he can actually test whether it's blocked by ClearClick",
        "cc097e0d7183ae8436e7df709553c8c0 (17:54): ab7faae5d7b250ea8606486575f8f79c: i don't but b25b6b77a0087ff8385941e5545d32ea does :)",
        "cc097e0d7183ae8436e7df709553c8c0 (17:55): hmm firefox 3 scrolls to the right place, wonder why trunk didn't when i tested",
        "cc097e0d7183ae8436e7df709553c8c0 (17:58): clearclick still picks up my clickjack attempt :(",
        "cc097e0d7183ae8436e7df709553c8c0 (17:58): goes to drink beer instead",
        "edb259c0e0038f38bb200bc20c8cbf7e (18:08): wise choice"
    ],
    "person_ids": [
        "ab7faae5d7b250ea8606486575f8f79c",
        "a924fb58d2c25874322f4e5126f608b9",
        "f139aba52f9fa1394b4034a7954b2220",
        "a11aabeeceeae6b8cb5d12ea06b56554",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "cc097e0d7183ae8436e7df709553c8c0",
        "b25b6b77a0087ff8385941e5545d32ea",
        "edb259c0e0038f38bb200bc20c8cbf7e"
    ]
}