{
    "id": "20c1919f9c014d395ead60081dcff9fe",
    "messages": [
        "edb259c0e0038f38bb200bc20c8cbf7e (11:10): cc097e0d7183ae8436e7df709553c8c0, hmm, too late",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:11): b25b6b77a0087ff8385941e5545d32ea, pretty printing ain't working",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:12): b25b6b77a0087ff8385941e5545d32ea, euhm... it's not that urgent, because of pretty printing",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:12): b25b6b77a0087ff8385941e5545d32ea, I suppose I could write a post-processor, but that defeats the purpose",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:17): that's basically the advantages of the W3C private one, a DOCTYPE that works for W3C publications and &quot;pretty&quot; source code",
        "b25b6b77a0087ff8385941e5545d32ea (11:17): edb259c0e0038f38bb200bc20c8cbf7e: I can look at both problems. If it is blocking your work I guess I can even do it today",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:17): I suppose pretty printing I can fix to some extent by having more closing tags, although the serializer in place omits &lt;head&gt; and &lt;body&gt; which doesn't help",
        "b25b6b77a0087ff8385941e5545d32ea (11:18): (but don't write a post-processor, that makes no sense)",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:18): it's not blocking my work, as I said, I can use the W3C private one",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:18): ok",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:18): it's just that using anolis seems way cooler and it generates better IDs and all",
        "b25b6b77a0087ff8385941e5545d32ea (11:19): edb259c0e0038f38bb200bc20c8cbf7e: OK I will make it a priority to fix over the weekend or something",
        "cd4b22ed5d04ebb783a3fd8ab0a39490 (11:28): yo: editorial question r/e the spec for &lt;small&gt;:  &quot; &quot;legal restrictions, such as copyrights or other disadvantages&quot;. I suggest that &quot;caveats&quot; be substitued for &quot;copyright&quot; as a  copyright isn't necessarily a &quot;disadvantge&quot; (unless you're Richard Stallman)",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (11:29): cd4b22ed5d04ebb783a3fd8ab0a39490, I've just looked at your HTML5 element test page and the layout doesn't work in Firefox 2. Your blog layout is also rather b0rked. Shall I e-mail screenshots to you?",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:30): 42e76c77af424a4350ab0e3e3f6f2ce9, Firefox 2 is known not to work with HTML5 stuff",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:30): 42e76c77af424a4350ab0e3e3f6f2ce9, it has a bug they fixed in 3 :)",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (11:31): edb259c0e0038f38bb200bc20c8cbf7e, Bruce's tests are interested in browsers as old as IE6.",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:33): b25b6b77a0087ff8385941e5545d32ea, cool",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:34): 42e76c77af424a4350ab0e3e3f6f2ce9, but Firefox 2 does not have 20% market share",
        "b25b6b77a0087ff8385941e5545d32ea (11:34): 42e76c77af424a4350ab0e3e3f6f2ce9: Are you aware of http://www.gijsk.com/blog/2009/01/zeven-zonderlinge-zaken/",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (11:37): b25b6b77a0087ff8385941e5545d32ea, yes I declined it via e-mail.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (11:38): edb259c0e0038f38bb200bc20c8cbf7e, wow Firefox 2 is the source of only 3.7% of traffic to my own website.",
        "b25b6b77a0087ff8385941e5545d32ea (11:39): 42e76c77af424a4350ab0e3e3f6f2ce9: Ah, boring ;)",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:39): at my site it's 5% out of 50%",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (11:40): edb259c0e0038f38bb200bc20c8cbf7e, all versions of Opera add up to 5.5%, all Firefox add up to 44%, all IE 45%",
        "b25b6b77a0087ff8385941e5545d32ea (11:40): 42e76c77af424a4350ab0e3e3f6f2ce9: I am really not sure why you prefer FF2 to 3",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:40): IE is 23% on mine",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (11:40): b25b6b77a0087ff8385941e5545d32ea, I tried it for a week and found it really annoying.",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:41): guess that's still too much to remove the IE hacks I have in place",
        "b25b6b77a0087ff8385941e5545d32ea (11:43): 42e76c77af424a4350ab0e3e3f6f2ce9: That wasn't really an answer to the question :) What did you find annoying?",
        "b25b6b77a0087ff8385941e5545d32ea (11:43): is pretty interested in UI but very bad at designing it",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (11:43): b25b6b77a0087ff8385941e5545d32ea, it made me less efficient than I am in Firefox 2.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (11:44): b25b6b77a0087ff8385941e5545d32ea, there was so much hype about it's UI being an amazing leap forwards, yet it hardly seemed different at all when I used it. So I felt slightly let down by it, too.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (11:45): b25b6b77a0087ff8385941e5545d32ea, I've also seen many many reports from people for whom it is crashing a lot.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (11:45): b25b6b77a0087ff8385941e5545d32ea, Firefox 2 hasn't crashed for me in...erm...actually I can't remember when it last did. (Several months, probably.)",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (11:46): b25b6b77a0087ff8385941e5545d32ea, oh and I couldn't find a good XP-like theme for Fx3, despite there being a big fanfare about OS Integration for Fx3. Another source of disappointment.",
        "b25b6b77a0087ff8385941e5545d32ea (11:47): 42e76c77af424a4350ab0e3e3f6f2ce9: I can't imagine working without the kind of awesomebar thing in FF3, recent Opera, etc. (I can't comment on stability since I have nightly builds of every browser I run)",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (11:47): b25b6b77a0087ff8385941e5545d32ea, trying to upgrade my parents to Fx3 went badly, too: http://projectcerbera.com/blog/2008/12/fx2",
        "042dd99eb0ff8653814e445ca0093427 (11:52): 42e76c77af424a4350ab0e3e3f6f2ce9: all I can say is, your experiences are not typical",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (11:53): 042dd99eb0ff8653814e445ca0093427, I expect that's true. I still love Firefox 2, though. :)",
        "ab7faae5d7b250ea8606486575f8f79c (11:56): People should write software that automatically introduces new bugs at an exponential rate after the next version of the software has been released, to encourage people to upgrade",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (11:57): edb259c0e0038f38bb200bc20c8cbf7e, Safari is 3.2% of my website's traffic; nearly as much as Firefox 2. (These percentages are from the 135,072 hits I've had so far this month, as recorded by AWstats 6.7.)",
        "0c25ae3066f1b9f7890ceff405fdcab1 (11:58): 42e76c77af424a4350ab0e3e3f6f2ce9: of course there's a Firefox 2 theme for Firefox 3: https://addons.mozilla.org/en-US/firefox/addon/6898",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:59): 42e76c77af424a4350ab0e3e3f6f2ce9: Firefox 3 on XP looks quite XPish to me",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (12:00): 0c25ae3066f1b9f7890ceff405fdcab1, Firefox 2's default theme doesn't quite fit XP. The tabs are wrong, for starters. That's why I use Fx2 with Winestripe.",
        "0c25ae3066f1b9f7890ceff405fdcab1 (12:01): ah, winestripe, not winstripe. (sorry, not that aware of Firefox themes)",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (12:01): 0c25ae3066f1b9f7890ceff405fdcab1, thanks for trying though. :)",
        "0c25ae3066f1b9f7890ceff405fdcab1 (12:03): 42e76c77af424a4350ab0e3e3f6f2ce9: the most recent comment on the winestripe addons page points to http://webdesigns.ms11.net/winstripethemes.html as having the same for Firefox 3 (even though on that page it's called winstripe again?)",
        "0c25ae3066f1b9f7890ceff405fdcab1 (12:04): Ah, which points to https://addons.mozilla.org/en-US/firefox/addon/9172 which says &quot;this is the Firefox 3 version of Winestripe&quot;",
        "0c25ae3066f1b9f7890ceff405fdcab1 (12:04): man, what a mess. :)",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (12:05): 0c25ae3066f1b9f7890ceff405fdcab1, now that's more like it! &quot;Updated 9 December 2008&quot; explains why I haven't found it before.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (12:09): 042dd99eb0ff8653814e445ca0093427, a comment on that theme says: &quot;Thank you for this theme, i was using one on Firefox 2.x and wouldn't upgrade to 3.0 until i had this theme.&quot; :P",
        "ab7faae5d7b250ea8606486575f8f79c (12:11): 42e76c77af424a4350ab0e3e3f6f2ce9: Two people out of a hundred million does not make it a typical case :-p",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (12:12): ab7faae5d7b250ea8606486575f8f79c, I'm not saying it's commonplace, just pointing out it exists. Also, the description says: &quot;Without this theme, I can‚Äôt use Firefox 3. And I‚Äôm not alone in this case.&quot;",
        "ab7faae5d7b250ea8606486575f8f79c (12:12): Okay, so it's at least three people (you, the theme author, and the commenter)",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (12:13): ab7faae5d7b250ea8606486575f8f79c, 1,181 total downloads.",
        "0c25ae3066f1b9f7890ceff405fdcab1 (12:13): wants to bet there'll be at least 100 Firefox themes that people say similar things about.",
        "b25b6b77a0087ff8385941e5545d32ea (12:13): 42e76c77af424a4350ab0e3e3f6f2ce9: The problem is that when you change anything there wll always be some people who prefer the old way. The trick is to make more people prefer the new way",
        "0c25ae3066f1b9f7890ceff405fdcab1 (12:13): Right back to Orbit 3.1",
        "b25b6b77a0087ff8385941e5545d32ea (12:14): (for example people spend a lot of time maintaining SeaMonkey even though Firefox is vastly more popular)",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (12:15): b25b6b77a0087ff8385941e5545d32ea, what I am confused by is why a custom theme does a better job of following the OS look-and-feel on XP than the Fx3 default theme. Especially when &quot;OS Integration&quot; was promoted so heavily as a benefit of Fx3.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (12:16): 0c25ae3066f1b9f7890ceff405fdcab1, the difference here is the theme follows the operating system, which is what should be the case by default (imho). :)",
        "b25b6b77a0087ff8385941e5545d32ea (12:16): 42e76c77af424a4350ab0e3e3f6f2ce9: I doin't have access to XP so I couldn't say",
        "ab7faae5d7b250ea8606486575f8f79c (12:17): The FF3 XP theme doesn't really look non-XPish to me",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:19): uses all his OSs with the default theme and desktop picture",
        "ab7faae5d7b250ea8606486575f8f79c (12:20): uses Linux so he doesn't expect an entirely consistent look-and-feel anyway",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (12:23): b8810fee2f4a71f849f3f7409546d1d9, b25b6b77a0087ff8385941e5545d32ea &amp; ab7faae5d7b250ea8606486575f8f79c: one example is the standard style of the current tab on XP. They have a white background with a yellow bar across the top and black text in the normal weight. Yet Firefox hasn't used that style since Fx1.5 (iirc) and even then it had bold text.",
        "b25b6b77a0087ff8385941e5545d32ea (12:24): uses Gnome on Linux so he does expect a consistent Look &amp; Feel but is sometimes disappointed",
        "ab7faae5d7b250ea8606486575f8f79c (12:26): 42e76c77af424a4350ab0e3e3f6f2ce9: Do any applications actually use the standard tab style on XP?",
        "ab7faae5d7b250ea8606486575f8f79c (12:27): I assume IE doesn't, and I assume Office doesn't, and I assume Visual Studio doesn't, and I can't think of any other applications I might use that might have tabs",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (12:27): ab7faae5d7b250ea8606486575f8f79c, everything which uses standard controls and avoids breaking XP theming support does.",
        "ab7faae5d7b250ea8606486575f8f79c (12:28): 42e76c77af424a4350ab0e3e3f6f2ce9: That still doesn't answer the question of whether any applications do that :-p",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (12:28): lol :D",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (12:28): Tools &gt; Options in Windows Media Player 10, IE6 and IE7 does.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (12:29): control Panel stuff and propety sheets throughout the OS generally do, apart from in really old networking dialogs which break XP theming support so they look Windows 95-ish",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (12:30): Opera 9.63 does, although the tabs are taller than default and the difference in height between selected tab and normal tab is less than standard",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (12:30): Outlook Express 6 uses standard tabs throughout",
        "ab7faae5d7b250ea8606486575f8f79c (12:31): Okay, so maybe there's a few :-)",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (12:31): It's common enough to notice when it's been done wrong, let me put it that way. ;)",
        "ab7faae5d7b250ea8606486575f8f79c (12:36): doesn't entirely like how you have to mess around with comctl versioning manifest stuff when compiling Windows applications, in order to opt-in to the new XP themed widget stylings",
        "ab7faae5d7b250ea8606486575f8f79c (12:36): (though it does make sense in terms of not breaking compatibility with old applications that made unreasonable assumptions)",
        "edb259c0e0038f38bb200bc20c8cbf7e (12:39): cc097e0d7183ae8436e7df709553c8c0, was there any conclusion on the spellcheck debate on the WHATWG list?",
        "edb259c0e0038f38bb200bc20c8cbf7e (12:40): looks",
        "edb259c0e0038f38bb200bc20c8cbf7e (12:42): seems Maciej had some objections but other than that nothing much",
        "b25b6b77a0087ff8385941e5545d32ea (12:50): fwiw 042dd99eb0ff8653814e445ca0093427's points about spellchecking seemed more convincing to me",
        "edb259c0e0038f38bb200bc20c8cbf7e (12:56): yeah, spellcheck seems simple enough",
        "cc097e0d7183ae8436e7df709553c8c0 (13:01): http://software.hixie.ch/utilities/js/live-dom-viewer/?%3C!DOCTYPE%20html%3E%0A%3Cscript%3E%20%0Aonload%3Dfunction()%7B%0Ad%3Ddocument%2C%0Af%3Dd.createDocumentFragment()%3B%0Af.appendChild(d.createElement('a'))%3B%0Af.appendChild(d.createElement('b'))%3B%0Ad.removeChild(d.documentElement)%0Atry%7Bd.appendChild(f)%7Dcatch(e)%7Bw(e)%7D%0A%7D%0A%3C%2Fscript%3E",
        "cc097e0d7183ae8436e7df709553c8c0 (13:02): webkit inserts the elements happily",
        "cc097e0d7183ae8436e7df709553c8c0 (13:03): hmm",
        "cc097e0d7183ae8436e7df709553c8c0 (13:04): it seems the viewer doesn't like empty documents",
        "cc097e0d7183ae8436e7df709553c8c0 (13:05): Hixie: could you add a check here in live dom viewer?",
        "cc097e0d7183ae8436e7df709553c8c0 (13:05): pre.appendChild(document.createTextNode(iframe.contentWindow.document.documentElement.innerHTML));",
        "cc097e0d7183ae8436e7df709553c8c0 (13:16): http://tinyurl.com/8ujdbn - IE8, log: abbr: [object HTMLPhraseElement]",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:18): why do .constructor? makes it fail in Opera",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:18): hmm, in Opera both &lt;a&gt; and &lt;area&gt; stringify",
        "cc097e0d7183ae8436e7df709553c8c0 (13:18): because &lt;a&gt; stringified to &quot;&quot;",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:19): wonders if HTML5 reflects that",
        "cc097e0d7183ae8436e7df709553c8c0 (13:19): ie8 and firefox do that too",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:19): found a bug in HTML5 then",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:19): it only does it for &lt;a&gt;",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:20): you want to report it?",
        "cc097e0d7183ae8436e7df709553c8c0 (13:20): yeah i can do it",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:20): the IDL bit is called [Stringifies=href]",
        "cc097e0d7183ae8436e7df709553c8c0 (13:38): Hixie: we're having requests from google to be able to use div as default block instead of p in contenteditable",
        "cc097e0d7183ae8436e7df709553c8c0 (13:39): Hixie: could an execCommand be added to control this?"
    ],
    "person_ids": [
        "edb259c0e0038f38bb200bc20c8cbf7e",
        "b25b6b77a0087ff8385941e5545d32ea",
        "cd4b22ed5d04ebb783a3fd8ab0a39490",
        "42e76c77af424a4350ab0e3e3f6f2ce9",
        "042dd99eb0ff8653814e445ca0093427",
        "ab7faae5d7b250ea8606486575f8f79c",
        "0c25ae3066f1b9f7890ceff405fdcab1",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "cc097e0d7183ae8436e7df709553c8c0"
    ]
}