{
    "id": "20d553b2821dad389aeb931a96dc572b",
    "messages": [
        "762125e16368a04ee4cba81538224e86 (01:41): What does this in general mean? Extract the web.xml file (from the .war, located at pentaho.war/WEB-INF/web.xml)",
        "762125e16368a04ee4cba81538224e86 (01:41): I just have the web.xml in a directory.....",
        "762125e16368a04ee4cba81538224e86 (01:41): at first I had to create a .war file... Now it's asking me to 'open' it and change a web.xml?",
        "762125e16368a04ee4cba81538224e86 (01:42): also.. where can I read what war files are... I am 100%newbie...",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (01:45): Ries: What I've heard from others is that Pentaho is too broken to deploy and use right now.. the implementation and documentation are confusing.  I haven't tried it myself (yet), but I wouldn't be surprised.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (01:46): Ries: From the look of their web pages, and the look of the JFree web site, it appears they're doing massive consolidation and refactoring right now, so I'd be surprised if what you download there is useable at the moment.",
        "92a2971947f98559b55851639c206ff3 (01:48): Issues with JFreeChart?",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (01:51): Well, not JFreeChart exactly..  JFreeReport.. it's becoming part of Pentaho.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (01:51): And, right now I think Pentaho is a mess.",
        "92a2971947f98559b55851639c206ff3 (01:51): For what reason?",
        "92a2971947f98559b55851639c206ff3 (01:52): Only view I have of it was helping yassine with the JNDI stuff.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (01:53): <a href=\"http://www.pentaho.org/index.php?option=com_content&amp;task=view&amp;id=124&amp;Itemid=238\">http://www.pentaho.org/index.php?option=com_content&amp;task=view&amp;id=124&amp;Itemid=238</a>",
        "762125e16368a04ee4cba81538224e86 (01:53): jasonb: me comming from a PHP world.... hehehehe this is confusing all...",
        "762125e16368a04ee4cba81538224e86 (01:56): jbalint: yassin is helping me to ;)",
        "762125e16368a04ee4cba81538224e86 (01:56): he is a guru...",
        "762125e16368a04ee4cba81538224e86 (01:56): But I can tell you.... putting something to work on tomcat for a newbie.... is not easy... I hoep I will learn and master it.... well, for 10% it would be nice",
        "92a2971947f98559b55851639c206ff3 (01:56): hehe, yes it is alot. Do you already program Java?",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (01:57): Ries: You just need good docs, and then it's easy.",
        "762125e16368a04ee4cba81538224e86 (01:57): jbalint: I made a couple of java applets like 8 years ago",
        "762125e16368a04ee4cba81538224e86 (01:57): jb might be 6 or 7 to... can't remember....",
        "b6f1fcd73f30aeff93ca1c52043e7771 (01:58): re",
        "762125e16368a04ee4cba81538224e86 (01:58): jasonb: in your humble opinion... They always say 'java is slow'... still I can't believe that really... how does it compare to php? I know it's apples and pears.... but",
        "762125e16368a04ee4cba81538224e86 (01:58): hey yassine!!! dude",
        "762125e16368a04ee4cba81538224e86 (01:58): buddy",
        "b6f1fcd73f30aeff93ca1c52043e7771 (01:58): heya Ries",
        "762125e16368a04ee4cba81538224e86 (01:58): My german friend :D",
        "b6f1fcd73f30aeff93ca1c52043e7771 (01:58): okay lets go strait the stuff",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (01:58): Ries: Java/JSP/Tomcat is slightly faster than PHP/Apache",
        "b6f1fcd73f30aeff93ca1c52043e7771 (01:59): :)",
        "762125e16368a04ee4cba81538224e86 (01:59): hehehe yassine... i think you know why I ask ;)",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (01:59): Ries: The people who say Java is slow are the people who stand to gain the most from Java being slow, and from people beginning to believe that Java is slow.",
        "762125e16368a04ee4cba81538224e86 (01:59): I thought so already....",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:00): Ries: But, there have been some pretty fair benchmark tests that found PHP/Apache to be slightly slower than Tomcat/JSP/Java.. and Tomcat/Java (no JSP).",
        "762125e16368a04ee4cba81538224e86 (02:01): jasonb: is that php with otu without a accelerator?",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:01): Ries: It ends up being very hard to compare them fairly since both sets of technologies are broad, with lots of features each, and since the features don't exactly correspond, it is hard to write a fair test for each feature you wish to compare, and if you don't compare them all then you don't have the full picture.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:02): Ries: It was with an accelerator.. but as usual the details are somewhat sketchy.  I wish someone would put together a team dedicated to getting to the bottom of this question in as fair and open a manner as possible.",
        "92a2971947f98559b55851639c206ff3 (02:03): Well it would probably have to be the exact same app written on both platforms.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:03): Ries: It really comes down to a couple of main things: which web server is faster, Apache or Tomcat?  Which web scripting language is faster, PHP or JSP?  But, each of those isn't one big feature to compare, it's a large set of features to compare.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:04): jbalint: Yes, but it's worse than that since no single webapp can be called &quot;average&quot;, nor representitive of what each of us is trying to write.",
        "b6f1fcd73f30aeff93ca1c52043e7771 (02:04): heya jbalint jasonb  :) how is everything ?",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:04): jbalint: So, instead, you have to benchmark zillions of individual features.. and on like 5 different operating systems each..",
        "92a2971947f98559b55851639c206ff3 (02:05): Yep. :) I don't really even consider things as whether raw PHP is faster than Java or JSP or Tomcat. I just think Javais best and capable so I use it and get it to do what I need.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:05): yassine: Hi yassine.  Things are good, just been unusually busy.",
        "2549196a6dfadb6089151e0780c9c854 (02:05): not to mention different jvms ;)",
        "92a2971947f98559b55851639c206ff3 (02:05): hey yassine",
        "92a2971947f98559b55851639c206ff3 (02:05): wltjr: Nobody uses different JVMs! :p",
        "92a2971947f98559b55851639c206ff3 (02:05): Sun is the one to rule them all.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:05): wltjr: That's for sure!  Like JRockit or Excelsior JET for example!",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:06): jbalint: Nah..  that's not true.  There are some JVMs out there that do a better job of some things than Sun's JVM, and people do use them.",
        "2549196a6dfadb6089151e0780c9c854 (02:06): jbalint:  we do  one gentoo :)",
        "762125e16368a04ee4cba81538224e86 (02:06): jasonb: thnk you for your opinion.... I fully agree.... a hello world, would not be a good thing to compare...",
        "2549196a6dfadb6089151e0780c9c854 (02:06): jbalint:  sun also does not have to much love for linux+amd64, no 1.4 jdk, and 1.5 is only a server vm, crappy performance with like netbeans and etc",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:07): Also, different traffic loads would need to be tested.. so it's a multi-dimensional graph for each feature that would need to be compared.",
        "92a2971947f98559b55851639c206ff3 (02:07): bbl - phone",
        "2549196a6dfadb6089151e0780c9c854 (02:07): heck Sun does not even have a booth at LWE SF next week :( only open solaris",
        "2549196a6dfadb6089151e0780c9c854 (02:08): jasonb: sure and not sure about php, but java apps can thread :)",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:08): Sun is still learning their lesson over Linux.",
        "2549196a6dfadb6089151e0780c9c854 (02:08): Sun needs to revive Cobalt",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:08): wltjr: PHP is also multithreaded, but how well it does that has a lot to do with which Apache version you run it through.",
        "2549196a6dfadb6089151e0780c9c854 (02:08): that was a great company, and good products, and Sun ate them and spit very little out",
        "2549196a6dfadb6089151e0780c9c854 (02:09): jasonb: I know php as a hole, but like a servlet can be single threaded or not, not sure about php stuff?",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:09): wltjr: I find it funny that most PHP developers use Apache 1.3, which only has a multi-process model, not a multi-thread model.",
        "2549196a6dfadb6089151e0780c9c854 (02:09): I see little to no purpose to run 1.3",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:09): wltjr: I believe new versions of PHP can run threaded code.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:09): wltjr: well, lots of PHP developers use 1.3 because for a long time PHP did not support Apache 2.0 or higher.",
        "2549196a6dfadb6089151e0780c9c854 (02:10): interesting, I don't know to much about it in modern days, I looked into it heavily a long time ago when I left ASP, but it was Java for me ;)",
        "762125e16368a04ee4cba81538224e86 (02:10): I think that apache itslef always say, stick to 1.4 because 2.0 is not stable....",
        "2549196a6dfadb6089151e0780c9c854 (02:10): jasonb: I will have to get with you over the weekend or first part of next week on your schedule, as I will be out your way",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:11): People who I know who used PHP for a significant amount of time ended up dropping it for Java/JSP/servlets eventually in most cases, saying that the PHP language itself was really shaky and not what it needed to be.  Plus, Java is a much more full featured programming language, and is the most widely used professional programming language today.",
        "2549196a6dfadb6089151e0780c9c854 (02:11): I have never known 2.0.x to not be stable, it's always been rock solid for me, just as much as 1.3.x, but I still have not dived into the workers part  very deep",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:12): wltjr: You're going to be in the SF bay area?",
        "2549196a6dfadb6089151e0780c9c854 (02:12): I know a few C people that prefer PHP, they have varying opinions of Java ;)",
        "2549196a6dfadb6089151e0780c9c854 (02:12): jasonb: yes, LWE :)",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:13): wltjr: Ahh.  I'm going to be busy next week, all except for Friday.  I don't know about this weekend though.  I might have some time.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:13): wltjr: When do you fly home?",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:13): wltjr: BTW: Lyken is out here now too.  :)",
        "2549196a6dfadb6089151e0780c9c854 (02:14): cool, I will be around",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:14): wltjr: Developers who like coding in C have a major stylistic conflict with anything orderly like Java, so I don't expect them to like it.",
        "2549196a6dfadb6089151e0780c9c854 (02:14): not sure who Lyken is? TC dev?",
        "51f7ed43858cd2419f1b5359a7763eb9 (02:15): &quot;'lo&quot; btw :)",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:16): hi swente.  :)",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:17): Well, when people do surveys to find out what languages businesses are using to develop their products, that's what I try to see.  That does include lots of OSS since lots of OSS does start out or end up in a company.",
        "51f7ed43858cd2419f1b5359a7763eb9 (02:17): hm. i've the strange feeling that especially in OSS area many people are paranoid against java",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:18): Lots of people are.. for no good reason.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:18): But, that hasn't stopped zillions of OSS Java projects from springing up all over.",
        "51f7ed43858cd2419f1b5359a7763eb9 (02:18): mmh &quot;opinions&quot; and &quot;reasons&quot; oftenly heavily differ :)",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:18): It could be more, but..",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:19): Eventually there will be a completely OSS (and good) JVM, so then I wonder what OSS folks will think of Java at that point.",
        "51f7ed43858cd2419f1b5359a7763eb9 (02:19): i wonder how things will evolve when|if SUN gives java free &quot;totally&quot;",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:20): That will happen eventually.  I just wonder if someone else won't donate their clean-room JVM before that happens.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:20): I was hoping for Excelsior JET, but they just licensed Java from Sun so I think it's not a clean-room impl anymore.  :(",
        "51f7ed43858cd2419f1b5359a7763eb9 (02:21): (i personally do not really worry about this *that* much. if java had been opensource, i assume m$ would have taken over.. i'm not sure how the process agains M$ and java had ended when java had not been that close to sun)",
        "51f7ed43858cd2419f1b5359a7763eb9 (02:21): much fanatism in OSS, although hardly anyone insists on using opensource hardware *g*",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:24): Open source hardware is a failed concept as far as I can tell.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:24): Open source software, though, isn't.",
        "51f7ed43858cd2419f1b5359a7763eb9 (02:25): well, you're probably [obviously?] right. (at least as long as we can't produce chips in a microwave)",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:25): heh",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (02:26): We can... nachos.",
        "51f7ed43858cd2419f1b5359a7763eb9 (02:26): 45nm-nachos? :)"
    ],
    "person_ids": [
        "762125e16368a04ee4cba81538224e86",
        "2a78e4ddb897d821d45a3ba9ce2078d5",
        "92a2971947f98559b55851639c206ff3",
        "b6f1fcd73f30aeff93ca1c52043e7771",
        "2549196a6dfadb6089151e0780c9c854",
        "51f7ed43858cd2419f1b5359a7763eb9"
    ]
}