{
    "id": "235b65ed9cb82bcce0cd03fd1140f6d2",
    "messages": [
        "65325d50b2e25aca54bc871b89758c9c (23:21): are any of the people who commented on the link relation thread planning to write up a proposal of the wiki-based approach?  88d4d34a8064a4ff39fd5e144eea7762? fd9ef1223e855714294498ebfde79f98? 1f8387eb43f131d7c309a90a4e36b5cb?) I haven't seen a volunteer yet and if no one does it then the IANA approach will win by default, which would be unfortunate given the number of people advocating the microformats wiki instead",
        "1f8387eb43f131d7c309a90a4e36b5cb (23:21): 65325d50b2e25aca54bc871b89758c9c: What's the deadline?",
        "65325d50b2e25aca54bc871b89758c9c (23:21): October 27",
        "1f8387eb43f131d7c309a90a4e36b5cb (23:21): Yeah, I'll do it if no one else picks it up.",
        "fd9ef1223e855714294498ebfde79f98 (23:26): I'll help with it, but I don't want to drive. :)",
        "fd9ef1223e855714294498ebfde79f98 (23:27): tantek would be a good person to have help on that",
        "1f8387eb43f131d7c309a90a4e36b5cb (23:29): Yeah, that's what I was thinking too.",
        "33ad25ed5e7950dce85e69b1a4fa8a20 (23:44): okay, guys, WTF",
        "33ad25ed5e7950dce85e69b1a4fa8a20 (23:44): why does executeSql work async?",
        "33ad25ed5e7950dce85e69b1a4fa8a20 (23:44): is the fact the transaction callback is run asynchronously already not enough?",
        "33ad25ed5e7950dce85e69b1a4fa8a20 (23:45): I'm surprised that ResultSets can be accessed without involving callbacks somewhere",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:55): 33ad25ed5e7950dce85e69b1a4fa8a20: anything that might take more than zero time is async, otherwise the browser might lock up while the call is happening",
        "33ad25ed5e7950dce85e69b1a4fa8a20 (23:56): 69b0d3dfe919a6b860a9fac82de52a7e: then to be honest rows.length should also be async, as as the spec notes it might be expensive",
        "e1b6d0b431cf5281f54819dfc2735b42 (23:56): hi 69b0d3dfe919a6b860a9fac82de52a7e",
        "33ad25ed5e7950dce85e69b1a4fa8a20 (23:56): besides, there are already *Sync() variants, so the lockup is still possible",
        "e1b6d0b431cf5281f54819dfc2735b42 (23:56): 69b0d3dfe919a6b860a9fac82de52a7e, did you get back to anyone on that missing PUT/DELETE thing?",
        "33ad25ed5e7950dce85e69b1a4fa8a20 (23:57): 69b0d3dfe919a6b860a9fac82de52a7e: and unrelated to async, I still think that the whole changeVersion() interface is horribly broken",
        "33ad25ed5e7950dce85e69b1a4fa8a20 (23:57): why does it not pass in the current DB version?",
        "33ad25ed5e7950dce85e69b1a4fa8a20 (23:57): you have no way to enumerate DBs, and no way to learn the current version",
        "33ad25ed5e7950dce85e69b1a4fa8a20 (23:58): so you have to try each possible combination of versions until one works",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:00): 33ad25ed5e7950dce85e69b1a4fa8a20: yeah, the .rows being sync and the changeVersion() API sucking are known bugs. That spec is dead though so I doubt anything will happen to fix those problems.",
        "33ad25ed5e7950dce85e69b1a4fa8a20 (00:01): *sigh*",
        "33ad25ed5e7950dce85e69b1a4fa8a20 (00:03): 69b0d3dfe919a6b860a9fac82de52a7e: so we have WebSQL, which is a huge pain to use, and broken in many places, and will never be supported by Mozilla, and IndexedDB, which is similarly broken but doesn't give a useful query language",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:03): For the broken parts, comment on it!",
        "33ad25ed5e7950dce85e69b1a4fa8a20 (00:03): proposed specs should not have glaring bugs apparent on the first reading ever :(",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:03): it = IndexedDB.",
        "33ad25ed5e7950dce85e69b1a4fa8a20 (00:03): 1f8387eb43f131d7c309a90a4e36b5cb: the draft at W3C doesn't have a nice comment box like the whatwg documents do",
        "33ad25ed5e7950dce85e69b1a4fa8a20 (00:03): but in a nutshell, it's race conditions waiting to happen",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:04): No, but it has a mailing list.",
        "33ad25ed5e7950dce85e69b1a4fa8a20 (00:04): &quot;Every method for making asynchronous requests returns an IDBRequest object that communicates back to the requesting application through events.&quot; &lt;-- here be race conditions",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:05): 33ad25ed5e7950dce85e69b1a4fa8a20: yes. Not much I can do about either though. If you want Web SQL DB resurrected, convince Mozilla and Microsoft to implement it (I'll spec the SQL profile if necessary). If you want IndexedDB to not suck, send comments on it, it's a work in progress.",
        "33ad25ed5e7950dce85e69b1a4fa8a20 (00:05): http://www.w3.org/TR/IndexedDB/#idl-def-IDBRequest &lt;-- No method for providing error handlers upon creation, and no method to read if it's finished with an error or not",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:05): IRC is not a good place to send feedback",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:05): 33ad25ed5e7950dce85e69b1a4fa8a20: I'm not an editor of that spec, nor is 69b0d3dfe919a6b860a9fac82de52a7e.  Email the list.",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:05): it's especially not a good place for IndexedDB since none of the IndexedDB editors are here :-)",
        "33ad25ed5e7950dce85e69b1a4fa8a20 (00:07): yeah, I'm just being disheartened by the piles of brokenness I encounter every time I try to use the newer APIs",
        "b25b6b77a0087ff8385941e5545d32ea (00:23): http://reprog.wordpress.com/2010/09/05/bibliographic-data-part-3-has-anyone-anywhere-ever-read-the-whole-of-the-rda-specification/ Never let anyone tell you that HTML5 is too long, ever again",
        "4c681049601b3c374f1d2c0077c99049 (00:25): oh my.",
        "1f58faf0d058f303f30239a369808167 (00:25): &quot;As best I can tell, the current total is about 1640 pages ‚Äî so if you printed it out on standard 80 gsm paper, it would be 17 cm thick (nearly 7 inches) and weigh something over 8 kg (18 pounds).&quot;",
        "1f58faf0d058f303f30239a369808167 (00:26): it is still less than the changelog of Irak article on wikipedia ;) http://booktwo.org/notebook/wikipedia-historiography/",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:26): Is there really no way to tell Bugzilla not to notify everyone when you make mass changes like renaming a component?",
        "b25b6b77a0087ff8385941e5545d32ea (00:27): Well it is a bit unfair to compare full history against a single snapshot",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:28): complete.html is about 500-600 pages, but that doesn't include things like SVG, CSS, MathML, HTTP, etc, which really should be part of the same spec IMHO, if we're going to spec The Platform",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:29): what are the 1640 pages speccing?",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:29): the blog post wasn't clear about that",
        "b25b6b77a0087ff8385941e5545d32ea (00:29): http://www.rdatoolkit.org/home",
        "1f58faf0d058f303f30239a369808167 (00:30): http://www.rdatoolkit.org/constituencyreview",
        "1f58faf0d058f303f30239a369808167 (00:32): from what I can see it is also using a large font. This kind of stats would be better counting words more than pages. Still it is a lot",
        "1f58faf0d058f303f30239a369808167 (00:32): they use extensive prose to describe each feature",
        "1f58faf0d058f303f30239a369808167 (00:33): example: 2.3.1.1",
        "1f58faf0d058f303f30239a369808167 (00:33): A title is a word, phrase, character, or group of characters that",
        "1f58faf0d058f303f30239a369808167 (00:33): names a resource or a work contained in it.",
        "1f58faf0d058f303f30239a369808167 (00:33): More than one title may appear in the resource itself (e.g., on a title page, title frame, etc.; as a caption title, running title, etc.; on a cover, spine, etc.; on a title bar, etc.), on a jacket, sleeve, container, etc., or in material accompanying the resource.",
        "1f58faf0d058f303f30239a369808167 (00:34): they have also a *lot* of examples"
    ],
    "person_ids": [
        "65325d50b2e25aca54bc871b89758c9c",
        "1f8387eb43f131d7c309a90a4e36b5cb",
        "fd9ef1223e855714294498ebfde79f98",
        "33ad25ed5e7950dce85e69b1a4fa8a20",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "e1b6d0b431cf5281f54819dfc2735b42",
        "b25b6b77a0087ff8385941e5545d32ea",
        "4c681049601b3c374f1d2c0077c99049",
        "1f58faf0d058f303f30239a369808167",
        "88d4d34a8064a4ff39fd5e144eea7762"
    ]
}