{
    "id": "2488cbf69c4aa2185960598f4575c3c9",
    "messages": [
        "a480104b0e570389c6f4284a88c7cd9d (21:55): I'm thinking of posting the following to public-html later today, if anybody wishes to provide feedback before I post, I'd appreciate it: http://intertwingly.net/tmp/html5.txt",
        "edb259c0e0038f38bb200bc20c8cbf7e (21:58): nit: it has changed from FPWD to &quot;just&quot; WD",
        "a480104b0e570389c6f4284a88c7cd9d (21:59): I think the two occurrences of FPWD in that text are correct as is.",
        "edb259c0e0038f38bb200bc20c8cbf7e (21:59): s/and summary/and @summary/",
        "edb259c0e0038f38bb200bc20c8cbf7e (22:00): yes, but the statement that follows is not quite correct",
        "a480104b0e570389c6f4284a88c7cd9d (22:00): the status of &quot;meeting the criteria for FPWD&quot; is likely to change?  I don't think so...  :-)",
        "a480104b0e570389c6f4284a88c7cd9d (22:01): @summary: thanks!",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (22:01): a480104b0e570389c6f4284a88c7cd9d: Huh?",
        "edb259c0e0038f38bb200bc20c8cbf7e (22:01): a480104b0e570389c6f4284a88c7cd9d, &quot;This status is not likely to change.&quot; (it has)",
        "edb259c0e0038f38bb200bc20c8cbf7e (22:02): (also, it's not backed up why it's not likely to change given that later on you say you think it will...)",
        "edb259c0e0038f38bb200bc20c8cbf7e (22:03): as for FOs, I personally think it would be more useful if people raised those kind of comments now rather than at Last Call",
        "edb259c0e0038f38bb200bc20c8cbf7e (22:03): ideally we'd go to LC without FOs",
        "a480104b0e570389c6f4284a88c7cd9d (22:05): &quot;you say you think it will&quot;...  where did I say that?",
        "a480104b0e570389c6f4284a88c7cd9d (22:06): as to FO's, I'm encouraging then &quot;at this time&quot;, i.e. now... i.e., not waiting to LC.",
        "edb259c0e0038f38bb200bc20c8cbf7e (22:06): a480104b0e570389c6f4284a88c7cd9d, you said you expect going to LC is feasible, but maybe I misunderstood",
        "a480104b0e570389c6f4284a88c7cd9d (22:06): but I'll change that to &quot;well before Last Call&quot;",
        "edb259c0e0038f38bb200bc20c8cbf7e (22:07): a480104b0e570389c6f4284a88c7cd9d, due to &quot;preparing&quot; that wasn't clear to me",
        "a480104b0e570389c6f4284a88c7cd9d (22:07): how does this sound: &quot;Those that feel otherwise would be served by raising issues[1] and raising Formal Objections well before Last Call.&quot;",
        "edb259c0e0038f38bb200bc20c8cbf7e (22:07): (the other point was really just a nit; FPWD != WD and we have published the latter)",
        "edb259c0e0038f38bb200bc20c8cbf7e (22:08): good",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:08): a480104b0e570389c6f4284a88c7cd9d: last time you asked for FOs, you got them",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:08): a480104b0e570389c6f4284a88c7cd9d: it might be better not to suggest that people send FOs",
        "a480104b0e570389c6f4284a88c7cd9d (22:09): my feeling is that we are going to get them, and I'd rather get then in June than in October.",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:11): a480104b0e570389c6f4284a88c7cd9d: I'd rather encourage people to be proactive in their comment without mentioning FO",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:12): a480104b0e570389c6f4284a88c7cd9d: I'm pretty sure I wouldn't have sent a FO earlier if your wording hadn't made it seem that you were looking for FOs",
        "a480104b0e570389c6f4284a88c7cd9d (22:12): refresh my memory, which FO are you referring to?",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:12): a480104b0e570389c6f4284a88c7cd9d: the one about normative aspects of H:TML",
        "a480104b0e570389c6f4284a88c7cd9d (22:14): I actually prefer it when people state their objections clearly and unambiguously, as you did.",
        "a480104b0e570389c6f4284a88c7cd9d (22:17): ... but I've dropped it for now, and think I've addressed all of edb259c0e0038f38bb200bc20c8cbf7e's comments.  Refresh and tell me if either of you think others.",
        "edb259c0e0038f38bb200bc20c8cbf7e (22:19): seems fine",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:20): a480104b0e570389c6f4284a88c7cd9d: seems ok for the substance, though I'd prefer a different substance, one that didn't encourage a lot of drafts but focus on feedback on the existing deliverable",
        "a480104b0e570389c6f4284a88c7cd9d (22:21): People have provided feedback on @profile and @summary.  What would you suggest that they do differently?",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:22): a480104b0e570389c6f4284a88c7cd9d: I think we should allow for an outcome that those attributes don't end up as valid",
        "a480104b0e570389c6f4284a88c7cd9d (22:22): I don't believe I said otherwise",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:23): ok, I suppose a concrete proposal makes sense for those two if anyone still wants to push them",
        "a480104b0e570389c6f4284a88c7cd9d (22:25): I'm not limiting it to those two; the approach should be applicable in all cases where people have provided feedback to Ian and aren't happy with the results that Ian produced.",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:26): in that case, &quot;the documents they produce will also be so recognized",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:27): &quot; may promise too much",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:27): people who step up and make concrete proposals shouldn't have too high hopes of what mere recognition means",
        "a480104b0e570389c6f4284a88c7cd9d (22:27): I think that's safe... what I said was that if the meet the criteria for being a WG WD...",
        "a480104b0e570389c6f4284a88c7cd9d (22:29): s/if the/if they/"
    ],
    "person_ids": [
        "a480104b0e570389c6f4284a88c7cd9d",
        "edb259c0e0038f38bb200bc20c8cbf7e",
        "0a39f78bcb297ab0ebe8a29c28bfed89",
        "b8810fee2f4a71f849f3f7409546d1d9"
    ]
}