{
    "id": "251f9c841fd00b07fad9c951d710a88d",
    "messages": [
        "06cb330920ae58e1614c9145d983b3d6 (18:06): what the",
        "06cb330920ae58e1614c9145d983b3d6 (18:06): apparently checking out the webkit source gives you ... webkit.org? thanks, I guess... :)",
        "171db427cee236fc04af9e5de94e7c39 (18:11): ?_?",
        "d3c9ec5d23498bc66cc43bac6408ab4d (18:15): The source of webkit.org is on svn, he's probably poining that out",
        "d3c9ec5d23498bc66cc43bac6408ab4d (18:15): (the site)",
        "d3c9ec5d23498bc66cc43bac6408ab4d (18:15): as are bugs. and planet.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:19): 7f9405da4034bf43083e64b57302a8e6, just because openness and standards work for the web doesn't mean they're needed everywhere.  I tend to broadly agree with Eric S. Raymond's analysis of open-source software, where he suggests that closed-source software will always work better in some markets.  The same logic applies to open standards.",
        "7f9405da4034bf43083e64b57302a8e6 (18:20): 88d4d34a8064a4ff39fd5e144eea7762, please elaborate. don't work ‚Äúclosed‚Äù products better even with open standards?",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:21): Well, if interoperability is useful, yes.  What do games need to interoperate on?",
        "7f9405da4034bf43083e64b57302a8e6 (18:21): There may be more people than h4kon advocating open standards while being perfectly fine with closed software.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:21): A typical high-end game is a standalone product that interacts with no other program (beyond the OS) and is basically obsolete in two years.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:22): What exactly is there to standardize?",
        "7f9405da4034bf43083e64b57302a8e6 (18:22): Special clients? I always hated it when strategy games did not give me the ability to write my own macros.",
        "7f9405da4034bf43083e64b57302a8e6 (18:23): (The only one that included it was Earth2150 in 1999, but the current rights holder is opposed to releasing the source code.)",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:23): What sort of API would they expose?  Different games work very differently, that's one of the problems.",
        "7f9405da4034bf43083e64b57302a8e6 (18:24): I just hate it when people lay bricks into my way of customizing things.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:24): I don't think standardization would help with that.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:24): Standardization is needed for inter-program APIs, document formats, things like that.  But any two independent games are different enough that there's nothing I can see that they could usefully share, in general.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:24): Well, they share things like graphics engines, clearly.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:25): But not along nice clean standardizable lines that you could make a stable API out of.",
        "ab7faae5d7b250ea8606486575f8f79c (18:25): They can be standardised at the OpenGL/DirectX level",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:25): At least it's my impression that when games use a third-party engine, they typically customize it to fit their needs.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:25): Well, yes.  Also file access can be standardized.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:25): Novel idea right there.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:25): But that's standardizing the OS, not the game.",
        "ab7faae5d7b250ea8606486575f8f79c (18:26): Anything higher-level will be obsolete within a year so everyone will want to write their own instead, unless the shared engine is continually updated and no longer standardised",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:26): Essentially, yes.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:27): (I've given thought to the possibility that an open-source graphics engine for games could be successful, if it used a dual-licensing scheme in the vein of MySQL.)",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:27): (It's really ridiculous how companies rewrite their graphics engines from scratch for most games they make.)",
        "7f9405da4034bf43083e64b57302a8e6 (18:27): Possible strawman: I neither do nor did advocate a common API or ABI for all games.",
        "ab7faae5d7b250ea8606486575f8f79c (18:28): (How would dual-licensing make it more successful than e.g. Ogre, which used to be dual-licensed and now is MIT?)",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:29): 7f9405da4034bf43083e64b57302a8e6, even similar games aren't similar enough that I see any useful API you could make.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:29): Maybe adopting a common scripting language or something like that, sure.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:29): Would be possible.",
        "7f9405da4034bf43083e64b57302a8e6 (18:29): LUA called, it wants its fame back ;)",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:30): But high-end games are usually written from scratch in a very short period and then thrown out.  That makes it unattractive to invest in features that aren't broadly useful.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:30): ab7faae5d7b250ea8606486575f8f79c, I've never heard of Ogre.  I'm just saying it could work, it could also fail for lots of reasons.",
        "7f9405da4034bf43083e64b57302a8e6 (18:30): ab7faae5d7b250ea8606486575f8f79c, re: dual-licensing ‚Äúcommercially successful‚Äù is different from ‚Äúbroad adoption successful‚Äù",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:31): My strategy would be to distribute it for free and let small players use it for free, and figure that if any big games stole it we'd notice.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:31): Try to get universities to use it in their courses, try to get a development community going.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:32): Anyway, I'm not actually going to try this, just an idle thought.",
        "69b0d3dfe919a6b860a9fac82de52a7e (18:33): fd9ef1223e855714294498ebfde79f98: is othermaciej on vacation or something?",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:33): hsivonen, you are aware that the chairs will consider objections even if they don't use the words &quot;I object&quot; every two sentences, right?",
        "ab7faae5d7b250ea8606486575f8f79c (18:33): 88d4d34a8064a4ff39fd5e144eea7762: Ogre's only the most well-known widespread open source graphics engine, which has been going seriously for ~6 years and has been used in several commercial games (e.g. Torchlight) :-)",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:33): Ah, interesting.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:34): Where do they get their development money from, if they're MIT-licensed?  Contracts, support?  I thought good 3D engines required very large ongoing development costs.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:35): (As opposed to most open-source projects, which can be more or less completed and then add features at their leisure without necessarily falling far behind)",
        "ab7faae5d7b250ea8606486575f8f79c (18:35): (I thought vaguely about using it recently, but found it's a pain to install on Linux because it now relies on a library that interacts badly with system libraries so most Linux distros won't touch it, so it ends up being a bit of a mess getting everything installed)",
        "b25b6b77a0087ff8385941e5545d32ea (18:35): 88d4d34a8064a4ff39fd5e144eea7762: It seems to be profitable to be very explicit when writing objections",
        "ab7faae5d7b250ea8606486575f8f79c (18:36): (so it's easier to just hack stuff onto an existing inflexible GL-based engine)",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:36): b25b6b77a0087ff8385941e5545d32ea, that I agree with.",
        "ab7faae5d7b250ea8606486575f8f79c (18:37): 88d4d34a8064a4ff39fd5e144eea7762: As far as I'm aware they don't have development money, it's just volunteers who want to work on the engine or want to use it for their own open source games",
        "06cb330920ae58e1614c9145d983b3d6 (18:37): i've worked on a commercial game that MIT-licenses most of its code for many years ... it works &quot;okay&quot;",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:37): And it's still competitive?  Or it's not competitive with the commercial engines, but it's good enough for the cost?",
        "ab7faae5d7b250ea8606486575f8f79c (18:37): and the result is okay enough that some commercial developers choose it instead of writing their own or buying one",
        "ab7faae5d7b250ea8606486575f8f79c (18:39): It's competitive if you're making a PC game that should run easily on 5-year-old hardware",
        "ab7faae5d7b250ea8606486575f8f79c (18:39): (from what I can see)",
        "ab7faae5d7b250ea8606486575f8f79c (18:39): (e.g. Torchlight lists GeForce 2 as a minimum requirement)",
        "ab7faae5d7b250ea8606486575f8f79c (18:40): (or Intel GMA 950, more relevantly)",
        "06cb330920ae58e1614c9145d983b3d6 (18:40): that's more like 10-year-old",
        "ab7faae5d7b250ea8606486575f8f79c (18:40): 950 is more like 5, I think",
        "ab7faae5d7b250ea8606486575f8f79c (18:40): and is very widespread",
        "b25b6b77a0087ff8385941e5545d32ea (18:41): 88d4d34a8064a4ff39fd5e144eea7762: I rather suspect I was insufficently explicit",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:41): b25b6b77a0087ff8385941e5545d32ea, on which issue?",
        "ab7faae5d7b250ea8606486575f8f79c (18:41): It's not exactly a graphics engine you're going to use for an Xbox 360 game",
        "ab7faae5d7b250ea8606486575f8f79c (18:42): (even if it supported consoles, which it doesn't)",
        "06cb330920ae58e1614c9145d983b3d6 (18:42): well, no open source game is actually going to really support consoles, since the APIs are largely proprietary and it's probably quasi-legal to even release code using them, heh",
        "b25b6b77a0087ff8385941e5545d32ea (18:42): 88d4d34a8064a4ff39fd5e144eea7762: 120",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:43): b25b6b77a0087ff8385941e5545d32ea, I hate when people refer to issues by numbers.  Can't you at least use the short description?",
        "06cb330920ae58e1614c9145d983b3d6 (18:43): (we did a PS2 port of our game years back; none of that code was ever released)",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:43): Is that the RDFa prefix one?",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:44): I suspect that one's a lost cause politically, but the chairs may surprise me.",
        "b25b6b77a0087ff8385941e5545d32ea (18:44): 88d4d34a8064a4ff39fd5e144eea7762: Yes, it's the RDFa one",
        "b25b6b77a0087ff8385941e5545d32ea (18:44): I have no idea what the shortname is",
        "b25b6b77a0087ff8385941e5545d32ea (18:44): Oh rdfa-prefixes",
        "ab7faae5d7b250ea8606486575f8f79c (18:45): Fortunately open source people seem very easily pleased with simple graphics - I see lots of compliments for the graphics of the game I work on, which has a 2004-era renderer that supports diffuse textures and shadows and a single light source and that's pretty much all",
        "fd9ef1223e855714294498ebfde79f98 (18:46): yeah, I need to get some survey responses in today",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:46): What does &quot;a single light source&quot; mean, in practice?",
        "ab7faae5d7b250ea8606486575f8f79c (18:46): The sun",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:46): Ah.",
        "ab7faae5d7b250ea8606486575f8f79c (18:46): (No dynamic lighting or anything)",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:46): So constant illumination from a fixed direction.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:46): I find graphics vaguely interesting.",
        "ab7faae5d7b250ea8606486575f8f79c (18:46): Indeed",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:47): I remember being amused when I saw in my brother's 3D graphics program (3DS Max or whatever) that he could change the rate at which the intensity of light dropped off.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:47): Constant, inverse-square, inverse, inverse-cube, exponential . . .",
        "b25b6b77a0087ff8385941e5545d32ea (18:47): 88d4d34a8064a4ff39fd5e144eea7762: Anyway, clearly the solution is to write a RFC defining terms like OBJECT and SUPPORT so people would know to look at the sentences with the defined terms and filter out the rest.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:48): Granted, constant makes sense for very far light sources like the sun, but exponential dropoff for light?  I guess you're not always aiming for realism, in graphics.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:48): The software also supported indices of refraction less than 1.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:48): Although negative indices of refraction can be possible.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:49): b25b6b77a0087ff8385941e5545d32ea, I don't think the chairs have dropped any objections lately just because of how they were phrased, did they?",
        "ab7faae5d7b250ea8606486575f8f79c (18:49): recently considered doing something as extreme as requiring GLSL shaders, which are only 7 years old, so he set up http://feedback.wildfiregames.com/report/opengl/ a few weeks ago to figure out what hardware support was available",
        "ab7faae5d7b250ea8606486575f8f79c (18:49): but it turns out quite a few people still have terrible hardware or drivers :-(",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:50): ab7faae5d7b250ea8606486575f8f79c, do you know of any book I could read that would teach me more about the principles of graphics programming, without expecting that I'd be willing to write any actual code except maybe really trivial snippets?",
        "06cb330920ae58e1614c9145d983b3d6 (18:50): i'd imagine typical systems with onboard Intel video chipsets and similar laptops",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:51): I would like to get it, read the first twenty pages, put it aside somewhere, and forget about it for months until I clean up my room, at which point I'll realize I have no time to read it and put it on my shelf, with a forlorn bookmark forever remaining in it as a testament to my lack of persistence.",
        "ab7faae5d7b250ea8606486575f8f79c (18:51): 88d4d34a8064a4ff39fd5e144eea7762: No - I don't think I've read any particularly relevant books, and I don't know enough about the subject to guess which ones might be good",
        "b25b6b77a0087ff8385941e5545d32ea (18:51): 88d4d34a8064a4ff39fd5e144eea7762: It's hard to tell. Based on http://www.w3.org/mid/<email/> it seems that some people don't feel their points have been considered in the way they would like due to the choice of wording",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:52): b25b6b77a0087ff8385941e5545d32ea, that objection was ignored because it suggested a change that wasn't suggested by any change proposal.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:52): I.e., it didn't actually support either change proposal, and they were only trying to decide between the change proposals, so it was useless to them.",
        "ab7faae5d7b250ea8606486575f8f79c (18:53): 06cb330920ae58e1614c9145d983b3d6: Yeah, lots of those, though I was surprised to see someone apparently still had a GeForce2 MX",
        "ab7faae5d7b250ea8606486575f8f79c (18:55): (which is even slower than an Intel 945GM, seemingly)",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:55): I think I have a GeForce 1 somewhere.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:55): Not in an actual working computer, needless to say.",
        "88d4d34a8064a4ff39fd5e144eea7762 (18:56): Wasn't GeForce 1 a PCI card, though?  If so, maybe it would still work.  I bet the Linux kernel still supports it.",
        "ab7faae5d7b250ea8606486575f8f79c (18:58): AGP, apparently",
        "ab7faae5d7b250ea8606486575f8f79c (18:58): (http://en.wikipedia.org/wiki/Comparison_of_Nvidia_graphics_processing_units#GeForce_series)",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:00): I probably have an AGP motherboard somewhere.  Whether I have a CPU and RAM to go with it is a separate question.",
        "ab7faae5d7b250ea8606486575f8f79c (19:04): likes measuring things",
        "ab7faae5d7b250ea8606486575f8f79c (19:04): http://zaynar.co.uk/0ad-pub/performance-20110317.png - probably wholly inaccurate, but I think it looks pretty",
        "b25b6b77a0087ff8385941e5545d32ea (19:05): What did you plot it with?",
        "ab7faae5d7b250ea8606486575f8f79c (19:05): matplotlib",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:10): I don't suppose anyone here knows how to get execCommand() to work in IE?  It doesn't seem to work on my page: http://aryeh.name/spec/editcommands/autoimplementation.html",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:10): The &quot;browser&quot; column remains stubbornly unstyled in IE9, with no errors logged or anything.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:11): It's worked before . . .",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:11): Oh well, I don't need to know IE's behavior for this particular thing anyway.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:11): goes back to rewriting his spec for about the fourth time",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:11): No, wait, I think it's only the third.",
        "06cb330920ae58e1614c9145d983b3d6 (19:27): &lt d3c9ec5d23498bc66cc43bac6408ab4d&gt; The source of webkit.org is on svn &lt;- it's not having them in svn that's surprising, it's having them in the WebKit source tree",
        "040342c014ffc1c11592948bd92e3721 (19:30): 69b0d3dfe919a6b860a9fac82de52a7e: are you there?",
        "69b0d3dfe919a6b860a9fac82de52a7e (19:30): here",
        "040342c014ffc1c11592948bd92e3721 (19:31): issue-147 about playbackrate",
        "06cb330920ae58e1614c9145d983b3d6 (19:31): webkit doesn't send onprogress reliably on chunked XHR responses :(",
        "040342c014ffc1c11592948bd92e3721 (19:31): are you planning on writing a change proposal?",
        "06cb330920ae58e1614c9145d983b3d6 (19:32): probably due to buffering",
        "06cb330920ae58e1614c9145d983b3d6 (19:32): yeah, definitely",
        "69b0d3dfe919a6b860a9fac82de52a7e (19:34): 040342c014ffc1c11592948bd92e3721: not if i can help it",
        "040342c014ffc1c11592948bd92e3721 (19:34): 69b0d3dfe919a6b860a9fac82de52a7e: if you like the idea of requestedPlaybackRate/actualPlaybackRate, I'd be happy to quickly write it",
        "040342c014ffc1c11592948bd92e3721 (19:34): and request another week of discussion extension, I guess",
        "69b0d3dfe919a6b860a9fac82de52a7e (19:35): based on what frank said, he doesn't much care to do anything but what they already shipped",
        "69b0d3dfe919a6b860a9fac82de52a7e (19:35): so...",
        "040342c014ffc1c11592948bd92e3721 (19:36): hmm, I care about a good spec and I would like to hear other browser vendor opinions",
        "69b0d3dfe919a6b860a9fac82de52a7e (19:36): i care about a good spec too, but it seems the w3c html wg is not the place we'll be able to achieve that",
        "69b0d3dfe919a6b860a9fac82de52a7e (19:36): (this is yet another example of how having microsoft implement cutting-edge stuff is a mistake)",
        "040342c014ffc1c11592948bd92e3721 (19:37): I've not lost faith :)",
        "040342c014ffc1c11592948bd92e3721 (19:37): other browsers have implemented stuff, too, that got changed later - that's not new",
        "040342c014ffc1c11592948bd92e3721 (19:38): no worries, I'll go ahead then",
        "69b0d3dfe919a6b860a9fac82de52a7e (19:41): other browsers don't have 3 year ship cycles",
        "69b0d3dfe919a6b860a9fac82de52a7e (19:41): (my faith is mostly lost from sam's many decisions recently, not just this issue)",
        "69b0d3dfe919a6b860a9fac82de52a7e (19:44): (and the recent polls, which have no good solutions proposed)",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:48): IE9 was shipped only two years after IE8, to be fair, not three.  :)"
    ],
    "person_ids": [
        "06cb330920ae58e1614c9145d983b3d6",
        "171db427cee236fc04af9e5de94e7c39",
        "d3c9ec5d23498bc66cc43bac6408ab4d",
        "88d4d34a8064a4ff39fd5e144eea7762",
        "7f9405da4034bf43083e64b57302a8e6",
        "ab7faae5d7b250ea8606486575f8f79c",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "b25b6b77a0087ff8385941e5545d32ea",
        "fd9ef1223e855714294498ebfde79f98",
        "040342c014ffc1c11592948bd92e3721"
    ]
}