{
    "id": "26260646efc34cbdfeff6c8200b6275e",
    "messages": [
        "30071b8d71ad838f7a5c85ffe49dc7e5 (02:38): hi all",
        "ae2723c5c3c9da84b0c32669c7b01e60 (02:42): yo",
        "30071b8d71ad838f7a5c85ffe49dc7e5 (02:42): yo yo yo hang on setting up geoshell shell on windows xp home",
        "30071b8d71ad838f7a5c85ffe49dc7e5 (02:43): ok im here while geoshell downloads",
        "30071b8d71ad838f7a5c85ffe49dc7e5 (02:44): bbiab",
        "97ad8877a5178ec00b63c3fa53b0ffd7 (02:54): hello everything",
        "f7ae7f087d4f278efbd1b7b2097b46a4 (03:14): howdy",
        "46c5b3443eb7241f44943054d7f43491 (03:14): mornin'",
        "f7ae7f087d4f278efbd1b7b2097b46a4 (03:14): i was wondering what the best cooling compound is - arctic silver?",
        "46c5b3443eb7241f44943054d7f43491 (03:14): 'tis what I've heard",
        "f7ae7f087d4f278efbd1b7b2097b46a4 (03:15): a related question - my cpu was running so hot that it burnt the little black plastic pads on the corner... is that going to be a problem when i reinstall the heatsink?",
        "46c5b3443eb7241f44943054d7f43491 (03:16): This an Athlon?",
        "f7ae7f087d4f278efbd1b7b2097b46a4 (03:16): they're not totally gone, just a little bit burnt off on the left side of two of them",
        "f7ae7f087d4f278efbd1b7b2097b46a4 (03:16): athlon mp 2800",
        "ae2723c5c3c9da84b0c32669c7b01e60 (03:17): not a problem if they still support the sink",
        "ae2723c5c3c9da84b0c32669c7b01e60 (03:17): they are purely mechanical",
        "f7ae7f087d4f278efbd1b7b2097b46a4 (03:18): right",
        "f7ae7f087d4f278efbd1b7b2097b46a4 (03:18): my concern is that the sink will sit a little crooked because they burned off on the same side",
        "46c5b3443eb7241f44943054d7f43491 (03:18): I don't think they support the sink much anyway, virtually all the HS pressure gets exerted on the core in the middle",
        "f7ae7f087d4f278efbd1b7b2097b46a4 (03:18): but then again, i guess there's only one way to find out... and the cpu has already been over 80C so it's not like it'll be harmed more by much of anything i try at this point :)",
        "46c5b3443eb7241f44943054d7f43491 (03:19): Athlons used to be rated to something like 90C",
        "f7ae7f087d4f278efbd1b7b2097b46a4 (03:19): yeah",
        "f7ae7f087d4f278efbd1b7b2097b46a4 (03:20): this thing got hot enough that i'd get occasional program crashes when it got above 77C or so",
        "f7ae7f087d4f278efbd1b7b2097b46a4 (03:20): then the system would usually just go blank, or occasionally bluescreen around 82C",
        "f7ae7f087d4f278efbd1b7b2097b46a4 (03:20): or sometimes the thermal control kicked in and shut the system off",
        "46c5b3443eb7241f44943054d7f43491 (03:20): you must have had some seriously shit cooling to reach 70C though, my 3000+ struggles to get past 60C even in the middle of summer",
        "f7ae7f087d4f278efbd1b7b2097b46a4 (03:21): LSD - it's an mp system, and this cpu is right next to the gpu, which i just upgraded",
        "f7ae7f087d4f278efbd1b7b2097b46a4 (03:21): so there's a lot of heat around",
        "f7ae7f087d4f278efbd1b7b2097b46a4 (03:21): now that i took the hot cpu out, even at full load it only gets to 55C or so",
        "f7ae7f087d4f278efbd1b7b2097b46a4 (03:22): but with both in, one cpu sensor would get to about 80, the other about that +2C",
        "f7ae7f087d4f278efbd1b7b2097b46a4 (03:22): here's what i'm wondering tho",
        "f7ae7f087d4f278efbd1b7b2097b46a4 (03:22): is it more likely it was the paste or the actual cooling block and fan",
        "46c5b3443eb7241f44943054d7f43491 (03:23): it could be, the point of the paste is to increase the thermal conductivity between the top of the CPU core and the HS",
        "f7ae7f087d4f278efbd1b7b2097b46a4 (03:23): after i powered it off before i finally too the thing out, i touched the gpu, and both cpu cooling blocks in order. it was like, warm, warm, HOT!!!!!",
        "88c07e4e9458c3e1cfa7bbee30c20207 (03:32): my laptops f'd up",
        "88c07e4e9458c3e1cfa7bbee30c20207 (03:32): Plugged in - 0% charged (28h40m until charged)",
        "ae2723c5c3c9da84b0c32669c7b01e60 (03:33): brianski, the quality of the paste application also matters",
        "24de570d333d3d14b0226d27fd37a8a6 (03:48): i have to decide if I want to buy a dothan centrino notebook or a core duo notebook. i want a good battery lifetime (&gt;4 houres) what is recommended? how much is a core duo faster then core solo/centrino dothan?",
        "ae2723c5c3c9da84b0c32669c7b01e60 (03:49): faster and longer battery life are opposing tendencies, you know",
        "ae2723c5c3c9da84b0c32669c7b01e60 (03:49): i would definitely look for a clock-scaling setup like &quot;speedstep&quot; or &quot;powernow&quot;... that will save you in the long run",
        "24de570d333d3d14b0226d27fd37a8a6 (03:52): what is recommended? core duo or better old centrino dothan?",
        "46c5b3443eb7241f44943054d7f43491 (03:53): another tip for long battery life is to avoid machines with 3rd party graphics solutions and go for one with the Intel integrated. It'll be crap for 3D but as it's part of an already fairly power efficient chipset it'll allow for longer batter life",
        "46c5b3443eb7241f44943054d7f43491 (03:53): Edrin: do you run anything that can really take advantage of a dual cpu machine?",
        "24de570d333d3d14b0226d27fd37a8a6 (03:54): LSD`: i dont know... when is duo an advantage?",
        "46c5b3443eb7241f44943054d7f43491 (03:55): Like any multiprocessing solution, dual core is only really advantageous if you're running multithreaded software. It's possible to nominate single thread to run on seperate cores but the advantage isn't as great. Most consumer level software is only single threaded though so dual core wouldn't be that great and advantage",
        "24de570d333d3d14b0226d27fd37a8a6 (03:55): LSD`: will office be faster with core duo?",
        "46c5b3443eb7241f44943054d7f43491 (03:56): probably not, I doubt it would be threaded",
        "24de570d333d3d14b0226d27fd37a8a6 (03:58): ok",
        "24de570d333d3d14b0226d27fd37a8a6 (03:58): and a centrino dothan will be better with energy, right?",
        "46c5b3443eb7241f44943054d7f43491 (04:00): I'm not sure, adding an extra cpu core will inevitably cause a rise in power consumption but Intel designed it and the rest of the Centrino DUuo components to be more power efficient so it might even out but most likely the Dothan would last slightly longer",
        "0c30958fe3960c6ed27d8ca6dbe4aab8 (04:05): what happens if I try to cluster 2 comps together: 1 P4 2.4Ghz and a Pentium (Pentium 1) 120Mhz",
        "0c30958fe3960c6ed27d8ca6dbe4aab8 (04:05): ok thats retarded",
        "0c30958fe3960c6ed27d8ca6dbe4aab8 (04:05): how about a Pentium D system and the P4 2.4Ghz",
        "ae2723c5c3c9da84b0c32669c7b01e60 (04:06): there is clustering overhead, i'm not sure it would be worthwhile",
        "0c30958fe3960c6ed27d8ca6dbe4aab8 (04:06): true"
    ],
    "person_ids": [
        "30071b8d71ad838f7a5c85ffe49dc7e5",
        "ae2723c5c3c9da84b0c32669c7b01e60",
        "97ad8877a5178ec00b63c3fa53b0ffd7",
        "f7ae7f087d4f278efbd1b7b2097b46a4",
        "46c5b3443eb7241f44943054d7f43491",
        "88c07e4e9458c3e1cfa7bbee30c20207",
        "24de570d333d3d14b0226d27fd37a8a6",
        "0c30958fe3960c6ed27d8ca6dbe4aab8"
    ]
}