{
    "id": "26b062c9e20e00b3fd01856e225cc1a1",
    "messages": [
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:05): 60659cfda992013e610f285c46692d28, I see namespace confusion all over and not at all limited to the DOM",
        "60659cfda992013e610f285c46692d28 (13:09): but the examples I see on the mailing list all have to do with DOM",
        "60659cfda992013e610f285c46692d28 (13:10): of course there's other confusion as well; but what does that mean? There#s also confusion about character encodings, CSS, HTTP methods, whatnot",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:13): I see much more confusion from experts on namespaces than CSS",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:13): though confusion about namespaces in CSS was a recent one, due to some copy and paste mistake",
        "60659cfda992013e610f285c46692d28 (13:16): what kind of experts?",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:17): professors at uni, QA at Opera, implementors at Opera (we still have namespace bugs with respect to attributes actually), people from the W3C Team",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:19): wonders how much other things we could be trying to get resolved that would actually be of the most value to end users...",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:19): hey, how about ruby?",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:19): does the &lt;ruby&gt; spec text still have issues?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:19): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: you're still in the CSS WG, right?",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:19): I am, yes",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:20): though I won't be at the next F2F as it clashes with WebApps",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:20): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: the HTML5 spec for ruby does not have any serious issues, as far as I know -- but I think the CSS spec for it does",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:20): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: an HTML5 &lt;ruby&gt; implementation will be landing in Webkit trunk soon, but I'm told that the ruby text won't be styleable because of issues with the CSS ruby spec",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:20): but I don't know about the specifics",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (13:20): changes: hixie: Add IANA considerations sections for HTTP headers. (whatwg r4091) &lt;http://lists.w3.org/Archives/Public/public-html-diffs/2009Oct/0022.html&gt;",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:21): a9b326df4e6da61c5b6f5e1058be83a2, I think that's because that's an implied box",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:21): a9b326df4e6da61c5b6f5e1058be83a2, so we'd need to introduce a pseudo-element of some sorts",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:21): though coloring and such should work",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:21): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: OK. Well I hope the other part can get resolved soon",
        "139513027e8e90b5582cbc68fc733884 (13:22): 60659cfda992013e610f285c46692d28: would it be fair to say you think technical purity is quite important when it comes to markup and protocols?",
        "60659cfda992013e610f285c46692d28 (13:22): Maciej, is that a trick question?",
        "60659cfda992013e610f285c46692d28 (13:23): Yes, I think technical purity is a good thing. But of course there are other things to consider as well.",
        "139513027e8e90b5582cbc68fc733884 (13:23): 60659cfda992013e610f285c46692d28: it seems to be a much lower priority for you when it comes to the DOM",
        "139513027e8e90b5582cbc68fc733884 (13:23): I'm puzzled by the disconnect",
        "60659cfda992013e610f285c46692d28 (13:23): Right now I think that many people think of technical purity as something bad, and are more than happy to ignore it without sufficient reason.",
        "60659cfda992013e610f285c46692d28 (13:24): I see.",
        "60659cfda992013e610f285c46692d28 (13:24): DOM in itself is inconsistent, because it allows mixing L1 and L2 access.",
        "60659cfda992013e610f285c46692d28 (13:25): It's a nightmare.",
        "60659cfda992013e610f285c46692d28 (13:25): That IE doesn't support L2 makes things even harder.",
        "60659cfda992013e610f285c46692d28 (13:25): So I think it would be very interesting to discuss a new API that doesn't repeat those mistakes.",
        "139513027e8e90b5582cbc68fc733884 (13:25): does that mean it's ok to design specs so that L1 access will let you pass the test cases, but L2 access won't, even in DOMs that support Level 2?",
        "60659cfda992013e610f285c46692d28 (13:25): But it's probably too late to do that for HTML5.",
        "60659cfda992013e610f285c46692d28 (13:26): Is that the case?",
        "139513027e8e90b5582cbc68fc733884 (13:26): (for namespace-aware content)",
        "139513027e8e90b5582cbc68fc733884 (13:26): (er, for namespaced content rather)",
        "60659cfda992013e610f285c46692d28 (13:27): If there are RDfa test cases for XHTML which can't be passed by an implementation using pure DOM Level 2, that sounds like a bug.",
        "60659cfda992013e610f285c46692d28 (13:27): Pointer?",
        "139513027e8e90b5582cbc68fc733884 (13:27): there are such RDFa test cases for HTML",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:29): e4x tried to be the new and great API",
        "139513027e8e90b5582cbc68fc733884 (13:29): I don't know if that shows misunderstanding or deliberate violation of the conceptual model, but I think it's one or the other, and I don't think you can blame it on DOM",
        "002fd66affb058c756926402acf97570 (13:30): points out there are tree models that don't give something like nodeName, and you're stuck if you want the actual prefix",
        "60659cfda992013e610f285c46692d28 (13:31): Please point to these test cases, optimally in email.",
        "139513027e8e90b5582cbc68fc733884 (13:36): here is one example: http://rdfa.digitalbazaar.com/test-suite/test-cases/html4/0001.html",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (13:36): Title: Test 0001 (at rdfa.digitalbazaar.com)",
        "139513027e8e90b5582cbc68fc733884 (13:37): but I think it's true of all the text/html test cases",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (13:43): planet: XML on the Web &lt;http://www.brucelawson.co.uk/2009/xml-on-the-web/&gt;",
        "3f2e2531201cfbf853f16f668132eaf2 (13:44): 139513027e8e90b5582cbc68fc733884: Maybe not quite all - you could do &lt;div property=&quot;xml:foo&quot;&gt; and it might or might not (I don't think it's been decided by the RDFa group yet) give you a triple, without having to parse any attribute names containing colons",
        "3f2e2531201cfbf853f16f668132eaf2 (13:45): but that's a bit of an edge case :-p",
        "139513027e8e90b5582cbc68fc733884 (13:45): 3f2e2531201cfbf853f16f668132eaf2: hmm... the RDFa spec does not seem to make any allowance for the xmlns: or xml: prefixes to be predefined as currently written",
        "139513027e8e90b5582cbc68fc733884 (13:46): 3f2e2531201cfbf853f16f668132eaf2: but if they were set to be predefined to their usual values for CURIE resolution purposes, then sure",
        "139513027e8e90b5582cbc68fc733884 (13:46): 3f2e2531201cfbf853f16f668132eaf2: I guess a test case that did not use xmlns: at all and just use &quot;:foo&quot; style CURIEs using the default prefix, that would also work fine with DOM L2 APIs only",
        "3f2e2531201cfbf853f16f668132eaf2 (13:47): Shane proposed an errate to say that RDFa processors MAY predefine xml and xmlns",
        "3f2e2531201cfbf853f16f668132eaf2 (13:47): *errata",
        "139513027e8e90b5582cbc68fc733884 (13:47): MAY, awesome",
        "3f2e2531201cfbf853f16f668132eaf2 (13:47): but I think it was generally agreed that that might not be such a good idea",
        "3f2e2531201cfbf853f16f668132eaf2 (13:48): although if the prefixes aren't defined by default, it's apparently impossible to implement an RDFa processor using XSLT",
        "139513027e8e90b5582cbc68fc733884 (13:48): I can't really think of legitimate use cases for using the XML or XMLNS namespaces as CURIE prefixes",
        "3f2e2531201cfbf853f16f668132eaf2 (13:50): It doesn't seem very useful in practice, I just think it's an edge case that ought to be defined",
        "3f2e2531201cfbf853f16f668132eaf2 (13:50): (because I think everything ought to be defined)",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:50): it sucks, though, if you are working with a non-DOM API that has a built-in prefix resolution facility that is sane per namespace but you can't use it because it predefines xml and xmlns",
        "3f2e2531201cfbf853f16f668132eaf2 (13:52): added some tests like http://github.com/msporny/rdfa-test-suite/blob/887c494ff514f7a2c7c6e7d55ffe1c958adfefd2/tests/0160.txt and Manu said they would review them all and make sure all the behaviour is defined by the specs",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (13:52): Title: tests/0160.txt at 887c494ff514f7a2c7c6e7d55ffe1c958adfefd2 from msporny's rdfa-test-suite - GitHub (at github.com)",
        "3f2e2531201cfbf853f16f668132eaf2 (13:52): so hopefully this kind of thing would be addressed then"
    ],
    "person_ids": [
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0",
        "60659cfda992013e610f285c46692d28",
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "0a39f78bcb297ab0ebe8a29c28bfed89",
        "139513027e8e90b5582cbc68fc733884",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "002fd66affb058c756926402acf97570",
        "3f2e2531201cfbf853f16f668132eaf2"
    ]
}