{
    "id": "29f4363f6c0f24aaed5b6ac8a615d835",
    "messages": [
        "137d480e4b8cc9c4d0d74bfbac2b5372 (05:57): what does it entail to enable this so called CSSOM ?",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (05:58): does it need JS to pre-process it? or is this like a css4 spec?",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (06:01): it will eventually be native to Chrome it seems. yowsa.",
        "4c681049601b3c374f1d2c0077c99049 (06:02): it'll go in at the webkit level",
        "4c681049601b3c374f1d2c0077c99049 (06:02): it wont need a preprocessor",
        "4c681049601b3c374f1d2c0077c99049 (06:02): but if we end up using this in the next 4 years.. people will probably use a pre-processor on the backend so we write like this...",
        "4c681049601b3c374f1d2c0077c99049 (06:02): send this code to supporting browsers..",
        "4c681049601b3c374f1d2c0077c99049 (06:02): and send the generated processed whatever to old shit",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (06:04): i love this shizzle. i wish it were native NOW",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (06:05): I need to start using less at least.  my css is pretty tight, but i need to start getting into these condensed modes.",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (06:08): So Paul, I made that &quot;TimeGrid&quot; jquery UI widget I had mentioned to you a while back.  its sweet.  plus, since then Ive also make a &quot;LiveCanvas&quot; control, so you can draw back and forth in a web-based chat app, zoom in on pictures and pan around, shiz.  And last night I made what I call a &quot;FormTree&quot; .... Im so digging the UI Widget pattern now.",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (06:09): I want to make them all opensource projects.  the code is technically Needle.com's, but I think they would be cool with me opening them up",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (06:10): Once I get over the hurdle trying to figure out why IE doesnt want to do the drawImage() canvas 2d context method, we will be able to push it out to production.",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (06:13): stupid effin IE.",
        "4c681049601b3c374f1d2c0077c99049 (06:27): 137d480e4b8cc9c4d0d74bfbac2b5372: mad cool",
        "4c681049601b3c374f1d2c0077c99049 (06:27): did you try out flashcanvas?",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (06:28): Ive got it in the repo, waiting for one of the guys to deploy it to staging for me. *sigh",
        "4c681049601b3c374f1d2c0077c99049 (06:28): cant try it without a deploy?",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (06:29): im on a mac, needing to set up a windows vm... its a pretty intricate set up, running a C backend, on an ubuntu VM for the chat server",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (06:30): but, that doesnt mean i couldnt get just a working demo",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (06:30): im dumb.",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (06:31): i need to have a local IE test setup on my mac anyways, i better read up on setting that up tonight.",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (06:34): at least I finished my son's pinewood derby car tonight :]",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (06:34): just need to touch up some of the paint-job",
        "4c681049601b3c374f1d2c0077c99049 (06:39): 137d480e4b8cc9c4d0d74bfbac2b5372: get virtualbox and some tiny winxp  image .torrent",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (06:51): sheesh man, I dont know why I havent done this sooner, I found a burned xp cd I had laying around, and been running Ubuntu through VirtualBox for some time now... creating a new windows VM instance now... thanks for pointing me in the right direction Mr. Irish :]",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (06:53): I had tried to set it up to boot natively from Bootcamp in the past, and freaked myself out thinking I had accidentally wiped my OSX partition while doing so... So I had steered clear from that prospect since.",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (06:53): VirtualBox Rocks.",
        "40f8fba47f4f263981acedf335d3f269 (06:57): i struggled with ubuntu for two years, feel life is just easier with windows. one problem with os other than windows/mac is the lack of software/app inventory",
        "40f8fba47f4f263981acedf335d3f269 (06:58): i tot i only need a browser and a console, but i was wrong",
        "40f8fba47f4f263981acedf335d3f269 (06:58): toggling between virtual machines is just not productive",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (06:59): I had been using ubuntu for like 2 years as well, before I got this mac like 6 months ago, my first time using OSX..  It came with the full adobe CS5 suite, so im loving it.  But I held my own with Gimp and the command line with Ubuntu...",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (07:00): Tried out Fedora for a few months before I got the Mac.  They all handled what I needed to do.",
        "40f8fba47f4f263981acedf335d3f269 (07:00): i love ubuntu, a lot of software are avaible on ubuntu, but the support is bad, very buggy",
        "4c681049601b3c374f1d2c0077c99049 (07:00): i actually prefer frontend dev on windows.. i like having IE6 right there and waiting.",
        "4c681049601b3c374f1d2c0077c99049 (07:00): but... the command line story on windows is pretty shit.",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (07:01): Apache, SVN, GIT, hackity hack.  you dont need too complex of an OS to use VI",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (07:01): yea, Im pretty proud to have been out of the windows world for a few years now.",
        "40f8fba47f4f263981acedf335d3f269 (07:02): yea... ie is a big reason i use windows, cos ie under wine just dont work that properly",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (07:02): Back in my windows days, it was mostly just a matter of installing Wamp, and using either Crimson editor, or Zend studio (when work had paid for it)",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (07:05): nowadays I havent had to do any PHP anymore, its all jQuery and client-side gui goodness.",
        "40f8fba47f4f263981acedf335d3f269 (07:06): is there a Wireshark equivalent on ubuntu?",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (07:07): looks like wireshark is downloadable for linux.",
        "40f8fba47f4f263981acedf335d3f269 (07:08): arh, i see",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (07:08): i havent personally dug too deep into the whole network protocol monitoring biznas, Im sure there are tons of command line style monitoring tools out there though",
        "137d480e4b8cc9c4d0d74bfbac2b5372 (07:09): wow, how would a human who is _away join?  thats some black magic."
    ],
    "person_ids": [
        "137d480e4b8cc9c4d0d74bfbac2b5372",
        "4c681049601b3c374f1d2c0077c99049",
        "40f8fba47f4f263981acedf335d3f269"
    ]
}