{
    "id": "2a25f15f39657e9079174178fe318e2f",
    "messages": [
        "b25b6b77a0087ff8385941e5545d32ea (22:11): 88d4d34a8064a4ff39fd5e144eea7762: I didn't have a better idea but zcorpan's idea is interesting",
        "b25b6b77a0087ff8385941e5545d32ea (22:12): Only seems worth it if there are other cases where it could be used though",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:35): I think we want something that goes further than that: something that autogenerates tests for things such as [TreatNullAs=] as well as the property descriptor.",
        "b25b6b77a0087ff8385941e5545d32ea (22:40): Well the logical conclusion is something where you paste a whole idl block in as text and do test_idl() and it runs all the tests for you",
        "b25b6b77a0087ff8385941e5545d32ea (22:40): The question is whether it is useful to have a bit less magic than that and make people write test for different parts of the idl by hand",
        "b25b6b77a0087ff8385941e5545d32ea (22:41): I'm not sure what the sweet spot is between ease of writing tests and ease of understanding the output",
        "b25b6b77a0087ff8385941e5545d32ea (22:41): I guess sone can have both",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:44): I think we just want to take a whole IDL block",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:45): Optionally with a function that returns an instance of the interface if it doesn't have a zero-argument constructor",
        "b25b6b77a0087ff8385941e5545d32ea (22:48): Why a function?",
        "b25b6b77a0087ff8385941e5545d32ea (22:48): Just pass in an instance",
        "b25b6b77a0087ff8385941e5545d32ea (22:48): Well I gues you might need many instances",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:53): b25b6b77a0087ff8385941e5545d32ea: What does nose actually buy us in the html5lib case?",
        "b25b6b77a0087ff8385941e5545d32ea (22:54): Me not wanted to kill people?",
        "b25b6b77a0087ff8385941e5545d32ea (22:54): Also, more seriously, test generators are ideal for us",
        "b25b6b77a0087ff8385941e5545d32ea (22:55): Since we generate a bunch of tests from a data file it is totally natural to represent that as a single test function being called multiple times from a generator",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:55): Eh, they make the tests harder to run (we appear to have almost a thousand errors currently‚Ä¶), and that's only relevant for people changing the test harness code, which is almost nobody.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:55): Optimizing for people editing that code is the wrong optimization.",
        "b25b6b77a0087ff8385941e5545d32ea (22:56): Rather than the crazy thing we did with unittest where we built a class wih test_* methods at runtime",
        "b25b6b77a0087ff8385941e5545d32ea (22:56): I have hated that code more than any other code in the project for some time",
        "b25b6b77a0087ff8385941e5545d32ea (22:57): I agree that if there is a committed partial conversion that's bad and we should finish the conversion",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:57): I believe that the default unittest in Ython nowadays can do everythign you need to get rid of that ugliness",
        "b25b6b77a0087ff8385941e5545d32ea (23:02): Show me where. I don't see it",
        "b25b6b77a0087ff8385941e5545d32ea (23:02): It adds test discovery but afaict not generators",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:02): &quot;Tests grouped by a TestSuite are always accessed by iteration. Subclasses can lazily provide tests by overriding __iter__().&quot;",
        "b25b6b77a0087ff8385941e5545d32ea (23:04): That will still be ugly",
        "b25b6b77a0087ff8385941e5545d32ea (23:04): We will sill have to create a TestCase for each test at runtime",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:05): And creating an object is so much worse than creating a tuple?",
        "b25b6b77a0087ff8385941e5545d32ea (23:05): Basically my problem with UnitTest is that it is a bout an order of magnitude more complex than needed, mostly for the benefit of looking like java",
        "4c681049601b3c374f1d2c0077c99049 (23:05): there is clearly a difference between how http://livedom.validator.nu/ and  http://software.hixie.ch/utilities/js/live-dom-viewer/ are acting. is one considered more maintained?",
        "b25b6b77a0087ff8385941e5545d32ea (23:05): Which is not something I aspire to",
        "3a11d663baf9dd49fd3266d53d9bec5c (23:06): 4c681049601b3c374f1d2c0077c99049, they have different purposes",
        "b25b6b77a0087ff8385941e5545d32ea (23:06): 4c681049601b3c374f1d2c0077c99049: I don't think either are particularly maintained. But the validator.nu one I expect has not been updated recently (it uses a javascript implementation of the parsing algorithm)",
        "3a11d663baf9dd49fd3266d53d9bec5c (23:06): 4c681049601b3c374f1d2c0077c99049, the former is based on the validator.nu parser, the latter uses your browser",
        "b25b6b77a0087ff8385941e5545d32ea (23:07): a11aabeeceeae6b8cb5d12ea06b56554: The errors that I see have no particular relationship to the test harness I don't think",
        "4c681049601b3c374f1d2c0077c99049 (23:07): ah uses a GWT compilation of the parser. cool.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:07): b25b6b77a0087ff8385941e5545d32ea: Regardless, the output from parser tests of unittest was a lot more usable than what we get now from nose, and that's far more important",
        "b25b6b77a0087ff8385941e5545d32ea (23:08): I disagree. nose's output is better",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:09): b25b6b77a0087ff8385941e5545d32ea: With unittest we got far more readable identifiers for testse.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:12): Also I can't get nose usefully working with pdb at all :\\",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:13): It puts me into pdb in a totally different place to the stack it gives me at the end, useful.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:15): Ergh, we're breaking relying upon non-documented behaviour.",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:16): roc: hey, I want to go to bed, but the background works poorly because there's no color, and if you have a background set already it gets thrown away because of the current style rules; we could make background:black apply at the normal UA style sheet level of course",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:17): roc: your description of stacking I didn't get because all the elements on a stack would be in the document",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:17): roc: because the stack is document bound",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:23): b25b6b77a0087ff8385941e5545d32ea: Bloody hell html5lib is broken from a testsuite POV‚Ä¶",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:23): And yes, I am bitchy about this.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:24): Because every time I want to hack on html5lib I invariably spend the vast majority of my time fixing regressions that others ahve introduced and would ahve found if they had run the testseuite.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:24): s/ahve/have/g",
        "b25b6b77a0087ff8385941e5545d32ea (23:28): a11aabeeceeae6b8cb5d12ea06b56554: Just as well it is as easy as typing nosetests now then",
        "b25b6b77a0087ff8385941e5545d32ea (23:28): I just fixed most of the error",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:28): b25b6b77a0087ff8385941e5545d32ea: No, it's as easy as installing nosetests and running it compared with just running runtests.py",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:30): b25b6b77a0087ff8385941e5545d32ea: And you did it a lot quicker than I did.",
        "b25b6b77a0087ff8385941e5545d32ea (23:30): If you aren't already using pip + virtualenv you have bigger problems",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:31): b25b6b77a0087ff8385941e5545d32ea: It's still an extra step.",
        "ab7faae5d7b250ea8606486575f8f79c (23:32): has never used either pip or virtualenv, and wouldn't know where to start",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:32): ab7faae5d7b250ea8606486575f8f79c: Obviously you have bigger problems then",
        "ab7faae5d7b250ea8606486575f8f79c (23:32): I have many problems",
        "b25b6b77a0087ff8385941e5545d32ea (23:34): I bet in practice you would start with google",
        "3a11d663baf9dd49fd3266d53d9bec5c (23:34): And bugs you need to get to",
        "b25b6b77a0087ff8385941e5545d32ea (23:34): 10 errors/8 fails",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:35): b25b6b77a0087ff8385941e5545d32ea: Le sigh, now I have a merge conflict from both of us fixing one bug.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:36): wonders how to get his repo back to the correct state",
        "b25b6b77a0087ff8385941e5545d32ea (23:37): Given the size of the bugs it can't have been more than one line",
        "b25b6b77a0087ff8385941e5545d32ea (23:37): Unless it was in test_sanitizer",
        "b25b6b77a0087ff8385941e5545d32ea (23:37): In which case you want my copy",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:37): It was etree, because I wrote a far longer commit message :P",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:37): And now I have two additional merges, and an extra fix.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:38): Why does hg have to be so hard to use!?",
        "b25b6b77a0087ff8385941e5545d32ea (23:39): It's not, it's just git brain damage",
        "b25b6b77a0087ff8385941e5545d32ea (23:39): I get the same",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:39): Oh, no, now you've fixed the one issue I fixed while I was fighting merges‚Ä¶",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:39): b25b6b77a0087ff8385941e5545d32ea: How do I find out what a push would push with hg?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:39): How do I revert to the remote head?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:39): I can't find any easy way to do either.",
        "b25b6b77a0087ff8385941e5545d32ea (23:40): hg outgoing shows what you would push",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:40): b25b6b77a0087ff8385941e5545d32ea: Nice of them to mention that in the hg push documentation.",
        "b25b6b77a0087ff8385941e5545d32ea (23:40): and hg update -r {revision} for the other thing",
        "b25b6b77a0087ff8385941e5545d32ea (23:41): Dunno if there is an equivalent of origin/master",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:41): b25b6b77a0087ff8385941e5545d32ea: That doesn't work.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:41): Because it's a parent of the revision I'm currently on.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:42): I can't actually get it back. WTF?",
        "b25b6b77a0087ff8385941e5545d32ea (23:42): I don't understand what you mean, but maybe --clean",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:42): hg up -r e46af3a0f549 is a no-op.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:42): --clean doesn't help",
        "b25b6b77a0087ff8385941e5545d32ea (23:43): And  help",
        "b25b6b77a0087ff8385941e5545d32ea (23:43): That's not what I was aiming for",
        "b25b6b77a0087ff8385941e5545d32ea (23:44): And e46af3a0f549 isn't your local HEAD?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:44): No, that's the merge of my fix for your last two commits and your last two commits.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:45): And I don't really want to push four commits that in total change zero lines of code.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:45): Because that's just fucking stupid.",
        "b25b6b77a0087ff8385941e5545d32ea (23:46): Enable the mq extension and hg strip them away?",
        "b25b6b77a0087ff8385941e5545d32ea (23:46): (note: may be dangerous)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:46): Bloody hell, how can this be so hard in hg?",
        "b25b6b77a0087ff8385941e5545d32ea (23:46): Well I don't really understand what you have done so it is hard to help",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:48): my head is a commit which merges two heads ‚Äî one is the current remote in the remote repo, one is an identical fix for the same bug which is local.",
        "b25b6b77a0087ff8385941e5545d32ea (23:50): The documentation claims that hg update -C -r works",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:50): Bullshit.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:50): a11aabeeceeae6b8cb5d12ea06b56554@vanveen:~/Documents/my-projects/OSS/html5lib/python/html5lib/tests$ hg up -C -r e46af3a0f549",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:50): 0 files updated, 0 files merged, 0 files removed, 0 files unresolved",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:51): a11aabeeceeae6b8cb5d12ea06b56554@vanveen:~/Documents/my-projects/OSS/html5lib/python/html5lib/tests$ hg log --limit 1",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:51): changeset:   1738:82a5ce2a85a4",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:52): http://www.markhneedham.com/blog/2010/04/15/hg-reverting-committed-changes/ claims I have to clone the whole repo to do it.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:52): Wow.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:53): Okay, so now I've spent the past twenty minutes trying to push fixes that you managed to push because I was fighting hg, onwards!",
        "b25b6b77a0087ff8385941e5545d32ea (23:53): You really don't *need* to",
        "b25b6b77a0087ff8385941e5545d32ea (23:55): Rule 1 of the internet is &quot;don't believe blogs that are written by people who don't understand what they are doing and mainly sourced from 'facts' cobbled together on twitter&quot;",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:56): Well, it was the best documentation I could find!",
        "b25b6b77a0087ff8385941e5545d32ea (23:56): Even the first comment is better documentation than the post!",
        "b25b6b77a0087ff8385941e5545d32ea (23:58): http://stackoverflow.com/questions/5833616/mercurial-getting-out-of-a-bad-merge",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:58): And how do I run nose under Python 3?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:58): Unless I have two separate html5lib clones running in different virtualenvs‚Ä¶",
        "a11aabeeceeae6b8cb5d12ea06b56554 (00:00): Just, wow. nose is *really* simplifying stuff.",
        "b25b6b77a0087ff8385941e5545d32ea (00:01): Huh?",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:02): b25b6b77a0087ff8385941e5545d32ea, a11aabeeceeae6b8cb5d12ea06b56554, zcorpan: yeah, what we ideally want is something that parses a WebIDL block and generates a whole bunch of tests.  But some things will still need to be tested manually, e.g., argument type conversion -- there's no way in general to figure out whether the arguments were converted correctly, or whether it's even safe to call the function with those arguments in the first place.",
        "b25b6b77a0087ff8385941e5545d32ea (00:02): Well yeah I guess any use of python 3 will require a different interpreter + set of libs",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:02): Still, we could do a whole lot based on the IDL block.",
        "70bfd0ae2cfbf2da192bddd569cf6132 (00:02): What do you think if i use data-* attributes in places where I used to use class=.  These data- attribute names have more semantic meaning to the document than just presentation. eg &lt;table data-meta&gt; for tabular data that serves as the meta or abstract of the document.",
        "b25b6b77a0087ff8385941e5545d32ea (00:03): 88d4d34a8064a4ff39fd5e144eea7762: Sounds like I have a project :)",
        "b25b6b77a0087ff8385941e5545d32ea (00:03): will now sleep",
        "a11aabeeceeae6b8cb5d12ea06b56554 (00:04): b25b6b77a0087ff8385941e5545d32ea: There's no simple way to get tests running under Python 3 and Python 2 without a lot of work using Nose.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (00:04): Without nose it was trivial.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (00:18): I'm confused as to what has happened to history as a result of that merge.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (00:18): Like, it looked fine locally, but now I'm just confused.",
        "ab7faae5d7b250ea8606486575f8f79c (00:20): Try &quot;hg view&quot; to visualise the repository, maybe?",
        "e29be37c2febc43a0d21a1f8efa351af (00:22): isn't familiar w/ hg view",
        "ab7faae5d7b250ea8606486575f8f79c (00:23): If you're familiar with gitk, it's that",
        "a11aabeeceeae6b8cb5d12ea06b56554 (00:23): That makes it look a heckuva lot cleaner than Google Code does.",
        "e29be37c2febc43a0d21a1f8efa351af (00:24): tends to use hg glog"
    ],
    "person_ids": [
        "b25b6b77a0087ff8385941e5545d32ea",
        "a11aabeeceeae6b8cb5d12ea06b56554",
        "4c681049601b3c374f1d2c0077c99049",
        "3a11d663baf9dd49fd3266d53d9bec5c",
        "edb259c0e0038f38bb200bc20c8cbf7e",
        "ab7faae5d7b250ea8606486575f8f79c",
        "88d4d34a8064a4ff39fd5e144eea7762",
        "70bfd0ae2cfbf2da192bddd569cf6132",
        "e29be37c2febc43a0d21a1f8efa351af"
    ]
}