{
    "id": "2b565d83661cae2004574ca21d9d7a0b",
    "messages": [
        "f125bffc1f0a1a40b303ba28b18f0062 (11:07): i'm a new solaris user and i tried to create a user with useradd and it said it could not create the users home directory even though i was logged in as root, i later notice i can",
        "f125bffc1f0a1a40b303ba28b18f0062 (11:07): oops",
        "f125bffc1f0a1a40b303ba28b18f0062 (11:07): this keyboard is weird to me, i later noticed i can't even mkdir /home/nocturnal",
        "7ef291c89ad915978b203d427919cfbb (11:07): nocturnal, <a href=\"http://uadmin.blogspot.com/2005/02/youre-never-far-from-home.html\">http://uadmin.blogspot.com/2005/02/youre-never-far-from-home.html</a>",
        "f125bffc1f0a1a40b303ba28b18f0062 (11:07): also i couldn't use the name nocturnal for a user or a group because it",
        "f125bffc1f0a1a40b303ba28b18f0062 (11:07): it's too long",
        "f125bffc1f0a1a40b303ba28b18f0062 (11:08): thanks jamesd",
        "17352d2e1d592b2f0610db85510f8012 (11:30): Hmm, can a ZFS filesystem have different mountpoints in different zones?",
        "7ef291c89ad915978b203d427919cfbb (11:31): I don'",
        "7ef291c89ad915978b203d427919cfbb (11:31): t see why not",
        "17352d2e1d592b2f0610db85510f8012 (11:31): Just checking... my brain is trying to shut down for the night, so things are a bit fuzzy. :)",
        "0b29b1ddcf8f089e17880d45e102c326 (11:33): Any directory, be it a plain directory or a ufs file system or a zfs file system or whatever, can be placed within any zone's file system space at any point by using the 'add fs' config option.",
        "0b29b1ddcf8f089e17880d45e102c326 (11:34): So two zones can see different directories (to them) that are in fact the same directory on the global zone.",
        "0b29b1ddcf8f089e17880d45e102c326 (11:38): If you are referring to giving a zfs file system to two different zones via the dataset option then I doubt that Solaris will allow it.  Haven't tried it, but doubt that it will work.",
        "17352d2e1d592b2f0610db85510f8012 (11:51): What I'm looking to do is have a ZFS filesystem that contains directories to hold my (and my users) mp3s... from the global zone, my desktop, I'll have complete control, but from the zone where my users will log in I only need to have them able to add files into their own directories, and for a third zone I want the filesystem read-only.",
        "0b29b1ddcf8f089e17880d45e102c326 (12:03): I'm guessing that you'll need something like 'add fs; dir=(local zone directory); special=(global directory where mp3's reside); type=lofs' on the zone where they are allowed to add mp3's, and a similar one but somehow specify that it's read-only for your third zone.",
        "17352d2e1d592b2f0610db85510f8012 (12:06): *nods* That's what I seem to be gathering from the docs, though Sun's information on this is a bit vague at points.  It mentions that the filesystem needs its mountpoint set to legacy, but doesn't say if that's necessary in the global zone or just the non-global zones...",
        "17352d2e1d592b2f0610db85510f8012 (12:07): <a href=\"http://docs.sun.com/app/docs/doc/817-2271/6mhupg6gj?a=view\">http://docs.sun.com/app/docs/doc/817-2271/6mhupg6gj?a=view</a> in particular is being confusing.",
        "0b29b1ddcf8f089e17880d45e102c326 (12:08): The &quot;mountpoint set to legacy&quot; I take as meaning a zfs dataset that added to a zone, not a plain old directory.",
        "0b29b1ddcf8f089e17880d45e102c326 (12:10): Do a typy=lofs rather then type=zfs.",
        "0b29b1ddcf8f089e17880d45e102c326 (12:10): type",
        "17352d2e1d592b2f0610db85510f8012 (12:11): What differences will that create?",
        "0b29b1ddcf8f089e17880d45e102c326 (12:11): It's not exporting the zfs dataset, just a loopback mount point to a directory.",
        "0b29b1ddcf8f089e17880d45e102c326 (12:12): ... which happens to be a zfs file system, but that shouldn't matter.",
        "17352d2e1d592b2f0610db85510f8012 (12:13): I will give that a shot tomorrow... thanks for the help, gramload.",
        "17352d2e1d592b2f0610db85510f8012 (12:13): er, gramlord",
        "17352d2e1d592b2f0610db85510f8012 (12:13): (Definitely need sleep... *sigh*)",
        "3b25664fbb0b44c0e8d816581aae95c4 (12:21): I need to restore a volume comprised of a few drives (created with sol. volume manager: growfs, metadb) that I've had to move from a box with failing hardware.  I can't get the box to boot normally; when I cancel auto boot to configure new hardware, it crashes.  What can I try to get through this?",
        "aa939d032327c8399cf2851d5b0201ed (12:27): you've moved the root disk?",
        "3b25664fbb0b44c0e8d816581aae95c4 (12:28): yeah",
        "3b25664fbb0b44c0e8d816581aae95c4 (12:29): ... the old hardware crashed",
        "3b25664fbb0b44c0e8d816581aae95c4 (12:29): (Failed, I mean)",
        "aa939d032327c8399cf2851d5b0201ed (12:29): x86 or sparc? and have you moved it to _exactly_ the same type of machine?",
        "3b25664fbb0b44c0e8d816581aae95c4 (12:30): x86.  the old machine was a p2, the new machine is an athlon xp (I don't have a machine of that type available any more)",
        "3b25664fbb0b44c0e8d816581aae95c4 (12:31): I think meta_insert will be helpful at some point, but I'm not sure what to do to get the system working so that I can try things like that",
        "aa939d032327c8399cf2851d5b0201ed (12:32): you will need to rebuild the device tree..  not sure exactly how to do that under x86, but google should be able to help",
        "3b25664fbb0b44c0e8d816581aae95c4 (12:33): k, what commands should I look up, and do I boot with special options to get to the point where I can try that?",
        "aa939d032327c8399cf2851d5b0201ed (12:33): nfi",
        "0b29b1ddcf8f089e17880d45e102c326 (12:35): MindDrive, in case you are still in the land of the waking, I just tried creating such a zfs f/s on the global zone and add fs as type=lofs into a zone and it worked fine.",
        "5587a5e42a4be7b36659b3e6122be842 (12:59): Hi"
    ],
    "person_ids": [
        "f125bffc1f0a1a40b303ba28b18f0062",
        "7ef291c89ad915978b203d427919cfbb",
        "17352d2e1d592b2f0610db85510f8012",
        "0b29b1ddcf8f089e17880d45e102c326",
        "3b25664fbb0b44c0e8d816581aae95c4",
        "aa939d032327c8399cf2851d5b0201ed",
        "5587a5e42a4be7b36659b3e6122be842"
    ]
}