{
    "id": "2f02943c619bebb883b73d048cd1b960",
    "messages": [
        "1b9ae15bb61d4c0852b5106b57b2bb0f (18:47): wonders what happened to the whatwg irc log from yesterday",
        "a924fb58d2c25874322f4e5126f608b9 (18:48): Quits: 8276c305beb1ebf1529fb8592cb24083h (n <email/>) (Read error: 110 (Connection timed out))",
        "a924fb58d2c25874322f4e5126f608b9 (18:49): That happened, over and over",
        "467f6d43402c6573237052cefcc252db (18:52): prolly someone with backups can help 8276c305beb1ebf1529fb8592cb24083h fix it if he wants to",
        "a924fb58d2c25874322f4e5126f608b9 (18:56): All he has to do is ask :)",
        "8276c305beb1ebf1529fb8592cb24083 (19:16): *asks*",
        "8276c305beb1ebf1529fb8592cb24083 (19:16): In fact, all you have to do is ask :)",
        "8276c305beb1ebf1529fb8592cb24083 (19:16): I don't really read the logs",
        "3cd30a070a8cd420f1a52db2a8b12754 (19:38): The feedback from MS seems to be largely, &quot;are you sure these are the right tags?&quot;",
        "3cd30a070a8cd420f1a52db2a8b12754 (19:39): Which after years of discussion, whatwg could only ever answer yes without looking like idiots",
        "467f6d43402c6573237052cefcc252db (19:48): good that we're not a single entity then :)",
        "1b9ae15bb61d4c0852b5106b57b2bb0f (19:58): you know, you'd do better if you took &quot;are you sure these are the right tags?&quot; to mean &quot;these tags look wrong, why do you think they are right?&quot;",
        "1b9ae15bb61d4c0852b5106b57b2bb0f (19:58): sometimes people are, amazingly, trying to be polite",
        "bd1556d73616e05539b749a6231dd993 (19:59): Any thoughts on why there is document.body but no document.head? Lots of developers append styles, etc to the head of a page and they waste time with getElementsByTagName('head'). Was this ever discussed before?",
        "bd1556d73616e05539b749a6231dd993 (20:05): although it looks like &quot;document.head&quot; shows up in the WHATWG mailing list a few times",
        "bd1556d73616e05539b749a6231dd993 (20:07): it doesn't show up in the IDL for document in the spec",
        "1b9ae15bb61d4c0852b5106b57b2bb0f (20:22): Steve: not everything in the spec is the result of years of discussion, is it?",
        "3cd30a070a8cd420f1a52db2a8b12754 (20:22): I couldn't say the age of anything",
        "1b9ae15bb61d4c0852b5106b57b2bb0f (20:25): but you did, &quot;Which after years of discussion, whatwg could only ever answer yes&quot;",
        "3cd30a070a8cd420f1a52db2a8b12754 (20:26): I do know that some elements are of significant age, given mailing list posts I've seen",
        "1b9ae15bb61d4c0852b5106b57b2bb0f (20:27): the elements Microsoft asked about?",
        "3cd30a070a8cd420f1a52db2a8b12754 (20:28): the section, article, nav, header, footer have been set for some time?",
        "3cd30a070a8cd420f1a52db2a8b12754 (20:28): The content models are the area of HTML5 I am most familiar with",
        "3cd30a070a8cd420f1a52db2a8b12754 (20:29): as I see the greatest value coming from them",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:31): 1b9ae15bb61d4c0852b5106b57b2bb0f: section, article, nav and footer have been around for a relatively long time",
        "1b9ae15bb61d4c0852b5106b57b2bb0f (20:37): if new elements from HTML4 are puzzling to MS, then some justification or pointers to the discussions about them seem like they would be useful. Just saying &quot;these have been here for years&quot; isn't very helpful.",
        "3cd30a070a8cd420f1a52db2a8b12754 (20:38): I disagree somewhat. If the wg has no problem with them for a substantial amount of time, what gives MS the right to come along towards the end of the drafting stage and use its commercial power to try and change things?",
        "3cd30a070a8cd420f1a52db2a8b12754 (20:41): I can't find a proper reference to @cite in the spec. It is mentioned and exampled, but only within the q element. It is not clear it can be used on section and other elements",
        "3cd30a070a8cd420f1a52db2a8b12754 (20:45): Infact, the spec says it cannot be. Only MS's example suggests otherwise",
        "7f9405da4034bf43083e64b57302a8e6 (20:47): 1b9ae15bb61d4c0852b5106b57b2bb0f, ms hasn't really tried to get involved in the process, not even in blocking terms like apple :i",
        "1b9ae15bb61d4c0852b5106b57b2bb0f (20:48): if you throw away all the organizational politics, the question is: are these good, justified additions to HTML",
        "1b9ae15bb61d4c0852b5106b57b2bb0f (20:48): every new feature has an amazing implementation cost for all kinds of HTML interpreters",
        "1b9ae15bb61d4c0852b5106b57b2bb0f (20:48): i mean, if you care about all of the HTML implementations in the world and not just the WhatWG browsers or the &quot;Major browsers&quot;",
        "3cd30a070a8cd420f1a52db2a8b12754 (20:49): of course, but they don't have to implement it, just as many developers won't use the new features",
        "1b9ae15bb61d4c0852b5106b57b2bb0f (20:49): so additions or changes to the language have a big cost -- even if Apple and WebKit and Mozilla and Opera and a few others have implemented",
        "1b9ae15bb61d4c0852b5106b57b2bb0f (20:49): no, not if you want to be a conforming implementation",
        "3cd30a070a8cd420f1a52db2a8b12754 (20:49): But by having an official specification with the options available, developers and UAs can use these features when possible",
        "3cd30a070a8cd420f1a52db2a8b12754 (20:50): I'm thinking of screenreaders interpreting nav. They might not, but from seeing things at standards.next, they need to",
        "3cd30a070a8cd420f1a52db2a8b12754 (20:50): It hits a user requirement right on the head",
        "1b9ae15bb61d4c0852b5106b57b2bb0f (20:50): well, look at http://en.wikipedia.org/wiki/List_of_HTML_editors",
        "1b9ae15bb61d4c0852b5106b57b2bb0f (20:50): so here are a bunch of editors of HTML",
        "1b9ae15bb61d4c0852b5106b57b2bb0f (20:51): every element you add is something that every editor needs to add if it's going to be a good HTML editor",
        "3cd30a070a8cd420f1a52db2a8b12754 (20:51): if a text editor finds that task difficult, they're doing something wrong",
        "1b9ae15bb61d4c0852b5106b57b2bb0f (20:52): you think so?",
        "3cd30a070a8cd420f1a52db2a8b12754 (20:53): considering good text editors are designed to allow user-submitted language highlighting, then yes",
        "1b9ae15bb61d4c0852b5106b57b2bb0f (20:53): these aren't all &quot;text editors&quot;, some people actually try to build editors that know about the markup language they're editing",
        "1b9ae15bb61d4c0852b5106b57b2bb0f (20:53): perhaps you're only familiar with text editing HTML?",
        "1b9ae15bb61d4c0852b5106b57b2bb0f (20:53): but there's a long list of WYSIWYG editors there too",
        "3cd30a070a8cd420f1a52db2a8b12754 (20:53): are there any elements in particular you see being a problem?",
        "1b9ae15bb61d4c0852b5106b57b2bb0f (20:54): i'm just commenting on why it would be good to take MS comments seriously, and not just dismiss them as &quot;we've talked about these for years&quot;",
        "3cd30a070a8cd420f1a52db2a8b12754 (20:55): At the same time, you need to make steps forwards",
        "1b9ae15bb61d4c0852b5106b57b2bb0f (20:56): of course, it's just that there's a balance",
        "ab7faae5d7b250ea8606486575f8f79c (21:20): Steve^: &quot;If the wg has no problem with them for a substantial amount of time, ...&quot; - that doesn't seem a very good argument - if somebody pointed out a serious problem or provided some new data, that should be taken fully into consideration even if nobody else noticed the issues for years",
        "3cd30a070a8cd420f1a52db2a8b12754 (21:20): sure, that's fine",
        "3cd30a070a8cd420f1a52db2a8b12754 (21:21): as long as they do that, rather than sound unsure",
        "ab7faae5d7b250ea8606486575f8f79c (21:23): Indeed, if they just say &quot;I don't think this sounds like a good idea&quot; then it's not actionable feedback, given that decisions supposedly aren't made on the basis of popularity at all",
        "7f9405da4034bf43083e64b57302a8e6 (21:32): 1b9ae15bb61d4c0852b5106b57b2bb0f, what new exements are bothering you at all?"
    ],
    "person_ids": [
        "1b9ae15bb61d4c0852b5106b57b2bb0f",
        "a924fb58d2c25874322f4e5126f608b9",
        "467f6d43402c6573237052cefcc252db",
        "8276c305beb1ebf1529fb8592cb24083",
        "3cd30a070a8cd420f1a52db2a8b12754",
        "bd1556d73616e05539b749a6231dd993",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "7f9405da4034bf43083e64b57302a8e6",
        "ab7faae5d7b250ea8606486575f8f79c"
    ]
}