{
    "id": "30d2a7f08dbe329a8f7f9b4a94589c75",
    "messages": [
        "85793dd1775fbc0c0562493f069bcaa2 (13:05): arun around?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:14): 85793dd1775fbc0c0562493f069bcaa2: arun is hardly ever around on IRC",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:15): 85793dd1775fbc0c0562493f069bcaa2: if you want to real-time talk with him, maybe e-mail him first and get his contact info",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:15): maybe he prefers some other chat mechanism (skype or whatever)",
        "85793dd1775fbc0c0562493f069bcaa2 (13:22): a9b326df4e6da61c5b6f5e1058be83a2: nevermind, it's not a real hurry",
        "85793dd1775fbc0c0562493f069bcaa2 (13:22): but the Unite thing is the reason for us wanting a traditional file I/O spec",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:23): aha",
        "85793dd1775fbc0c0562493f069bcaa2 (13:24): (and apologies if I've been unrelenting on certain security issues -- I just don't want the web security model to infest the server side)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:29): 85793dd1775fbc0c0562493f069bcaa2: I don't think anybody with an open mind would expect you to apologize for that. and you don't otherwise owe any apologies to those who've been trotting out the narrow-minded &quot;it's not the Web&quot; rhetoric",
        "56ef338f9fcf9452fc833a005325025e (13:30): but.... it's not the web!!!1",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:30): heh",
        "56ef338f9fcf9452fc833a005325025e (13:31): I don't think apologies are needed, the security issues are a cause of concern whether unite is there or not",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:32): if the &quot;it's not the Web&quot; thing were phrased instead as, &quot;it's not the browser security model&quot;, then the right response is, Yeah, well, no shit, Sherlock.",
        "56ef338f9fcf9452fc833a005325025e (13:32): besides, since when do we apologise around here?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:32): saying &quot;it's not the Web&quot; is a good way to offer an invitation to a fistfight",
        "56ef338f9fcf9452fc833a005325025e (13:32): well that's the point isn't it?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:33): 56ef338f9fcf9452fc833a005325025e: are you calling me a sissy?",
        "56ef338f9fcf9452fc833a005325025e (13:33): that being said, I still think that we ought to stick to the browser security model as much as possible ‚Äî if things become too different we lose the advantage of known technology",
        "56ef338f9fcf9452fc833a005325025e (13:33): a9b326df4e6da61c5b6f5e1058be83a2: do I need to call you that? I thought it was rather obvious",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:34): heh",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:34): is it my purse?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:34): because it's not a purse",
        "56ef338f9fcf9452fc833a005325025e (13:34): more like the haircut",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:34): it's a &quot;men's bag&quot;",
        "56ef338f9fcf9452fc833a005325025e (13:34): it's a manpouch!",
        "56ef338f9fcf9452fc833a005325025e (13:34): I have one too",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:36): I saw this dude today that instead of a man bag he was carrying this sort of miniature aluminum attache",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:36): which actually made him look even more like a little miss prissy",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:37): because it's like, dude, if you're going to carry an attache, carry a real one",
        "85793dd1775fbc0c0562493f069bcaa2 (13:37): a9b326df4e6da61c5b6f5e1058be83a2: my point is that I've been unrelenting, but unwilling to explain why",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:38): 85793dd1775fbc0c0562493f069bcaa2: that's OK, nobody understands you when you explain stuff anyway",
        "85793dd1775fbc0c0562493f069bcaa2 (13:38): :D",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:38): and being unrelenting is the only way to survive around here",
        "85793dd1775fbc0c0562493f069bcaa2 (13:39): 56ef338f9fcf9452fc833a005325025e: re serverjs: I'm not really all that sure serverjs is the right thing",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:39): because the other bastards will eat you alive if you ever un-unrelent",
        "85793dd1775fbc0c0562493f069bcaa2 (13:39): at least not after having looked at a partial implementation like jack.js",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:40): 85793dd1775fbc0c0562493f069bcaa2: anyway, congrats on Unite -- seriously nice piece of work. I'm looking forward to seeing what kinds of things folks end up doing with it.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:43): has to go.. will barge back in again later on my train ride back home",
        "56ef338f9fcf9452fc833a005325025e (13:45): 85793dd1775fbc0c0562493f069bcaa2: I don't know, I thought I should make a feature request before trying it",
        "56ef338f9fcf9452fc833a005325025e (13:45): I was just thinking that it's a potentially nice set of APIs to produce web services",
        "56ef338f9fcf9452fc833a005325025e (13:45): nice work, I agree",
        "56ef338f9fcf9452fc833a005325025e (13:45): (I'm running it now)"
    ],
    "person_ids": [
        "85793dd1775fbc0c0562493f069bcaa2",
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "56ef338f9fcf9452fc833a005325025e"
    ]
}