{
    "id": "31a5106456dc800d6baf4264879b4c03",
    "messages": [
        "f139aba52f9fa1394b4034a7954b2220 (06:54): wow, ARIA Role is worse than I thought. It's a band-aid solution written from an ivory tower, seemingly without seriously considering any authoring issues.",
        "f139aba52f9fa1394b4034a7954b2220 (06:55): (I'm fairly sure I'll get flamed for saying that, but oh well)",
        "77db19c1dd94414f199e58aa6ca1827f (06:59): f139aba52f9fa1394b4034a7954b2220: can you name the accessibility experts you consulted before coming to that conclusion?",
        "139513027e8e90b5582cbc68fc733884 (07:00): actually, I do think some sort of tagging system for accessibility roles is useful, if only because web applications will want to get ahead of what browsers support natively",
        "139513027e8e90b5582cbc68fc733884 (07:00): but I think ARIA Role is not a very good approach to doing that",
        "f139aba52f9fa1394b4034a7954b2220 (07:00): I reached my conclusion from reading the spec",
        "139513027e8e90b5582cbc68fc733884 (07:01): f139aba52f9fa1394b4034a7954b2220: I was being needlessly sarcastic there",
        "f139aba52f9fa1394b4034a7954b2220 (07:02): I know, but there are IRC log readers who might want the answer anyway",
        "139513027e8e90b5582cbc68fc733884 (07:03): I agree with you, based also on reading the spec",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:03): mumbles something about having been saying that for years",
        "139513027e8e90b5582cbc68fc733884 (07:03): although I think the intent is partly that JavaScript toolkit libraries will do all the heavy lifting, so the scope of authoring issues would be limited",
        "f139aba52f9fa1394b4034a7954b2220 (07:04): BTW, wairole:grid is also addressed by &lt;datagrid&gt;",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:04): as far as i can tell, there isn't anything in wairole that isn't catered for by html5",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:05): (i used the wairole spec as a checklist a year ago or so and made sure)",
        "139513027e8e90b5582cbc68fc733884 (07:05): tristate checkboxes?",
        "f139aba52f9fa1394b4034a7954b2220 (07:05): unfortunately, we can't rely on javascript toolkits (or any other tools) saving authors from the complexity",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:06): oh right, tristate checkboxes were on the list for wf2 but got bumped to wf3 because i couldn't work out how to submit them neatly",
        "f139aba52f9fa1394b4034a7954b2220 (07:06): 69b0d3dfe919a6b860a9fac82de52a7e, are they somewhere in the whatwg.org/issues/ list?",
        "139513027e8e90b5582cbc68fc733884 (07:06): how do normal checkboxes submit?",
        "f139aba52f9fa1394b4034a7954b2220 (07:07): when checked, they submit name=value.  when unchecked, they submit nothing",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:07): lachy: they're probably in the big comment at the bottom of wf2's source",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:07): what lachy said",
        "139513027e8e90b5582cbc68fc733884 (07:07): the third (indeterminate/mixed) state of tristate checkboxes is mainly useful as an initial state when a group has mixed state and can be toggled on and off as a whole",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:07): there's an easy solution (have a second name for the mixed state) but i don't really like that",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:08): 139513027e8e90b5582cbc68fc733884: yeah but you still have to distinguish between left-in-initial-state and unchecked vs checked",
        "f139aba52f9fa1394b4034a7954b2220 (07:08): I'm not sure mixed state checkboxes should be submitted, since they're usually representative of a group of other checkboxes, and so their state can be determined by examining the state of the others",
        "139513027e8e90b5582cbc68fc733884 (07:08): mixed-state checkboxes mainly seem useful for cases where check/uncheck will be handled by script",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:09): possible",
        "139513027e8e90b5582cbc68fc733884 (07:09): what (if anything) they submit can't just be left unspecified",
        "f139aba52f9fa1394b4034a7954b2220 (07:09): indeed. AFAIK, there is no way for a user to explicity set an individual checkbox to a mixed state in any UI I've seen.",
        "139513027e8e90b5582cbc68fc733884 (07:09): but it's possible that not submitting (just like an unchecked one) might be workable",
        "139513027e8e90b5582cbc68fc733884 (07:10): maybe not though",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:10): well we'll see",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:10): wf3 is a far future thing",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:10): and demand for tristate is low",
        "f139aba52f9fa1394b4034a7954b2220 (07:11): the other alternative would be to introduce an attribute &lt;input type=checkbox name=x value=&quot;foo&quot; mixed=&quot;bar&quot;&gt;, where x=foo is submitted in the normal case and x=bar for the mixed case",
        "139513027e8e90b5582cbc68fc733884 (07:11): I'm probably going to suggest form features for HTML5 that aren't part of WF2 at some point",
        "139513027e8e90b5582cbc68fc733884 (07:12): but I don't know if tristate would be high on the list",
        "f139aba52f9fa1394b4034a7954b2220 (07:12): 139513027e8e90b5582cbc68fc733884, are you or someone else from apple ever going to get around to providing details about placeholder=&quot;&quot;? I recall that you once said someone would do so",
        "139513027e8e90b5582cbc68fc733884 (07:12): f139aba52f9fa1394b4034a7954b2220: I will remind the relevant person when she gets back from vacation",
        "f139aba52f9fa1394b4034a7954b2220 (07:13): ok",
        "139513027e8e90b5582cbc68fc733884 (07:13): but I'm not sure there's a whole lot to say about it",
        "139513027e8e90b5582cbc68fc733884 (07:13): &lt;input type=&quot;search&quot;&gt; is probably something that will actually need revision to be spec-worthy, and explication of current behavior",
        "f139aba52f9fa1394b4034a7954b2220 (07:13): I think most of placeholder is fairly obvious, but in case there's some not-so-obvious detail about it",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:14): f139aba52f9fa1394b4034a7954b2220: yeah i suggested that easy solution above :-)",
        "139513027e8e90b5582cbc68fc733884 (07:14): I don't think there is anything non-obvious about placeholder",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:15): placeholder will be done before wf3 i'm sure",
        "f139aba52f9fa1394b4034a7954b2220 (07:15): one thing about tristate checkbox that would need to be addressed is that typically, when checking one, the states of the related group of checkboxes is usually toggled too.",
        "139513027e8e90b5582cbc68fc733884 (07:16): it might be possible to come up with a nice solution for that in the context of datagrid at least",
        "139513027e8e90b5582cbc68fc733884 (07:18): I think there's definitely controls that would be more useful than some of the half-dozen different date controls in WF2",
        "139513027e8e90b5582cbc68fc733884 (07:19): but I will save it until the current forms stuff is integrated into the main spec",
        "139513027e8e90b5582cbc68fc733884 (07:19): (presumably after the Forms Task Force finishes deciding what it is supposed to do and then doing it)",
        "f139aba52f9fa1394b4034a7954b2220 (07:20): 139513027e8e90b5582cbc68fc733884, is the forms task force ever going to get started?",
        "139513027e8e90b5582cbc68fc733884 (07:21): f139aba52f9fa1394b4034a7954b2220: we're waiting on the sixth person to give a sign of life",
        "139513027e8e90b5582cbc68fc733884 (07:21): f139aba52f9fa1394b4034a7954b2220: there was some rumor that he might be on vacation",
        "139513027e8e90b5582cbc68fc733884 (07:21): though I must admit so far it is the slowest-acting six-person group I have ever seen",
        "f139aba52f9fa1394b4034a7954b2220 (07:22): hmm. there are 10 emails pending user approval for public-forms-tf. I can't see what they are though, I don't have permission for that. Maybe they're trying to send but can't?",
        "139513027e8e90b5582cbc68fc733884 (07:22): I would assume that shouldn't happen for people who are on the list",
        "f139aba52f9fa1394b4034a7954b2220 (07:24): yeah, unless &quot;pending user approval&quot; means that they haven't yet agreed to the W3C's email archive policy, which needs to be done before posts will go through on any list",
        "139513027e8e90b5582cbc68fc733884 (07:27): Sebastian has been an XForms WG member for some time (and I think maybe also XHTML2 WG)",
        "139513027e8e90b5582cbc68fc733884 (07:27): I'd be surprised if he hasn't sent any email",
        "f139aba52f9fa1394b4034a7954b2220 (07:29): yeah, he has, I just checked, so that can't be the reason",
        "d3ca5dde60f88db606021eeba2499c02 (07:47): can confirm",
        "d3ca5dde60f88db606021eeba2499c02 (07:47): the 10 mails &quot;pending approval&quot; are all spam",
        "d3ca5dde60f88db606021eeba2499c02 (07:47): Dept.of Offshore Mortgage Services !",
        "d3ca5dde60f88db606021eeba2499c02 (07:48): Dearest Be Loved One",
        "f139aba52f9fa1394b4034a7954b2220 (07:49): thanks d3ca5dde60f88db606021eeba2499c02",
        "d3ca5dde60f88db606021eeba2499c02 (07:49): etc etc",
        "d3ca5dde60f88db606021eeba2499c02 (07:49): np",
        "f139aba52f9fa1394b4034a7954b2220 (07:49): do they get automatically purged after a while?",
        "d3ca5dde60f88db606021eeba2499c02 (07:50): yes, I think so",
        "d3ca5dde60f88db606021eeba2499c02 (07:50): I think the people have a week following the initial challenge",
        "d3ca5dde60f88db606021eeba2499c02 (07:53): the assumption being that if they send mail, they're around and aren't going to disappear for a week moments after sending their first mail to a list"
    ],
    "person_ids": [
        "f139aba52f9fa1394b4034a7954b2220",
        "77db19c1dd94414f199e58aa6ca1827f",
        "139513027e8e90b5582cbc68fc733884",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "d3ca5dde60f88db606021eeba2499c02"
    ]
}