{
    "id": "35b2b9f50c13f3a7a8b6701b49b16990",
    "messages": [
        "69b0d3dfe919a6b860a9fac82de52a7e (07:35): 227a9a17d1db3f8e5c71a150345fb2a6: here now",
        "227a9a17d1db3f8e5c71a150345fb2a6 (07:58): 69b0d3dfe919a6b860a9fac82de52a7e, D3E: I don't have a strict timetable, but I now have more time to spend on it, and will take a cue from implementer review what issues they think are outstanding and what they want changed, will resolve conflicts and propose solutions, and will address the general case for host language treatment of events",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:58): cool",
        "227a9a17d1db3f8e5c71a150345fb2a6 (07:58): as I recall, you didn't want me to address that last time I brought it up, though...",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:59): oh?",
        "227a9a17d1db3f8e5c71a150345fb2a6 (07:59): that was my impression",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:59): well, shows what i know :-)",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:01): btw, what's the plan for actually defining the requirements for things like mouse and key events, is that in dom3 events?",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:02): 69b0d3dfe919a6b860a9fac82de52a7e: as in Use Cases and Requirements?",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:03): as in, the text that says &quot;when a user presses down on a key on the keyboard, the user agent must send a keydown event that...&quot; or whatever",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:03): I don't know that I was that systematic about it before, since I was picking up a spec that I thought was nearly done... but I see that we would benefit from having those well-defined beforehand",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:03): oh, hmm",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:03): oic",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:04): would probably make sense to have that in a separate spec, but i'd imagine that e.g. for mouse events it would be the same spec that defines MouseEvent",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:04): I think that it would be best to define that in the D3E spec, and then mention that a host language can override or repurpose them for that specific case",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:04): how does that strike you?",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:05): to me, it might clarify the context in which the event was &quot;designed&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:05): seems independent of host language, since DOM3 Events presumably would work unchanged whether the Document object had any child nodes or not",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:06): doesn't really understand the concept of &quot;host language&quot; these days",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:06): seems somewhat anachronistic",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:06): well, I might be stretching the term a bit",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:07): I use it to mean, another spec that reuses this spec as a sort of integrated module",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:07): but I don't see that as an important point",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:08): basically, I'd expect mouse events to function pretty much uniformly across SVG, HTML, MathML, etc.",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:08): are we expecting dom3 events to be reused, rather than just implemented as is?",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:09): reuse in that way sounds scary; i agree that we'd want it to behave uniformly everywhere",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:09): but certain things, like the &quot;load&quot; event, have idiosyncratic behavior in HTML (eg)",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:09): and thus HTML woudl define that behavior as a sort of extension to D3E",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:09): well presumably we'd want that event to work the same regardless of what the root element happens to be",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:10): that said, I'm not totally committed to that, it's just the way I had been thinking about it",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:10): though that would mean defining the xml parser in a more useful way than currently, i guess",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:10): isn't sure what to do about the dependencies on an xml parser spec in html5",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:10): hmmm... load works differently in HTML vs. SVG, iirc",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:10): huh",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:10): i thought SVG fired SVGLoad, not load",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:11): if it's a 'load' event, how does a UA know how to fire it?",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:11): maybe this should indeed be handled by the dom3 events spec somehow",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:12): though really neither xhtml nor svg should be firing the 'load' event, that should just be fired by a generic &quot;xml parsing for scripted uas&quot; spec",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:12): http://www.w3.org/TR/SVGTiny12/interact.html#LoadEvent",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:12): hm",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:12): is that defined anywhere?",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:13): (or that description all there is?)",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:13): s/or/or is/",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:14): I think that's all",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:15): what do you think is missing?",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:17): well there are no requirements there, for one",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:17): so nothing testable",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:17): even if we pretend that the descriptive text is normative, it's also very vague, e.g.:",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:17): what does &quot;finishes loading the element&quot; mean?",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:17): what does &quot;after&quot; mean?",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:18): is the event fired synchronously or asynchronously?",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:18): what is the target of the event?",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:19): what exactly are the dependent resources?",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:19): does it trigger when the element is reinserted? some of the text suggests not, some suggests it is",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:21): I understand that you prefer more precise wording, but I question whether that is strictly necessary for an implementer to create an interoperable implementation of the load event...",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:21): I think some of the questions there are not a big deal, and a reasonable reading of the text would satisfy most developers",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:22): well without violating the w3c process, how will svg 1.2 tiny get to CR if the spec isn't testable?",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:22): that said, that text is very old and when we write SVG Core we will be more precise",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:22): get past CR, i mean",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:23): apologises for being passive-aggressive",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:24): I don't think we're headed in a productive direction, so let's save that discussion for another time",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:24): anyway, html has taught us that if a technology gets widely deployed, this kind of detail will get locked down, de-facto if not de-jure, and if it's de-facto then it'll be mostly random",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:24): wrt mutation events, I'm getting mixed signals from Mozilla and script library folks",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:24): the mess that people complain about in html is basically all due to the people writing the specs in the past saying &quot;I think some of the questions there are not a big deal, and a reasonable reading of the text would satisfy most developers&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:25): re mutation events; what are the options on the table?",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:26): on the one hand, Moz has said they are fine with some of the mutation events staying as-is in the spec (which is what script librarians want), but they then say they won't implement them... I don't want to put features in D3E that Moz won't implement",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:26): well that seems like an easy choice then",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:26): 69b0d3dfe919a6b860a9fac82de52a7e, it's been a while, so why don't I review and summarize the issues, and send them to the webapps list?",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:26): that might help, yeah",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:27): to make progress on the html5 spec i don't really care what the mutation event spec says, i just need it to be precise so i know how to fiddle with the rules, basically",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:27): understood",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:27): what's your timetable",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:27): ?",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:27): there's some things where we want them to not fire at all and some where we want them to fire in particular ways, and right now i just don't know how to do it",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:27): well, html5 is supposed to be locked down and done by october",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:27): I can &quot;finalize&quot; parts of D3E in advance",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:27): i expect to have most of this stuff done by end-of-q2",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:28): ok, I can work with that",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:28): cool",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:28): I will aim to have the big issues solved (modulo LC review) in Q1",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:28): or mid-q2",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:28): okie dokie",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:29): i never thought i'd see the day where html5's progress might be tied up waiting on a dependency on another spec :-P",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:29): I will write up a summary of outstanding issues, and ask for review on the other parts",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:29): cool",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:29): I have no interest in holding up HTML5, I'll do my best",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:30): wrt Websockets, aiui, some of that will be done by IETF, is that right?",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:30): and what is &quot;left over&quot;?",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:30): yeah the non-api parts are being shipped off to an ID",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:30): the API basically",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:30): idl block and related requirements",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:31): will you be editor?",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:32): or do you need someone else?",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:32): I don't much care where it happens... I'm curious who would have a problem with it being done in either WebApps or HTML WG?",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:33): most of the players are in both WGs",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:33): I'm happy to have it added to WebApps, if that helps",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:34): and I can put together a revised charter to that effect",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:34): i can edit it, there won't be much to it",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:34): ok",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:34): i don't mind where it is, it just needs a home for patent protection",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:35): i'm happy to continue assuming it's in the htmlwg charter, after all, it's already in the html5 spec at the moment",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:35): but the last time i did that (Workers) the spec ended up being moved",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:35): so i figured i'd just check first :-)",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:36): any help would be greatly appreciated",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:36): in all likelihood the spec will be done by the time the charter is approved, so if you need a timetable you can put FPWD, LC, and CR all within 3 months of each other",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:36): as in, three months apart",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:37): hmmm... looking at the charter, we have the Network API spec, already in scope (left over from removal from the SVG 1.2 spec)",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:37): #",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:37): Network Communication API (Network API)",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:37): a socket interface to enable &quot;push&quot; content update",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:37): would that suffice?",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:37): close enough for me!",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:37): shakes on it",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:37): well, that was easy!",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:37): that's probably actually exactly what this was intended for -- i expect that came from the TCPConnection API in WHATWG",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:38): which is what WebSocket came from",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:38): no, I put that in there from the original requirement in the SVG 1.2 spec",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:38): aah, cool",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:38): well, this won't do quite the same as the networking stuff from svg",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:38): that was raw sockets iirc",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:38): we knew it needed doing, matter of convergence",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:39): so there's no draft yet for this? i'm not stepping on anyone's editorship toes or anything?",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:39): i've no desire to cause more trouble than necessary...",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:39): actually, it was just loosely defined to take advantage of existing mechanisms in phones, mostly Java stuff... it was intended as a wrapper on native functionality",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:40): 69b0d3dfe919a6b860a9fac82de52a7e: I will check on drafts and potential conflicts, but I will try to smooth any of that away and hand it over to you",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:40): cool",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:40): let's assume there won't be any problems that can't be solved",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:40): let me know if/when i should mail anything to the list",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:40): ok, I should know this week (hopefully tomorrow)",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:40): my plan is to have the websocket text wrapped up by end-of-q1",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:41): cool",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:41): (and then just watch them painfully go through the ietf and w3c processes)",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:59): ok, man, I will dig into the Network/WebSockets API stuff and let you know ASAP",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:59): cool, thanks",
        "227a9a17d1db3f8e5c71a150345fb2a6 (08:59): but now, I must lay the body down and let the weary bones rest... nn",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:00): nn"
    ],
    "person_ids": [
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "227a9a17d1db3f8e5c71a150345fb2a6"
    ]
}