{
    "id": "35b37071709f0b72a1a90c5adc477ddc",
    "messages": [
        "69b0d3dfe919a6b860a9fac82de52a7e (00:48): 65325d50b2e25aca54bc871b89758c9c: why does this api change drawFocusRing() to draw the focus ring even if you give it an element that isn't focused? (the CP checks the ancestor chain as well)",
        "65325d50b2e25aca54bc871b89758c9c (00:50): 69b0d3dfe919a6b860a9fac82de52a7e: that I do not know - I guess I should have read the text and diffed it against the spec instead of just relying on the bullet points",
        "65325d50b2e25aca54bc871b89758c9c (00:50): one thing I can imagine is a single element may be focused but you want to draw focus rings around all the pieces; but that doesn't really make sense, you could just construct a path like that in the first place",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:53): Basically, it seems like when the issue is &quot;you should design an API for this&quot;, the decision process is extremely ill-suited, as it requires people to bundle up the &quot;I think this is an area we should cover&quot; with a specific API design.",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:53): that the system is broken is clear",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:54): Well, I mean it's *extra* broken when the issue needs API design work.",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:54): Because you have people with no API design skills being forced to design an API so that they have a precise description of the desired change.",
        "1f58faf0d058f303f30239a369808167 (00:54): http://marcdrummond.com/xhtml/2011/04/26/when-standards-go-awry",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:54): And then that precise API is required to be pulled into the spec.",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:55): it's not just api design skills that are lacking. i presume i'm supposed to fix grammatical mistakes but i've no idea what this sentence that i'm supposed to add is trying to say: &quot;If the given element is focused or a descendant of the element with focus, draws a focus ring around the current path, following the platform conventions for focus rings.&quot;",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:56): That's clear to me (I dunno if it's sensical in context).",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:56): oh, wait, i think i understand what it's saying",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:56): it's just overly long",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:56): ok",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:58): this api doesn't make sense",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:58): what happens if someone just calls drawFocusRing() but nothing else?",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:58): does it not magnify the focused element?",
        "23d8cf33a2e08de91349aa35ea0a4749 (01:07): because some applications manage focus for their children",
        "23d8cf33a2e08de91349aa35ea0a4749 (01:07): what does not make sense is the fact that your existing api falls through when someone draws custom focus rings and a special system setting is not set to draw a focus ring a certain way",
        "23d8cf33a2e08de91349aa35ea0a4749 (01:08): when that happens NO magnifier gets notified of the change",
        "23d8cf33a2e08de91349aa35ea0a4749 (01:08): if you had read the change proposal you would have seen the bug.",
        "23d8cf33a2e08de91349aa35ea0a4749 (01:09): candrawcustom is stupid anyway.",
        "23d8cf33a2e08de91349aa35ea0a4749 (01:10): all you need to do is set up your drawing path before making the call and if the system has not configured a specific drawing style drawfocusring simply draws it the way the author has specified.",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:12): yo, 23d8cf33a2e08de91349aa35ea0a4749, while you're here, can I request that you send your emails as plaintext instead of HTML?  Your emails are distractingly and sometimes unreadably styled.",
        "23d8cf33a2e08de91349aa35ea0a4749 (01:12): how do you mean?",
        "23d8cf33a2e08de91349aa35ea0a4749 (01:13): are you wanting to have monospaced fonts?",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:13): Your emails are HTML.  Your editting system sets custom font and size, and occasionally color, which makes it hard for me to rea.",
        "23d8cf33a2e08de91349aa35ea0a4749 (01:13): Lotus Notes. - I will see what I can do, sure",
        "23d8cf33a2e08de91349aa35ea0a4749 (01:14): thanks for letting me know",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:14): The color thing is really bad - occasionally the text is black or dark blue, which is unreadable in my Gmail theme of green-text-on-black",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:14): Cool.",
        "23d8cf33a2e08de91349aa35ea0a4749 (01:14): wow. that would dreadful",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:15): Yeah.  It's often hard to tell whether your text is 'black' or 'automatic' in most GUI editors, unless you manually check the text color.",
        "23d8cf33a2e08de91349aa35ea0a4749 (01:15): I updated to a new version of Notes this past week. so, something must have been enabled i did not notice.",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:16): Nah, this is something that's always been true.",
        "23d8cf33a2e08de91349aa35ea0a4749 (01:16): hmm. ok",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:16): Like I said, the color thing doesn't always happen; it's occasional.  The font/size thing, though, is always true, and somewhat randomly inconsistent - one email will be slightly larger font-size for no reason I can tell.",
        "23d8cf33a2e08de91349aa35ea0a4749 (01:17): ugh. that is distracting. - sorry",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:17): It's cool.  Most email editors can be told to send plaintext instead of HTML.  That makes everything easy, because then there's no way for accidental styling to creep in.",
        "23d8cf33a2e08de91349aa35ea0a4749 (01:19): digging into notes now",
        "cc7bcfbc58c467939c5987584fc882cb (01:19): emails should be plain text",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:20): cc7bcfbc58c467939c5987584fc882cb: I'm of the opinion that email readers should be like RSS readers, and just strip/ignore styles from the document.",
        "cc7bcfbc58c467939c5987584fc882cb (01:21): my email client is configured to show messages as plain text",
        "cc7bcfbc58c467939c5987584fc882cb (01:21): images are also not shown :&gt;",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:21): Gmail used to have a lab to do that, but they removed it. &gt;_&lt;",
        "ab7faae5d7b250ea8606486575f8f79c (01:22): 1f8387eb43f131d7c309a90a4e36b5cb: That'd break the reading of some emails that only differentiate quoted text by style",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:22): ab7faae5d7b250ea8606486575f8f79c: People who do that should be shot.  Simple. ^_^&amp;",
        "cc7bcfbc58c467939c5987584fc882cb (01:22): another problem solved :)",
        "23d8cf33a2e08de91349aa35ea0a4749 (01:23): tab, just send you an email let me know if it came out alright",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:23): It's still being sent as HTML.",
        "23d8cf33a2e08de91349aa35ea0a4749 (01:23): ugh",
        "23d8cf33a2e08de91349aa35ea0a4749 (01:23): ok",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:24): And, because email readers are lowest-common-denominator, it's styled with &lt;font&gt;. ^_^",
        "23d8cf33a2e08de91349aa35ea0a4749 (01:26): yes. I chose plain text for internet email. need to dig further.",
        "06cb330920ae58e1614c9145d983b3d6 (01:33): heh, my #1 problem with gmail is there's no way to restrict what people can do with fonts, particularly font size",
        "06cb330920ae58e1614c9145d983b3d6 (01:33): people on yahoo mail in particular seem to like sending mails in 35pt",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:34): YES",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:34): argh",
        "06cb330920ae58e1614c9145d983b3d6 (01:34): which isn't really their fault--I tried searching to find out how to reset it (to give one of them a hint), and I couldn't even figure it out",
        "da5121879fff54b08b69ec54d9ac2bf6 (01:34): mutt sucks, but at least it got that part right. (c:",
        "da5121879fff54b08b69ec54d9ac2bf6 (01:34): is an unhappy mutt user.",
        "a3f19f90edf0a0893c7847d08016abe3 (01:35): isn't every mutt user an unhappy mutt user? :)",
        "da5121879fff54b08b69ec54d9ac2bf6 (01:36): I would think so. (Not that the alternatives are any better. Email sucks. :)",
        "fd9ef1223e855714294498ebfde79f98 (01:46): gnus ftw :)",
        "da5121879fff54b08b69ec54d9ac2bf6 (01:52): fd9ef1223e855714294498ebfde79f98: As an atheist, I'm keeping a safe distance from the Church of Emacs. (c:",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:56): Darn, why is our EventSource implementation broken?  Now I know why I couldn't ever get it to work.",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:57): It just polls the page for you.  If you hold the connection open and send data incrementally, there'll never be a 'message' event.",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:57): That's kinda useless."
    ],
    "person_ids": [
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "65325d50b2e25aca54bc871b89758c9c",
        "1f8387eb43f131d7c309a90a4e36b5cb",
        "1f58faf0d058f303f30239a369808167",
        "23d8cf33a2e08de91349aa35ea0a4749",
        "cc7bcfbc58c467939c5987584fc882cb",
        "ab7faae5d7b250ea8606486575f8f79c",
        "06cb330920ae58e1614c9145d983b3d6",
        "da5121879fff54b08b69ec54d9ac2bf6",
        "a3f19f90edf0a0893c7847d08016abe3",
        "fd9ef1223e855714294498ebfde79f98"
    ]
}