{
    "id": "37797301158af9b449aa88b00407aec1",
    "messages": [
        "50d471f8bf9335785753faf95141a906 (17:44): ok, which is better? I'm making a templating system which \\should\\ stop a template coder from ever touching PHP however I need some in there, so do I add the PHP or do I use str_replace to add the PHP with their {{content}} tag and eval it ?",
        "50d471f8bf9335785753faf95141a906 (17:44): eval is pretty evil :P",
        "84769583c3bdd642c505babd84d5ba52 (17:47): lovely",
        "84769583c3bdd642c505babd84d5ba52 (17:48): That stats page is funny ...",
        "84769583c3bdd642c505babd84d5ba52 (17:50): You'd have to be pretty dam neurotic to write something like that.",
        "84769583c3bdd642c505babd84d5ba52 (17:50): Obsessive to say the least.",
        "0f2635bba9ae4c5f76c294290d4b6675 (18:00): I'm curious.  I'm fairly new to PHP and I've been developing a site that connects to a MySQL database.  So far the only way that I've determined to be able to connect to the database is to store the username and password in a file in plaintext.  This seems like a bad idea to me.  Is there some other way that I'm not seeing or thinking of?  The only altername idea I had was to encrypt the username and password, and hard-code the decryption ke",
        "0f2635bba9ae4c5f76c294290d4b6675 (18:00): ys into the program, which seems to not really be much better off than just using plain text.  Any more experienced PHP developers care to chime in on this?",
        "84769583c3bdd642c505babd84d5ba52 (18:01): miyako: Unfortunately that is the only way I can think of.",
        "84769583c3bdd642c505babd84d5ba52 (18:01): However ....",
        "84769583c3bdd642c505babd84d5ba52 (18:01): I recall that there is a way to encode your entire php file.  Don't ask me how it's done tho.",
        "0f2635bba9ae4c5f76c294290d4b6675 (18:04): yeah, so far the best thing I've been able to think of is to tell the server admin that the site is going to to just make sure to get the permissions set right so that nobody can read the config file that has the database username and password, and to make sure to set the database up such that compromising that database username and password won't compromise any other data",
        "0f2635bba9ae4c5f76c294290d4b6675 (18:04): luckily, nothing that sensitive is being stored in the database for this project, but it just sort of bothered me as a potential security hole",
        "6f54965bc576611e4bf2a4c212310376 (18:04): miyako: <a href=\"http://scriptuncle.nl/index.php/FUN\">http://scriptuncle.nl/index.php/FUN</a>:Passwdbf has some pointers to extensions that can help obscuring your data.",
        "0f2635bba9ae4c5f76c294290d4b6675 (18:05): thanks CyaNox",
        "6174db44a96f0292f19bf5646961a830 (18:05): miyako: just make php run as a different user, i have admin pages for one project running as httpda:httpda and the permissions are set to 0700",
        "6174db44a96f0292f19bf5646961a830 (18:05): miyako: other users files are run as them so they wont be able to read the files",
        "6174db44a96f0292f19bf5646961a830 (18:06): keep connection strings in php files all the time, its the systems security that it relys on",
        "0f2635bba9ae4c5f76c294290d4b6675 (18:09): I couldn't actually hard code the connection information into the code, because the people the code is for said basically &quot;we don't want to have to ever edit the code&quot;, so I put the connection info in an ini file and wrote a simple program to allow them to configure it without having to edit code",
        "6f54965bc576611e4bf2a4c212310376 (18:11): Well putting configuration options in a php file is usually better. And editing that can be as easy as editing a .ini file.",
        "6f54965bc576611e4bf2a4c212310376 (18:11): Also take in account that its best to put the configuration outside your webroot.",
        "0f2635bba9ae4c5f76c294290d4b6675 (18:13): yeah, what I was thinking of doing is having two config files, one that is the actual config file, and another file that tells the program where to find the config file, then set up an install scrip that will install the php files and put the actual config file in /etc/sysconfig",
        "0f2635bba9ae4c5f76c294290d4b6675 (18:13): but allow the admin to actually put the config file wherever they want",
        "0f2635bba9ae4c5f76c294290d4b6675 (18:13): I suppose with a little bit of more complex scripting I could just edit the code that looks for the file, but I'm no wiz at shell scripting either",
        "84769583c3bdd642c505babd84d5ba52 (18:17): miyako: still with that setup /etc/sysconfig would need to be world readable ...",
        "0f2635bba9ae4c5f76c294290d4b6675 (18:18): ...yeah, I didn't think of that",
        "0f2635bba9ae4c5f76c294290d4b6675 (18:18): just kind of thinking about ideas aloud",
        "84769583c3bdd642c505babd84d5ba52 (18:18): The problem is trust.",
        "84769583c3bdd642c505babd84d5ba52 (18:18): Do you trust the people you share the database with?",
        "84769583c3bdd642c505babd84d5ba52 (18:18): Er ... server",
        "84769583c3bdd642c505babd84d5ba52 (18:18): It's kinda funny you mention that.",
        "0f2635bba9ae4c5f76c294290d4b6675 (18:20): well, the server is owned by the people I'm doign the site for, and it's on site and not a colo.  What I don't entirely trust is that, given my relative lack of experience, that I do not have some glaring security holes in my own code - although I have tried to follow best practices and have done a fair bit of testing- and I'm trying to figgure out how to best mitigate any potential problems my inexperience may have caused.",
        "84769583c3bdd642c505babd84d5ba52 (18:21): Well biggest one I can think of is doing something stupid like $_GET['filename'] and $_GET['filename'] being the full path.  Where $_GET['file_id'] would be much safer, then doing a lookup.",
        "889b9118612fb02a093d65d7ae3f205b (18:22): hi",
        "889b9118612fb02a093d65d7ae3f205b (18:23): I checked google but couldn't find any useful info, how can I get teh active connections to specific web page?",
        "84769583c3bdd642c505babd84d5ba52 (18:23): There are so many people I've seen do <a href=\"http://whatever.com/index.php?page=filename.php\">http://whatever.com/index.php?page=filename.php</a> then do an include_once ($_GET['filename']);",
        "889b9118612fb02a093d65d7ae3f205b (18:23): is there a way to get current active sessions?",
        "84769583c3bdd642c505babd84d5ba52 (18:23): It's a big security risk if you ask me.",
        "84769583c3bdd642c505babd84d5ba52 (18:23): camcorder: like all of them?",
        "889b9118612fb02a093d65d7ae3f205b (18:23): the-erm, yes",
        "0f2635bba9ae4c5f76c294290d4b6675 (18:23): yeah, I'm not specifically getting any files from the system.  I tried to avoid sending data through $_GET as much as possible, and I tried to make sure that everything I sent (through post or get) was checked for validity, and I used mysql_real_escape_string on every variable that was included in an sql query.",
        "84769583c3bdd642c505babd84d5ba52 (18:24): That's the best way to do it when dealing with a database.",
        "84769583c3bdd642c505babd84d5ba52 (18:25): camcorder: I can't think of one off the top of my head.  The only thing I think you might be able to do is a glob on your session's temp dir.",
        "84769583c3bdd642c505babd84d5ba52 (18:25): Of course I can't tell for sure that they would be 'active'",
        "889b9118612fb02a093d65d7ae3f205b (18:26): so is there a known way to show online users of a web page?",
        "0f2635bba9ae4c5f76c294290d4b6675 (18:27): camcorder, I would think the best way would be to use either a database table (probably slow) or write to a file the user name or some other identification when a user logs in, then remove them when the log out",
        "0f2635bba9ae4c5f76c294290d4b6675 (18:29): well, I'm going to take off for a bit.  Thanks for the help and pointers all",
        "84769583c3bdd642c505babd84d5ba52 (18:29): camcorder: Exactly what miyako said.",
        "889b9118612fb02a093d65d7ae3f205b (18:30): the-erm, how can I get noticed when user disconnects",
        "84769583c3bdd642c505babd84d5ba52 (18:30): That's the challenge.",
        "2334217a6edf5d2f5e14225373a2f844 (18:31): hi",
        "2334217a6edf5d2f5e14225373a2f844 (18:31): does anyone have a regex to get the system load?",
        "889b9118612fb02a093d65d7ae3f205b (18:31): best thing might be storing the ips, and checking them with a cron script and netstat",
        "2334217a6edf5d2f5e14225373a2f844 (18:31): and if possible all three values",
        "889b9118612fb02a093d65d7ae3f205b (18:31): ah, I doubt it that worths the fuss",
        "889b9118612fb02a093d65d7ae3f205b (18:32): from uptime?",
        "2334217a6edf5d2f5e14225373a2f844 (18:32): camcorder: yes",
        "889b9118612fb02a093d65d7ae3f205b (18:32): /.*\\ (.*),\\ (.*),\\ (.*)$/",
        "889b9118612fb02a093d65d7ae3f205b (18:33): if I recall uptime line correctly though",
        "889b9118612fb02a093d65d7ae3f205b (18:33): hm you better put ? in those crackets",
        "889b9118612fb02a093d65d7ae3f205b (18:33): brackets",
        "889b9118612fb02a093d65d7ae3f205b (18:33): that's perl regex btw",
        "84769583c3bdd642c505babd84d5ba52 (18:34): camcorder: I would have a last_time_loged_in on my database table, and logged_in enum('true','false'); .. or a int 1 for logged in, 0 for logged off.  When they log in set the last_time_logged_in to NOW();  Then - your last query on the page - update where last_time_logged_in &lt;= &quot;'.date('Y-d-m h:?:?',strtotime('-30 min')).'&quot;",
        "84769583c3bdd642c505babd84d5ba52 (18:35): camcorder: Are you using a mysql?",
        "889b9118612fb02a093d65d7ae3f205b (18:35): the-erm, taht's assuming user stays 30 min on avg isn't it",
        "889b9118612fb02a093d65d7ae3f205b (18:35): the-erm, yes",
        "84769583c3bdd642c505babd84d5ba52 (18:37): I'm just saying 30 minutes ... you could set it to 5 minutes.  OR if you really obsessive, have some sort of countdown script that 'pings' your server ever x minutes.  Something in AJAX.",
        "84769583c3bdd642c505babd84d5ba52 (18:39): ... I'm up to the challenge ... and board ...",
        "e31aee06bcdc06a56dd5ac2698544a8d (18:39): Q. How many Swedish police does it take to change a light bulb?",
        "84769583c3bdd642c505babd84d5ba52 (18:39): I think I'll write a quick script that does it.",
        "e31aee06bcdc06a56dd5ac2698544a8d (18:39): A. 50. One to change the bulb, and 49 to seize all the other bulbs in the house as evidence.",
        "e74134544df8e4f10375789863ec3ae8 (18:45): morning",
        "3c541005d59fe3ced179145220269df8 (18:50): i currently have a mysql table with a counter and a date column, and i would like an image,a graph , being drawn from that data. Could you give me a google keyword? would you recommend using jpgraph? do it &quot;manual&quot; with gdlib? something else?",
        "b4d146619f85d3fc03ca62ee766e62ba (18:53): mutante: <a href=\"http://sparkline.org/\">http://sparkline.org/</a> came up in google, looks kinda cool",
        "3c541005d59fe3ced179145220269df8 (18:53): thanks"
    ],
    "person_ids": [
        "50d471f8bf9335785753faf95141a906",
        "84769583c3bdd642c505babd84d5ba52",
        "0f2635bba9ae4c5f76c294290d4b6675",
        "6f54965bc576611e4bf2a4c212310376",
        "6174db44a96f0292f19bf5646961a830",
        "889b9118612fb02a093d65d7ae3f205b",
        "2334217a6edf5d2f5e14225373a2f844",
        "e31aee06bcdc06a56dd5ac2698544a8d",
        "e74134544df8e4f10375789863ec3ae8",
        "3c541005d59fe3ced179145220269df8",
        "b4d146619f85d3fc03ca62ee766e62ba"
    ]
}