{
    "id": "37808198bb505ba4d49fa551573160fb",
    "messages": [
        "69b0d3dfe919a6b860a9fac82de52a7e (12:56): ab7faae5d7b250ea8606486575f8f79c: &lt;rb&gt; is non-conforming to help authors who may get trapped by trying to style &lt;rb&gt; without success",
        "edb259c0e0038f38bb200bc20c8cbf7e (12:58): so dataset[&quot;&quot;] = x doesn't work either?",
        "ab7faae5d7b250ea8606486575f8f79c (12:58): 69b0d3dfe919a6b860a9fac82de52a7e: By that logic you should make all of ruby non-conforming, to help authors who may get trapped by trying to use it when a reasonably significant number of users use browsers which don't yet support it",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:59): edb259c0e0038f38bb200bc20c8cbf7e: per spec, it should &quot;work&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:00): ab7faae5d7b250ea8606486575f8f79c: yeah i didn't buy it either. the real reason it's not conforming is because i don't want to add a useless element to the spec, and ruby right now is in very early stages, so i'm willing to sacrifice a few authors today for the good of authors in the coming decades.",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:01): it does make implementing ruby slightly more complex",
        "ab7faae5d7b250ea8606486575f8f79c (13:01): Is there a known reason why the original ruby spec has &lt;rb&gt;?",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:02): apparently it's feasible to implement ruby using the inline table model from CSS and some to set a row as a baseline (Opera has a feature for that)",
        "ab7faae5d7b250ea8606486575f8f79c (13:02): edb259c0e0038f38bb200bc20c8cbf7e: Do you mean the presence of &lt;rb&gt; makes it more complex?",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:02): no, the absence",
        "ab7faae5d7b250ea8606486575f8f79c (13:03): edb259c0e0038f38bb200bc20c8cbf7e: You'd have to cope with people who don't use &lt;rb&gt; anyway, so its conformingness seems irrelevant",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:04): unless rendering is defined without requiring pseudo elements :)",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:04): but yeah",
        "ab7faae5d7b250ea8606486575f8f79c (13:17): edb259c0e0038f38bb200bc20c8cbf7e: Existing content omits &lt;rb&gt;, so, for compatibility, rendering would have to be defined without requiring explicit &lt;rb&gt; elements",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:18): tries to support anne in the xhr debacle",
        "ab7faae5d7b250ea8606486575f8f79c (13:18): (I suppose they could be implied, like tbody etc, but that seems kind of nasty)",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:19): 69b0d3dfe919a6b860a9fac82de52a7e, I think that's going ok now. I just need to get a few outstanding things resolved and then I simply ask for WG resolutions on each because I can't work it out with Julian and then we can go to CR (or another LC, not sure)",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:20): WG resolutions?",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:20): ab7faae5d7b250ea8606486575f8f79c, seems the main problem is the rb/rt pairing in the current draft",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:21): why can't you just make a decision and move on?",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:21): you'll always have some peopel unhappy",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:21): html5 has all kinds of things julian disagrees with :-)",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:21): 69b0d3dfe919a6b860a9fac82de52a7e, yes, but in order to suggest that he can raise a formal objection, i need support of the WG or something",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:21): 69b0d3dfe919a6b860a9fac82de52a7e, that seems like the simplest solution to me",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:22): doesn't plan on trying to get &quot;support of the WG&quot; before telling people to raise formal objections :-)",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:22): doesn't really care about formal objections at all in fact :-)",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:23): 69b0d3dfe919a6b860a9fac82de52a7e, ah, I was wondering whether to reply to that e-mail from sicking asking for more info",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:25): seriously though, if you've considered all the input and come to a conclusion, and he just disagrees with your conclusion but agrees that there is no information you aren't aware of, then asking the wg isn't going to do any good",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:25): groups of people make random decisions",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:26): the more people the more random",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:26): random decisions aren't what's best for hte web",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:26): I had this debacle once in the CSS WG, I don't want it again",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:27): I don't like it when chairs of WGs go all mad on me",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:27): eh you'll get used to it",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:28): i guess i'm in the lucky position of being able to just pull out of the w3c altogether if it gets too crazy",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:28): we really need a patent policy setup for whatwg",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:28): that way we wouldn't need the w3c at all",
        "a11aabeeceeae6b8cb5d12ea06b56554 (13:31): Silly W3C.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (13:31): &quot;The only person who counts is the editor. If you disagree with the editor, go tell your mummy on him.&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:33): if enough people disagree with the editor, the editor gets replaced and is out of a job",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:33): but you'll always find people who disagree",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:33): anyway. bed time. nn.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (13:33): Nah. Everyone agrees with me.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (13:33): night, 69b0d3dfe919a6b860a9fac82de52a7e"
    ],
    "person_ids": [
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "edb259c0e0038f38bb200bc20c8cbf7e",
        "ab7faae5d7b250ea8606486575f8f79c",
        "a11aabeeceeae6b8cb5d12ea06b56554"
    ]
}