{
    "id": "3a8eaa377f32e14407e57483dcb90889",
    "messages": [
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): CHAPTER 1",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): Jonathan Harker's Journal",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): 3 May. Bistritz.--Left Munich at 8:35 P.M., on 1st May, arriving at",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): Vienna early next morning; should have arrived at 6:46, but train was",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): an hour late.  Buda-Pesth seems a wonderful place, from the glimpse",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): which I got of it from the train and the little I could walk through",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): the streets.  I feared to go very far from the station, as we had",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): arrived late and would start as near the correct time as possible.",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): The impression I had was that we were leaving the West and entering the",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): East; the most western of splendid bridges over the Danube, which is",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): here of noble width and depth, took us among the traditions of Turkish",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): rule.",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): We left in pretty good time, and came after nightfall to Klausenburgh.",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): Here I stopped for the night at the Hotel Royale.  I had for dinner,",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): or rather supper, a chicken done up some way with red pepper, which",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): was very good but thirsty.  (Mem. get recipe for Mina.) I asked the",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): waiter, and he said it was called &quot;paprika hendl,&quot; and that, as it was",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): a national dish, I should be able to get it anywhere along the",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): Carpathians.",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): I found my smattering of German very useful here, indeed, I don't know",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): how I should be able to get on without it.",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): Having had some time at my disposal when in London, I had visited the",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): British Museum, and made search among the books and maps in the",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): library regarding Transylvania; it had struck me that some",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): foreknowledge of the country could hardly fail to have some importance",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): in dealing with a nobleman of that country.",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): I find that the district he named is in the extreme east of the",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): country, just on the borders of three states, Transylvania, Moldavia,",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): and Bukovina, in the midst of the Carpathian mountains; one of the",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): wildest and least known portions of Europe.",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:45): I was not able to light on any map or work giving the exact locality",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): of the Castle Dracula, as there are no maps of this country as yet to",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): compare with our own Ordance Survey Maps; but I found that Bistritz,",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): the post town named by Count Dracula, is a fairly well-known place.  I",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): sha",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): shall enter here some of my notes, as they may refresh my memory when",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): I talk over my travels with Mina.",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): In the population of Transylvania there are four distinct",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): nationalities:  Saxons in the South, and mixed with them the Wallachs,",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): who are the descendants of the Dacians; Magyars in the West, and",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): Szekelys in the East and North.  I am going among the latter, who",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): claim to be descended from Attila and the Huns.  This may be so, for",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): when the Magyars conquered the country in the eleventh century they",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): found the Huns settled in it.",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): I read that every known superstition in the world is gathered into the",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): horseshoe of the Carpathians, as if it were the centre of some sort of",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): imaginative whirlpool; if so my stay may be very interesting.  (Mem.,",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): I must ask the Count all about them.)",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): I did not sleep well, though my bed was comfortable enough, for I had",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): all sorts of queer dreams.  There was a dog howling all night under my",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): window, which may have had something to do with it; or it may have",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): been the paprika, for I had to drink up all the water in my carafe,",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): and was still thirsty.  Towards morning I slept and was wakened by the",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): continuous knocking at my door, so I guess I must have been sleeping",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:46): soundly then.",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:47): I had for breakfast more paprika, and a sort of porridge of maize",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:47): flour which they said was &quot;mamaliga&quot;, and egg-plant stuffed with",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:47): forcemeat, a very excellent dish, which they call &quot;impletata&quot;. (Mem.,",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:47): get recipe for this also.)",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:47): I had to hurry breakfast, for the train started a little before eight,",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:47): or rather it ought to have done so, for after rushing to the station",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:47): at 7:30 I had to sit in the carriage for more than an hour before we",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:47): began to move.",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:47): It seems to me that the further east you go the more unpunctual are",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:47): the trains.  What ought they to be in China?",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:47): All day long we seemed to dawdle through a country which was full of",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:47): beauty of every kind.  Sometimes we saw little towns or castles on the",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:47): top of steep hills such as we see in old missals; sometimes we ran by",
        "f60c535b2f622890ffd0a26f41c5c6e2 (18:47): rivers and streams which seemed from the wide stony mar"
    ],
    "person_ids": [
        "f60c535b2f622890ffd0a26f41c5c6e2"
    ]
}