{
    "id": "3b9d526feddd9a2074ac73bd28b60f0a",
    "messages": [
        "b25b6b77a0087ff8385941e5545d32ea (14:23): wonders if the usemap thing conflicts with the drawFocusRing changes",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:35): was the new vision group open to charter review at some point?",
        "edb259c0e0038f38bb200bc20c8cbf7e (14:36): it's a special Task Force so I guess not",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:36): I see",
        "edb259c0e0038f38bb200bc20c8cbf7e (14:36): I'm guessing it came out of the W3C getting a new CEO or some such",
        "edb259c0e0038f38bb200bc20c8cbf7e (14:37): it's somewhat announced here: http://www.w3.org/QA/2010/06/the_mission_of_w3c.html",
        "edb259c0e0038f38bb200bc20c8cbf7e (14:37): but not in a very concrete way",
        "edb259c0e0038f38bb200bc20c8cbf7e (14:37): &quot;we are building teams that will look at each of these topics&quot;",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:39): I guess &quot;Make W3C the best place for new standards work.&quot; semi-implies that it isn't already, which may not be an entirely wrong implication",
        "edb259c0e0038f38bb200bc20c8cbf7e (14:40): right, but then putting mostly W3C old-timers in the &quot;vision&quot; Task Force does not give much hope for change",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:41): I find it interesting that Andy Updegrove is in the task force",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:56): I think the placement of &quot;Impl.&quot; in http://www.w3.org/2010/Talks/ij-newstd-201005/#%288%29 doesn't reflect reality",
        "b25b6b77a0087ff8385941e5545d32ea (14:58): No, the problem with reality is that it doesn't make for convenient slides or slogans",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:00): yes, lets blame reality",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:03): hmm",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:04): maybe XHR can be moved to CR if the WebApps WG can make a decision to that effect",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:05): it would also mean people would have to agree with the decisions made so far, but given the lack of email so far I guess that will go okay (or not)",
        "b25b6b77a0087ff8385941e5545d32ea (15:06): I'm not blaming reality; I'm pointing out that complex things are often poorly understood because they are hard to communicate so people communicate simple fantasies instead",
        "73eaf221abca1b8244e34b0b9e76ac46 (15:11): Hixie: &quot;Let origin be the ASCII serialization of the origin of the script that invoked the WebSocket() constructor, converted to ASCII lowercase.&quot; - was the 'of the script' part deliberate?",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:21): 73eaf221abca1b8244e34b0b9e76ac46, I think so",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:21): 73eaf221abca1b8244e34b0b9e76ac46, XMLHttpRequest does it differently",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:22): 73eaf221abca1b8244e34b0b9e76ac46, but it matters in e.g. an iframe scenario where the iframes are of different domains but can communicate to document.domain",
        "73eaf221abca1b8244e34b0b9e76ac46 (15:23): why does it matter? if they can talk to each other, there's no security reason to get the origin from the script instead of from the constructor",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:25): what do you mean &quot;from the constructor&quot;?",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:25): like XMLHttpRequest does it?",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:25): iirc XMLHttpRequest is quite exceptional",
        "73eaf221abca1b8244e34b0b9e76ac46 (15:26): i mean from the window object of the constructor",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:27): it's not that simple, you can copy the interface object",
        "73eaf221abca1b8244e34b0b9e76ac46 (15:27): how?",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:28): win.X2 = win2.XMLHttpRequest; x = new X2;",
        "73eaf221abca1b8244e34b0b9e76ac46 (15:29): that's not a copy though, just a reference. it's the same object",
        "73eaf221abca1b8244e34b0b9e76ac46 (15:29): does that change which origin is used?",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:29): no",
        "b25b6b77a0087ff8385941e5545d32ea (15:30): Running eval in the context of othre windows is &quot;fun&quot;",
        "b25b6b77a0087ff8385941e5545d32ea (15:30): *other",
        "cdbe0e8aea85495cfcf22db2db988e7d (15:30): b8810fee2f4a71f849f3f7409546d1d9, edb259c0e0038f38bb200bc20c8cbf7e, any suggestions are super welcome for the task force.",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:30): the other thing in case of XHR is that the base URL is also based on the original document",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:31): unless you use XHR in the context of workers",
        "cdbe0e8aea85495cfcf22db2db988e7d (15:31): I can also step down if you think it will be better for it. I can only explain my goals joining it under invitation.",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:31): cdbe0e8aea85495cfcf22db2db988e7d, no worries :)",
        "73eaf221abca1b8244e34b0b9e76ac46 (15:31): edb259c0e0038f38bb200bc20c8cbf7e: ok, but let's ignore baseurl since websockets doesn't have it",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:31): I'd focus on seeing how the process can be changed to meet reality",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:32): i.e. implementations happen before CR (before REC even, see also patent policy)",
        "cdbe0e8aea85495cfcf22db2db988e7d (15:33): My goals are to push w3c toward a more flexible way of working. It's a bit hard right now for one to spontaneously start things at w3c. I have no idea if it will happen but at least there is a door open and a welcoming hand. So let's try.",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:33): 73eaf221abca1b8244e34b0b9e76ac46, most other contexts like window.location and such come to the base URL by using the &quot;first script&quot; (or whatever we call it now)",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:33): 73eaf221abca1b8244e34b0b9e76ac46, so it would make sense to also get the origin there",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:33): 73eaf221abca1b8244e34b0b9e76ac46, rather than the different way XMLHttpRequest goes about things",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:33): cdbe0e8aea85495cfcf22db2db988e7d: in addition to the point edb259c0e0038f38bb200bc20c8cbf7e made, a major bug I see in the Process, and a bug that is actively harming HTML5, is the way dissent is handled",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:34): cdbe0e8aea85495cfcf22db2db988e7d: specifically, &quot;can live with&quot; and &quot;weakest objections&quot; are ways to get a race to the bottom in terms of technical excellence if non-implementors start objecting a lot",
        "cdbe0e8aea85495cfcf22db2db988e7d (15:36): b8810fee2f4a71f849f3f7409546d1d9, here you express the issue. What process implementation, do you propose?",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:37): cdbe0e8aea85495cfcf22db2db988e7d: that WG decisions should be technically the best that implementors agree to implement even if the decisions draws loud objections",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:38): cdbe0e8aea85495cfcf22db2db988e7d: that is, framing decisions in terms of technical merit instead of framing them in terms of least objection",
        "cdbe0e8aea85495cfcf22db2db988e7d (15:41): b8810fee2f4a71f849f3f7409546d1d9, hmm it doesn't seem testable either. &quot;should&quot;, &quot;technical merit&quot;, &quot;agree to implement&quot; push a bit further the issue.",
        "cdbe0e8aea85495cfcf22db2db988e7d (15:41): Would it help if a controversial issue was raised to have test cases, and implemented code to finally make the balance (according to different class of products)?",
        "cdbe0e8aea85495cfcf22db2db988e7d (15:41): s/was raised/when raised/",
        "b25b6b77a0087ff8385941e5545d32ea (15:42): I'm not convinced test cases help the class of problems we have had in the HTMLWG",
        "b25b6b77a0087ff8385941e5545d32ea (15:42): Except insofar as they can be used to demonstrate claims about existing behaviour",
        "cdbe0e8aea85495cfcf22db2db988e7d (15:43): b25b6b77a0087ff8385941e5545d32ea, maybe that would be a good starting point. Taking the type of issues we had and see how practically we could solve them in a testable way. If possible.",
        "cdbe0e8aea85495cfcf22db2db988e7d (15:43): test cases are half part of the story. Implemented code is  necessary too.",
        "b25b6b77a0087ff8385941e5545d32ea (15:44): For some issues (X would be better as a seperate document) it's hard to see what type of testcases you could even write",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:44): cdbe0e8aea85495cfcf22db2db988e7d: like b25b6b77a0087ff8385941e5545d32ea says, test cases only help establishing what the current state of implementation is",
        "b25b6b77a0087ff8385941e5545d32ea (15:45): (because the experiment you want to do is to have X in/out of the main document and see if the implementations are of higher quality in the long term, but you can't do that)",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:45): cdbe0e8aea85495cfcf22db2db988e7d: basically, stuff like &quot;remove X&quot;, &quot;split out Y&quot;, &quot;make a non-normative reference to Z&quot; should not be taking a group's time",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:45): cdbe0e8aea85495cfcf22db2db988e7d: and proposals to change technical substance should be decided on technical merit--not on who threates to complain the most",
        "cdbe0e8aea85495cfcf22db2db988e7d (15:46): b25b6b77a0087ff8385941e5545d32ea, splitting out spec is an entire different issue which might be handled at the start and has nothing to do with technical merit that was the initial point of starting the discussion :)",
        "cdbe0e8aea85495cfcf22db2db988e7d (15:47): * technical merit of a feature",
        "cdbe0e8aea85495cfcf22db2db988e7d (15:47): * specs organization",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:48): cdbe0e8aea85495cfcf22db2db988e7d: that could be partially solved by letting a participant make non-technical proposals (like splitting the spec) only after the participant has a track record of also contributing technically",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:48): (by sending in good review comments, implementing the spec, writing test cases, etc.)",
        "cdbe0e8aea85495cfcf22db2db988e7d (15:49): b8810fee2f4a71f849f3f7409546d1d9, stackoverflow model. Good participants get more ways of participating. Getting credentials in a community. Could be interesting indeed.",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:50): cdbe0e8aea85495cfcf22db2db988e7d: the basic problem is that working groups need to be open so that new people who contribute positively can come in",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:50): cdbe0e8aea85495cfcf22db2db988e7d: but",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:51): cdbe0e8aea85495cfcf22db2db988e7d: not so open that anyone can come in and start process trolling the group",
        "cdbe0e8aea85495cfcf22db2db988e7d (15:52): b8810fee2f4a71f849f3f7409546d1d9, basically you are proposing: open read access, and progressive write access with positive contributions. Worth trying, would have to be modelled a bit to understand the possible issues.",
        "b25b6b77a0087ff8385941e5545d32ea (15:53): cdbe0e8aea85495cfcf22db2db988e7d: It does have technical ramifications if it makes implementing harder, or affects the accuracy of the spec (because split documents diverge, for example)",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:53): cdbe0e8aea85495cfcf22db2db988e7d: yes. also, an important point: one should be able to suggest technical &quot;write&quot; things right away but shouldn't feel an entitlement of getting one's suggestions accepted right away",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:55): cdbe0e8aea85495cfcf22db2db988e7d: in fact, a strong sense of entitlement is part of the problem",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:55): cdbe0e8aea85495cfcf22db2db988e7d: when I got involved, I didn't get paid to work on a browser",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:56): cdbe0e8aea85495cfcf22db2db988e7d: I made suggestions, but I didn't have a grandiose feeling of entitlement",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:56): cdbe0e8aea85495cfcf22db2db988e7d: that is, I didn't think the WHATWG were required to do things my way",
        "73eaf221abca1b8244e34b0b9e76ac46 (15:58): has the same experience as b8810fee2f4a71f849f3f7409546d1d9",
        "cdbe0e8aea85495cfcf22db2db988e7d (15:59): b8810fee2f4a71f849f3f7409546d1d9, yep difficult issue. Even in free community (not paid and nothing to pay), I have seen people asking for things like if we were forced to do it. (example validators when the source code was available.)",
        "cdbe0e8aea85495cfcf22db2db988e7d (15:59): But I'm not sure this issue can be solved.",
        "cdbe0e8aea85495cfcf22db2db988e7d (16:00): I guess it is the &quot;moral&quot; stance of each individuals which drives them. Some people are respectful. Some less. :/ very hard issue.",
        "cdbe0e8aea85495cfcf22db2db988e7d (16:02): will point out Ian to this discussion and pushes further. Back to my daily work. Thanks b8810fee2f4a71f849f3f7409546d1d9 and b25b6b77a0087ff8385941e5545d32ea",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:02): cdbe0e8aea85495cfcf22db2db988e7d: thanks",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:03): cdbe0e8aea85495cfcf22db2db988e7d: and one solution is that chairs tell people who walk in with a strong sense of entitlement that they need to adjust their attitude",
        "4d2a769942601baa26f55634a8eb251b (16:10): The &quot;Public Accountability part of process&quot; bullet point makes me wonder if that only applies to decision and not to rationale and discussion on private lists",
        "61184365556a05dbbeecb13ffe69c9d2 (16:22): notes roc &quot;ooh, we should have helped to try to get Widgets kicked out&quot;, why would you do that?",
        "61184365556a05dbbeecb13ffe69c9d2 (16:24): yeah, I thought so...",
        "4d2a769942601baa26f55634a8eb251b (16:33): &quot;For instance, it seems there may be resistance to finalizing CSS 2.1 out of concern it will not be maintained once a Rec.&quot;",
        "4d2a769942601baa26f55634a8eb251b (16:33): What is this about?",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:38): 4d2a769942601baa26f55634a8eb251b: where's the quote from?",
        "4d2a769942601baa26f55634a8eb251b (16:39): From the wiki page about the new vision thing",
        "a9b326df4e6da61c5b6f5e1058be83a2 (16:43): somebody should please create a &quot;Web platform&quot; article at Wikipedia",
        "73eaf221abca1b8244e34b0b9e76ac46 (16:43): a9b326df4e6da61c5b6f5e1058be83a2: just rename the &quot;HTML5&quot; article",
        "a9b326df4e6da61c5b6f5e1058be83a2 (16:43): heh",
        "a9b326df4e6da61c5b6f5e1058be83a2 (16:43): well, I was thinking something more along the lines of what hober has written up at http://edward.oconnor.cx/2009/05/what-the-web-platform-is",
        "a9b326df4e6da61c5b6f5e1058be83a2 (16:46): and what b8810fee2f4a71f849f3f7409546d1d9 diagrammed at http:/ b8810fee2f4a71f849f3f7409546d1d9.iki.fi/web-stack/",
        "cdbe0e8aea85495cfcf22db2db988e7d (16:47): http://en.wikipedia.org/wiki/World_Wide_Web",
        "cdbe0e8aea85495cfcf22db2db988e7d (16:47): maybe starts with a section here.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (16:48): yeah, that'd be one way to do it",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:49): seems there would be conflict of interest",
        "a9b326df4e6da61c5b6f5e1058be83a2 (16:50): well, there would be if I were to do it at least",
        "a9b326df4e6da61c5b6f5e1058be83a2 (16:51): edb259c0e0038f38bb200bc20c8cbf7e: or maybe I misunderstand what you meant",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:51): nope :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:52): edb259c0e0038f38bb200bc20c8cbf7e: the problem with wikipedia rules is that if you actually know a lot about a topic, you've probably crossed the conflict of interest line",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:53): no suggestion there",
        "4d2a769942601baa26f55634a8eb251b (16:58): b8810fee2f4a71f849f3f7409546d1d9: You're also likely to run into the whole &quot;need third party sources, preferably paper ones&quot; issue :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:59): 4d2a769942601baa26f55634a8eb251b: my other writing is already authoritative enough to be cited on wikipedia, so it's worth trying to use my writing as a source for more :-)",
        "f139aba52f9fa1394b4034a7954b2220 (17:17): So it turns out that the iPhone 4 will be available unlocked in the UK, and will work on carriers worldwide. :-)",
        "f139aba52f9fa1394b4034a7954b2220 (17:18): I'm considering getting one. Though I want to evaluate some other alternatives before I commit.",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:18): f139aba52f9fa1394b4034a7954b2220: don't you want a phone that runs Opera Mobile 10.x?",
        "edb259c0e0038f38bb200bc20c8cbf7e (17:23): so I finally got time to look into CSSOM again",
        "edb259c0e0038f38bb200bc20c8cbf7e (17:24): the way getComputedStyle works in Gecko is indeed as Boris described (unsurprisingly)",
        "edb259c0e0038f38bb200bc20c8cbf7e (17:25): it takes the style rules of the document of the window on which it is invoked and then applies those to the tree/fragment the element is from (irrespective of whether it is in fact the same document or not) and gives you an object with answerss",
        "f139aba52f9fa1394b4034a7954b2220 (17:25): b8810fee2f4a71f849f3f7409546d1d9, I will look at the available Android phones first",
        "edb259c0e0038f38bb200bc20c8cbf7e (17:25): whenever something changes that would affect the computations the object is updated",
        "f139aba52f9fa1394b4034a7954b2220 (17:26): I believe there are some android phones on the market with Opera 10 on them. I'm not sure which though",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:26): edb259c0e0038f38bb200bc20c8cbf7e: what do other browsers do if the owner doc and the window don't match?",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:26): f139aba52f9fa1394b4034a7954b2220: is Opera Mobile available for Android as a self-install download?",
        "edb259c0e0038f38bb200bc20c8cbf7e (17:26): usually assume there are no style rules",
        "edb259c0e0038f38bb200bc20c8cbf7e (17:26): but apparently developers like what Gecko does",
        "edb259c0e0038f38bb200bc20c8cbf7e (17:27): some of them anyway",
        "edb259c0e0038f38bb200bc20c8cbf7e (17:27): and I'm happy either way",
        "edb259c0e0038f38bb200bc20c8cbf7e (17:28): I wanna discuss it with Rune who is mainly responsible for layout in Opera, but I doubt he feels strongly either way",
        "f139aba52f9fa1394b4034a7954b2220 (17:30): b8810fee2f4a71f849f3f7409546d1d9, I don't know.",
        "f139aba52f9fa1394b4034a7954b2220 (17:30): I can find out",
        "f139aba52f9fa1394b4034a7954b2220 (17:32): b8810fee2f4a71f849f3f7409546d1d9, a11aabeeceeae6b8cb5d12ea06b56554 tells me that it's only avaialble on Android phones that are shipped with it pre-installed.",
        "f139aba52f9fa1394b4034a7954b2220 (17:32): I believe Mini is available though",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:33): Mini in beta",
        "f139aba52f9fa1394b4034a7954b2220 (17:43): b8810fee2f4a71f849f3f7409546d1d9, apparently there aren't any android devices with Mobile either. Only mini."
    ],
    "person_ids": [
        "b25b6b77a0087ff8385941e5545d32ea",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "edb259c0e0038f38bb200bc20c8cbf7e",
        "73eaf221abca1b8244e34b0b9e76ac46",
        "cdbe0e8aea85495cfcf22db2db988e7d",
        "4d2a769942601baa26f55634a8eb251b",
        "61184365556a05dbbeecb13ffe69c9d2",
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "f139aba52f9fa1394b4034a7954b2220",
        "a11aabeeceeae6b8cb5d12ea06b56554"
    ]
}