{
    "id": "3b9ee22adbd78427b1bca109bec16c2c",
    "messages": [
        "b5ef00f170716a058ad31a979fb22efd (10:37): Hixie: Chicken",
        "b5ef00f170716a058ad31a979fb22efd (10:38): Hixie: Chicken/egg problem, though isn't FF 3.5 supposed to have improved support for such microformats?",
        "b5ef00f170716a058ad31a979fb22efd (10:39): What's a real shame is that Google doesn't cull information from our business listings that are all in microformats.",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:40): Hixie: if someone wants a parser to do something, build one. The reason adding to calendar (/subscribing in google calendar) is the big one is because it's what everyone wanted to build",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:40): building a microformats parser is pretty simple if you have a decent HTML parser available, which many languages do",
        "b5ef00f170716a058ad31a979fb22efd (10:41): c74f596e4fe95fc3bb8726dbde2031b0: I think the issue is that web surfers that browse to the site aren't able to make use of the microformats due to not having any built in ability in the browser.",
        "b5ef00f170716a058ad31a979fb22efd (10:42): You could write a plugin, but you're still excluding the vast majority of people that wouldn't be able to figure it out.",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:42): b5ef00f170716a058ad31a979fb22efd: NEVER build that kind of cruft into a browser. That's what extensions/userscripts/plugins/other things are for",
        "b5ef00f170716a058ad31a979fb22efd (10:42): In this case, just exporting an iCal file would be easier.",
        "b5ef00f170716a058ad31a979fb22efd (10:43): That type of support should be built into IE.",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:43): So include a link to export said iCal data from the microformats, or also output iCal (it's not hard)",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:43): I heartily disagree",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:43): Browsers have too much crap in them as it is",
        "b5ef00f170716a058ad31a979fb22efd (10:43): But you already said that support for it would be simple.",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:44): I said building a parser to do something is simple... that doesn't mean it belongs native in the browser",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:44): The complaint was about behaviours",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:44): if you build it into the browser, it's still only going to be able to be added to a calendar unless you build another behaviour",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:45): and if you build another behaviour, just do it with existing tools",
        "b5ef00f170716a058ad31a979fb22efd (10:45): A rather large percentage of the Internet has contact information and events built into web pages.  If those were all built as microformats, it'd make sense to build support in for the browser.",
        "b5ef00f170716a058ad31a979fb22efd (10:45): It'd be like not including SVG support.",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:46): I like the idea of SVG support being a plugin, actually, but that's a seperate matter",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:46): The point is that the original complaint was that there was only one obvious action",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:46): Where that action lives makes no difference",
        "b5ef00f170716a058ad31a979fb22efd (10:47): Ideally browsers would support all official web standards out of box, and microformats would gain some sort of official status.",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:47): Ideally browsers would only be content rendering windows to hang plugin on, and there would be no such thing as &quot;official status&quot;",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:48): but we're never going to get there, so we work with what we have :)",
        "b5ef00f170716a058ad31a979fb22efd (10:48): HTML 4.01 is an official standard.",
        "b5ef00f170716a058ad31a979fb22efd (10:48): One would hope it is supported by the browser.",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:48): It's a W3C standard, and thus official for those who recognise their authority",
        "b5ef00f170716a058ad31a979fb22efd (10:49): Are you suggesting JavaScript be moved to a plugin?",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:49): One would hope that most user agents would process HTML by default, yes, but it need not be a feature of all of them, there's no rule about that",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:49): b5ef00f170716a058ad31a979fb22efd: I'm suggesting *everything* be moved to a plugin",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:49): Modular designs rule",
        "b5ef00f170716a058ad31a979fb22efd (10:50): Fine, then include all of those plugins by default, including ones that support microformats.",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:50): But I've already conceeded that people are too rooted in their ways to do that",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:50): b5ef00f170716a058ad31a979fb22efd: sure, but that still doesn't solve the root problem Hixie brought up",
        "b5ef00f170716a058ad31a979fb22efd (10:51): If most users have browsers that support microformats, then that would solve the issue.",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:51): The issue was that &quot;supporting microformats&quot; only means &quot;let them add to a calendar&quot;... ie, not enough actions/behaviours available",
        "b5ef00f170716a058ad31a979fb22efd (10:51): Oh wait, I think I see what might be being said.",
        "b5ef00f170716a058ad31a979fb22efd (10:52): Yeah, I see that now.",
        "b5ef00f170716a058ad31a979fb22efd (10:52): But I fail to see the point.",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:53): As do I... adding to calendar seems to be all people care about (as evidenced by it being all they've built)...  I've been working on a good &quot;invite others&quot; action as well (bookmarklet), not done yet",
        "b5ef00f170716a058ad31a979fb22efd (10:54): Reading the microformat and getting an iCal file would be functionally identical, and that is the purpose.  If they want to &quot;interact&quot; with the event then they just need to add a form and maybe publish an API if someone wants to write an application for it.",
        "b5ef00f170716a058ad31a979fb22efd (10:54): Ala, writing a Facebook application.",
        "b5ef00f170716a058ad31a979fb22efd (10:56): I guess someone could suggest adding a tag to indicate that the Microformat fields are empty and are meant to be filled in by the client.",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:56): b5ef00f170716a058ad31a979fb22efd: microformats are kind of for data... not forms",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:57): empty ones are not so useful",
        "b5ef00f170716a058ad31a979fb22efd (10:57): Like creating a form with everything tagged as an hCal, and at the root have class=&quot;userSubmit&quot; or something.",
        "b5ef00f170716a058ad31a979fb22efd (10:57): Then an application could automatically find a form and fill data in to the proper fields automatically.",
        "b5ef00f170716a058ad31a979fb22efd (10:58): But I'm still not seeing how that would be useful in any practical sense.",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:58): better idea: use the class names from microformat be used as the name= attribute on the form (I tend to do this anyway)",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:58): more semantic, and acheives the same goal",
        "b5ef00f170716a058ad31a979fb22efd (10:59): Someone would need to specify then that form elements MUST not be scrubbed for data.",
        "b5ef00f170716a058ad31a979fb22efd (10:59): That could be problematic.",
        "c74f596e4fe95fc3bb8726dbde2031b0 (10:59): http://pastie.org/467373",
        "b5ef00f170716a058ad31a979fb22efd (11:00): I suppose you could have a plugin that lets you fill in contact or calender information always using the exact same looking interface, and then that filled in form.",
        "b5ef00f170716a058ad31a979fb22efd (11:01): What if someone assigns a value to one of those form fields?  How do you make sure a microformat plugin doesn't think that is a contact?",
        "c74f596e4fe95fc3bb8726dbde2031b0 (11:02): b5ef00f170716a058ad31a979fb22efd: a microformat plugin won't see it, because the class names aren't set to anything microformatty (or anything at all in this case)",
        "b5ef00f170716a058ad31a979fb22efd (11:03): It would actually be nice to be able to automatically fill in all contact fields in a form.",
        "b5ef00f170716a058ad31a979fb22efd (11:03): slaps forehead.",
        "b5ef00f170716a058ad31a979fb22efd (11:03): You're right.",
        "b5ef00f170716a058ad31a979fb22efd (11:04): I think we still come back to the issue of &quot;What's the point?&quot;",
        "c74f596e4fe95fc3bb8726dbde2031b0 (11:04): Quite possibly",
        "c74f596e4fe95fc3bb8726dbde2031b0 (11:04): Although: 03:59 &lt; b5ef00f170716a058ad31a979fb22efd&gt; It would actually be nice to be able to automatically fill in all contact fields in a form.",
        "b5ef00f170716a058ad31a979fb22efd (11:05): And that is the only use I can think of.",
        "b5ef00f170716a058ad31a979fb22efd (11:05): That doesn't even apply to a calender.",
        "c74f596e4fe95fc3bb8726dbde2031b0 (11:05): True. Not sure if there's a calendar use case",
        "c74f596e4fe95fc3bb8726dbde2031b0 (11:05): Except that standard field names are nice",
        "b5ef00f170716a058ad31a979fb22efd (11:06): It seems like a lot of work to go through too for a minute or two of saved time every so often.",
        "b5ef00f170716a058ad31a979fb22efd (11:06): Yeah, standard field names are nice.",
        "b5ef00f170716a058ad31a979fb22efd (11:07): Anything but this though.  http://www.ietf.org/rfc/rfc3106",
        "c74f596e4fe95fc3bb8726dbde2031b0 (11:08): heh, I agree, using existing field/class names (and short ones) is much nicer than inventing some namespaced new thing :)",
        "b5ef00f170716a058ad31a979fb22efd (11:08): Ecom_ShipTo_Telecom_Phone_Number?",
        "b5ef00f170716a058ad31a979fb22efd (11:08): Seriously?",
        "c74f596e4fe95fc3bb8726dbde2031b0 (11:09): yeah :P"
    ],
    "person_ids": [
        "b5ef00f170716a058ad31a979fb22efd",
        "c74f596e4fe95fc3bb8726dbde2031b0"
    ]
}