{
    "id": "3d32a9c5c5e0aa6d57b5dd42b11be955",
    "messages": [
        "ab7faae5d7b250ea8606486575f8f79c (16:28): http://alistapart.com/comments/semanticsinhtml5?page=2#16 - &quot;isn‚Äôt HTML5, at its core, simply replacing one fixed set of tags with another? The new tags might be meaningful now, but will they be in 30 years time?&quot; - in 30 years time, we can have HTML9 with a new fixed set of tags that are meaningful then, so that doesn't seem a problem",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:39): and more &quot;Boy it‚Äôd be great if this ‚ÄúXML‚Äù language existed along with support for ‚ÄúDTDs‚Äù...&quot; in the comments there",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:40): I somehow didn't realize the rest of the world hasn't moved on yet",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:42): http://dret.net/netdret/docs/wilde-cacm2008-xml-fever.html#self-description-delusion",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:42): &quot;Recovery from self-description delusion can take a great deal of personal commitment and effort.&quot;",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:52): Hixie: I've always erred away from writing such a script, simply because the RFC format is so strict and has some many minor little rules that have to be got correctly",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:54): Hixie: There are also all ready tools that do this. Ask DanC.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:00): Hixie: And I have exams starting in 8 days, so no.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:00): (This is the &quot;I'm not your bitch&quot; statement.)",
        "edb259c0e0038f38bb200bc20c8cbf7e (17:08): b8810fee2f4a71f849f3f7409546d1d9, lovely",
        "edb259c0e0038f38bb200bc20c8cbf7e (17:09): b8810fee2f4a71f849f3f7409546d1d9, the funny thing is that e.g. http://alistapart.com/comments/semanticsinhtml5?page=2#20 does realize it's problematic but is still arguing for it",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:15): also, the usual Cascading Semantic Sheets are proposed: http://alistapart.com/comments/semanticsinhtml5?page=2#16",
        "edb259c0e0038f38bb200bc20c8cbf7e (17:21): b8810fee2f4a71f849f3f7409546d1d9, apparently the RDF community is seriously discussing that",
        "edb259c0e0038f38bb200bc20c8cbf7e (17:21): b8810fee2f4a71f849f3f7409546d1d9, forgot where though",
        "edb259c0e0038f38bb200bc20c8cbf7e (17:22): slightly sad that I said on my blog I'd lost interest in pointing out who's wrong on the internet; I prolly haven't, just moved the ranting to IRC :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:24): ranting on IRC or twitter is easier than writing coherent articles",
        "47223c0fa41aa7e167a2d1fd2740cbb8 (17:33): edb259c0e0038f38bb200bc20c8cbf7e: heheh",
        "edb259c0e0038f38bb200bc20c8cbf7e (17:37): http://twitter.com/clintonskakun/statuses/1099669102",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (17:58): is now reading the ALA article.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (17:58): thought nothing interesting had been written on ALA for about 5 years.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (17:59): &quot;We have simply run out of HTML elements and attributes with which to mark up more richly semantic documents.&quot; Actually, I think the problem is people forgetting how many there are and not being imaginative enough about how they can be used and combined.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (17:59): &quot;It‚Äôs pseudo semantic markup at best.&quot; that's all it needs to be...",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:00): ROFL @ linking to some random article about &quot;HTML semantics&quot; instead of the actual index pages for HTML 4.01",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:01): &quot;We need mechanisms in HTML that clearly and unambiguously enable developers to add richer, more meaningful semantics‚Äînot pseudo semantics‚Äîto their markup.&quot; for what purpose?",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:04): &quot;Given the half-life of Internet Explorer, we can predict that most users will be using IE6 or IE7 even several years from now.&quot; Nice way to describe it, in terms of a &quot;half-life&quot;.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:06): &quot;[...] the need for greater semantic capability in HTML [...] more semantic goodness [...] we still won‚Äôt have solved the problem.&quot; So, erm, just what is that problem?",
        "a924fb58d2c25874322f4e5126f608b9 (18:06): The semantic web",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:07): I thought the semantic web amounted to publishing databases on the web so people could merge them?",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:07): and that the document web we have today would not be affected",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:09): &quot;[...] the extremely important task of providing a mechanism for semantic richness in HTML [...]&quot; But it just said semantic richness doesn't solve the problem?",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:10): &quot;[...] we‚Äôve been using class and id attributes as mechanisms to extend the semantics of HTML.&quot; and yet the article claims several times there's no mechanism to extend HTML",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:11): &quot;Let‚Äôs invent a new attribute. [...] we can add a class value to the element for styling.&quot; So much for HTML being efficient!",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:12): &quot;Instead of new elements, HTML 5 should adopt a number of new attributes.&quot; Is this part requesting for the data-* attributes which are already present?",
        "ab7faae5d7b250ea8606486575f8f79c (18:13): 42e76c77af424a4350ab0e3e3f6f2ce9: (I think it's requesting attributes where there is a global shared understanding of what their values mean, so that's not data-*)",
        "ab7faae5d7b250ea8606486575f8f79c (18:13): (though I don't know where that shared understanding is going to come from)",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:13): ah",
        "ab7faae5d7b250ea8606486575f8f79c (18:13): (Oh, I know, it comes from DTDs!)",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:13): :P",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:14): oh, the author owns microformatique.com so those are just vanity links",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:15): ab7faae5d7b250ea8606486575f8f79c, he likens these new attributes to class so maybe their meaning is not expected to be understood by UAs? Perhaps it's just to give authors a warm, fuzzy feeling when they View Source?",
        "a924fb58d2c25874322f4e5126f608b9 (18:15): Like &lt;invisible&gt;&lt;/invisible&gt; to hide source?",
        "ab7faae5d7b250ea8606486575f8f79c (18:15): 42e76c77af424a4350ab0e3e3f6f2ce9: I can't really tell, given that his only proposed usage of the attributes is to make divs with a defined structure have bold text",
        "ab7faae5d7b250ea8606486575f8f79c (18:18): The only real problem with adding new elements to HTML is the block/inline parsing differences, so what HTML5 should say is that if the MD5 of an unknown tag name is an even number then it's parsed as a block element, else it's inline",
        "ab7faae5d7b250ea8606486575f8f79c (18:19): Then, when HTML6 is adding new elements, it can just be careful to choose element names that have the right MD5",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:19): &quot;[...] could be used to markup the rhetorical nature of a document.&quot; hmm, I wonder why that would be a useful expenditure of time+money at the web scale",
        "ab7faae5d7b250ea8606486575f8f79c (18:19): which isn't really a problem because there's plenty of synonyms",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:19): ab7faae5d7b250ea8606486575f8f79c, I kind of hoped unknown elements would work like &lt;ins&gt; and &lt;del&gt;, adapting to their context, but it seems that won't happen",
        "a924fb58d2c25874322f4e5126f608b9 (18:20): ab7faae5d7b250ea8606486575f8f79c: Have you checked if that works for all existing elements?",
        "ab7faae5d7b250ea8606486575f8f79c (18:22): a924fb58d2c25874322f4e5126f608b9: It works perfectly for all existing elements, because the new rules will only apply to unknown elements",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:22): the article brings up the issue of timestamps in title attributes as a reason to introduce a new attribute, when HTML5 already introduced &lt;time datetime&gt;: http://www.whatwg.org/specs/web-apps/current-work/multipage/text-level-semantics.html#the-time-element",
        "a924fb58d2c25874322f4e5126f608b9 (18:24): ab7faae5d7b250ea8606486575f8f79c: Then it's a silly rule, because it restricts choosing the most awesome tag name for a temporary short-term gain",
        "ab7faae5d7b250ea8606486575f8f79c (18:27): a924fb58d2c25874322f4e5126f608b9: How dare you call it a silly rule :-(",
        "ab7faae5d7b250ea8606486575f8f79c (18:27): It seems perfectly sensible to me",
        "a924fb58d2c25874322f4e5126f608b9 (18:29): ab7faae5d7b250ea8606486575f8f79c: You should create a new hashing function that works on all existing elements, that way new UAs can implement only the hashing and leave out arbitrary specific block/inline designations",
        "ab7faae5d7b250ea8606486575f8f79c (18:31): a924fb58d2c25874322f4e5126f608b9: That should be easy - just use something like gperf",
        "a924fb58d2c25874322f4e5126f608b9 (18:31): I want it on my desk tomorrow",
        "ab7faae5d7b250ea8606486575f8f79c (18:33): The problem with that is that I'm too lazy",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:42): Opinion needed: I have an English dissertation first draft due Thursday, and physics and computing prelims next Wednesday. What school work do I do now?",
        "57d876083caf517f49e8cf5e03307450 (18:42): a11aabeeceeae6b8cb5d12ea06b56554: obviously, HTML 5 work",
        "ab7faae5d7b250ea8606486575f8f79c (18:42): I suggest you do none of it, and chat on IRC/Twitter/etc instead",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:42): was somewhat tempted by those two answers",
        "ab7faae5d7b250ea8606486575f8f79c (18:43): By the way, you should not take any advice on this channel seriously",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:43): But also by working on a spec I started on yesterday.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:43): doesn't take that statement by ab7faae5d7b250ea8606486575f8f79c seriously :)|",
        "57d876083caf517f49e8cf5e03307450 (18:44): a11aabeeceeae6b8cb5d12ea06b56554: just say the computer crashed and destroyed your work",
        "57d876083caf517f49e8cf5e03307450 (18:44): and you had to spend the next five hours stopping it from crashing ever again",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:44): a11aabeeceeae6b8cb5d12ea06b56554, what are the prelims?",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:44): a11aabeeceeae6b8cb5d12ea06b56554, I suggest dropping any expendable work and getting the essential work done first.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:44): 42e76c77af424a4350ab0e3e3f6f2ce9: http://en.wikipedia.org/wiki/Prelims",
        "57d876083caf517f49e8cf5e03307450 (18:45): since it's in this channel",
        "57d876083caf517f49e8cf5e03307450 (18:45): 42e76c77af424a4350ab0e3e3f6f2ce9 can't be giving serious advice",
        "57d876083caf517f49e8cf5e03307450 (18:45): so do the opposite of what he says",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:45): 42e76c77af424a4350ab0e3e3f6f2ce9: All of this is essential.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:45): 42e76c77af424a4350ab0e3e3f6f2ce9: See the &quot;Singapore and Scotland&quot; section of that article",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:46): a11aabeeceeae6b8cb5d12ea06b56554, looks like prelims are the more essential thing, since a &quot;first draft&quot; implies there will be further opportunities to submit the work.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:46): alternative, just do as much as possible instead of debating it here :)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:46): But the English is worth 40% of the final grade.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:47): 42e76c77af424a4350ab0e3e3f6f2ce9: Nah.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:47): well, the English is due much sooner so you could work your arse off on that now",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:48): notes he has actually done more of it than most of his class",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:48): then work your arse off preparing for prelims after this Thrusday",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:48): but the important thing is to do the actual work instead of talking about doing the actual work...you aren't W3C!",
        "ab7faae5d7b250ea8606486575f8f79c (18:48): a11aabeeceeae6b8cb5d12ea06b56554: If the only result of failing to hand in the English dissertation is that you get told off and have to hand it in later, whereas failing to prepare for practice exams means that you will have forever wasted that opportunity for practice, then it sounds sensible to concentrate on the latter",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:49): ab7faae5d7b250ea8606486575f8f79c: It would however mean I have less time to do the English, which in the long run is more important than prelims whose results will never (unless I choose to) leave the school",
        "ab7faae5d7b250ea8606486575f8f79c (18:50): a11aabeeceeae6b8cb5d12ea06b56554: That depends on how far past the deadline you can work on the English",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:50): sighs",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:50): Life is fun.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:51): a11aabeeceeae6b8cb5d12ea06b56554, if you can't make up your mind them flip a coin once and do that.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:51): *then",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:51): That seems too arbitrary :P",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:51): is now reading RFC2616",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:52): procrastinating means you get nothing done at all",
        "ab7faae5d7b250ea8606486575f8f79c (18:52): is most productive while procrastinating",
        "ab7faae5d7b250ea8606486575f8f79c (18:52): (Not necessarily productive on the thing I'm meant to be working on, but it's better than nothing)",
        "57d876083caf517f49e8cf5e03307450 (18:52): a11aabeeceeae6b8cb5d12ea06b56554: rand(1)*2 = 1.9150",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (18:52): since both are &quot;essential&quot;, making progress on either is worthwhile, so a coin toss as a tie-breaker seems quite reasonable",
        "57d876083caf517f49e8cf5e03307450 (18:52): do with that as you will",
        "ab7faae5d7b250ea8606486575f8f79c (18:53): 57d876083caf517f49e8cf5e03307450: Why not use rand(2)? :-)",
        "57d876083caf517f49e8cf5e03307450 (18:53): ab7faae5d7b250ea8606486575f8f79c: that does a 2-by-2 matrix",
        "ab7faae5d7b250ea8606486575f8f79c (18:53): 57d876083caf517f49e8cf5e03307450: Oh, crazy language",
        "57d876083caf517f49e8cf5e03307450 (18:53): ab7faae5d7b250ea8606486575f8f79c: it's MATLAB :-)",
        "ab7faae5d7b250ea8606486575f8f79c (18:53): 57d876083caf517f49e8cf5e03307450: I thought it was Perl, but I can see now how that's clearly a stupid thought",
        "a480104b0e570389c6f4284a88c7cd9d (18:57): if they both are essential, do the shorter task first",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (19:00): back to timestamps in the title attribute and the ALA suggestion for a new attribute...I just found a topic where I suggest custom attributes for this back in August 2007: http://www.accessifyforum.com/viewtopic.php?p=54804#54804",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (19:00): it was shot down by peers of the ALA author...nice to see how times change :)",
        "ab7faae5d7b250ea8606486575f8f79c (19:01): The computer science approach is to make use of the understanding of real-time OS task scheduling algorithms, so e.g. if it's possible to satisfy your tasks with no more than 100% utilisation then you can use http://en.wikipedia.org/wiki/Earliest_deadline_first_scheduling",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (19:03): (zcorpan has been suggesting data-dtstart=timestamp and suchlike for about as long, IIRC)",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (19:04): ALA article says: &quot;[...] a significant amount of work needs to be done to really develop a workable solution.&quot; That's already been done and it led to data-*, right?",
        "ab7faae5d7b250ea8606486575f8f79c (19:06): 42e76c77af424a4350ab0e3e3f6f2ce9: That's a solution for associating private script-accessible data with elements, not for defining the semantics of elements",
        "ab7faae5d7b250ea8606486575f8f79c (19:07): e.g. you can't write '&lt;span data-datetime=&quot;2009-01-01&quot;&gt;a few days ago&lt;/span&gt;' and have a browser extension that lets you click dates to add them to your calendar",
        "ab7faae5d7b250ea8606486575f8f79c (19:08): because that extended browser would be non-conforming to HTML5",
        "ab7faae5d7b250ea8606486575f8f79c (19:08): so it's not a solution to that problem",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (19:09): ab7faae5d7b250ea8606486575f8f79c, yes, that restriction would need to be lifted or softened.",
        "ab7faae5d7b250ea8606486575f8f79c (19:10): 42e76c77af424a4350ab0e3e3f6f2ce9: That restriction is there for a reason, and it can't be lifted without addressing the reason for it",
        "ab7faae5d7b250ea8606486575f8f79c (19:10): (The reason being that there's no mechanism for people to agree on the meanings of data-* attributes)",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (19:12): ab7faae5d7b250ea8606486575f8f79c, I imagine the mechanism would be the same as class values? So things like Microformats would move their class values to the part after the hyphen in data-* and UAs could choose to interpret them natively, or via add-ons.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (19:13): they could be managed like rel values using a WHATWG wiki page, too",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (19:13): (For the logs, data-* attributes are here in the HTML5 spec: http://www.whatwg.org/specs/web-apps/current-work/multipage/dom.html#embedding-custom-non-visible-data)",
        "ab7faae5d7b250ea8606486575f8f79c (19:14): 42e76c77af424a4350ab0e3e3f6f2ce9: HTML5 had a mechanism for providing specific meaning to certain class values, and that didn't work well and got ripped out, so it's not a good precedent :-)",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (19:16): ab7faae5d7b250ea8606486575f8f79c, I guess something ad-hoc and communally agreed, like the Microformats approach, will be more successful than a central registry, then.",
        "ab7faae5d7b250ea8606486575f8f79c (19:16): But I suppose what's likely to happen is than a Microformats-like process will emerge to define common meaning to some data-* values, and they'll ignore that it's abusing the spec and that there's no reason to think it's not going to conflict with other people using the same name",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (19:16): indeed :)",
        "ab7faae5d7b250ea8606486575f8f79c (19:16): because the validator won't complain and it'll achieve their goals, so it's futile to try to stop them",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (19:27): ooh, ALA's live preview is nice, except it doesn't do linkification",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (19:28): hmm, it seems you can't make clickable links in ALA comments :| oh well",
        "ab7faae5d7b250ea8606486575f8f79c (19:29): Maybe they haven't grasped the concept of &quot;web&quot; and hyperlinking yet",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (19:34): hmm, commenting takes me to a slightly different URL than clicking the permalink for my comment",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (19:34): anyway, my comment is here: http://alistapart.com/comments/semanticsinhtml5?page=3#26",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (19:34): time for dinner"
    ],
    "person_ids": [
        "ab7faae5d7b250ea8606486575f8f79c",
        "edb259c0e0038f38bb200bc20c8cbf7e",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "a11aabeeceeae6b8cb5d12ea06b56554",
        "47223c0fa41aa7e167a2d1fd2740cbb8",
        "42e76c77af424a4350ab0e3e3f6f2ce9",
        "a924fb58d2c25874322f4e5126f608b9",
        "57d876083caf517f49e8cf5e03307450",
        "a480104b0e570389c6f4284a88c7cd9d"
    ]
}