{
    "id": "41c55c372072c040464d2c9373af7829",
    "messages": [
        "b25b6b77a0087ff8385941e5545d32ea (14:49): Oops, I meant to use Spec with *status* markers as the subject line",
        "c472a8ecbb4cd66373e8fc6daeaab188 (15:07): Should I ask a vector graphics question here even though my example is in SVG and not Canvas?  It is a pretty general case and not SVG specific.  Otherwise, I'll need to find a trigonometry channel :)",
        "b25b6b77a0087ff8385941e5545d32ea (15:13): c472a8ecbb4cd66373e8fc6daeaab188: This isn't really a authoring help channel. Although someone might help you anyway I guess",
        "3f2e2531201cfbf853f16f668132eaf2 (15:13): SVG is sort of part of HTML now, so it wouldn't be too heretical to ask such a thing :-)",
        "c472a8ecbb4cd66373e8fc6daeaab188 (15:13): Thanks, I am trying to use relative 'l' and relative 'a'.",
        "c472a8ecbb4cd66373e8fc6daeaab188 (15:13): The first path starts at an absolute point of 600,200 and draws an arc to the left: d=&quot; M 600,200 l 0,-150 a 150,150 0 0,0 -106.066017177982,43.9339828220179 z&quot;",
        "c472a8ecbb4cd66373e8fc6daeaab188 (15:13): So, the next arc will start at 600,200 again. ¬†What is the formula to get my next line? ¬†It obviously is dependant on l 0,-150 in relation to -106.066017177982,43.9339828220179, but I cannot extract a general rule.",
        "c472a8ecbb4cd66373e8fc6daeaab188 (15:14): This is a pie chart and that first example is a 45 degree slice.",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:14): c472a8ecbb4cd66373e8fc6daeaab188: I'm not sure if I understand the question, but the line from the previous Bezier control point to the end point is tangential to the curve at the end point",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:15): I misunderstood the question. sorry",
        "3f2e2531201cfbf853f16f668132eaf2 (15:21): c472a8ecbb4cd66373e8fc6daeaab188: Which &quot;next line&quot; do you mean?",
        "c472a8ecbb4cd66373e8fc6daeaab188 (15:23): OK, so It starts at 600,200, moves up 150 and moves left 0, right?  That leaves us at absolute of 600,50, but I don't want to worry about absoultes anywhere besides the start point.  So, from that end point or the line we move down relatively 43.93 and left 106.07.  That is the end point of the arc.  I need to turn that end point for the first arc into the end point of the line for the next slice.  It is relative to up 150, left 0, but what is the general rul",
        "c472a8ecbb4cd66373e8fc6daeaab188 (15:23): 3f2e2531201cfbf853f16f668132eaf2: I am drawing 2 slices of pie at 45 degrees each with a radius of 150.  I need to find the relative start point of the second line.",
        "3f2e2531201cfbf853f16f668132eaf2 (15:25): Sounds like you could do &quot;(stuff you did before) M 600,200 l -150cos(x),150sin(x) a 150,150 0 0,0 -150cos(y)+150cos(x),150sin(y)-150sin(x) z&quot; maybe",
        "3f2e2531201cfbf853f16f668132eaf2 (15:25): where x and y are the angles you're drawing between",
        "3f2e2531201cfbf853f16f668132eaf2 (15:26): Um, I might have mixed up the horizontal/vertical numbers a bit",
        "c472a8ecbb4cd66373e8fc6daeaab188 (15:28): 3f2e2531201cfbf853f16f668132eaf2: you meant to have l -150cos(x),150sin(x) and not a y in there?",
        "3f2e2531201cfbf853f16f668132eaf2 (15:30): The idea was to M back to the center point, then draw a line out to where the previous arc left off (i.e. based on x, where x is the angle of the previous arc), then do an arc to the end of the new arc (i.e. based on y, where y is the absolute angle of the new arc, minus the position of the previous point because the arc coordinates are relative)",
        "3f2e2531201cfbf853f16f668132eaf2 (15:33): decides that 'x' and 'y' are terrible names to use, and he should have said 'a' and 'b'",
        "3f2e2531201cfbf853f16f668132eaf2 (15:33): because now I can't talk about the x axis without getting very confused",
        "c472a8ecbb4cd66373e8fc6daeaab188 (15:38): 3f2e2531201cfbf853f16f668132eaf2: we are talking the same language.  I'm a little slow with math though.  Let me make sure I am clear on the first slice.  So, we start at 600,200 and go up 150 and left 0.  From there we arc left 106.07 and down 43.93.  The first part I don't understand is how I get at those numbers cos(45) = 106.07 and sin(45) = 106.07 but why are we moving to -106.07 for x and 150 - 106.07 (43.93) (or some other way to arrive at 43.93) for y?",
        "c472a8ecbb4cd66373e8fc6daeaab188 (15:40): In your example I can't distinguish radius from angle.  I'm using 45 degrees until I get a handle on this.",
        "3f2e2531201cfbf853f16f668132eaf2 (15:46): The point you're arcing to is 150 units from the center, 45 degrees anticlockwise from the upwards direction, so it has position 150*sin(-45),150*cos(-45)",
        "3f2e2531201cfbf853f16f668132eaf2 (15:46): (position relative to the center, that is)",
        "3f2e2531201cfbf853f16f668132eaf2 (15:46): which is -106,44 (relative to the center)",
        "3f2e2531201cfbf853f16f668132eaf2 (15:46): Wait, no",
        "3f2e2531201cfbf853f16f668132eaf2 (15:47): It's -106,106 (relative to the center)",
        "3f2e2531201cfbf853f16f668132eaf2 (15:48): which is -106,-44 relative to the point 0,150 (which is where you previously moved to)",
        "3f2e2531201cfbf853f16f668132eaf2 (15:48): Um, I've got the vertical axis mixed up again, just negate all the y coordinates :-p",
        "3f2e2531201cfbf853f16f668132eaf2 (15:49): and the 'a' command takes coordinates relative to the start point (i.e. relative to 0,150 (or 0,-150 or whatever it is)), which is why you get the -44 (or 44 or whatever it is)",
        "c472a8ecbb4cd66373e8fc6daeaab188 (15:49): 3f2e2531201cfbf853f16f668132eaf2: that is helping.  When you said 150*sin(-45),150*cos(-45) should it not be 150*cos(-45),150*sin(-45) to go in x,y order?",
        "3f2e2531201cfbf853f16f668132eaf2 (15:50): I assumed angle 0 was meant to be at 0,150",
        "3f2e2531201cfbf853f16f668132eaf2 (15:51): so it has to be sin(angle),cos(angle)",
        "3f2e2531201cfbf853f16f668132eaf2 (15:51): (because sin(0)=0 etc)",
        "c472a8ecbb4cd66373e8fc6daeaab188 (15:54): 3f2e2531201cfbf853f16f668132eaf2: angle 0 arc is 0,-150 from 200,200  the first slice loooks just like this: \\| except at a 45 on not whatever that slash is.",
        "3f2e2531201cfbf853f16f668132eaf2 (15:55): Trying to get my axes right this time:",
        "3f2e2531201cfbf853f16f668132eaf2 (15:55): I think you want 150*sin(angle),-150*cos(angle)",
        "3f2e2531201cfbf853f16f668132eaf2 (15:55): so if angle=0 you get 0,-150",
        "3f2e2531201cfbf853f16f668132eaf2 (15:56): and if angle=-45 (i.e. anticlockwise in your choice of 'up') you get -106,-106 (relative to the origin) which is -106,44 (relative to 0,-150)",
        "c472a8ecbb4cd66373e8fc6daeaab188 (15:58): 3f2e2531201cfbf853f16f668132eaf2: I'm trying it out.  I guess I was missing the negative angle bit.",
        "3f2e2531201cfbf853f16f668132eaf2 (15:58): is used to the usual mathematical view where +x is right, +y is up, positive angles are anticlockwise",
        "3f2e2531201cfbf853f16f668132eaf2 (15:59): but if you interpret -y as being up, then positive angles are clockwise",
        "3f2e2531201cfbf853f16f668132eaf2 (15:59): so anticlockwise angles need to be negative",
        "3f2e2531201cfbf853f16f668132eaf2 (15:59): gets too easily confused by this :-(",
        "c472a8ecbb4cd66373e8fc6daeaab188 (16:00): 3f2e2531201cfbf853f16f668132eaf2: I was toying with how to get the negatives into the mix and I didn't know how.  Quadrants are so much easier."
    ],
    "person_ids": [
        "b25b6b77a0087ff8385941e5545d32ea",
        "c472a8ecbb4cd66373e8fc6daeaab188",
        "3f2e2531201cfbf853f16f668132eaf2",
        "b8810fee2f4a71f849f3f7409546d1d9"
    ]
}