{
    "id": "41dd78b9c0bd05947e5f1e3a026ab8d3",
    "messages": [
        "cc097e0d7183ae8436e7df709553c8c0 (16:26): hmm. i have opera mobile 11 on android 2.3.3, HTC Gracia which is ARM6. webm.html5.org says it doesn't support WebM",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:37): cc097e0d7183ae8436e7df709553c8c0: what does http://webm.html5.org/debug/ say?",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:37): cc097e0d7183ae8436e7df709553c8c0: I may have introduced a bug when I tried to blacklist Opera Mobile on Symbian",
        "cc097e0d7183ae8436e7df709553c8c0 (16:46): b8810fee2f4a71f849f3f7409546d1d9: it says Android 2.2, (empty), (empty)",
        "cc097e0d7183ae8436e7df709553c8c0 (16:47): shows a video element but doesn't play anything",
        "cc097e0d7183ae8436e7df709553c8c0 (16:47): i thought i had upgraded to 2.3.3",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:47): cc097e0d7183ae8436e7df709553c8c0: oh so Opera Mobile now reveals the Android version. interesting",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:48): cc097e0d7183ae8436e7df709553c8c0: could you paste the entire UA string, please?",
        "cc097e0d7183ae8436e7df709553c8c0 (16:50): sent by email",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:51): cc097e0d7183ae8436e7df709553c8c0: thanks",
        "cc097e0d7183ae8436e7df709553c8c0 (16:52): it seems i still have android 2.2, but no new updates are available",
        "88d4d34a8064a4ff39fd5e144eea7762 (16:53): othermaciej, I agree that sometimes reviewing code properly takes more time than writing it, but normally it takes much less time.  In particular, well-written patches should include enough comments, documentation, and explanation that they're reasonably easy to review, and if they don't, the reviewer can ask for them.",
        "88d4d34a8064a4ff39fd5e144eea7762 (16:53): In most cases.  You'll still always have some hard-to-review patches, in the end.",
        "88d4d34a8064a4ff39fd5e144eea7762 (16:53): (you probably have a lot more experience reviewing patches than I do, though, and maybe you review them more thoroughly)",
        "88d4d34a8064a4ff39fd5e144eea7762 (16:54): I do think that in commit-then-review, reviewers have a lot less power than in review-then-commit.",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:54): cc097e0d7183ae8436e7df709553c8c0: what does the ADR number mean in the UA string?",
        "b25b6b77a0087ff8385941e5545d32ea (16:54): Is there any software project that uses CtR?",
        "88d4d34a8064a4ff39fd5e144eea7762 (16:54): cc097e0d7183ae8436e7df709553c8c0, I'm going to spec everything execCommand()-related eventually, but there's loads to do.  The only thing I'm really working on speccing right now is the algorithm for applying inline markup commands.",
        "cc097e0d7183ae8436e7df709553c8c0 (16:54): b8810fee2f4a71f849f3f7409546d1d9: no idea",
        "88d4d34a8064a4ff39fd5e144eea7762 (16:55): b25b6b77a0087ff8385941e5545d32ea, MediaWiki, for one.",
        "88d4d34a8064a4ff39fd5e144eea7762 (16:55): It's probably a bad idea, and most of us seem to be in favor of switching to RtC.",
        "cc097e0d7183ae8436e7df709553c8c0 (16:55): 88d4d34a8064a4ff39fd5e144eea7762: cool",
        "b25b6b77a0087ff8385941e5545d32ea (16:55): 88d4d34a8064a4ff39fd5e144eea7762: Well that seems like a bad idea",
        "88d4d34a8064a4ff39fd5e144eea7762 (16:55): cc097e0d7183ae8436e7df709553c8c0, I should say, I'm going to do it if time allows.  I still have a few months left, though, so it's likely that I'll be able to finish it.",
        "b25b6b77a0087ff8385941e5545d32ea (16:55): (using CtR)",
        "88d4d34a8064a4ff39fd5e144eea7762 (16:56): b25b6b77a0087ff8385941e5545d32ea, yes, it is, which is why a lot of us want to change it.",
        "88d4d34a8064a4ff39fd5e144eea7762 (17:00): b25b6b77a0087ff8385941e5545d32ea, if you count projects that have a status of &quot;commit access&quot; but no formal review process as CtR, then I suspect it's more popular overall than RtC.",
        "88d4d34a8064a4ff39fd5e144eea7762 (17:00): Although big, prominent, well-run projects tend to use RtC.",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:02): cc097e0d7183ae8436e7df709553c8c0: I refined the Android advice that webm.html5.org gives",
        "b25b6b77a0087ff8385941e5545d32ea (17:02): 88d4d34a8064a4ff39fd5e144eea7762: I think &quot;we don't have review&quot; is a bit different to CtR",
        "88d4d34a8064a4ff39fd5e144eea7762 (17:02): Maybe, yeah.",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:02): it still sucks that Firefox is tied to CPU and Opera to the Android version",
        "88d4d34a8064a4ff39fd5e144eea7762 (17:02): You'll still usually have some sort of informal review in such cases, though.",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:02): I wonder how many Android users know what CPU their device has :-(",
        "b25b6b77a0087ff8385941e5545d32ea (17:03): e.g. html5lib doesn't really have review. Except that I have never committed a patch from a non-core-contributer without reviewing it first",
        "b25b6b77a0087ff8385941e5545d32ea (17:03): For single person projects the concept of review doesn't even make sense",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:04): I'd love to know if the default browser on Android 2.3.3 supports WebM and if Opera Mobile 11 on Android &gt;= 2.3 but &lt; 2.3.3 supports WebM",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:10): for additional Android fragmentation FAIL, HTC doesn't list the Android version or the CPU instruction set in its product specs",
        "4d05dc3c4352ebe7593b536f2078cfe9 (17:11): b8810fee2f4a71f849f3f7409546d1d9: I tried to update my android device but it requires a SIM card‚Ä¶",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:12): 4d05dc3c4352ebe7593b536f2078cfe9: so the device works without a SIM in general but doesn't update without a SIM?",
        "4d05dc3c4352ebe7593b536f2078cfe9 (17:12): yes",
        "4d05dc3c4352ebe7593b536f2078cfe9 (17:12): I'm using it on wifi all the time in the office for testing but never as a phone",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:12): is this some user-hostile mechanism that allows updates to be blocked by operator?",
        "4d05dc3c4352ebe7593b536f2078cfe9 (17:12): might be",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:13): because otherwise, people with hostile operators could just take out the SIM and upgrade over wifi",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:13): the mobile business is so sad",
        "4d05dc3c4352ebe7593b536f2078cfe9 (17:14): as someone reminded recently, home ISP was bad 10 years ago",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:14): even Apple, the supposed savior of users from operator hostility, reportedly requires partner operators to impose data transfer caps in order sell iPads",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:14): that's so crazily bizarre.",
        "4d05dc3c4352ebe7593b536f2078cfe9 (17:15): like you could only use the ISP modem, you couldn't use more than one machine behind the modem, etc",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:15): maybe they want their product offering to suck everywhere as much as it sucks in the U.S. or something",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:15): 4d05dc3c4352ebe7593b536f2078cfe9: in France? it wasn't like that in Finland in 1995",
        "4d05dc3c4352ebe7593b536f2078cfe9 (17:16): b8810fee2f4a71f849f3f7409546d1d9: yes",
        "4d05dc3c4352ebe7593b536f2078cfe9 (17:16): they weren't enforcing the &quot;one machine&quot; rule a lot, but it was in the contract",
        "4d05dc3c4352ebe7593b536f2078cfe9 (17:17): and the plans were limited in time, only 10/20/50 hours a month",
        "8925426ae91d6282f262eb2ee108bdc0 (17:19): 4d05dc3c4352ebe7593b536f2078cfe9: It was the same way in the US back then :(",
        "4d05dc3c4352ebe7593b536f2078cfe9 (17:20): hopefully one ISP was aggressive enough to change a lot of those rules and we now have one of the cheapest internet access",
        "4d05dc3c4352ebe7593b536f2078cfe9 (17:20): and this ISP (Iliad/Free) should launch mobile plans next year, hopefully changing the market in the same way"
    ],
    "person_ids": [
        "cc097e0d7183ae8436e7df709553c8c0",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "88d4d34a8064a4ff39fd5e144eea7762",
        "b25b6b77a0087ff8385941e5545d32ea",
        "4d05dc3c4352ebe7593b536f2078cfe9",
        "8925426ae91d6282f262eb2ee108bdc0"
    ]
}