{
    "id": "431297244af5179c663eb9d2fb536d30",
    "messages": [
        "69b0d3dfe919a6b860a9fac82de52a7e (12:18): wonders what idiom &quot;nicely nicely&quot; translates to in dutch :-)",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:21): replies to mail from november 2004",
        "edb259c0e0038f38bb200bc20c8cbf7e (12:21): isn't sure, got it from Ideal (BBC show)",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:22): odd",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:22): what context do they use it in?",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:22): i've never heard it before",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:22): google doesn't seem to help",
        "edb259c0e0038f38bb200bc20c8cbf7e (12:22): the main character says it when he's pleased",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:22): aah",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:22): odd",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:22): the british, really, you never know what they'll say next",
        "f139aba52f9fa1394b4034a7954b2220 (12:23): LOL",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:23): ooh that reminds me, i have a top gear downloading",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:23): i get to watch it tomorrow evening!",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:23): yay",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:23): i was so happy to see top gear on itunes",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:24): back on topic, i wonder how to convert &lt;datagrid&gt; to an async API",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:25): 040342c014ffc1c11592948bd92e3721: ping",
        "f139aba52f9fa1394b4034a7954b2220 (12:26): 69b0d3dfe919a6b860a9fac82de52a7e, is that the original or current BBC series, or the US version of Top Gear?",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:26): current bbc series",
        "f139aba52f9fa1394b4034a7954b2220 (12:27): ok. I've not heard of it. Just reading about it in wikipedia",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:27): you haven't heard of top gear? oh my",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:27): it's awesome",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:27): and i don't even remotely like cars",
        "f139aba52f9fa1394b4034a7954b2220 (12:28): apparently there's a new Australian version that started last year",
        "f139aba52f9fa1394b4034a7954b2220 (12:28): though it's on SBS, and so even if I were in Australia, I'd be unlikeliy to bother watching it",
        "ab7faae5d7b250ea8606486575f8f79c (12:29): It seems more like a TV show about people who are making a TV show about cars, rather than actually being a TV show about cars",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:29): the reason to watch it isn't the show concept so much as the execution, and i doubt that other teams would get quite the same result",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:29): ab7faae5d7b250ea8606486575f8f79c: right",
        "f139aba52f9fa1394b4034a7954b2220 (12:32): so is it suitable for people like myself with no interest in cars and/or racing, except for the annual Bathurst 1000?",
        "b07211a0c7cb119232799d2119cea90f (12:33): yes",
        "b07211a0c7cb119232799d2119cea90f (12:33): very much so",
        "040342c014ffc1c11592948bd92e3721 (12:33): 69b0d3dfe919a6b860a9fac82de52a7e: pong",
        "b07211a0c7cb119232799d2119cea90f (12:33): it's suitable for just about anyone :)",
        "f139aba52f9fa1394b4034a7954b2220 (12:33): alright. I'll download a few episodes later and check it out, if I remember",
        "ab7faae5d7b250ea8606486575f8f79c (12:34): (One particular example is that they had a segment filmed in America, and introduced it by saying they only had visas for making documentaries, and the last time they were in America they were accused of having made an entertainment film instead, and there wasn't time to get new visas, so this time they would have to be very careful not to be entertaining)",
        "ab7faae5d7b250ea8606486575f8f79c (12:34): (which is a bit meta)",
        "edb259c0e0038f38bb200bc20c8cbf7e (12:34): yeah, Top Gear is funny, didn't know it was still going on",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:35): 040342c014ffc1c11592948bd92e3721: according to ken, what i was saying yesterday is indeed google's opinion; he thinks you may have confused his interest in captioning standards for interest in annotation standards",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:35): 040342c014ffc1c11592948bd92e3721: in particular, we're still very much playing around with annotation so we wouldn't really know what we wanted standardised yet",
        "040342c014ffc1c11592948bd92e3721 (12:35): ah",
        "040342c014ffc1c11592948bd92e3721 (12:35): hmm",
        "040342c014ffc1c11592948bd92e3721 (12:36): I wonder what I confused then",
        "1c32249ea47a56f145a75349f2b0426a (12:36): isn't interested in cars and doesn't watch TV anymore either.. :-p",
        "040342c014ffc1c11592948bd92e3721 (12:37): anyway - we all know we need to solve the simple case first",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:37): 1c32249ea47a56f145a75349f2b0426a: TV is much more entertaining once you remove all ads, trailers, previews, overlayed images, etc, and make it on-demand and limit it to only quality programming. :-)",
        "040342c014ffc1c11592948bd92e3721 (12:37): gets back to it :)",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:38): 040342c014ffc1c11592948bd92e3721: :-)",
        "f139aba52f9fa1394b4034a7954b2220 (12:38): 69b0d3dfe919a6b860a9fac82de52a7e, if you're referring to the video annotation &quot;feature&quot; that YouTube has implemented, I really despise that. It has ruined so many otherwise good videos, because people abuse it way too much",
        "040342c014ffc1c11592948bd92e3721 (12:38): no harm in discussing the future though!",
        "ab7faae5d7b250ea8606486575f8f79c (12:39): likes that Top Gear is an hour-long programme and because it's on the BBC it's actually really an hour, not 30 minutes plus adverts :-)",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:39): wonders how &lt;video&gt; rendering in WebKit is threaded",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:40): f139aba52f9fa1394b4034a7954b2220: http://www.blogsdna.com/288/turn-off-youtube-video-annotations.htm",
        "f139aba52f9fa1394b4034a7954b2220 (12:41): 69b0d3dfe919a6b860a9fac82de52a7e, I always turn them off manually when I see them.",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:41): ab7faae5d7b250ea8606486575f8f79c: i was utterly shocked the first time i was exposed to US TV -- if you think (non-bbc) british tv is bad, you should see tv in the us, holy crap",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:41): I've seriously considered stopping paying for the TV permit and getting rid of the tuner accordingly",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:41): ab7faae5d7b250ea8606486575f8f79c: they play ads between the teaser and the first act, and between the last act and the credits!",
        "f139aba52f9fa1394b4034a7954b2220 (12:42): 69b0d3dfe919a6b860a9fac82de52a7e, unfortunately, there's no way to have them off by default",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:42): f139aba52f9fa1394b4034a7954b2220: yeah it does seem that way, that's unfortunate",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:42): too bad availability of online movie rentals sucks in Finland",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:42): i don't understand why media companies are still region-limiting availability",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:43): that makes zero sense to me",
        "040342c014ffc1c11592948bd92e3721 (12:43): b8810fee2f4a71f849f3f7409546d1d9: get a digital tuner card and set up mythtv",
        "f139aba52f9fa1394b4034a7954b2220 (12:43): b8810fee2f4a71f849f3f7409546d1d9, I suggest using Giganews and Newzbin for your TV and film needs",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:43): why would you ever explicitly _restrict_ your audience?",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:43): 040342c014ffc1c11592948bd92e3721: I have a USB tuner and EyeTV",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:43): then again, they also do drm and stuff, they clearly don't understand the digital age yet",
        "040342c014ffc1c11592948bd92e3721 (12:43): and you have to pay for that in Finland?",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:43): 040342c014ffc1c11592948bd92e3721: yes",
        "040342c014ffc1c11592948bd92e3721 (12:44): :(",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:44): 040342c014ffc1c11592948bd92e3721: like in the UK",
        "040342c014ffc1c11592948bd92e3721 (12:44): not here",
        "040342c014ffc1c11592948bd92e3721 (12:44): fortunately",
        "f139aba52f9fa1394b4034a7954b2220 (12:44): 69b0d3dfe919a6b860a9fac82de52a7e, it makes some sense for the BBC, since ok UK citizens are paying their BBC TV licences, and other people would just be free loading off them",
        "ab7faae5d7b250ea8606486575f8f79c (12:44): 69b0d3dfe919a6b860a9fac82de52a7e: If you sell something to a wider audience now, you can't sell it to them next year for more money",
        "f139aba52f9fa1394b4034a7954b2220 (12:44): s/since ok/since only/",
        "ab7faae5d7b250ea8606486575f8f79c (12:44): so you lose the opportunity for price discrimination",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:45): f139aba52f9fa1394b4034a7954b2220: it makes sense taht the bbc doesn't give away their content internationally, but they don't even sell most of it! top gear is only on iTunes in the US because it is shown on BBC America and BBC America has a separate deal with iTunes!",
        "040342c014ffc1c11592948bd92e3721 (12:45): I heard this weird argument that audiences outside the target country would need to get different ads and so some sites restrict their region",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:45): it's moronic",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:45): ab7faae5d7b250ea8606486575f8f79c: why can't yet sell it straight away for more money? by next year, half the audience will have bittorrented it",
        "040342c014ffc1c11592948bd92e3721 (12:46): we still cannot get Hulu down here",
        "ab7faae5d7b250ea8606486575f8f79c (12:46): 69b0d3dfe919a6b860a9fac82de52a7e: They sell it on DVD, but I don't know if they sell it on US-regioned DVDs so maybe that doesn't help",
        "f139aba52f9fa1394b4034a7954b2220 (12:46): 69b0d3dfe919a6b860a9fac82de52a7e, I agree that there should be no restrictions on selling TV shows, films and music worldwide",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:46): it's also moronic that iTunes rentals are available only in a couple of English-language locales",
        "ab7faae5d7b250ea8606486575f8f79c (12:46): 69b0d3dfe919a6b860a9fac82de52a7e: I think you overestimate how many people use BitTorrent :-)",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:46): which suggests that someone at Apple thinks that they couldn't offer untranslated content elsewhere",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:47): b8810fee2f4a71f849f3f7409546d1d9: i doubt it's apple's fault frankly",
        "040342c014ffc1c11592948bd92e3721 (12:47): it's usually the content owners (traditional distributors)",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:47): do you mean content owners prohibit untranslated distribution?",
        "040342c014ffc1c11592948bd92e3721 (12:47): they are not entering a new market without knowing how to commercialise it properly",
        "ab7faae5d7b250ea8606486575f8f79c (12:47): 69b0d3dfe919a6b860a9fac82de52a7e: They probably want to negotiate with broadcasters in foreign regions to do the first showing (and thus get millions of viewers and lots of money from advertisers), which takes months or years to sort out and schedule, before distributing it online",
        "040342c014ffc1c11592948bd92e3721 (12:48): I agree",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:48): after all, once the content is available in the U.S. and U.K. letting others pay for it would be free money",
        "f139aba52f9fa1394b4034a7954b2220 (12:48): unfortunately, the way the rights organisations like the RIAA and MPAA, and their international equivalents are structured, retailers have to negotiate rights in each territory individually, which sucks so much. And they also have to consider release schedules on local TV networks, so they don't compete directly with their old and failing business model",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:49): so is it just a coincidence that the U.K. was the next territory after the U.S.?",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:49): ab7faae5d7b250ea8606486575f8f79c: i would be surprised if they got more money from ads on syndication than they did from iTunes sales to an equal audience. And if it's not an equal audience, then one still doesn't preclude the other.",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:49): b8810fee2f4a71f849f3f7409546d1d9: sometimes the UK is first, even (e.g. some babylon 5 and sg-1 episodes aired in the UK before the US)",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:50): basically the entire media industry is aniquated",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:50): anyway",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:50): anyway, when Steve promised &quot;Internation later this year [2008]&quot;, I expected something more than just the U.K.",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:50): *national",
        "f139aba52f9fa1394b4034a7954b2220 (12:51): b8810fee2f4a71f849f3f7409546d1d9, Australia got some TV series too",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:51): i expect he did too",
        "ab7faae5d7b250ea8606486575f8f79c (12:51): 69b0d3dfe919a6b860a9fac82de52a7e: You can't really broadcast a nationwide exclusive of some series if 5% of people have already downloaded it on iTunes and know exactly what's going to happen and give spoilers to everyone else and ruin the excitement",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:52): ab7faae5d7b250ea8606486575f8f79c: yes because national boundaries are really effective at stopping _that_ problem",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:53): I stopped watching series, because the broadcast distribution model just sucks for them--you have to capture the data at a certain time, and the time isn't stable because sports are allowed to go overtime",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:54): i recommend interning with some US company, getting a US credit card, and keeping it when you leave",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:54): :-)",
        "f139aba52f9fa1394b4034a7954b2220 (12:54): ab7faae5d7b250ea8606486575f8f79c, the fact is that refusing to sell content directly to consumers only ignores the fact that Usenet and BitTorrent are already catering to that market well",
        "1c32249ea47a56f145a75349f2b0426a (12:55): even my sister uses torrent. :)",
        "f139aba52f9fa1394b4034a7954b2220 (12:55): I only use torrent when something isn't available on Usenet because torrents can be and are actively tracked by rights organisations, whereas usenet can't be",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:57): my neighbours try to use torrent",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:58): i block it because they aren't any good at bandwidth management and it takes down my network",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:58): (personally i just use HTTP to download tv shows)",
        "ab7faae5d7b250ea8606486575f8f79c (12:59): f139aba52f9fa1394b4034a7954b2220: Rights organisations could get the news servers taken down for hosting illegal content, and then replace them with servers run by themselves which log all accesses",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:00): but they don't :-)",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:00): (yet, anyway)",
        "f139aba52f9fa1394b4034a7954b2220 (13:01): ab7faae5d7b250ea8606486575f8f79c, if they were running the servers, then they're the ones providing access and they can't turn around and accuse users of obtaining illegal access",
        "ab7faae5d7b250ea8606486575f8f79c (13:01): I guess the main difference is that people get caught/punished for uploading content (which will happen in any P2P system), not for downloading it (which is all that happens in Usenet)",
        "f139aba52f9fa1394b4034a7954b2220 (13:01): but Usenet servers are protected by the DMCA safe harbour provisions in the US, and similar laws in other countries",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:03): so what you're saying is p2p systems should be written in such a way as to be covered by safe-harbour provisions...",
        "f139aba52f9fa1394b4034a7954b2220 (13:03): 69b0d3dfe919a6b860a9fac82de52a7e, yes, if that's possible",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:03): that i want to see",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:03): for the comedic value if nothing else",
        "f139aba52f9fa1394b4034a7954b2220 (13:03): like a Freenet-like P2P system",
        "ab7faae5d7b250ea8606486575f8f79c (13:03): I don't think I'd want to rely on a &quot;safe harbour&quot; defence when the service's entire reason for existence is to serve illegal content to people",
        "f139aba52f9fa1394b4034a7954b2220 (13:03): unfortunately, Freenet is a little too slow for such things",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:03): bittorrent is used for far more than illegal content",
        "ab7faae5d7b250ea8606486575f8f79c (13:14): Grokster served legal content too, but its main usage and reason for existence was to serve illegal content",
        "ab7faae5d7b250ea8606486575f8f79c (13:14): which seems to be about the same situation as Usenet binaries",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:14): ab7faae5d7b250ea8606486575f8f79c: Usenet binaries can be used for distributing copies of perl"
    ],
    "person_ids": [
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "edb259c0e0038f38bb200bc20c8cbf7e",
        "f139aba52f9fa1394b4034a7954b2220",
        "ab7faae5d7b250ea8606486575f8f79c",
        "b07211a0c7cb119232799d2119cea90f",
        "040342c014ffc1c11592948bd92e3721",
        "1c32249ea47a56f145a75349f2b0426a",
        "b8810fee2f4a71f849f3f7409546d1d9"
    ]
}