{
    "id": "43eeec247419a8a1ec01543ad020d14a",
    "messages": [
        "0a39f78bcb297ab0ebe8a29c28bfed89 (16:58): planet: HTML5 and WAI-ARIA &lt;http:/ e3fb62ebfa4f36acf5cbff6a6ed0f2e0vankesteren.nl/2009/04/html5-wai-aria&gt;",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:22): so is there a list other than public-pfwg-comments where submitted comments area actually discussed?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:22): s/comments area/comments are/",
        "b25b6b77a0087ff8385941e5545d32ea (17:27): a9b326df4e6da61c5b6f5e1058be83a2: There is a wai-xtech list but I'm not sure what is actually discussed there",
        "b25b6b77a0087ff8385941e5545d32ea (17:28): Like they might just ignore the comments then tell you later that you should have posted to pfwg-comments",
        "b25b6b77a0087ff8385941e5545d32ea (17:29): As I may have mentioned before the whole idea of a write-only email address is insane",
        "b25b6b77a0087ff8385941e5545d32ea (17:29): s/address/list/",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:29): b25b6b77a0087ff8385941e5545d32ea: yeah, definitely suboptimal",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:30): not everybody shares our views about value of openness and working completely in public",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:31): maybe there's not any discussion at all anywhere going about the submitted comments yet",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:31): some groups sort of do a comment-collection phase and then respond in batches",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:32): I'm wondering if Aaron Leventhal is still involved with ARIA as an editor",
        "b25b6b77a0087ff8385941e5545d32ea (17:32): a9b326df4e6da61c5b6f5e1058be83a2: I would be intrigued to hear a defence of the current pfwg setup",
        "b25b6b77a0087ff8385941e5545d32ea (17:34): Because even allowing for the fact that the group operates in secret, not allowing you to subscribe to the email list where you are commenting is bizzare in the extreme",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:35): I thnk maybe it just wasn't well thought-through",
        "b25b6b77a0087ff8385941e5545d32ea (17:36): a9b326df4e6da61c5b6f5e1058be83a2: Maybe you could enquire about the possibility of a renassiance?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:36): yeah, I will",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (17:36): they log issues in a private issue tracker and then go through those during telcons",
        "b25b6b77a0087ff8385941e5545d32ea (17:36): a9b326df4e6da61c5b6f5e1058be83a2: Great",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (17:36): I was told",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:36): 876f3aa8d5bea53881de8315f292288a is here, so we can chat with him about it if/when he's free",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (17:37): and then at some point they come back with an answer though b8810fee2f4a71f849f3f7409546d1d9 told me not all his comments from before the LC were addressed",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (17:37): (which violates the Process document, but that's no surprise I suppose)",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:38): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: yeah, I got a bit annoyed when I found that ARIA went to LC without either fixing the spec according my comments or responding with explicit rejection of my comments with rationale",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:38): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: so I quoted a bit of the Process in one of my Last Call comments",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:38): that is definitely an issue",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:42): the Disposition of Comments document for every spec that transitions beyond LC is supposed to be a complete record, and the Director's decision is based on reviewing that document under the assumption that it is a complete and accurate record",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (17:42): this were comments before going to LC",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:42): ah",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:42): so that's a different case",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (17:43): still, per &quot;Process&quot; you go to LC having done your very best to address all the issues you know about",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:43): yeah",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (17:43): (and I believe it even calls for doing some outreach to get to know about more issues)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:43): there is a general expectation that groups make a good-faith effort to respond to all comments, regardless of what part of the process",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:47): anyway, given the problem with public-pfwg-comments, it seems like you could choose to not submit comments there at all, but instead submit them over at wai-xtech",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:48): I would think that the editors would all be subscribe to wai-xtech also",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:48): a9b326df4e6da61c5b6f5e1058be83a2: then there'd be a risk of comments getting ignored due to wrong submission mechanism",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:51): if messages are posted to wai-xtech, with subjects clearly labeled as &quot;Last Call comment&quot;, it would be pretty hard for them to be ignored",
        "876f3aa8d5bea53881de8315f292288a (17:52): I see I'm pinged. I don't want to be put in a position of responding defensively, which the tone of the above steers me to. I also have a meeting in a few so can't really get into it. A couple points of information:",
        "876f3aa8d5bea53881de8315f292288a (17:52): The PF comments list is post-only because if comments come to a list where discussion also happens, it's nearly impossible to verify that we've satisfied our formal requirement of responding to all comments if they're mixed in with discussion. So we define comments as those arriving on the post-only list, and other discussions are helpful but not treated formally.",
        "876f3aa8d5bea53881de8315f292288a (17:52): We do participate in discussions about the issues that have been submitted to us, included the XTech list, HTML list, and other fora. None of those discussions necessarily represent a group consensus on how to respond to the comment. Ensuring we have consensus on the response is one reason we hold off on sending responses.",
        "876f3aa8d5bea53881de8315f292288a (17:52): The discussion of the public comments is happening in Member space in part because PF is structured as a Member group and that is the visibility our tracker happens to have. I have to say, though, that discussing more openly, when the discussion isn't complete and we don't have consensus, sometimes triggers a flood of reactions that we have to take time to deal with, when we didn't even have...",
        "876f3aa8d5bea53881de8315f292288a (17:52): ...consensus on the position, so it really makes it difficult for us to fulfill our process requirements.",
        "876f3aa8d5bea53881de8315f292288a (17:52): The comment stage does include a phase of requesting feedback from the commenter. We don't simply publish a new draft after rejecting suggestions received, without at least working with the commenter to see if we can arrive at a position.",
        "876f3aa8d5bea53881de8315f292288a (17:52): We were not under formal requirements to respond to comments received before Last Call, so have not violated Process. However, we did make an attempt to make sure we addressed things. It is quite possible we dropped the ball on some, and I apologize.",
        "876f3aa8d5bea53881de8315f292288a (17:52): Please don't send comments to wai-xtech without sending to public-pfwg-comments. They won't get processed as formal comments. Discussions on wai-xtech are helpful, and we'll try to be sure to reference them as we discuss the comments.",
        "876f3aa8d5bea53881de8315f292288a (17:52): I have to go to a meeting now. I hope this is helpful information. I feel like you think we're acting in bad faith, and I believe we're working very hard to act in good faith. We have specific reasons for the way we do things, I hope you can understand that.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:53): nobody is saying you are acting in bad faith",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (17:54): was that a copy &amp; paste?",
        "876f3aa8d5bea53881de8315f292288a (17:54): yes, but I wrote it just now, it wasn't a canned response if that's what you're asking",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:55): 876f3aa8d5bea53881de8315f292288a: the &quot;tone of the above&quot; (and comments elsewhere) seems to me to be a tone of genuine frustration, by people who want to comment on the spec and are finding that the current mechanism provided is making it hard for them do so in the way the can in other places",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (17:55): 876f3aa8d5bea53881de8315f292288a, ok",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:57): 876f3aa8d5bea53881de8315f292288a: many of the active HTML WG comments are coming from an culture of almost-completely-open dialog, and not accustomed to no-public discussions",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:58): 876f3aa8d5bea53881de8315f292288a: you all are of course free to use what commenting mechanisms work best for your needs",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:59): but another risk here is that people end up being unhappy enough with the mechanism provided that they just don't bother to comment at all",
        "876f3aa8d5bea53881de8315f292288a (18:00): I'm sorry, I am in a meeting now, I can't continue discussion right now. It does seem re last comment that this is a larger issue with concerns about W3C process. I feel caught in the middle on that. I really can't address it right now, and suggest we need Team discussion on this.",
        "876f3aa8d5bea53881de8315f292288a (18:00): FWIW I've been supporting many of the POVs expressed by HTML members in various fora",
        "876f3aa8d5bea53881de8315f292288a (18:00): but also have various constraints to work in",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:01): understood, it's not a personal thing fwiw",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:01): at least, I hope it isn't!"
    ],
    "person_ids": [
        "0a39f78bcb297ab0ebe8a29c28bfed89",
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "b25b6b77a0087ff8385941e5545d32ea",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "876f3aa8d5bea53881de8315f292288a"
    ]
}