{
    "id": "463720ea800a6f38d6ea6e11fc461b05",
    "messages": [
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:13): &quot;The interim junior co-chair of the working group has thus far shown indifference (some might say hostility) toward the needs of those arriving with sketches of airplanes they'd like implementors to build for them.&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:14): i believe that is a compliment",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:15): (and a well-earned one, i might add)",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:18): a9b326df4e6da61c5b6f5e1058be83a2: is that an actual quote?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:19): b8810fee2f4a71f849f3f7409546d1d9: no, just something I can imagine somebody saying",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (11:19): :p",
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:20): I figured I would get some reactions to the &quot;shipbuilding&quot; QA blog entry I wrote, but don't seem to be any so far",
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:21): http://www.w3.org/QA/2008/06/shipbuilding.html",
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:21): but John Boyer posted a comment to the dbaron interview",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:22): 69b0d3dfe919a6b860a9fac82de52a7e: I'm impressed by how well the foreign content stuff responds to bogus input",
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:22): http://www.w3.org/QA/2008/06/interview_david_baron_on_firef.html#c151036",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:25): b8810fee2f4a71f849f3f7409546d1d9: cool",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:26): congratulates self for doing token-major insertion-mode-minor dispatching despite what the spec says",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:26): :-)",
        "b07211a0c7cb119232799d2119cea90f (11:41): I think hubbub might end up with a mixed approach",
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:41): 69b0d3dfe919a6b860a9fac82de52a7e: so no more open issues for URLs? (except for the one mentioned in the note at the beginning of the URLs section)",
        "b07211a0c7cb119232799d2119cea90f (11:41): where character/doctype/eof tokens get dealt with token-major and everything else insertion-major",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:42): a9b326df4e6da61c5b6f5e1058be83a2: my main goal, defining how to handle errorneous URIs and how to handle non-ASCII content in URIs everywhere, is now done, yes.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:42): k",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:45): resists the temptation to write a smartass answer on mike's blog entry (&quot;I considered your suggestion, but it's not really in line with our goals for this version, so I'm not going to do it for now.&quot;)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:46): my blog entry?",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:46): shipbuildin",
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:48): ah",
        "4ed79bc86fc1a897151872df945b52e3 (11:55): John Boyer isn't really doing xforms a favor with the tone of that comment...",
        "056705610ffb1726be04db950e5feebe (12:08): so glad 69b0d3dfe919a6b860a9fac82de52a7e took the initiative to do the URL stuff... now he can just copy and paste into the widget spec :D",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:10): about John's comment, this part: &quot;the demand for XForms is such that IBM has decided not to wait for web browser makers to define the web. Just as Ajax libraries like Dojo are coming to define the new face of web application development&quot;",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:11): I've seen several different people saying things quite similar to that lately",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:11): seems like they may have gotten together and decided to use it as a common message",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:12): to suggest that browser vendors are no longer innovating and can be safely ignored (or something)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:13): which would seem like sort of a convenient view to have if you were working on specs without actively trying to get browser vendors involved in the work on those specs",
        "b07211a0c7cb119232799d2119cea90f (12:17): the thing is, John's comments don't actually refute what David says",
        "b07211a0c7cb119232799d2119cea90f (12:17): Mozilla obviously hasn't seen enough demand to balance the cost of writing/testing/offering/permanently supporting the code in Firefox",
        "b07211a0c7cb119232799d2119cea90f (12:18): because if they had, then they would be trying to meet it",
        "b07211a0c7cb119232799d2119cea90f (12:22): it also sounds like XForms is being deployed in intranet apps, not interweb apps, so it seems like a plugin would do there anyway",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:23): b07211a0c7cb119232799d2119cea90f: yeah, I think John doesn't address the issue that the cost of actually implementing is just one part of the overall cost. maybe just a small part of the cost, looking at it long-term",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:23): I personally think a lot of Web developers would really like to have native XForms support and could come up with some great applications to make use of it",
        "b07211a0c7cb119232799d2119cea90f (12:24): I don't really know what can't be done now that could be done with XForms",
        "b07211a0c7cb119232799d2119cea90f (12:25): all their advertising is about schemas and XML",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:25): I guess it's a matter of what could possibly be done more easily than it could be now",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:25): yeah, it's definitely not to their advantage to advertise those aspects",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:27): I think the big advantages from XForms would come only if it were implemented interoperably across browsers",
        "056705610ffb1726be04db950e5feebe (12:28): plugs http://standardssuck.org upcoming episode &quot;W3C Digging the XML Grave&quot; ... should be out later today!",
        "b07211a0c7cb119232799d2119cea90f (12:28): I guess I just don't see the need for a paradigm shift in the way forms are used on the web",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:29): I don't see a need for a paradigm shift, either.",
        "b07211a0c7cb119232799d2119cea90f (12:29): web forms 2 seems to hit the sweet spot, more-or-less",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:29): so it would allow developers who wante to use declarative approach for buidling cross-browser apps. that is, leaving heavy lifting up to the browser instead of needing to do it themselves in JS code",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:29): however, for Ajax app, it makes sense to implement MVC in JS instead of relying on an XForms engine providing one blessed MVC engine",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:30): I think XForms is meant to be useful for more than just forms",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:30): it has evolved that way, anyway",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:30): 056705610ffb1726be04db950e5feebe: what's the grave? 5th ed.?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:32): b07211a0c7cb119232799d2119cea90f: anyway, I'm playing devil's advocate here. it seems at this point that there's not much likelihood of XForms getting implemented natively across browsers is",
        "b07211a0c7cb119232799d2119cea90f (12:33): I guess I'm just not sold on declarative languages full stop.  code and data aren't as distinct as people would like to think they are, IME, and web forms 2 seems to do about the right thing (move from JS-&gt;HTML for really common things)",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:33): the problem with being declarative is that once you escape to JS even a little (the XForms group showed interest in XHR for instance), the main selling points of being declarative get poisoned",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:33): so one might as well embrace JS from the getgo",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:34): (hmm. I guess I just ended up arguing against the WF2 repetition templates)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:35): yeah, the work on declarative approaches seems to be bases on a hypothesis that declarative approaches are absolutely better and that many or most developers would prefer them, given a choice",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:36): but there does not seem to be a huge amount of data to support that hypothesis",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:36): and some that seems to disprove it",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:36): for example, the popularity of &lt;canvas&gt; among developers",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:37): it's a conspiracy perpetrated by CS curricula not starting with Prolog",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:38): hmm. my error messages in 'in frameset' suck",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:38): b8810fee2f4a71f849f3f7409546d1d9: WF2 repetition templates are sort of slated for removal at this point, are they not? seems like browser vendors have not shown much interest in supporting them",
        "3f2e2531201cfbf853f16f668132eaf2 (12:38): Most web developers have not partaken in CS curricula",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:39): a9b326df4e6da61c5b6f5e1058be83a2: didn't Opera implement them? I have no idea about interest on part of other vendors.",
        "3f2e2531201cfbf853f16f668132eaf2 (12:40): If I remember correctly, the &lt;datatemplate&gt; stuff in the spec was an attempt at replacing the WF2 repetition feature",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:41): many of the best developers (non-Web, C/C++ developers) I have worked with professionally have not partaken of CS curricula. they came from some other field and picked up programming initially as a scratch-an-itch means-to-an-end way to solve some other problem they needed to solve for their original work",
        "3f2e2531201cfbf853f16f668132eaf2 (12:41): (Opera does implement repetition like in http://olav.dk/wf2/demo/repetition.asp )",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:42): b8810fee2f4a71f849f3f7409546d1d9: I thought they were not implemented in Opera, but perhaps I'm wrong",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:42): b8810fee2f4a71f849f3f7409546d1d9: conspiracy perpetrated by CS curricula not starting with Prolog? what's special about Prolog in this regard?",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:42): a9b326df4e6da61c5b6f5e1058be83a2: I may be wrong about Opera",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:42): a9b326df4e6da61c5b6f5e1058be83a2: Prolog is declarative",
        "3f2e2531201cfbf853f16f668132eaf2 (12:43): a9b326df4e6da61c5b6f5e1058be83a2: They are",
        "3f2e2531201cfbf853f16f668132eaf2 (12:46): The &quot;Moving blocks&quot; bit of http://olav.dk/wf2/demo/repetition.asp does expose a bug in Opera's redrawing of move-up/down buttons, though",
        "3f2e2531201cfbf853f16f668132eaf2 (12:47): I never paid much attention to Prolog, but I was taught some Verilog, which seems like a declarative language",
        "139513027e8e90b5582cbc68fc733884 (12:47): if XForms can be usefully implemented in script then perhaps there is no need to implement it natively in browsers",
        "4ed79bc86fc1a897151872df945b52e3 (12:49): prolog is an exercise in doubt",
        "4ed79bc86fc1a897151872df945b52e3 (12:50): You give the program some constraints and hope it doesn't do something really stupid when solving it",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:50): does XForms depend on the PSVI?",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:51): considers the PSVI harmful",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:51): 139513027e8e90b5582cbc68fc733884: given improvements in JS interpreter performance, maybe XForms implemented as a cross-browser JS library is more feasible now that it would have been before",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:51): b8810fee2f4a71f849f3f7409546d1d9: I think it does not",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:51): it doesn't absolutely depend on schema support",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:52): a9b326df4e6da61c5b6f5e1058be83a2: good",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:52): yeah",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:52): depending on PSVI would be a deal breaker for sure",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:54): anyway, the general premise that declarative programming is something a lot of developers would seem to suggest we'd all already be using lots of great apps built using Prolog or whatever",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:54): something a lot developers would want/prefer",
        "3f2e2531201cfbf853f16f668132eaf2 (12:57): It would suggest we'd all be writing declarative formulas into Excel",
        "3f2e2531201cfbf853f16f668132eaf2 (12:57): Oh, we are",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:57): heh",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:57): SQL",
        "4ed79bc86fc1a897151872df945b52e3 (12:58): 3f2e2531201cfbf853f16f668132eaf2: Or that we're using the spreadsheet as a variable matrix and using it for regular imperative programming :P",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:58): most people I work with don't use Excel for formulas. they use it as a pretty table editor",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:58): for some reason, theoretical purity of programming languages and doing real work don't go hand in hand. A lot of real work is done in C++ which isn't exactly the most pure language.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:59): &quot;worse is better&quot;",
        "4ed79bc86fc1a897151872df945b52e3 (13:00): In the ultimate parable, declarative programming is like wearing a straitjacket. You can't stab yourself in the foot anymore, but it feels kinda restrictive :)",
        "b07211a0c7cb119232799d2119cea90f (13:00): you said SQL, but SQL is an example of where people wilfully concatenate strings and all do manner of weird string handling, and then loop over the results and do something imperitive wit hthem",
        "b07211a0c7cb119232799d2119cea90f (13:00): and even SQL has functions and whatnot, doesn't it?",
        "b07211a0c7cb119232799d2119cea90f (13:01): to me it looks like declarative works in a very small and well-defined problem space, I haven't seen that it works too well outside of that",
        "4ed79bc86fc1a897151872df945b52e3 (13:01): _Pure_ functions don't conflict with declarativeness (I believe)",
        "b07211a0c7cb119232799d2119cea90f (13:01): wonders if all the uses of his sweeping statement licence have been used now...",
        "3f2e2531201cfbf853f16f668132eaf2 (13:01): offers b07211a0c7cb119232799d2119cea90f a free 30-day licence extension",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:02): on the Web, there's always a trouble-maker who doesn't agree about what the problem space is"
    ],
    "person_ids": [
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0",
        "b07211a0c7cb119232799d2119cea90f",
        "4ed79bc86fc1a897151872df945b52e3",
        "056705610ffb1726be04db950e5feebe",
        "3f2e2531201cfbf853f16f668132eaf2",
        "139513027e8e90b5582cbc68fc733884"
    ]
}