{
    "id": "473a980f6af495b7cba72607726b4976",
    "messages": [
        "f139aba52f9fa1394b4034a7954b2220 (17:41): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: I could have told you not to bother responding to him a long time ago.  He like to use the equivalent of the &quot;Pokemon test&quot; in his arguments a lot. http://en.wikipedia.org/wiki/WP:POKEMON",
        "f139aba52f9fa1394b4034a7954b2220 (17:43): basically, arguing that if X is good enough, then Y is also.  (He did the same for other features. e.g. listing code, kbd, samp and var and arguing that if they're included, so should whatever he wants)",
        "f139aba52f9fa1394b4034a7954b2220 (17:45): you could try responding with the chewbacca defence, it'd be as effective as anything else ;-)",
        "587bf8b858e15d03428e1415c33c38ef (17:59): MikeSmith, I agree about the utility of an organized decision rationale. The wiki seems to be the mechanism of choice so far. Have you used it much?",
        "587bf8b858e15d03428e1415c33c38ef (17:59): also... I'm curious as to how comments on mobileOK Basic Tests 1.0 are tracked. any pointers?",
        "587bf8b858e15d03428e1415c33c38ef (18:12): ok, I think I'm gonna put the question on html4-differences v1.25",
        "587bf8b858e15d03428e1415c33c38ef (18:13): is mjs around? I wonder what response options to offer. maybe yes, abstain, no, formally object",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:14): what's the practical difference between not voting and &quot;abstain&quot;?",
        "587bf8b858e15d03428e1415c33c38ef (18:14): none",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:14): k",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:14): those options seem fine with me btw",
        "587bf8b858e15d03428e1415c33c38ef (18:15): well, it contributes to the evidence that the WG is making an informed decision. maybe just a little.",
        "587bf8b858e15d03428e1415c33c38ef (18:15): &quot;working draft headed for note&quot; seems best for status",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:18): yeah...",
        "587bf8b858e15d03428e1415c33c38ef (18:30): ok, take a look: http://www.w3.org/2002/09/wbs/40318/trdiff/",
        "587bf8b858e15d03428e1415c33c38ef (18:33): the one objection I can see is &quot;we should do design principles instead&quot;. I'm OK to do design principles *also*... I wonder if it's worth some discussion first, though",
        "587bf8b858e15d03428e1415c33c38ef (18:33): changes the start date to tomorrow to avoid dirty data",
        "587bf8b858e15d03428e1415c33c38ef (18:33): just while I'm mulling it over",
        "587bf8b858e15d03428e1415c33c38ef (18:36): e3fb62ebfa4f36acf5cbff6a6ed0f2e0, are you interested/willing to work with mjs to format the design principles as a /TR/? (sandro has some tools to make a /TR/ out of wiki topics automatically; I wonder if it's worth a try)",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:36): there's no draft for design principles yet it seems",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:36): ah",
        "587bf8b858e15d03428e1415c33c38ef (18:36): http://esw.w3.org/topic/HTML/ProposedDesignPrinciples is a draft of sorts",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:36): I meant TR/ draft but then you just pressed enter :)",
        "587bf8b858e15d03428e1415c33c38ef (18:37): would like to chat with dbaron and mjs for just a bit",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:37): I can make html5/design-principles/ I suppose",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:37): seems only some minor HTML editing is needed",
        "587bf8b858e15d03428e1415c33c38ef (18:38): checking the history of the wiki topic... good: no anonymous edits. all those names should go in the acks section",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:39): makes sense",
        "587bf8b858e15d03428e1415c33c38ef (18:40): I could (a) put the question on diffs now or (b) try to get design principles in similar shape real quick and put the questions on both of them simultaneously. any strong opinions? e3fb62ebfa4f36acf5cbff6a6ed0f2e0?",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:40): makes it &quot;html-design-principles&quot;",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:41): no opinion",
        "587bf8b858e15d03428e1415c33c38ef (18:41): how close is chaals? you guys aren't in the same building or anything, are you?",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:43): his laptop is next to mine more or less",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:43): but he's hanging out somewhere else",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:43): prolly meeting or something",
        "587bf8b858e15d03428e1415c33c38ef (18:43): once you make a copy of the wiki topic in the dev.w3.org CVS repostitory, does that become the &quot;truth&quot;, or can we continue to welcome edits to the wiki topic and port them over?",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:44): porting is annoying, but I wouldn't call it &quot;truth&quot; :D",
        "587bf8b858e15d03428e1415c33c38ef (18:44): yeah; poor choice of words...",
        "587bf8b858e15d03428e1415c33c38ef (18:45): is in the habit of using &quot;truth&quot; when talking about multiple version-control repositories and sync issues",
        "587bf8b858e15d03428e1415c33c38ef (18:48): hmm... &quot;France Telecom has joined the HTML Working Group&quot;",
        "587bf8b858e15d03428e1415c33c38ef (18:54): I don't see as much reference to the design principles as I'd like. I seem to recall argument that echoes some of the principles without referring to them by name/URI",
        "587bf8b858e15d03428e1415c33c38ef (18:56): e.g. Hixie writes &quot;Several features have been designed and then",
        "587bf8b858e15d03428e1415c33c38ef (18:56): removed from HTML5 after flaws in the fallback behaviour were pointed out.",
        "587bf8b858e15d03428e1415c33c38ef (18:56): We have in fact been ruthless about ensuring this.&quot;",
        "587bf8b858e15d03428e1415c33c38ef (18:56): that seems pretty close to the &quot;Degrade Gracefully&quot; principle, but doesn't invoke it by name",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:57): One thing that was rather elegant in the past was &lt;select editable&gt;",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:57): that's replaced by an explicit relationship with &lt;input&gt; and &lt;datalist&gt;",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:57): because &lt;select editable&gt; did not have the proper fallback",
        "587bf8b858e15d03428e1415c33c38ef (18:57): the short version of &quot;Degrade Gracefully&quot; is hard for me to grok: &quot;New versions of HTML should allow documents using them to work in user agents that don't yet support it.&quot;",
        "587bf8b858e15d03428e1415c33c38ef (18:58): noodles...",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:59): lets first port the thing to HTML before making improvements :)",
        "587bf8b858e15d03428e1415c33c38ef (18:59): &quot;HTML documents that include markup for new features should work reasonably well in old [extant?] user agents&quot;",
        "587bf8b858e15d03428e1415c33c38ef (19:00): by port you mean to CVS, right? that changes the social arrangement from &quot;it's a wiki -- fix it yourself&quot; to &quot;mail suggested changes and an editor will consider them&quot;",
        "587bf8b858e15d03428e1415c33c38ef (19:00): I sorta think I should get mjs in the loop for making such a change.",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:01): in theory the wiki can still be fixed...",
        "ab7faae5d7b250ea8606486575f8f79c (19:01): They should work in new not-yet-released UAs that haven't bothered implementing the new features, as well as just old UAs",
        "587bf8b858e15d03428e1415c33c38ef (19:02): well, I understood &quot;lets first port the thing to HTML before making improvements :)&quot; as push-back against continued tweaking of the wiki topic",
        "587bf8b858e15d03428e1415c33c38ef (19:03): I started making a survey with separate questions for each design principle, but it didn't go easily.",
        "587bf8b858e15d03428e1415c33c38ef (19:05): oops; &quot;Visible Metadata&quot; is among the design principles there. it's disputed, but it's there. I didn't realize that when I suggested closing the 'fear of &quot;invisible metadata&quot;' thread.",
        "587bf8b858e15d03428e1415c33c38ef (19:07): HTML/ProposedDesignPrinciples in its present state doesn't really appeal to me. I have a hard time proposing it to the WG when I don't really like it that much.",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:11): i got an HTML variant of it",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:12): haven't added acknowledgements and stuff",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:16): should I do something with it?",
        "587bf8b858e15d03428e1415c33c38ef (19:18): hmm",
        "587bf8b858e15d03428e1415c33c38ef (19:18): mail mjs and copy public-html , a la &quot;what do you think?&quot;",
        "587bf8b858e15d03428e1415c33c38ef (19:19): that's perhaps a lot to ask...",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:20): what kind of response are you looking for?",
        "587bf8b858e15d03428e1415c33c38ef (19:20): anything from &quot;yeah, please run with that; I'm snowed under but somebody should keep it moving&quot;",
        "587bf8b858e15d03428e1415c33c38ef (19:21): to &quot;hang on a bit; I'm snowed under just now, but I'm not sure we should move from the wiki just now&quot;",
        "587bf8b858e15d03428e1415c33c38ef (19:22): others might chime in a la &quot;I don't agree with #4; it should be moved to the disputed section or changed _thusly_ or deleted&quot;",
        "587bf8b858e15d03428e1415c33c38ef (19:23): or mjs might say &quot;great; ok, I committed a few changes too. feel free to mail more change requests and I'll consider them&quot;",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:23): so I chould commit the doc to cvs?",
        "587bf8b858e15d03428e1415c33c38ef (19:23): er... I thought you did already",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:24): I wasn't sure if it was appropriate",
        "587bf8b858e15d03428e1415c33c38ef (19:24): I'm totally on the fence; I'm as much following your lead as advising you.",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:27): http://dev.w3.org/cvsweb/~checkout~/html5/html-design-principles/Overview.html",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:35): done",
        "f139aba52f9fa1394b4034a7954b2220 (19:56): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: here's an abstract for you to add to that draft:",
        "f139aba52f9fa1394b4034a7954b2220 (19:56): This document describes the set of guiding principles used by the HTML Working Group for the development of HTML5.  The principles are designed to offer guidance for the design of HTML, in the areas of compatibility, utility and interoperability.",
        "f139aba52f9fa1394b4034a7954b2220 (19:59): we're going to need to resolve those disputed principles before it's finished, though I support publishing it as a WD",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (20:07): e-mail that to public-html or www-archive maybe?",
        "f139aba52f9fa1394b4034a7954b2220 (20:07): yeah, will do",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (20:07): I'm not going to work on it until 587bf8b858e15d03428e1415c33c38ef has an idea on how to proceed",
        "587bf8b858e15d03428e1415c33c38ef (20:10): ok, I just put the question on html4-differences",
        "587bf8b858e15d03428e1415c33c38ef (20:10): thanks for moving the ball forward on design principles; I wanted some visible progress on that before putting this question.",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (20:16): sweet",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (20:22): In http://www.w3.org/2002/09/wbs/40318/trdiff/results the non-responders section only lists Members and W3C Invited Experts",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (20:22): not normal Invited Experts",
        "a11aabeeceeae6b8cb5d12ea06b56554 (20:28): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: why do you cite both WHATWG and W3C hosted copies of HTML 5?",
        "587bf8b858e15d03428e1415c33c38ef (20:52): yeah, that looks like a WBS bug, e3fb62ebfa4f36acf5cbff6a6ed0f2e0. I'm not too worried about it. feel free to report it to sysreq",
        "dbf12477c91aa2a8bc08bc55d90c44de (21:00): 587bf8b858e15d03428e1415c33c38ef: the consensus link on the questionnaire is broken",
        "587bf8b858e15d03428e1415c33c38ef (21:02): oops...",
        "587bf8b858e15d03428e1415c33c38ef (21:04): fixed"
    ],
    "person_ids": [
        "f139aba52f9fa1394b4034a7954b2220",
        "587bf8b858e15d03428e1415c33c38ef",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0",
        "ab7faae5d7b250ea8606486575f8f79c",
        "a11aabeeceeae6b8cb5d12ea06b56554",
        "dbf12477c91aa2a8bc08bc55d90c44de"
    ]
}