{
    "id": "48171c69f5cf1bdb23dc656058f0fa1f",
    "messages": [
        "5059ecaa4fb3ab1183f267bf1613010e (19:14): 227a9a17d1db3f8e5c71a150345fb2a6: any D3E updates?",
        "227a9a17d1db3f8e5c71a150345fb2a6 (19:14): 5059ecaa4fb3ab1183f267bf1613010e: I have been working on it, but nothing published for today",
        "227a9a17d1db3f8e5c71a150345fb2a6 (19:15): I was kinda expecting some more feedback from you on specific issues",
        "5059ecaa4fb3ab1183f267bf1613010e (19:15): Yep. Just sent you a few items.",
        "227a9a17d1db3f8e5c71a150345fb2a6 (19:15): but that's not holding me up, I can integrate your suggestion at any time",
        "227a9a17d1db3f8e5c71a150345fb2a6 (19:15): ah, great, thanks",
        "5059ecaa4fb3ab1183f267bf1613010e (19:15): It's not a lot. But a start.",
        "227a9a17d1db3f8e5c71a150345fb2a6 (19:16): 5059ecaa4fb3ab1183f267bf1613010e: ouch...",
        "227a9a17d1db3f8e5c71a150345fb2a6 (19:16): I also have a mouse diagram :(",
        "5059ecaa4fb3ab1183f267bf1613010e (19:17): haha, oh well. there was bound to be some overlap.",
        "227a9a17d1db3f8e5c71a150345fb2a6 (19:17): lol",
        "5059ecaa4fb3ab1183f267bf1613010e (19:17): besides, my graphics arts skills needed some refreshing lol",
        "227a9a17d1db3f8e5c71a150345fb2a6 (19:17): well, mine isn't fantastic",
        "5059ecaa4fb3ab1183f267bf1613010e (19:18): so are there any particular issues that you know will take a while, or you are looking for particular guidance on?",
        "5059ecaa4fb3ab1183f267bf1613010e (19:18): I've just been working from the bottom up",
        "227a9a17d1db3f8e5c71a150345fb2a6 (19:19): well, like I mentioned, the step-by-step examples are tedious and I could use help there",
        "5059ecaa4fb3ab1183f267bf1613010e (19:23): I see an issue marked for needing an example for  default actions which occur before the event dispatch.",
        "5059ecaa4fb3ab1183f267bf1613010e (19:24): I'm not sure shich step-by-step examples you're referring to, I guess.",
        "227a9a17d1db3f8e5c71a150345fb2a6 (19:36): 5059ecaa4fb3ab1183f267bf1613010e: I'm having trouble finding those myself...",
        "227a9a17d1db3f8e5c71a150345fb2a6 (19:36): you want to look at ISSUE-172?",
        "5059ecaa4fb3ab1183f267bf1613010e (19:38): oh yeah, i did look at this",
        "5059ecaa4fb3ab1183f267bf1613010e (19:39): we divided it into 2 issues:  one about whether it's ok for implementations to give 0 if they can't determine timestamp (issue 171, I believe?), and another for whether timestamp should be generated when the event object is created (as currently spec'd) or when the event is dispatched",
        "5059ecaa4fb3ab1183f267bf1613010e (19:39): wrt to the former, I really don't have a preference since IE provides timestamp. I'm not really sure what kind of implementation wouldn't be able to provide a timestamp....but sure....",
        "5059ecaa4fb3ab1183f267bf1613010e (19:40): i would say leave that one as is (currently allowed to be 0)",
        "5059ecaa4fb3ab1183f267bf1613010e (19:40): for the latter issue, I'd rather not change it from what the spec currently says",
        "5059ecaa4fb3ab1183f267bf1613010e (19:45): Looking at our telecon minutes, we decided to remove the allowance for timeStamp being 0, but keep timeStamp as ms since epoch (at the time the event was created)",
        "5059ecaa4fb3ab1183f267bf1613010e (19:45): so Issue 172 is a non-issue: no change to be made",
        "5059ecaa4fb3ab1183f267bf1613010e (19:46): For Issue 171, you should remove the sentence &quot;When not available, the value must be 0.&quot; from the Event IDL",
        "227a9a17d1db3f8e5c71a150345fb2a6 (20:04): 5059ecaa4fb3ab1183f267bf1613010e: sorry to be dense... what should the value be if it's not available?",
        "5059ecaa4fb3ab1183f267bf1613010e (20:05): i think the point was to say that not providing a timeStamp would be considered non-conforming",
        "227a9a17d1db3f8e5c71a150345fb2a6 (20:05): hmmm",
        "5059ecaa4fb3ab1183f267bf1613010e (20:05): like i said, I don't particularly have a preference",
        "227a9a17d1db3f8e5c71a150345fb2a6 (20:05): ok",
        "5059ecaa4fb3ab1183f267bf1613010e (20:06): but our resolution was to remove that allowance for it to be 0",
        "227a9a17d1db3f8e5c71a150345fb2a6 (20:06): ok",
        "5059ecaa4fb3ab1183f267bf1613010e (20:06): did you ever figure out what the &quot;step by step examples&quot; were? or are there others that you'd like me to take a look at?",
        "227a9a17d1db3f8e5c71a150345fb2a6 (20:08): ok, done",
        "227a9a17d1db3f8e5c71a150345fb2a6 (20:09): 5059ecaa4fb3ab1183f267bf1613010e: don't worry about that... if you see anything that needs doing and interests you, maybe just ping me about it to se if I've already started on it?",
        "5059ecaa4fb3ab1183f267bf1613010e (20:09): ok, sounds good....i take it you're on IRC most of the time :-)",
        "5059ecaa4fb3ab1183f267bf1613010e (20:10): Thursdays are generally more available for me. So I may sit down and take a shot at some of these.  Was the kind of stuff I had in that doc helpful, or was it mostly old news to you?",
        "5059ecaa4fb3ab1183f267bf1613010e (20:11): I basically just wrapped up what is in the issue tracker + any resolutions from telecons + suggested text wherever necessary",
        "227a9a17d1db3f8e5c71a150345fb2a6 (20:19): ok"
    ],
    "person_ids": [
        "5059ecaa4fb3ab1183f267bf1613010e",
        "227a9a17d1db3f8e5c71a150345fb2a6"
    ]
}