{
    "id": "4bfbbe7727cc327b7475d1939da7f38f",
    "messages": [
        "b8810fee2f4a71f849f3f7409546d1d9 (16:44): eightfold: to get WebM for IE9, you go to a Web page, download an installer .exe and run it as administrator",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:44): eightfold: the experience is the usual Windows software installation experience",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:45): eightfold: MPEG-LA wants royalties from encoders, decoders and from a subset of people who distribute bits arranged with an H.264 encoder",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:46): eightfold: for H.264 to be properly royalty-free, it needs to be royalty-free to decode, to encode and to transfer",
        "06cb330920ae58e1614c9145d983b3d6 (16:46): if you ever hear the MPEG-LA offering anything for &quot;free&quot;, double-check--the entire *point* of the MPEG-LA is to license MPEG stuff for money",
        "06cb330920ae58e1614c9145d983b3d6 (16:47): they're not going to do anything just to be nice",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:47): eightfold: where encode and decode are shorthand for making, distributing and running decoder/encoder",
        "06cb330920ae58e1614c9145d983b3d6 (16:49): (though I could just almost see them offering a hamstrung profile for free, just to try to cripple competing free codec development)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:06): 06cb330920ae58e1614c9145d983b3d6: There are plenty of members of MPEG-LA and the MPEG WG who want there be a RF standard. Apple is one of the most vocal.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:07): (And don't think Apple are just saying that after the Ogg/Theora stuff going everywhere: they were vocal about this at the time H.264 was being standardized a decade ago.)",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:07): a11aabeeceeae6b8cb5d12ea06b56554: they were vocal about MPEG-4 (Visual) Simple Profile before H.264",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:08): And I believe about stuff before that too.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:08): But yeah, that there are patent holders pushing for a RF baseline isn't new, but it's no more likely to happen now than a decade ago.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:09): Also, as foolip has pointed out multiple times, without an audio codec and the container becoming RF, it doesn't matter much as you don't gain compat. with existing toolchains.",
        "06cb330920ae58e1614c9145d983b3d6 (17:09): and of course it would be a reduced profile",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:09): a11aabeeceeae6b8cb5d12ea06b56554: so much so that the release of QuickTime 6 was delayed, because Apple tried to get the stuff made royalty-free",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:10): (of course, when you have shown you have the software ready to ship, it's not particularly credible to withhold it for a short while. they know you are going to ship it)",
        "7f9405da4034bf43083e64b57302a8e6 (17:10): a11aabeeceeae6b8cb5d12ea06b56554, if apple cares about royalty free standards now, why haven't they supported vorbis when everyone else does? explain.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:11): &quot;Apple agrees with paying a reasonable royalty for including MPEG-4 codecs in QuickTime, but does not believe that MPEG-4 can be successful in the marketplace if content owners must also pay royalties in order to deliver their content using MPEG-4.&quot;",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:11): a11aabeeceeae6b8cb5d12ea06b56554: you'd gain compat with existing chips",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:11): b8810fee2f4a71f849f3f7409546d1d9: True, but I get the impression that stuff is starting to move on mobile to where it is on TVs: having DSPs reprogrammable.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:12): 7f9405da4034bf43083e64b57302a8e6: There are plenty of reasons why they might not have done so; it's hard to speculate.",
        "7f9405da4034bf43083e64b57302a8e6 (17:12): aren't they already? see the OMAP work.",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:12): a11aabeeceeae6b8cb5d12ea06b56554: reprogrammable by whom",
        "7f9405da4034bf43083e64b57302a8e6 (17:12): a11aabeeceeae6b8cb5d12ea06b56554, i thought you might be more in the know than me.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:12): 7f9405da4034bf43083e64b57302a8e6: Most mobile devices ship with locked-down DSPs. Certainly OMAP devices in general have unlocked DSPs, not sure about mobile applications of them.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:12): b8810fee2f4a71f849f3f7409546d1d9: Anyone whom the OS allows access to the chips to.",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:13): a11aabeeceeae6b8cb5d12ea06b56554: if the chip vendor gives you enough documentation and toolchain",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:13): b8810fee2f4a71f849f3f7409546d1d9: Sure, but for most Android devices that's probably enough.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:14): b8810fee2f4a71f849f3f7409546d1d9: Because WebM is now part of the standard Android impl",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:14): a11aabeeceeae6b8cb5d12ea06b56554: does Android let apps push code to the DSP?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:14): b8810fee2f4a71f849f3f7409546d1d9: I believe not. But I believe everyone who does WebM decoding uses the Android's native support.",
        "06cb330920ae58e1614c9145d983b3d6 (17:14): hardware on android tends to be hidden behind magic proprietary .so's or hidden away on the locked-down radio side of things",
        "06cb330920ae58e1614c9145d983b3d6 (17:14): it'd be the vendor who would have to implement it",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:15): a11aabeeceeae6b8cb5d12ea06b56554: is it so much part of the standard Android impl that Opera is going to let it show in canPlayType?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:15): (Though our experience has been WebM support often interacts badly with hardware-accelerated drawing in a lot of cases.)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:17): (i.e., WebM's support in Android on many devices is buggy)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:18): Apparently it often draws in the wrong place, for example.",
        "06cb330920ae58e1614c9145d983b3d6 (17:22): heh, second time google search has wonked up the cursor position while i was typing a search",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:27): b8810fee2f4a71f849f3f7409546d1d9: Somehow Google needs to better ensure Android devices don't have horrible bugs like that :\\",
        "06cb330920ae58e1614c9145d983b3d6 (17:28): they can't even get android devices to use a standard button layout, so ...",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:51): 7f9405da4034bf43083e64b57302a8e6: A few possible reasons: they don't feel their customers require it; they don't think another format that exists for the sake of being RF is benefical and would rather an existing format; they think the patent risk of Theora is too high, etc.",
        "7f9405da4034bf43083e64b57302a8e6 (17:52): a11aabeeceeae6b8cb5d12ea06b56554, i was more talking about vorbis.",
        "7f9405da4034bf43083e64b57302a8e6 (17:52): which is usable almost everywhere except when apple software comes into the picture",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:53): 7f9405da4034bf43083e64b57302a8e6: Vorbis is a more interesting question, and less clear why MS/Apple's native frameworks don't support it.",
        "7f9405da4034bf43083e64b57302a8e6 (17:55): a11aabeeceeae6b8cb5d12ea06b56554, ‚Ä¶ says a person working for a company that would take a sizable hit if it had to pay royalties for media decoding, opposed to apple and ms.",
        "7f9405da4034bf43083e64b57302a8e6 (17:57): reducing competition is an incentive.",
        "e9fe2a8ed6a64844a5c024b6f688d024 (18:00): good morning, Whatwg!",
        "7f9405da4034bf43083e64b57302a8e6 (18:01): a11aabeeceeae6b8cb5d12ea06b56554, or wouldn't it? how high are royalties?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:01): 7f9405da4034bf43083e64b57302a8e6: Apple and MS both pay more for licensing than they recieve from them, AFAIK",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:01): 7f9405da4034bf43083e64b57302a8e6: Apple certainly does.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:02): Apple certainly has little financial interest in MPEG-4 being used, and have pushed for everything in MPEG-4 they hold patents on to be RF.",
        "06cb330920ae58e1614c9145d983b3d6 (18:03): as far as I'm concerned, anything MPEG being RF is a bad thing (for the rest of the world)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:04): 06cb330920ae58e1614c9145d983b3d6: Why?",
        "06cb330920ae58e1614c9145d983b3d6 (18:04): it will slow the adoption and development of truly free codecs",
        "7f9405da4034bf43083e64b57302a8e6 (18:04): a11aabeeceeae6b8cb5d12ea06b56554, that is not a point. but 81 million NOK being around 13.5 million US$ may be a point.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:05): 7f9405da4034bf43083e64b57302a8e6: huh?",
        "7f9405da4034bf43083e64b57302a8e6 (18:05): apple income is measured in *billions* of dollarites",
        "7f9405da4034bf43083e64b57302a8e6 (18:05): a11aabeeceeae6b8cb5d12ea06b56554, i just looked up how big the companies are and figured that licensing media codecs hits a small company more than a big. you tell me if i am correct.",
        "7f9405da4034bf43083e64b57302a8e6 (18:06): ‚Äûbig‚Äú as in ‚Äûoperating income‚Äú",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:06): 7f9405da4034bf43083e64b57302a8e6: The cost of licensing it to ship encoders and decoders will stay for a while regardless; there's too much existing content out there, and the fact that DVDs and Blu-Ray require the decoders (and encoders, if you want to author content, which bundled software allows)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:06): 7f9405da4034bf43083e64b57302a8e6: Right, yeah.",
        "7f9405da4034bf43083e64b57302a8e6 (18:07): if the cost for h.264 stuff is capped at 6.5 million, that it as least the same ballpark. scary.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:08): The licensing fees aren't a major issue to Apple, but nor is the income they get at all notable. The only financal reasons not to ship more codecs is developer time and patent risk.",
        "7f9405da4034bf43083e64b57302a8e6 (18:08): hahaha, doctor evil http://obamapacman.com/wp-content/uploads/2010/02/Dr-Evil-H.264-5-million-dollars-licensing-myth.jpg",
        "7f9405da4034bf43083e64b57302a8e6 (18:09): a11aabeeceeae6b8cb5d12ea06b56554, are you assuming that it is not a strategic benefit to make it harder to enter a market?",
        "7f9405da4034bf43083e64b57302a8e6 (18:09): &gt;obamapacman.com",
        "7f9405da4034bf43083e64b57302a8e6 (18:09): wat",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:09): 7f9405da4034bf43083e64b57302a8e6: Which markert?",
        "7f9405da4034bf43083e64b57302a8e6 (18:09): harry potter. OBAMA.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:09): *market",
        "06cb330920ae58e1614c9145d983b3d6 (18:10): a11aabeeceeae6b8cb5d12ea06b56554: it's not hard to contrive other possible financial reasons (whether they're actual considerations or not, only they know)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:10): Practically, I can't think of any market for which it is a strategic benefit.",
        "7f9405da4034bf43083e64b57302a8e6 (18:10): a11aabeeceeae6b8cb5d12ea06b56554, any market. if company A can afford to pay for patents more easily than company B, a competitor, an open standard may not be in the best short-term-interest of the shareholders of company A.",
        "b25b6b77a0087ff8385941e5545d32ea (18:10): a11aabeeceeae6b8cb5d12ea06b56554: You seem to be missing the point. Irrespective of whether Apple profits directly from licensing fees, requiring browser implementors to support h.264 would be like regressive taxation",
        "b25b6b77a0087ff8385941e5545d32ea (18:11): In that it would disproportionately affect the poorer players",
        "06cb330920ae58e1614c9145d983b3d6 (18:11): for example, everyone using codecs that cost money could increase the cost--slightly--of creating competing phones",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:11): b25b6b77a0087ff8385941e5545d32ea: But Apple practically isn't competing with other browser vendors, esp. on iOS.",
        "b25b6b77a0087ff8385941e5545d32ea (18:11): a11aabeeceeae6b8cb5d12ea06b56554: Huh?!",
        "7f9405da4034bf43083e64b57302a8e6 (18:11): a11aabeeceeae6b8cb5d12ea06b56554, what? apple is hindering them for the benefit of its own ecosystem. see the crippling of the audio element API.",
        "b25b6b77a0087ff8385941e5545d32ea (18:12): I agree that they are trying to have an unlevel playing field",
        "7f9405da4034bf43083e64b57302a8e6 (18:12): which is a strategic benefit. a11aabeeceeae6b8cb5d12ea06b56554, i do not see where you are going here.",
        "b25b6b77a0087ff8385941e5545d32ea (18:12): But they clearly compete with mini on iOS and with other platforms on mobile",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:12): 7f9405da4034bf43083e64b57302a8e6: I'd argue that was not wanting the web platform competing with native applications, not a fear about browser marketshare per-se.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:14): b25b6b77a0087ff8385941e5545d32ea: And Mini is going for a sufficently different segment of the market when it comes to video support, for example, that it isn't really competition in this context.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:16): Basically, my point is that for iOS/iPod the market is so full of competitors that already support the same formats (excluding Apple's DRM) that they have no competitive advantage there, as allowing more competitors into the market likely would not be a massive threat to their marketshare; on the desktop it possibly makes F/OSS OSes more plausible, but most users there already install the patent-encumbered codecs anyway, it doesn't give them a comp"
    ],
    "person_ids": [
        "b8810fee2f4a71f849f3f7409546d1d9",
        "06cb330920ae58e1614c9145d983b3d6",
        "a11aabeeceeae6b8cb5d12ea06b56554",
        "7f9405da4034bf43083e64b57302a8e6",
        "e9fe2a8ed6a64844a5c024b6f688d024",
        "b25b6b77a0087ff8385941e5545d32ea"
    ]
}