{
    "id": "4d717f35d64a075f307561f930e43bfb",
    "messages": [
        "b25b6b77a0087ff8385941e5545d32ea (16:24): wonders if it's worth dragging up the fact that WCAG is only chartered to address the needs of users with disabilities whereas HTML has to work for a wider range of people",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:26): b25b6b77a0087ff8385941e5545d32ea: yes, if you think it's worthwhile to touch the subject matter in general",
        "b25b6b77a0087ff8385941e5545d32ea (16:27): b8810fee2f4a71f849f3f7409546d1d9: That's what I can't decide. I don't think I will be very popular...",
        "b25b6b77a0087ff8385941e5545d32ea (16:27): (but perhaps it needs to be said)",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:29): PT(W) completely missed the point of my question",
        "ab7faae5d7b250ea8606486575f8f79c (16:30): Then people might say that alt is primarily an accessibility feature so it needs to address the needs of users with disabilities and therefore WCAG is the right place to do that",
        "bb76dfcc4f591df0120c3ef31743d8e2 (16:30): I am amazed, over and over, at how little faith they have in WCAG",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:31): bb76dfcc4f591df0120c3ef31743d8e2: have you read WCAG 2.0? If you have, do *you* have faith in it?",
        "bb76dfcc4f591df0120c3ef31743d8e2 (16:31): b8810fee2f4a71f849f3f7409546d1d9: No, but then I don't consider it a good idea either",
        "bb76dfcc4f591df0120c3ef31743d8e2 (16:32): (My first introduction to it was Joe Clark's article, and I haven't seen anything to dispute it)",
        "b25b6b77a0087ff8385941e5545d32ea (16:37): ab7faae5d7b250ea8606486575f8f79c: It's not just an accessibility feature though. It's also needed or e.g. text-only browsers",
        "b25b6b77a0087ff8385941e5545d32ea (16:37): s/or/for/",
        "bb76dfcc4f591df0120c3ef31743d8e2 (16:38): Are balloons 'moored' when landed or is there a different verb?",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:38): bb76dfcc4f591df0120c3ef31743d8e2: it's not quite as bad as it used to be",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:38): bb76dfcc4f591df0120c3ef31743d8e2: it's still bad, though",
        "f139aba52f9fa1394b4034a7954b2220 (16:38): othermaciej, yt?",
        "bb76dfcc4f591df0120c3ef31743d8e2 (16:39): b8810fee2f4a71f849f3f7409546d1d9: Bad enough that you might be better off with the samurai errata instead?",
        "ab7faae5d7b250ea8606486575f8f79c (16:40): bb76dfcc4f591df0120c3ef31743d8e2: http://www.balloonlife.com/publications/balloon_life/9608/images/tetherm.gif shows a &quot;MOORED&quot; balloon, so that sounds reasonable",
        "ab7faae5d7b250ea8606486575f8f79c (16:40): (assuming it is actually moored, not just sitting on the ground because it's too heavy to float)",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:40): bb76dfcc4f591df0120c3ef31743d8e2: bad enough that the WG chose to produce exegesis documents themselves, because the spec itself is not suitable for mortals to interpret on their own",
        "bb76dfcc4f591df0120c3ef31743d8e2 (16:41): ab7faae5d7b250ea8606486575f8f79c: Good enough, thanks",
        "bb76dfcc4f591df0120c3ef31743d8e2 (16:41): I'm anticipating a new category of spec writers, the ones sitting in the balloon moored on top of the ivory tower",
        "ab7faae5d7b250ea8606486575f8f79c (16:45): b25b6b77a0087ff8385941e5545d32ea: Indeed, but it sounds like that'd possibly just shift the arguments to go in a different direction, rather than actually resolving anything",
        "f139aba52f9fa1394b4034a7954b2220 (16:46): http://arstechnica.com/news.ars/post/20080819-mozilla-drags-ie-into-the-future-with-canvas-element-plugin.html",
        "ab7faae5d7b250ea8606486575f8f79c (16:46): How would you make a whole tower out of ivory, unless you poached one of the Discworld elephants?",
        "bb76dfcc4f591df0120c3ef31743d8e2 (16:46): ab7faae5d7b250ea8606486575f8f79c: That's what we've been doing all along",
        "bb76dfcc4f591df0120c3ef31743d8e2 (16:47): One person agrees to one resolution, and then another one picks up a different end and starts it all over again",
        "b25b6b77a0087ff8385941e5545d32ea (16:47): ab7faae5d7b250ea8606486575f8f79c: Well the point that I may or not make is that you end up with different conformance requirements if your only goal is to support the disabled compared to those you end up with if your goal is to support everyone",
        "bb76dfcc4f591df0120c3ef31743d8e2 (16:47): I'm sure every single person on the list has said &quot;Yeah, that would work&quot; to at least one suggestion",
        "bb76dfcc4f591df0120c3ef31743d8e2 (16:47): But they never do it to the same one",
        "b25b6b77a0087ff8385941e5545d32ea (16:48): e.g. WCAG seems to forbit publishing James Joyce's Uylsses in an unaltered form",
        "b25b6b77a0087ff8385941e5545d32ea (16:48): s/forbit/forbid/",
        "ab7faae5d7b250ea8606486575f8f79c (16:50): f139aba52f9fa1394b4034a7954b2220: Why do people think Adobe releasing an ActionScript VM as open source has any relation to making it not totally unrealistic that Adobe would distribute Mozilla's canvas plugin with Flash? That part of the article seems totally irrelevant to me...",
        "b25b6b77a0087ff8385941e5545d32ea (16:51): also the WCAG people still seem to have the attitude that people should be prepared to put an unlimited amount of effort into accessibility despite the evidence that this is not true. Designing around this assumption doesn't help accessibility but does have negative consequences on people's perception of the value of conformance requirements",
        "f139aba52f9fa1394b4034a7954b2220 (16:51): ab7faae5d7b250ea8606486575f8f79c, I have no idea",
        "ab7faae5d7b250ea8606486575f8f79c (16:52): (and the rest of the article is just rephrasing the three-week-old blog post)",
        "f139aba52f9fa1394b4034a7954b2220 (16:52): I didn't see the 3 week old blog post before",
        "ab7faae5d7b250ea8606486575f8f79c (16:52): You need to subscribe to more people's blog feeds :-)",
        "f139aba52f9fa1394b4034a7954b2220 (16:53): I'm probably on too many already. It's difficult to keep up with everything",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:03): wonders if the whole content area of IE could be taken over by Gecko-as-ActiveX",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:07): sees http://starkravingfinkle.org/blog/2006/12/xule-what-if/",
        "ab7faae5d7b250ea8606486575f8f79c (17:12): Combining the web-compatibility of Gecko with the UI of IE? That sounds like a fantastic idea",
        "bb76dfcc4f591df0120c3ef31743d8e2 (17:12): How long does an internet argument have to last before you can stop assuming ignorance and start assuming malice?",
        "b25b6b77a0087ff8385941e5545d32ea (17:15): bb76dfcc4f591df0120c3ef31743d8e2: I thought most people assumed that from the start ;)",
        "f139aba52f9fa1394b4034a7954b2220 (17:20): is there anyone here who understands and can explain how DOMImplementation.getFeature() and Node.getFeature() in DOM3Core are supposed to work?",
        "b07211a0c7cb119232799d2119cea90f (17:22): bb76dfcc4f591df0120c3ef31743d8e2: given the length of the alt thread, I'd say at least a few years",
        "f139aba52f9fa1394b4034a7954b2220 (17:28): ddd01b1de2f07d48d4953be350a7944c, yt?",
        "ddd01b1de2f07d48d4953be350a7944c (17:29): f139aba52f9fa1394b4034a7954b2220: what's up",
        "f139aba52f9fa1394b4034a7954b2220 (17:29): ddd01b1de2f07d48d4953be350a7944c, the selectors api test suite needs tests for hasFeature() and getFeature()",
        "f139aba52f9fa1394b4034a7954b2220 (17:30): I'm not exactly sure what getFeature() is supposed to do, besides return a copy of the object itself if the feature is implemented",
        "f139aba52f9fa1394b4034a7954b2220 (17:30): and if that's all it's meant to do, then it seems quite useless",
        "f139aba52f9fa1394b4034a7954b2220 (17:31): and Node.isSupported() too",
        "f139aba52f9fa1394b4034a7954b2220 (17:32): and probably getDOMImplementation() too",
        "f139aba52f9fa1394b4034a7954b2220 (17:32): and getDOMImplementationList()",
        "f139aba52f9fa1394b4034a7954b2220 (17:32): wishes he didn't add a feature string. I didn't realise it would complicate so many things :-(",
        "ddd01b1de2f07d48d4953be350a7944c (17:33): f139aba52f9fa1394b4034a7954b2220: could you come up with a list of what exactly is supposed to be tested?",
        "f139aba52f9fa1394b4034a7954b2220 (17:36): ddd01b1de2f07d48d4953be350a7944c, I'm mailing public-webapps about it now",
        "f139aba52f9fa1394b4034a7954b2220 (17:41): ddd01b1de2f07d48d4953be350a7944c, http://lists.w3.org/Archives/Public/public-webapps/2008JulSep/0436.html",
        "ddd01b1de2f07d48d4953be350a7944c (17:43): f139aba52f9fa1394b4034a7954b2220: what feature/version strings should I be checking for?",
        "f139aba52f9fa1394b4034a7954b2220 (17:45): see the spec",
        "f139aba52f9fa1394b4034a7954b2220 (17:46): &quot;Selectors-API&quot;, &quot;1.0&quot;"
    ],
    "person_ids": [
        "b25b6b77a0087ff8385941e5545d32ea",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "ab7faae5d7b250ea8606486575f8f79c",
        "bb76dfcc4f591df0120c3ef31743d8e2",
        "f139aba52f9fa1394b4034a7954b2220",
        "b07211a0c7cb119232799d2119cea90f",
        "ddd01b1de2f07d48d4953be350a7944c"
    ]
}