{
    "id": "4df6917d488f567ea6a22af9bad836e5",
    "messages": [
        "4402b3bae27683fee56b202bfd23bab3 (05:26): surkov: hi. :)",
        "4402b3bae27683fee56b202bfd23bab3 (05:26): is around now",
        "f5137d105ccd11d3c4384e8e8573b3c8 (05:30): 4402b3bae27683fee56b202bfd23bab3, I wonder how we should proceed with menus that have own windows too",
        "4402b3bae27683fee56b202bfd23bab3 (05:31): surkov: you mean bug 670087?",
        "47e87577fff6e08b0f2f43540db8c9c9 (05:31): Bug https://bugzilla.mozilla.org/show_bug.cgi?id=670087 nor, --, ---, nobody, NEW, AccessibleObjectFromPoint returns incorrect accessible for popup menus",
        "f5137d105ccd11d3c4384e8e8573b3c8 (05:32): maybe not",
        "f5137d105ccd11d3c4384e8e8573b3c8 (05:32): ah yes",
        "f5137d105ccd11d3c4384e8e8573b3c8 (05:32): I guess the fix might be the same",
        "4402b3bae27683fee56b202bfd23bab3 (05:32): surkov: I provided two solutions in that bug",
        "4402b3bae27683fee56b202bfd23bab3 (05:33): surkov: the same? What problem are you referring to (aside from that one)?",
        "f5137d105ccd11d3c4384e8e8573b3c8 (05:33): plugin stuffs",
        "f5137d105ccd11d3c4384e8e8573b3c8 (05:33): to return embed accessible object for that window",
        "4402b3bae27683fee56b202bfd23bab3 (05:33): surkov: mm, that is a little different",
        "4402b3bae27683fee56b202bfd23bab3 (05:33): surkov: the problem with plugins is that they don't naturally link into the gecko a11y tree. menus do.",
        "4402b3bae27683fee56b202bfd23bab3 (05:34): surkov: whether you need to do that depends on whether anyone will ever know that there is a separate window",
        "f5137d105ccd11d3c4384e8e8573b3c8 (05:34): I mean that code that returns embed accessible for plugin window will return menupopup accessible for menu window I guess",
        "4402b3bae27683fee56b202bfd23bab3 (05:34): ah, yes, that is true",
        "f5137d105ccd11d3c4384e8e8573b3c8 (05:35): and it seems this is one of solutions in bug 670087",
        "4402b3bae27683fee56b202bfd23bab3 (05:35): although that depends whether accHitTest will be implemented differently for menupopups",
        "f5137d105ccd11d3c4384e8e8573b3c8 (05:35): I mean this solution: The MozillaDropShadowWindowClass window should return the popup menu accessible as its client. This menu accessible should answer IAccessible::accHitTest correctly for the menu and its items.",
        "f5137d105ccd11d3c4384e8e8573b3c8 (05:36): ok, I wanted to make sure if we return menupopup for menu window is ok :)",
        "f5137d105ccd11d3c4384e8e8573b3c8 (05:36): I wasn't sure before you pointed a bug to me",
        "4402b3bae27683fee56b202bfd23bab3 (05:38): ah, sorry. gotcha. that's perfectly fine and I believe is the correct behaviour",
        "4402b3bae27683fee56b202bfd23bab3 (05:38): the only thing I'm concerned about is embed element returning the wrapper HWND for IAccessible2::windowHandle because it'll break NVDA's obj-in-doc check",
        "4402b3bae27683fee56b202bfd23bab3 (05:39): that doesn't matter for DropShadow menus because they're not part of a document",
        "4402b3bae27683fee56b202bfd23bab3 (05:39): of course, it's possible for WM_GETOBJECT to return an accessible which reports a different HWND. it's just asymmetrical is all",
        "4402b3bae27683fee56b202bfd23bab3 (05:44): weird. Firefox is no longer prompting for admin privs to update",
        "4402b3bae27683fee56b202bfd23bab3 (05:44): that concerns me just a little ..",
        "f5137d105ccd11d3c4384e8e8573b3c8 (05:47): yeah, I'll keep document HWND for those",
        "4402b3bae27683fee56b202bfd23bab3 (05:48): surkov: should bug 722248 (i.e. the bug, before the patch landed) have broken position information as well? I noticed position info was broken for some controls around the same time I noticed the visibility state problems, but now it's fixed",
        "47e87577fff6e08b0f2f43540db8c9c9 (05:49): Bug https://bugzilla.mozilla.org/show_bug.cgi?id=722248 nor, --, mozilla12, bolterbugz, RESO FIXED, Some chrome accessibles report incorrect visibility states",
        "4402b3bae27683fee56b202bfd23bab3 (05:49): I mean, taht's a good thing, but just curious",
        "f5137d105ccd11d3c4384e8e8573b3c8 (05:55): 4402b3bae27683fee56b202bfd23bab3, that could be be related, what's your suggestion exactly?",
        "4402b3bae27683fee56b202bfd23bab3 (05:56): surkov: well, position info for tabs and menus in thunderbird was missing, and menus were reporting the collapsed state when they shouldn't. this is now fixed",
        "f5137d105ccd11d3c4384e8e8573b3c8 (05:56): 4402b3bae27683fee56b202bfd23bab3: it makes sense to add a comment asking for adding tests for that, what else?",
        "4402b3bae27683fee56b202bfd23bab3 (05:57): surkov: nothing. I just didn't understand how visibility states could affect position info/collapsed state is all",
        "f5137d105ccd11d3c4384e8e8573b3c8 (05:58): 4402b3bae27683fee56b202bfd23bab3: technically it shouldn't or it makes sense to file new bug asking for mochitests, could you do that perhaps?",
        "4402b3bae27683fee56b202bfd23bab3 (06:01): btw, is mochitest a unit testing framework or is it more system testing? does Mozilla do unit testing as well?",
        "f5137d105ccd11d3c4384e8e8573b3c8 (06:06): I think it's closer to unit testing",
        "4402b3bae27683fee56b202bfd23bab3 (06:13): surkov: my understanding is that you do stuff in the tests and assert that Gecko responds in the way you expect, but not really so much about calling functions to see if you get expected values",
        "f5137d105ccd11d3c4384e8e8573b3c8 (06:14): it's closer to 2nd that to 1st",
        "f5137d105ccd11d3c4384e8e8573b3c8 (06:15): but in mochitest we do testing by XPCOM layer",
        "f5137d105ccd11d3c4384e8e8573b3c8 (06:15): so we don't test MSAA or whatever else",
        "3fe145094f808469bffe4e30453f94c1 (06:36): Hi all!",
        "5bff37e5176f0dc80ce9452cd754879f (06:36): Hii",
        "3fe145094f808469bffe4e30453f94c1 (06:39): 4402b3bae27683fee56b202bfd23bab3: Thanks for your additional info on bug 722248! I believe what you were seeing is a different side of the same bug.",
        "47e87577fff6e08b0f2f43540db8c9c9 (06:39): Bug https://bugzilla.mozilla.org/show_bug.cgi?id=722248 nor, --, mozilla12, bolterbugz, VERI FIXED, Some chrome accessibles report incorrect visibility states",
        "3fe145094f808469bffe4e30453f94c1 (06:40): Hi surkov, hub!",
        "3fe145094f808469bffe4e30453f94c1 (06:41): Hi eeejay, tbsaunde! :)",
        "94d50e2efa8ecc99acd742d7cdd18f4a (06:50): hi MarcoZ",
        "4402b3bae27683fee56b202bfd23bab3 (07:11): MarcoZ: ok. was just trying to figure how visibility and position info/collapsed could be related :)",
        "f5137d105ccd11d3c4384e8e8573b3c8 (07:15): hi, MarcoZ",
        "3fe145094f808469bffe4e30453f94c1 (07:26): 4402b3bae27683fee56b202bfd23bab3: That code is pretty complex and relies on a lot of stuff from other Gecko modules. And apparently, the API we were using was, aside from being on the verge of getting depricated, giving us some wrong info there."
    ],
    "person_ids": [
        "4402b3bae27683fee56b202bfd23bab3",
        "f5137d105ccd11d3c4384e8e8573b3c8",
        "47e87577fff6e08b0f2f43540db8c9c9",
        "3fe145094f808469bffe4e30453f94c1",
        "5bff37e5176f0dc80ce9452cd754879f",
        "94d50e2efa8ecc99acd742d7cdd18f4a"
    ]
}