{
    "id": "4e52f2022b01750b0e2cc8689ce4d2f3",
    "messages": [
        "13a74a99387e388d28a3afb47d1c4512 (21:24): in JS, functions are objects right?",
        "13a74a99387e388d28a3afb47d1c4512 (21:24): howcome &quot;document.body.insertAdjacentElement(document.createElement(&quot;div&quot;).innerHTML = &quot;ljkghljkg&quot;);&quot; is illegal?",
        "1f8387eb43f131d7c309a90a4e36b5cb (21:26): The return value of 'document.createElement(&quot;div&quot;).innerHTML = &quot;ljkghljkg&quot;' isn't a valid arg for insertAdjacentElement().",
        "1f8387eb43f131d7c309a90a4e36b5cb (21:26): This isn't jQuery, where everything returns a reasonable value for chaining.  ^_^",
        "13a74a99387e388d28a3afb47d1c4512 (21:35): arghh, right sry",
        "1f8387eb43f131d7c309a90a4e36b5cb (21:38): Was your &quot;functions are objects&quot; question unrelated?",
        "1f8387eb43f131d7c309a90a4e36b5cb (21:39): Because yes, they are.  And most objects are functions, so you can get a constructor.",
        "69bdeb2b749b85f0838eefe186b92c76 (21:40): woah, just checked out the site hosting the irc logs. The yellow highlight function is epic awesome.",
        "13a74a99387e388d28a3afb47d1c4512 (21:42): 1f8387eb43f131d7c309a90a4e36b5cb: i thought the createElement().innetHTML part was the illegal one so I was assuming that createElement was not an object.",
        "1f8387eb43f131d7c309a90a4e36b5cb (21:42): Ah, that's unrelated.  createElement() returns a Node object.",
        "13a74a99387e388d28a3afb47d1c4512 (21:45): what's a node object? html tags?",
        "1f8387eb43f131d7c309a90a4e36b5cb (21:45): Yeah, it's a class that represents an element in the DOM.  Also other things, like text or comments.",
        "4c681049601b3c374f1d2c0077c99049 (21:54): boblet proposed using css transitions and transforms without the prefix (in addition to the prefixed variants) as the spec isnt likely to change and end users are unlikely to update their code when the spec hits CR...",
        "4c681049601b3c374f1d2c0077c99049 (21:54): i can totally see that POV but i've been holding off on going unprefixed for un-cr things so far..",
        "4c681049601b3c374f1d2c0077c99049 (21:55): anyone here take a side on that?",
        "1f8387eb43f131d7c309a90a4e36b5cb (21:55): As long as you're willing to go back and fix your code, there's no problem.",
        "b8810fee2f4a71f849f3f7409546d1d9 (21:55): yes, there is",
        "b8810fee2f4a71f849f3f7409546d1d9 (21:55): implementors don't know if your site is maintained by a person who is willing to adjust",
        "4c681049601b3c374f1d2c0077c99049 (21:55): i can handle either case, i just want to make the right recommendation to other developers.",
        "1f8387eb43f131d7c309a90a4e36b5cb (21:55): wants to write a mixin spec for CSS which would solve the prefix problem without the problems of removing them entirely.",
        "4c681049601b3c374f1d2c0077c99049 (21:56): who are likely a lot more lazy",
        "b8810fee2f4a71f849f3f7409546d1d9 (21:56): (I use unprefixed stuff myself, though.)",
        "1f8387eb43f131d7c309a90a4e36b5cb (21:56): b8810fee2f4a71f849f3f7409546d1d9: But going with or without prefixes both cause problems for implementors.",
        "13a74a99387e388d28a3afb47d1c4512 (21:56): let's say I create an image in JS and point it to a PNG file in the server with _.src property, when does the browser actually starts to download it? also when the image.onload event occurs, does it mean that the download is finished or that the image is in the memory? or do I make any kind of sense :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (21:56): 1f8387eb43f131d7c309a90a4e36b5cb: indeed, I use unprefixed versions partly in protest against long-term prefixing",
        "4c681049601b3c374f1d2c0077c99049 (21:57): webkit animation is one i'd certainly not leave unprefixed. that seems to be a bit more contentious, yes?",
        "b8810fee2f4a71f849f3f7409546d1d9 (21:57): yeah",
        "1f8387eb43f131d7c309a90a4e36b5cb (21:57): Animation's complex enough that I wouldn't unprefix it.  Too much change of *something* changing underneath you.",
        "4c681049601b3c374f1d2c0077c99049 (21:57): For sure. thx guys",
        "1f8387eb43f131d7c309a90a4e36b5cb (21:58): And yeah, the convo's died down somewhat, but I'm agitating for some changes to animations.",
        "ab7faae5d7b250ea8606486575f8f79c (21:58): 13a74a99387e388d28a3afb47d1c4512: It could start to download in the background as soon as you set .src, though I don't know whether browsers will wait for the current script to return first",
        "ab7faae5d7b250ea8606486575f8f79c (21:59): 13a74a99387e388d28a3afb47d1c4512: onload will be called some time (probably immediately) after the image is downloaded and decoded and found to not have errors (else it'll call onerror instead, I think), and you can safely use the image for drawing in canvases etc after that",
        "13a74a99387e388d28a3afb47d1c4512 (22:00): ab7faae5d7b250ea8606486575f8f79c: so in this phase image is still not read to the memory right?",
        "ab7faae5d7b250ea8606486575f8f79c (22:01): 13a74a99387e388d28a3afb47d1c4512: Depends on what you mean by being in memory",
        "ab7faae5d7b250ea8606486575f8f79c (22:02): 13a74a99387e388d28a3afb47d1c4512: Browsers are free to do whatever optimisations they want in terms of caching data in memory, lazy decoding, etc, so you can never really know what they're doing - you just know whether or not it's safe to perform certain actions on images (like drawing them)",
        "13a74a99387e388d28a3afb47d1c4512 (22:03): I mean, is the image data transferred to a buffer in the memory? or is it simply presented by something like file pointers in C?",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:04): Again, you don't know, because browsers are allowed to do what they want.  All you know is that certain actions are allowed at specific points.",
        "ab7faae5d7b250ea8606486575f8f79c (22:04): It's been downloaded from the network (so you can use it immediately), but everything else is just implementation details that you shouldn't need to know about",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:05): edb259c0e0038f38bb200bc20c8cbf7e, the entire IE compatibility list thing can be fairly described as &quot;hard to do&quot;, but IE has to do it anyway, since they have to deal with IE-only sites and IE-only code paths, so if they just implemented standards without compatibility they'd break.  (See: IE7.)",
        "13a74a99387e388d28a3afb47d1c4512 (22:05): ab7faae5d7b250ea8606486575f8f79c: you know I want to download my game assets before the game starts,  what I wonder is that if I do that will it fill up the memory?",
        "13a74a99387e388d28a3afb47d1c4512 (22:05): lets say for 1000 images",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:06): Everyone else tends to get the same code paths in most cases, due to &quot;develop your site for standards-compliant browsers, then fix for IE&quot;.  So they can converge on a common behavior without causing more bugs than they prevent, usually.",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:06): IE9's goal is explicitly to work with the same exact code everyone else gets, so hopefully IE10 won't need an IE9 compatibility mode.",
        "ab7faae5d7b250ea8606486575f8f79c (22:08): 13a74a99387e388d28a3afb47d1c4512: That's an implementation detail :-)",
        "ab7faae5d7b250ea8606486575f8f79c (22:09): 13a74a99387e388d28a3afb47d1c4512: It seems plausible that some implementations would store all loaded images as decoded RGBA in RAM, so you don't want to load huge amounts of image data and just hope the browser will do something clever with it",
        "13a74a99387e388d28a3afb47d1c4512 (22:10): ab7faae5d7b250ea8606486575f8f79c: I better load each levels' assets when the time to use comes just to be safe then.",
        "ab7faae5d7b250ea8606486575f8f79c (22:10): 13a74a99387e388d28a3afb47d1c4512: Depends on whether you're talking about megabytes or hundreds of megabytes or gigabytes of decoded image data",
        "ab7faae5d7b250ea8606486575f8f79c (22:11): 13a74a99387e388d28a3afb47d1c4512: (If you're using them with WebGL then you have to worry about VRAM too, which is much more limited than RAM+swap)",
        "13a74a99387e388d28a3afb47d1c4512 (22:11): exactly",
        "13a74a99387e388d28a3afb47d1c4512 (22:11): I'M talking about couple hundreds of MB image data",
        "13a74a99387e388d28a3afb47d1c4512 (22:11): and about 100 MB of audio",
        "13a74a99387e388d28a3afb47d1c4512 (22:13): hmm wait, I'm not sure I can use an Image() object directly with webgl",
        "13a74a99387e388d28a3afb47d1c4512 (22:13): maybe there is a loadtexture function like in opengl to read it to VRAM",
        "75f800da7cf8abadac2cd4849e0589fc (22:13): hi guys",
        "75f800da7cf8abadac2cd4849e0589fc (22:14): Would watchPosition in the Geolocation API still report positions when the browsers (safari on iphone for example) is not active ?",
        "ab7faae5d7b250ea8606486575f8f79c (22:15): The web environment is not designed to provide much control of resource usage (since it's meant to provide portability instead, which means taking resource control away from authors and leaving it to browser developers), so if you want to push the boundaries then you'll just have to do lots of experimentation and make browser-specific assumptions",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:15): Or wait till everyone supports NaCl.",
        "ab7faae5d7b250ea8606486575f8f79c (22:15): which is an irritating concept when you're used to having complete control over your environment",
        "ab7faae5d7b250ea8606486575f8f79c (22:16): You can pass an Image to glTexImage2D or something like that, I think",
        "13a74a99387e388d28a3afb47d1c4512 (22:16): ab7faae5d7b250ea8606486575f8f79c: yeah I'm already irritated but the concept of playing hardware accelerated games in browser is just too good to pass",
        "13a74a99387e388d28a3afb47d1c4512 (22:17): ab7faae5d7b250ea8606486575f8f79c: yes I checked it. I need to explicitly pass it to a webgl texture so I don't have to worry about browser filling the VRAM. and I can live with a couple hundreds MB of RAM usage",
        "13a74a99387e388d28a3afb47d1c4512 (22:20): I think I'll start by writing a decent game resource manager in javascript before anything else.",
        "13a74a99387e388d28a3afb47d1c4512 (22:32): is Image() object inherited form a regular node object? if so why there is an Image() object when it can also be created with .createElement(&quot;img&quot;)?",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:52): What format do HTML5 tests need to be in?  It occurs to me that I wrote some tests for my Mozilla patch to enable maxlength on textarea, and could probably submit those.",
        "ab7faae5d7b250ea8606486575f8f79c (22:54): I don't think any format has really been agreed yet",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:54): Well, there must be some way to run all the tests and figure out how many passed, no?",
        "ab7faae5d7b250ea8606486575f8f79c (22:55): There ought to be",
        "ab7faae5d7b250ea8606486575f8f79c (22:56): Actually, there probably shouldn't be a way to run *all* the tests",
        "ab7faae5d7b250ea8606486575f8f79c (22:56): because nobody will really want ten thousand results all at once, they'll just focus on a single feature",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:57): 88d4d34a8064a4ff39fd5e144eea7762: That's the part that I'm working on.",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:57): Ah.",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:58): When there is a standard test format, hopefully all the browsers can write tests for new features using that format and wrap it in their own format for internal use.",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:58): That would be cool.",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:58): Exactly.",
        "ab7faae5d7b250ea8606486575f8f79c (22:58): will just submit his own idiosyncratic format for now",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:58): Since it seems to me that WebKit and Gecko must be writing tons of HTML5 tests for internal use, but they aren't submitting them like Microsoft is.",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:58): I mean, both of them have an &quot;all new features must have tests&quot; policy . . .",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:59): Yeah, I know our format is very ideosyncratic.",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:59): Everyone's is.",
        "65325d50b2e25aca54bc871b89758c9c (23:04): 88d4d34a8064a4ff39fd5e144eea7762: WebKit definitely has tests for HTML5 features",
        "65325d50b2e25aca54bc871b89758c9c (23:04): I think there would be a few steps required to make them into appropriate tests for a standards test suite:",
        "65325d50b2e25aca54bc871b89758c9c (23:05): 1) ensure that everything tested is associated with specific conformance requirements in the spec",
        "65325d50b2e25aca54bc871b89758c9c (23:05): 2) annotate the tests with the relevant conformance requirements",
        "65325d50b2e25aca54bc871b89758c9c (23:05): 3) convert to whatever format the w3c wants them in",
        "88d4d34a8064a4ff39fd5e144eea7762 (23:05): Come to think of it, my maxlength tests won't work at all cross-browser, because they synthesize keyboard input.  Oops.",
        "65325d50b2e25aca54bc871b89758c9c (23:06): we have a lot of tests that are script-driven, and would totally work cross-browser",
        "65325d50b2e25aca54bc871b89758c9c (23:06): we have some that are based on dumps of the render tree structure which would need substantial reworking",
        "65325d50b2e25aca54bc871b89758c9c (23:06): I don't believe Apple, Google, or any of the other big players in WebKit-land have anyone currently tasked with converting WebKit regression tests for test suite use",
        "4d05dc3c4352ebe7593b536f2078cfe9 (23:08): I think Opera contributes a lot of test, no ?",
        "65325d50b2e25aca54bc871b89758c9c (23:10): I believe they do in general, I am not sure how many have been contributed for HTML5 in particular",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:16): zcorpan, yeah, haven't filed a bug yet"
    ],
    "person_ids": [
        "13a74a99387e388d28a3afb47d1c4512",
        "1f8387eb43f131d7c309a90a4e36b5cb",
        "69bdeb2b749b85f0838eefe186b92c76",
        "4c681049601b3c374f1d2c0077c99049",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "ab7faae5d7b250ea8606486575f8f79c",
        "88d4d34a8064a4ff39fd5e144eea7762",
        "75f800da7cf8abadac2cd4849e0589fc",
        "65325d50b2e25aca54bc871b89758c9c",
        "4d05dc3c4352ebe7593b536f2078cfe9",
        "edb259c0e0038f38bb200bc20c8cbf7e"
    ]
}