{
    "id": "4f681105be2343c30c72051020af4275",
    "messages": [
        "b8810fee2f4a71f849f3f7409546d1d9 (10:44): I think http://html5.org/tools/web-apps-tracker?from=6078&amp;to=6079 didn't actually &quot;clarify&quot; things.",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:47): that's because you still think they mean &quot;italics&quot; and &quot;bold&quot;",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:47): 69b0d3dfe919a6b860a9fac82de52a7e: we've always been at war with Eastasia",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:50): i do not claim that they did not once mean &quot;italics&quot; and &quot;bold&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:50): so i think that's an inappropriate attempt at dismissing my position using a platitude",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:55): 69b0d3dfe919a6b860a9fac82de52a7e: granted, I should have come up another redefinition-related quote that doesn't imply retroactive redefinition.",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:56): or you could use your own words :-)",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:57): :-)",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:57): i'm updating the terms used in the stability boxes in the spec... any idea of a better term for &quot;first draft&quot;, to mean the first attempt at specifying something?",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:57): &quot;first attempt&quot; was my other idea",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:57): but both kinda suck",
        "65325d50b2e25aca54bc871b89758c9c (10:57): in Newspeak, &lt;b&gt; is defined to serve the needs of the people",
        "cc097e0d7183ae8436e7df709553c8c0 (10:58): 69b0d3dfe919a6b860a9fac82de52a7e: &quot;Don't use this yet LOL&quot;",
        "cc097e0d7183ae8436e7df709553c8c0 (10:59): 69b0d3dfe919a6b860a9fac82de52a7e: or follow the W3C naming and call it &quot;Last attempt&quot;",
        "65325d50b2e25aca54bc871b89758c9c (10:59): &quot;unstable&quot;?",
        "65325d50b2e25aca54bc871b89758c9c (10:59): &quot;experimental&quot;?",
        "65325d50b2e25aca54bc871b89758c9c (10:59): (not sure if that matches the intent)",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:00): i'll try &quot;Experimental draft&quot; for now maybe",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:01): search for &quot;== STATUS&quot; in http://www.whatwg.org/specs/web-apps/current-work/status.js for the new list",
        "b25b6b77a0087ff8385941e5545d32ea (11:23): Aren't the real statuses &quot;Unimplemeneted&quot;, &quot;experimentally implemented&quot;, &quot;Multiple interoperable implementations&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:25): &quot;experimentally implemented&quot; doesn't correspond to a state in the spec",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:25): and there are definitely more states than just &quot;no&quot; and &quot;yes&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:25): :-)",
        "b25b6b77a0087ff8385941e5545d32ea (11:25): Yes it does",
        "b25b6b77a0087ff8385941e5545d32ea (11:25): It corresponds to what W3C woudl call &quot;Last Call&quot;",
        "b25b6b77a0087ff8385941e5545d32ea (11:26): i.e. if you don't like this comment soon before more people implement it",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:26): oh i thought you meant a feature implemented as an experiment before the spec is written",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:26): sorry",
        "b25b6b77a0087ff8385941e5545d32ea (11:26): Ah",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:26): yeah, those are a subset of the states",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:26): see the script for the full list",
        "b25b6b77a0087ff8385941e5545d32ea (11:31): 69b0d3dfe919a6b860a9fac82de52a7e: The states there don't seem to be much like the ones I said at all",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:33): b25b6b77a0087ff8385941e5545d32ea: unimplemented = TBW, OCBE, FD, WD; implemented = LC, CR; multiple = REC",
        "b25b6b77a0087ff8385941e5545d32ea (11:33): Also I agree with b8810fee2f4a71f849f3f7409546d1d9 about the interesting use of the word &quot;clarify&quot; to mean &quot;make more unlike reality&quot; in the &lt;b&gt; and &lt;i&gt; definitions",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:33): authoring conformance requirements aren't about past reality they're about future reality",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:33): they're about best practices, and what we can most highly recommend to authors",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:34): they're very much unlike implementation conformance criteria, in that respect",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:34): 69b0d3dfe919a6b860a9fac82de52a7e: not entirely true in a world where people have legacy sites to work with",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:34): (which is why the decision to make &lt;table&gt; not entirely non-presentational in the w3c copy is just a bad decision)",
        "b25b6b77a0087ff8385941e5545d32ea (11:34): 69b0d3dfe919a6b860a9fac82de52a7e: My point about the statuses, such as it was, was that statuses could be explicitly about implementations rather than having abstract states and having to tell people who they map onto reality",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:34): b8810fee2f4a71f849f3f7409546d1d9: how not?",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:35): b25b6b77a0087ff8385941e5545d32ea: we already have explicit implementation status information, so that would be redundant",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:35): the states are not abstract, they're descriptions of the quality of the text",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:35): 69b0d3dfe919a6b860a9fac82de52a7e: if a validator whines too much about legacy content on points that take effort to fix but that have dubious payoff, the validator isn't really helping the author and the author might opt not to validate",
        "b25b6b77a0087ff8385941e5545d32ea (11:36): 69b0d3dfe919a6b860a9fac82de52a7e: From the reader's point of view they're abstract",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:36): 69b0d3dfe919a6b860a9fac82de52a7e: which would be bad, because the author would then also miss out on useful error messages",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:36): b8810fee2f4a71f849f3f7409546d1d9: i'll be immediately convinced of that argument's relevance to this particular problem as soon as you are able to determine whether &lt;b&gt; is being used for bold or for keywords.",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:36): programatically",
        "b25b6b77a0087ff8385941e5545d32ea (11:36): About &lt;b&gt; and &lt;i&gt;: the glorious future where people never use them to mean bold or italic will likely never happen. Even if it did it wouldn't be a big win for anyone",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:37): b8810fee2f4a71f849f3f7409546d1d9: when it comes to cases that _can_ be programmatically detected, i think we've done a good job of walking that line, though",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:37): 69b0d3dfe919a6b860a9fac82de52a7e: how's that a prerequisite for my point?",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:37): b8810fee2f4a71f849f3f7409546d1d9: either i misunderstood your point, or your point doesn't apply to a case where you wouldn't ever show an error message regardless of the definition we're talking about",
        "b25b6b77a0087ff8385941e5545d32ea (11:38): The main bad effect is that people won't take the rest of the spec seriously",
        "b25b6b77a0087ff8385941e5545d32ea (11:38): Not that they won't take validators seriously",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:38): b25b6b77a0087ff8385941e5545d32ea: re the states being abstract, i don't really see how &quot;this is brand new first-draft experimental text&quot; vs &quot;i think we are ready for implementations&quot; is &quot;abstract&quot;, but if it is, then i guess i think we need abstraction here.",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:39): if people are going to dismiss the entire spec just because &lt;i&gt; is defined in a media-independent way, then i think we have bigger problems.",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:39): like, why on earth isn't the rest of the spec useful enough that it overcomes this minor issue.",
        "b25b6b77a0087ff8385941e5545d32ea (11:40): 69b0d3dfe919a6b860a9fac82de52a7e: The &quot;How do I suggest a feature&quot; FAQ suggests implementations may preceed spec text so the smooth transition implied by the current states doesn't man much",
        "b25b6b77a0087ff8385941e5545d32ea (11:40): Not the whole rest of the spec",
        "b25b6b77a0087ff8385941e5545d32ea (11:40): But the other semantic requirments",
        "b25b6b77a0087ff8385941e5545d32ea (11:40): Including the ones that actually matter a bit",
        "b25b6b77a0087ff8385941e5545d32ea (11:40): Like not using &lt;table&gt; for layout",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:41): i don't see how anything smooth is implied. certainly no smoothness was intended to be implied.",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:41): i think the w3c has done far more damage to the tables-for-layout issue than we could possibly do even if we defined &lt;i&gt; to mean &quot;ice cream&quot;",
        "b25b6b77a0087ff8385941e5545d32ea (11:41): That is true",
        "b25b6b77a0087ff8385941e5545d32ea (11:41): But it's only one example",
        "b25b6b77a0087ff8385941e5545d32ea (11:42): and doesn't excuse us anyway",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:42): but i also think the people who are most likely to care about &lt;table&gt; being media-independent are the same people who are likely to appreciate &lt;i&gt; being media-independent",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:42): so i don't really buy the premise of your argument",
        "b25b6b77a0087ff8385941e5545d32ea (11:43): Well I care about &lt;table&gt; but don't really care if people use &lt;i&gt; to mean &quot;I want this text to be italic&quot;",
        "b25b6b77a0087ff8385941e5545d32ea (11:43): Because non-visual UAs have to deal with that anyway",
        "b25b6b77a0087ff8385941e5545d32ea (11:43): and it seems to be way down the list of problems they have",
        "cc097e0d7183ae8436e7df709553c8c0 (11:43): b25b6b77a0087ff8385941e5545d32ea: do you care if people use &lt;em&gt; to mean &quot;I want this text to be italic&quot;?",
        "b25b6b77a0087ff8385941e5545d32ea (11:44): cc097e0d7183ae8436e7df709553c8c0: I think that is a bigger problem",
        "b25b6b77a0087ff8385941e5545d32ea (11:44): (and one that is encouraged by demonising &lt;i&gt;)",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:45): we don't demonise &lt;i&gt;, we give it what imho is a rather succint definition that maps surprisingly well to real good-practice usage (i.e. not pure styling where an entire section is italics, but more phrasing-like usage), in such a way that authors can continue to use it with no fear of media-dependence",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:46): personally i am quite happy with where we are with &lt;i&gt;, &lt;b&gt;, &lt;small&gt;, and even &lt;u&gt; which i have come to terms with",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:46): i don't really see what value we would have in introducing &lt;font&gt;-like definitions for any of them",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:47): 69b0d3dfe919a6b860a9fac82de52a7e: are there Web authors other than you and fantasai who use &lt;i&gt; correctly as specced as a result of reading and understanding the spec? (as opposed to by accident)",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:47): no idea",
        "b25b6b77a0087ff8385941e5545d32ea (11:47): I don't see that any UA can treat &lt;i&gt; as currently defined different to &lt;span style=&quot;font-style:italic&quot;&gt;",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:48): dunno how one would measure that",
        "b25b6b77a0087ff8385941e5545d32ea (11:48): So whatever media independence we have would be equally true if we defined that as a synonym",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:49): same can be said of &lt;em&gt; and &lt;cite&gt;",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:49): so i dunno that that is relevant",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:49): anyway, i really should go to bed",
        "b25b6b77a0087ff8385941e5545d32ea (11:49): Not really. I would expect an AT to read &lt;em&gt; in a difference voice, for example",
        "b25b6b77a0087ff8385941e5545d32ea (11:49): I might be wrong in that expectation ofc",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:49): b25b6b77a0087ff8385941e5545d32ea: &lt;em&gt; different voice from &lt;i&gt;?",
        "b25b6b77a0087ff8385941e5545d32ea (11:50): b8810fee2f4a71f849f3f7409546d1d9: That depends how many people are using &lt;i&gt; to mean &lt;em&gt; I guess",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:50): I'd expect the best AT user experience to come from rendering &lt;em&gt; and &lt;i&gt; the same way by default regardless of medium, because they are rendered the same way on the medium that authors test the most",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:51): b25b6b77a0087ff8385941e5545d32ea: of course, it should be possible to test and find out what implementations actually do!",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:51): as opposed to theorizing about it",
        "b25b6b77a0087ff8385941e5545d32ea (11:52): Indeed"
    ],
    "person_ids": [
        "b8810fee2f4a71f849f3f7409546d1d9",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "65325d50b2e25aca54bc871b89758c9c",
        "cc097e0d7183ae8436e7df709553c8c0",
        "b25b6b77a0087ff8385941e5545d32ea"
    ]
}