{
    "id": "52948fa170aa16183d3b363c5257fc13",
    "messages": [
        "b8810fee2f4a71f849f3f7409546d1d9 (11:31): should I expect datatemplates to be stable enough to start working on conformance checking them?",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:37): &quot;The contents of rule elements form a template, and may be anything that, when the parent datatemplate is applied to some conforming data, results in a conforming DOM tree.&quot; is that supposed to be machine-checkable?",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:39): I guess it is, but it seems rather tricky as it may involve additional requests, etc.",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:39): also, it involves computing all possible context trees for a selector...",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:41): isn't that infinite most of the time?",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:41): '*'",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:41): gotta love how a &quot;small&quot; change can totally break fundamental assumptions about the nature of computations for conformance checking...",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:41): edb259c0e0038f38bb200bc20c8cbf7e: obviously, enumerating the trees is futile",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:42): I haven't yet figured out what problem data templates solve",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:42): on the first look it seems like XSLT lite with Selectors instead of XPath",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:43): I'm not sure either, although I'm told it likely replaces repetition templates and looks like XUL templating but simpler",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:45): this stuff looks much harder to grok than repetition templates",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:46): &quot;When an element has a template attribute but no ref attribute, the element may, instead of its usual content model, have a single element of any kind. That element is then used as the root node of the data for the template.&quot; aargh",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:47): You slowly begin to understand why Hixie advocates a no-schema approach",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:48): edb259c0e0038f38bb200bc20c8cbf7e: well, I guess he has more knowledge of what kind of radical changes he is going to pull off",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:48): true",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:48): edb259c0e0038f38bb200bc20c8cbf7e: earlier, analyzing the spec and deciding to use RELAX NG was a reasonable choice",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:48): http://developer.mozilla.org/en/docs/XUL_Tutorial:Templates has an intro to XUL templates that seems to map to &lt;datatemplatE&gt; and co",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:50): with a complex structure it should be possible to generate your weblog out of your Atom feed, as I understand it :)",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:51): this saves some templates on the server side, but is probably a nightmare for search engines and older clients...",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:53): I'm fine with certain things being left to the server side",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:54): server side means that all sites don't need to buy in to the same solutions and can be updated out of sync and can explore stuff without browser cooperation",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:54): maybe there are more convincing use cases",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:55): Hixie: are data templates *really* supposed to work inline or do you expect people to use XML templates by reference anyway?",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:55): I mean inline in text/html",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:55): I suppose it helps in the cases where you don't have a server, as in offline applications",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:55): I'm sensing some serious scope creep here",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:56): Although writing some JavaScript to do the same might not be too hard",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:56): I feel like sending a dozen emails, but I don't want to stir it on public-html up front",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:56): e-mail <email/> ?",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:57): and say it's important as you're planning to implement",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:57): yeah, when I have smart questions to ask, I'll probably take the whatwg route",
        "b25b6b77a0087ff8385941e5545d32ea (12:02): FWIW I think Hyatt suggested the datatemplate thing",
        "cc097e0d7183ae8436e7df709553c8c0 (12:02): &quot;Most mobile browsers do not support everything HTML defines. Our experience is that XHTML Basic delivered with application/xhtml+xml is more likely to result in a functional user experience than other combinations.&quot; -- http://lists.w3.org/Archives/Public/public-bpwg-comments/2007OctDec/0012.html",
        "edb259c0e0038f38bb200bc20c8cbf7e (12:05): sounds like bs",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:05): I must be living in some parallel universe where I carry a Gecko-based browser, a WebKit-based browsers and three Opera-based browsers on my person when I go out",
        "edb259c0e0038f38bb200bc20c8cbf7e (12:05): although maybe they can give some pointers to research they've done in that area, that counters yours",
        "edb259c0e0038f38bb200bc20c8cbf7e (12:06): and even then WebKit would get the encoding wrong :p",
        "ab7faae5d7b250ea8606486575f8f79c (12:10): b8810fee2f4a71f849f3f7409546d1d9: From what I've seen, inline text/html datatemplates appear to have extremely limited uses, since you can't use any interesting HTML elements in them without breaking in HTML5 UAs and in pre-HTML5 UAs",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:13): ab7faae5d7b250ea8606486575f8f79c: if that's true, I don't like inline datatemplates",
        "edb259c0e0038f38bb200bc20c8cbf7e (12:23): more on XUL templates: http://www.jerf.org/resources/xblinjs/whyNotMozilla/notXulTemplates.html",
        "ab7faae5d7b250ea8606486575f8f79c (12:25): (At least the &lt;select&gt;&lt;nest&gt;&lt;/select&gt; is broken by HTML5 parsers in http://philip.html5.org/demos/datatemplate/experimental/002.html - not sure if there are other problems there)",
        "edb259c0e0038f38bb200bc20c8cbf7e (12:26): would expect that the parsing rules are modified at some point",
        "edb259c0e0038f38bb200bc20c8cbf7e (12:26): for &lt;select&gt; you can use a data= attribute btw that points to an external XML file",
        "edb259c0e0038f38bb200bc20c8cbf7e (12:26): although then you'd have to do the templating on the server side",
        "ab7faae5d7b250ea8606486575f8f79c (12:27): If the contents of &lt;datatemplate&gt; doesn't get parsed like normal HTML, it'd seem even weirder to have it inline in HTML documents"
    ],
    "person_ids": [
        "b8810fee2f4a71f849f3f7409546d1d9",
        "edb259c0e0038f38bb200bc20c8cbf7e",
        "b25b6b77a0087ff8385941e5545d32ea",
        "cc097e0d7183ae8436e7df709553c8c0",
        "ab7faae5d7b250ea8606486575f8f79c"
    ]
}