{
    "id": "54937853052364b3efbb1fdeda1b0c8e",
    "messages": [
        "b65a1668d3f56352ebf6e4735afeb424 (05:43): wow, f139aba52f9fa1394b4034a7954b2220, you're right, XHTML5 *is* a widely used term... about 1/10th as widely used as XHTML2",
        "f139aba52f9fa1394b4034a7954b2220 (05:46): b65a1668d3f56352ebf6e4735afeb424: I wasn't making a comparison of how widely each are used, it makes no difference that &quot;XHTML2&quot; is used more than &quot;XHTML5&quot;",
        "b65a1668d3f56352ebf6e4735afeb424 (05:46): then why did you make the argument?",
        "f139aba52f9fa1394b4034a7954b2220 (05:48): because it is a widely used term.  just because A is more widely used than B, doesn't mean B isn't widely used",
        "b65a1668d3f56352ebf6e4735afeb424 (05:49): the only reason I see for HTML5's XML serialization to be called XHTML (as far as I can tell) is to attempt to undermine the efforts of XHTML2",
        "b65a1668d3f56352ebf6e4735afeb424 (05:49): why isn't HTML5/XML just as good, for example?",
        "f139aba52f9fa1394b4034a7954b2220 (05:50): so you're ignoring the fact that XHTML5 is much close to XHTML1, than XHTML2 is.  If only one is to retain the name, it should be the one that is closer to XHTML1.",
        "f139aba52f9fa1394b4034a7954b2220 (05:50): however, I couldn't care less if XHTML2 retains it's name.  XHTML2 is irrelevant",
        "b65a1668d3f56352ebf6e4735afeb424 (05:50): f139aba52f9fa1394b4034a7954b2220, I can read, and I've read that argument about 20 times now",
        "f139aba52f9fa1394b4034a7954b2220 (05:51): well, then why are you still debating?",
        "b65a1668d3f56352ebf6e4735afeb424 (05:51): it's clear that that's your opinion, but remember, &quot;opinions don't matter&quot;, right?",
        "b65a1668d3f56352ebf6e4735afeb424 (05:51): I'm not debating, I'm pointing out that you aren't making very good arguments",
        "b65a1668d3f56352ebf6e4735afeb424 (05:52): I have no investment in XHTML2 at all, myself",
        "f139aba52f9fa1394b4034a7954b2220 (05:52): that XHTML2 is irrelevant is my opinion, but that XHTML5 is closer to XHTML1 than XHTML2 is, is a fact (which I already supplied evidence for)",
        "b65a1668d3f56352ebf6e4735afeb424 (05:56): on a syntactic level, perhaps",
        "b65a1668d3f56352ebf6e4735afeb424 (05:56): but not in spirit",
        "139513027e8e90b5582cbc68fc733884 (05:58): XHTML2's effort doesn't need any undermining",
        "139513027e8e90b5582cbc68fc733884 (05:58): they seem to be handling that fine by themselves",
        "b65a1668d3f56352ebf6e4735afeb424 (05:58): ok, then why are you getting in a pissing contest about the name?",
        "139513027e8e90b5582cbc68fc733884 (05:59): I think it's fine for both to keep their current name",
        "139513027e8e90b5582cbc68fc733884 (05:59): I'm not the one who started asking the other group to change",
        "139513027e8e90b5582cbc68fc733884 (05:59): I think both using the XHTML1 namespace URI is a bigger problem, but it would be a problem for XHTML2 even if XHTML5 didn't exist",
        "b65a1668d3f56352ebf6e4735afeb424 (06:02): if XHTML2 is so doomed, why would you even want XHTML5 to be associated with the name?",
        "b65a1668d3f56352ebf6e4735afeb424 (06:02): or, in other news, why not just play nice and use a different name?",
        "139513027e8e90b5582cbc68fc733884 (06:04): - the normal name so far for an XML version of HTML has been XHTML, there doesn't seem to be any deep need to change it",
        "139513027e8e90b5582cbc68fc733884 (06:04): - why doesn't XHTML2 WG play nice and use a different name?",
        "139513027e8e90b5582cbc68fc733884 (06:04): (not that I care if they do, but they are the ones who seem to think different names are important)",
        "139513027e8e90b5582cbc68fc733884 (06:06): I think the XHTML2 WG passing a resolution that the HTML WG should not use a particular name is not a very friendly way to start the discussion",
        "b65a1668d3f56352ebf6e4735afeb424 (06:08): I believe that the discussion was started by the WHATWG appropriating the W3C name XHTML, don't you agree?",
        "b65a1668d3f56352ebf6e4735afeb424 (06:08): or am I mischaracterizing the situation?",
        "139513027e8e90b5582cbc68fc733884 (06:08): WHATWG used the name &quot;Web Apps 1.0&quot;",
        "139513027e8e90b5582cbc68fc733884 (06:08): although unofficially people referred to it as HTML5 and XHTML5",
        "139513027e8e90b5582cbc68fc733884 (06:09): now it is a W3C spec maintained by the HTML WG",
        "139513027e8e90b5582cbc68fc733884 (06:09): which has officially resolved to name it HTML5, but has not picked an official name for the XHTML serialization",
        "139513027e8e90b5582cbc68fc733884 (06:09): although popular and sensible proposals include XHTML 5 and XHTML 1.5",
        "b65a1668d3f56352ebf6e4735afeb424 (06:10): that wasn't my question, 139513027e8e90b5582cbc68fc733884",
        "139513027e8e90b5582cbc68fc733884 (06:10): I think it's a mischaracterization to say &quot;the discussion was started by the WHATWG appropriating the W3C name XHTML&quot;",
        "139513027e8e90b5582cbc68fc733884 (06:10): which was in fact your question",
        "b65a1668d3f56352ebf6e4735afeb424 (06:11): how is it a mischaracterization?",
        "b65a1668d3f56352ebf6e4735afeb424 (06:11): f139aba52f9fa1394b4034a7954b2220 stated that the term XHTML5 has been used for 3 years.... either it has been or it hasn't",
        "b65a1668d3f56352ebf6e4735afeb424 (06:12): and, in fact, it has",
        "139513027e8e90b5582cbc68fc733884 (06:12): WHATWG didn't name anything XHTML5, random people called it that, now the WG is considering making it official",
        "b65a1668d3f56352ebf6e4735afeb424 (06:12): you should run for office :)",
        "139513027e8e90b5582cbc68fc733884 (06:13): no one told XHTML2 WG what they should or shouldn't name their spec",
        "139513027e8e90b5582cbc68fc733884 (06:13): both groups will be defining languages evolved from XHTML 1",
        "139513027e8e90b5582cbc68fc733884 (06:13): I am sure arguments could be made why one side has more right to the name than the other",
        "139513027e8e90b5582cbc68fc733884 (06:13): I think sharing is just fine",
        "b65a1668d3f56352ebf6e4735afeb424 (06:13): I think they were chartered to work on the XHTML spec, right?",
        "b65a1668d3f56352ebf6e4735afeb424 (06:15): I think it's not a very friendly way to start the discussion by appropriating the name of a language that they were chartered to define",
        "139513027e8e90b5582cbc68fc733884 (06:15): they are chartered to &quot;continue the XHTML2 work&quot;",
        "139513027e8e90b5582cbc68fc733884 (06:15): I didn't know they were chartered to define XHTML5",
        "139513027e8e90b5582cbc68fc733884 (06:15): I don't think it says that in their charter",
        "139513027e8e90b5582cbc68fc733884 (06:16): I don't see a problem with both languages being named XHTML N for different values of N",
        "b65a1668d3f56352ebf6e4735afeb424 (06:16): you can spin it howver you like, maciej, but I'll say again, the only reason I can see for the HTML WG (and the WHATWG) to use the term XHTML5 is to sow confusion and undermine the XHTML2 WG",
        "b65a1668d3f56352ebf6e4735afeb424 (06:17): and I suspect you think the same thing",
        "139513027e8e90b5582cbc68fc733884 (06:17): I'd be fine with XHTML 1.5 as a name if it made people happy (makes it more clear that it is related to the XHTML 1.x family of languages, not XHTML2)",
        "139513027e8e90b5582cbc68fc733884 (06:17): but I don't think it would make people happy",
        "b65a1668d3f56352ebf6e4735afeb424 (06:17): you know it wouldn't, and you know why",
        "139513027e8e90b5582cbc68fc733884 (06:18): I personally don't care what the XHTML2 WG does and I wish they would leave us alone",
        "139513027e8e90b5582cbc68fc733884 (06:18): we don't go to their mailing list to start turf wars or pissing matches",
        "b65a1668d3f56352ebf6e4735afeb424 (06:18): there's an easy way to do that: stop stepping on their toes... there are plenty of perfectly good acronyms out there",
        "139513027e8e90b5582cbc68fc733884 (06:19): it could certainly reduce confusion if they didn't use &quot;H&quot;, &quot;T&quot;, &quot;M&quot; and &quot;L&quot; in that order in their name",
        "b65a1668d3f56352ebf6e4735afeb424 (06:19): but like I said, I'm just a spectator here",
        "139513027e8e90b5582cbc68fc733884 (06:19): since it may lead people to think their language is suitable for use as an on-the-wire format, or would work in browsers",
        "f139aba52f9fa1394b4034a7954b2220 (06:19): there has been no real evidence for such confusion presented yet",
        "139513027e8e90b5582cbc68fc733884 (06:19): but I don't think it's a big problem for them to keep the XHTML2 name",
        "b65a1668d3f56352ebf6e4735afeb424 (06:20): ah, yes, &quot;evidence&quot;",
        "b65a1668d3f56352ebf6e4735afeb424 (06:20): that's starting to sound like a dirty word",
        "139513027e8e90b5582cbc68fc733884 (06:21): I actually don't know why XHTML 1.5 would be unacceptable either - it lets XHTML2 keep the privilege of the larger number and the appearance of the more radically forward-looking language",
        "b65a1668d3f56352ebf6e4735afeb424 (06:21): define evidence, please... and do avoid using the word &quot;evident&quot; because it's clear that's not what you mean",
        "b65a1668d3f56352ebf6e4735afeb424 (06:22): 139513027e8e90b5582cbc68fc733884, because there would be a name clash through iterations either way",
        "139513027e8e90b5582cbc68fc733884 (06:22): I mean, I guess it is ok for the XHTML2 WG to make a polite request to change the name of the XML serialization of our language, but I also think it is ok for us to say &quot;no&quot; to that",
        "f139aba52f9fa1394b4034a7954b2220 (06:22): evidence for confusion would be things like forum posts, emails, blog posts, etc. that ask questions like what's the difference between XHTML2 and XHTML5, and saying I don't understand something, where such statements arise from the similarity in names",
        "b65a1668d3f56352ebf6e4735afeb424 (06:22): (assuming either language survives more than a couple decades, which I personally doubt)",
        "139513027e8e90b5582cbc68fc733884 (06:23): arguments could be made both ways why one has more or less right to claim their language is a successor to XHTML",
        "139513027e8e90b5582cbc68fc733884 (06:23): but arguing such things is a waste of time",
        "139513027e8e90b5582cbc68fc733884 (06:23): let's just be nice and share",
        "b65a1668d3f56352ebf6e4735afeb424 (06:23): lol",
        "b65a1668d3f56352ebf6e4735afeb424 (06:24): I honestly think you're a good guy, 139513027e8e90b5582cbc68fc733884, but I don't think you're being straightforward here",
        "b65a1668d3f56352ebf6e4735afeb424 (06:25): f139aba52f9fa1394b4034a7954b2220, I've been at a meeting where there was, in fact, great confusion about the relationship of XHTML2 and XHTML5",
        "b65a1668d3f56352ebf6e4735afeb424 (06:25): it was a large meeting of mostly technical people",
        "139513027e8e90b5582cbc68fc733884 (06:25): sample argument: XHTML5 will likely get served as application/xhtml+xml on the public web as a final format, XHTML2 likely won't (unless carefully restricted to an XHTML5 or XHTML1-compatible subset, or using trickery like client-side XSLT to transform to an actual end delivery format)",
        "139513027e8e90b5582cbc68fc733884 (06:26): seems like the thing that will be served with the XHTML MIME type should be named XHTML",
        "139513027e8e90b5582cbc68fc733884 (06:26): (this is not to disparage the potential value of XHTML2 as a back-end authoring format)",
        "139513027e8e90b5582cbc68fc733884 (06:27): you can see how arguments along these lines could easily turn into a mean-spirited dick size flamewar"
    ],
    "person_ids": [
        "b65a1668d3f56352ebf6e4735afeb424",
        "f139aba52f9fa1394b4034a7954b2220",
        "139513027e8e90b5582cbc68fc733884"
    ]
}