{
    "id": "55b908144e1bf7468d1a473e6a009d37",
    "messages": [
        "c5292ef67d94fef9037d7e67efc58b3d (19:59): don't mind me, I'm just in my sprint meeting, via phone conference",
        "497c6f45cd8d2b106e83b42f664305c7 (20:07): Has there been done any work relating to augmented reality as overlays to the VIDEO element? I have a geopositioned video with compass direction, as well as several POIs which are geopositioned, and I'm trying to translate the POIs position to a relative position on top of the video overlay. Does anyone have any good links for me to check out?",
        "c5292ef67d94fef9037d7e67efc58b3d (20:08): 497c6f45cd8d2b106e83b42f664305c7: what are you overlaying, video from a mobile camera?",
        "497c6f45cd8d2b106e83b42f664305c7 (20:09): c5292ef67d94fef9037d7e67efc58b3d: Nope, it's for a live broadcast on a website. So I'm constantly getting an updated geoposition of the live video, and I have prefilled list of all the POIs that I want to overlay on the video when they're actually inside the viewport.",
        "a190a2299f464789ce3270850f4ac49d (20:10): Ovarlay an canvas over it?",
        "a190a2299f464789ce3270850f4ac49d (20:10): (or svg, whatever floats your boat)",
        "497c6f45cd8d2b106e83b42f664305c7 (20:10): a190a2299f464789ce3270850f4ac49d: Yeah, for example. I'm just a bit lost when it comes to actually translating the geoposition to a relative pixel position on top of the video",
        "a190a2299f464789ce3270850f4ac49d (20:11): (hell you can even overlay regular elements)",
        "a190a2299f464789ce3270850f4ac49d (20:11): 497c6f45cd8d2b106e83b42f664305c7: well the coordinates are kind of x,y coordinates",
        "a190a2299f464789ce3270850f4ac49d (20:11): except that the earth isnt flat",
        "a190a2299f464789ce3270850f4ac49d (20:12): (if yours is, then it should be easy)",
        "497c6f45cd8d2b106e83b42f664305c7 (20:13): a190a2299f464789ce3270850f4ac49d: Hehe, unfortunately, mine isn't either. Most of the POIs are more or less on the same altitude, though",
        "497c6f45cd8d2b106e83b42f664305c7 (20:14): a190a2299f464789ce3270850f4ac49d: Do you by any chance know of any resources that explains the mathematics involved in the translation?",
        "a190a2299f464789ce3270850f4ac49d (20:14): well i know a source that helps you calculate the distance between coordinates A &amp; B in a 'straight' line",
        "a190a2299f464789ce3270850f4ac49d (20:16): but pretty much what you want is to know what coordinate is at the closest center point towards the viewer",
        "70cfd9ce3d1646aaafd5b85d737706f3 (20:16): 497c6f45cd8d2b106e83b42f664305c7: yes",
        "497c6f45cd8d2b106e83b42f664305c7 (20:16): a190a2299f464789ce3270850f4ac49d: right :)",
        "70cfd9ce3d1646aaafd5b85d737706f3 (20:17): 497c6f45cd8d2b106e83b42f664305c7: google maps has good APIs handling geolocation data",
        "70cfd9ce3d1646aaafd5b85d737706f3 (20:17): but there are free libraries also",
        "a190a2299f464789ce3270850f4ac49d (20:17): and then from there calculate how far the coordinate you want moved in the x plane only",
        "9f873a67efcfe48cac10405dc48d2263 (20:18): Well, translating 3D points onto a 2D surface isn't too difficult, but it depends on how accurate the data you're getting is and what format the data you're getting is in",
        "a190a2299f464789ce3270850f4ac49d (20:18): you can use pythagorian A^2 + B^2 = C^2 for that",
        "497c6f45cd8d2b106e83b42f664305c7 (20:20): 9f873a67efcfe48cac10405dc48d2263, a190a2299f464789ce3270850f4ac49d: The POI-data is rather accurate, and the current video location is very accurate (from a Arduino-based GPS-system).",
        "497c6f45cd8d2b106e83b42f664305c7 (20:20): pythagorian, of course. I'll have to brush up on my math. :)",
        "0de37da1d654c10aed33d7b7347b8e3b (20:20): which shield are you using?",
        "0de37da1d654c10aed33d7b7347b8e3b (20:21): adafruit?",
        "9f873a67efcfe48cac10405dc48d2263 (20:21): &lt;3 my Arduino. The data you're receiving - Are they distance coordinates from the camera, latitude/longitude/altitude, etc?",
        "497c6f45cd8d2b106e83b42f664305c7 (20:22): 0de37da1d654c10aed33d7b7347b8e3b: A colleague of mine is building the unit ‚Äì but he's using a generic GPS, not something built for the Arduino itself",
        "497c6f45cd8d2b106e83b42f664305c7 (20:23): 9f873a67efcfe48cac10405dc48d2263: The data is from the vessel that holds the camera, that's correct. Both the broadcast and the GPS data are stored with a syncronized timestamp",
        "a190a2299f464789ce3270850f4ac49d (20:23): Btw: has anyone here ever wrangled with jekyll?",
        "0de37da1d654c10aed33d7b7347b8e3b (20:41): not beyond using gh-pages",
        "a190a2299f464789ce3270850f4ac49d (20:41): hmm",
        "a190a2299f464789ce3270850f4ac49d (20:41): i would like to know if you could use jekyll to spit out JSON instead of html",
        "c5292ef67d94fef9037d7e67efc58b3d (20:42): a190a2299f464789ce3270850f4ac49d: I've never heard of jekyll but 5secs of Google makes me think that's a strong NO",
        "a190a2299f464789ce3270850f4ac49d (20:43): yeah, i cant find it either",
        "c5292ef67d94fef9037d7e67efc58b3d (20:43): heck, looks like jekyll devs rarely even read JSON, outputting it isn't even mentioned",
        "a190a2299f464789ce3270850f4ac49d (20:43): would love a cool framework that generates HTML + JSON",
        "c5292ef67d94fef9037d7e67efc58b3d (20:43): but hey, why can't you just write your own output functions to do so?",
        "a190a2299f464789ce3270850f4ac49d (20:44): well, it's worrth checking it's possible before writing something on your own",
        "a190a2299f464789ce3270850f4ac49d (20:45): i can propably get away with a script that changes .html to .json",
        "c5292ef67d94fef9037d7e67efc58b3d (20:47): you're not making a lot of sense, HTML is a formatting syntax, JSON is a data syntax",
        "c5292ef67d94fef9037d7e67efc58b3d (20:47): you are implying HTML -&gt; JSON and that makes as much sense as  Apple -&gt; Motorway",
        "a190a2299f464789ce3270850f4ac49d (20:48): c5292ef67d94fef9037d7e67efc58b3d, i can propably cheat jekyll into templating my data into JSON, but it will output it as an .html file (with only formatted json in it) and then have a script that renames the file extension",
        "c5292ef67d94fef9037d7e67efc58b3d (20:49): well it sounds like your trying to hammer a screw in... right tool for the job",
        "a190a2299f464789ce3270850f4ac49d (20:49): =D",
        "c5292ef67d94fef9037d7e67efc58b3d (20:49): jekyll is for outputting HTML markup, and trying to abuse it to output JSON is a bad idea",
        "834b7ec693f0a110e668d9285aeeba76 (20:49): Anyone able to demonstrate how to use an svg image blahblah.svg within canvas? Or point me to a good resource.. i've been googlin with no luck... or would i sinmply use an svg elemant and manipulate that?",
        "834b7ec693f0a110e668d9285aeeba76 (20:50): yikes nice typing",
        "c5292ef67d94fef9037d7e67efc58b3d (20:50): it's good enough, this isn't #english_class",
        "834b7ec693f0a110e668d9285aeeba76 (20:50): haha thanks",
        "9f873a67efcfe48cac10405dc48d2263 (20:53): Purposefully communicating poorly isn't really an effective way of getting help =/",
        "9f873a67efcfe48cac10405dc48d2263 (20:54): It depends on what you're trying to accomplish - What are you trying to do and why wouldn't you simply manipulate an SVG element?",
        "834b7ec693f0a110e668d9285aeeba76 (20:55): basically just want to take a wheel image in svg format and make it spin",
        "834b7ec693f0a110e668d9285aeeba76 (20:55): just looking to try using canvas or svg and find a nice lil tutorial",
        "9f873a67efcfe48cac10405dc48d2263 (20:59): You could just draw a wheel in svg and spin it using CSS transitions",
        "834b7ec693f0a110e668d9285aeeba76 (21:04): hmm yeah i thought abouht that... its a pretty complex wheel though.. im just trying to load the svg graphic in possibly an object element but not sure how to bring it in as an object to the javascript",
        "0de37da1d654c10aed33d7b7347b8e3b (21:22): it doesn't really matter how complex the SVG is, as long as you can load it using &lt;svg&gt;, you can CSS-rotate the hell out of it.",
        "834b7ec693f0a110e668d9285aeeba76 (21:23): thanks guys I was able to get it :)"
    ],
    "person_ids": [
        "c5292ef67d94fef9037d7e67efc58b3d",
        "497c6f45cd8d2b106e83b42f664305c7",
        "a190a2299f464789ce3270850f4ac49d",
        "70cfd9ce3d1646aaafd5b85d737706f3",
        "9f873a67efcfe48cac10405dc48d2263",
        "0de37da1d654c10aed33d7b7347b8e3b",
        "834b7ec693f0a110e668d9285aeeba76"
    ]
}