{
    "id": "580abdee3ca4a7f8a7a6d20090659a05",
    "messages": [
        "78aae8df79360f4ca59a9a5169955a58 (23:46): hey all",
        "78aae8df79360f4ca59a9a5169955a58 (23:47): I have a website, html5-games.org that has been on-line for little over a year now",
        "78aae8df79360f4ca59a9a5169955a58 (23:47): looking for 'html5 games' via Google currently has my site on #4",
        "78aae8df79360f4ca59a9a5169955a58 (23:47): usually it's at #6, but it's always somewhere between 4 and 6",
        "78aae8df79360f4ca59a9a5169955a58 (23:48): but I barely get any visitors",
        "78aae8df79360f4ca59a9a5169955a58 (23:48): now I'm thinking about just removing the whole site",
        "78aae8df79360f4ca59a9a5169955a58 (23:48): because it takes lots of time recording all these videos",
        "78aae8df79360f4ca59a9a5169955a58 (23:48): and I doubt the number of visitors will ever increase",
        "78aae8df79360f4ca59a9a5169955a58 (23:49): I have a list of about 20 of the main html5 game websites and all but a few of them have stopped posting new games",
        "78aae8df79360f4ca59a9a5169955a58 (23:49): I expected html5 to be a lot more popular by now, to be honest",
        "78aae8df79360f4ca59a9a5169955a58 (23:50): if I leave a game on the frontpage for a week and check how many plays it got, over 30 is a lot",
        "78aae8df79360f4ca59a9a5169955a58 (23:51): and then I'm not talking about a crappy game, but even impressive things like Kincses Torony that is currently on the frontpage",
        "78aae8df79360f4ca59a9a5169955a58 (23:51): most of the plays are from search engines to begin with",
        "78aae8df79360f4ca59a9a5169955a58 (23:52): it just seems that nobody really cares about html5",
        "78aae8df79360f4ca59a9a5169955a58 (23:52): or, also possible, nobody cares about my site",
        "78aae8df79360f4ca59a9a5169955a58 (23:52): but it's 4-6 on Google and I barely get anyone to my site",
        "78aae8df79360f4ca59a9a5169955a58 (23:53): so, I decided to come here and see if anyone can give a reason not to delete my site",
        "78aae8df79360f4ca59a9a5169955a58 (23:53): because really, 552 games now and each I recorded a video for",
        "78aae8df79360f4ca59a9a5169955a58 (23:53): I'm wasting away my life like this",
        "78aae8df79360f4ca59a9a5169955a58 (23:53): would be worth the trouble if anyone but me cared",
        "78aae8df79360f4ca59a9a5169955a58 (23:53): and I no longer do :|",
        "f5ff147ac29f9220f8790a0a99de3d5f (23:54): honestly, why not just have a blog that links to the games? forget recording videos",
        "f5ff147ac29f9220f8790a0a99de3d5f (23:54): they are just little web based games",
        "f5ff147ac29f9220f8790a0a99de3d5f (23:54): we can try them quickly enough",
        "78aae8df79360f4ca59a9a5169955a58 (23:54): that's true, but plenty of sites like that already exist",
        "f5ff147ac29f9220f8790a0a99de3d5f (23:55): and you wonder why you don't have a lot of visitors",
        "78aae8df79360f4ca59a9a5169955a58 (23:55): well, I'm at 4-6 on Google, so most of the other sites must be doing even worse",
        "f5ff147ac29f9220f8790a0a99de3d5f (23:56): well first consider a few things",
        "f5ff147ac29f9220f8790a0a99de3d5f (23:57): first, your search terms. I don't know anyone who would type &quot;html5 games&quot;",
        "f5ff147ac29f9220f8790a0a99de3d5f (23:57): at least no one who sits around playing games in browsers",
        "f5ff147ac29f9220f8790a0a99de3d5f (23:57): it seems like having the video demos and the search terms that you are targetting, you should format the site to showcase technology to other developers",
        "f5ff147ac29f9220f8790a0a99de3d5f (23:58): if you are aiming for casual gamers, rethink your promotional strategy",
        "f5ff147ac29f9220f8790a0a99de3d5f (23:58): obviously you won't place well for &quot;games&quot;, so you need to advertise",
        "f5ff147ac29f9220f8790a0a99de3d5f (23:59): having decent results for unlikely search terms is hardly even a good start, promotion wise",
        "78aae8df79360f4ca59a9a5169955a58 (00:00): idea behind the site is to help people who're wondering what html5 games are out there, so what's possible with html5, generally speaking",
        "78aae8df79360f4ca59a9a5169955a58 (00:00): advertising is not an option, I'm doing it all for free and investing money when I'm actually thinking about just removing the whole site wouldn't make sense",
        "f5ff147ac29f9220f8790a0a99de3d5f (00:01): then you need to promote it in places that won't cost you",
        "f5ff147ac29f9220f8790a0a99de3d5f (00:01): like reddit or other social media sites",
        "78aae8df79360f4ca59a9a5169955a58 (00:01): yeah, I've tried that, but it's like nobody cares",
        "f5ff147ac29f9220f8790a0a99de3d5f (00:02): the niche market of people who are just interested in what is recently possible with html5 is not enough to support your video-making efforts",
        "78aae8df79360f4ca59a9a5169955a58 (00:02): but the points you make are valid, I guess I just no longer think it's worth to invest any effort/time into this thing",
        "36f8eeda5467f5b6ef7c23d729a553a6 (00:08): anyone know if there's a way to exceed 5MB (perhaps user prompted) recommended limit on web storage?",
        "0acb83f1a9cfc48f061ff5555e61c6bf (00:08): 78aae8df79360f4ca59a9a5169955a58: just keep the domain around and you'll be rich after 10 years",
        "0acb83f1a9cfc48f061ff5555e61c6bf (00:08): 36f8eeda5467f5b6ef7c23d729a553a6: depends on the browser",
        "36f8eeda5467f5b6ef7c23d729a553a6 (00:11): 0acb83f1a9cfc48f061ff5555e61c6bf:   mobile (iOS &amp; android) specifically lusted for",
        "0acb83f1a9cfc48f061ff5555e61c6bf (00:11): mobile safari should prompt if you try to store more than 5 MB?",
        "0acb83f1a9cfc48f061ff5555e61c6bf (00:12): don't know about crappydroid",
        "36f8eeda5467f5b6ef7c23d729a553a6 (00:12): 0acb83f1a9cfc48f061ff5555e61c6bf:   guess we'll have to run some tests",
        "0acb83f1a9cfc48f061ff5555e61c6bf (00:12): quick googling may save time :)",
        "136126c730b6b812c7c4e0268d186e6a (00:17): 36f8eeda5467f5b6ef7c23d729a553a6 I think you can prompt. not 100% sure atm tho",
        "136126c730b6b812c7c4e0268d186e6a (00:19): 36f8eeda5467f5b6ef7c23d729a553a6 they say &quot;There is no limit, although once your databases increase beyond a certain size (5MB seems to be the default), the browser will prompt the user to allow for more space.&quot; over here http://stackoverflow.com/questions/2689939/html5-database-storage-sql-lite-few-questions",
        "0acb83f1a9cfc48f061ff5555e61c6bf (00:21): the recent iOS versions have improved the user experience by allowing the user to see and wipe the data per HTML page thru the device settings",
        "78aae8df79360f4ca59a9a5169955a58 (00:21): f5ff147ac29f9220f8790a0a99de3d5f, 0acb83f1a9cfc48f061ff5555e61c6bf, thanks for the feedback; will take it into account when making decision",
        "36f8eeda5467f5b6ef7c23d729a553a6 (00:28): i'm going to try to pick a library and get an actual test.  i want to see the data on the device.  doing evaluation"
    ],
    "person_ids": [
        "78aae8df79360f4ca59a9a5169955a58",
        "f5ff147ac29f9220f8790a0a99de3d5f",
        "36f8eeda5467f5b6ef7c23d729a553a6",
        "0acb83f1a9cfc48f061ff5555e61c6bf",
        "136126c730b6b812c7c4e0268d186e6a"
    ]
}