{
    "id": "5d843d696193e25370899314e045e2c5",
    "messages": [
        "f139aba52f9fa1394b4034a7954b2220 (16:21): hmm. 587bf8b858e15d03428e1415c33c38ef thinks we can go from CR to REC in just 13 months.",
        "587bf8b858e15d03428e1415c33c38ef (16:22): yup",
        "587bf8b858e15d03428e1415c33c38ef (16:22): the key is to build tests as we address issues",
        "f139aba52f9fa1394b4034a7954b2220 (16:22): How do you expect to produce a comprehensive test suite and achieve 2 interoperable implementations of the whole spec within that time?",
        "587bf8b858e15d03428e1415c33c38ef (16:22): we have a lot of test materials in progress",
        "587bf8b858e15d03428e1415c33c38ef (16:22): I don't expect to produce a comprehensive test suite; just a good-enough test suite",
        "f139aba52f9fa1394b4034a7954b2220 (16:23): define &quot;good enough&quot;?",
        "587bf8b858e15d03428e1415c33c38ef (16:23): experience will define good enough",
        "587bf8b858e15d03428e1415c33c38ef (16:23): checks the charter and finds &quot;comprehensive test suite&quot;. hmm. oh well; that's still subject to judgement",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:24): would count comprehensive at checking every possible if statement",
        "587bf8b858e15d03428e1415c33c38ef (16:24): I plan to do the best test suite we can in the next year or two",
        "f139aba52f9fa1394b4034a7954b2220 (16:24): CSS 2.1 has been CR for several years now (though it went back to WD in between)",
        "587bf8b858e15d03428e1415c33c38ef (16:24): assertion-based testing isn't all that valuable in my experience; I don't mind if somebody does it",
        "f139aba52f9fa1394b4034a7954b2220 (16:25): it looks like it was first published as CR in 2004",
        "587bf8b858e15d03428e1415c33c38ef (16:25): I don't think CSS is a good example of how to manage the W3C process",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:25): 587bf8b858e15d03428e1415c33c38ef: is there a good example that we should learn from?",
        "f139aba52f9fa1394b4034a7954b2220 (16:26): I'm referring to the time it is taking for CSS2.1 to be interoperably implemented",
        "587bf8b858e15d03428e1415c33c38ef (16:26): I've done several timely test suites: RDF Core, OWL, SPARQL, and GRDDL. I'm reasonably happy with all of those, though their scope is hundreds of times smaller than HTML's",
        "f139aba52f9fa1394b4034a7954b2220 (16:26): also CSS2.0 went Rec in 1998 (before the CR phase was introduced in the W3C), so that's been nearly 10 years and we still don't have 2 interoperable implementations",
        "587bf8b858e15d03428e1415c33c38ef (16:26): I expect a massively parallel testing and QA effort for HTML",
        "f139aba52f9fa1394b4034a7954b2220 (16:27): 587bf8b858e15d03428e1415c33c38ef, of course. Implementation and testing is currently going on. But it's taking a long time",
        "587bf8b858e15d03428e1415c33c38ef (16:27): isn't particularly interested in using CSS as an example",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:27): 587bf8b858e15d03428e1415c33c38ef: It seems to me we lack a massive number of competent and willing test case writers",
        "f139aba52f9fa1394b4034a7954b2220 (16:27): isn't particularly interested in using RDF and GRDDL as examples",
        "587bf8b858e15d03428e1415c33c38ef (16:28): b8810fee2f4a71f849f3f7409546d1d9, we have a lot of recruiting to do, indeed. But we don't need to write *that* many tests. The bulk of the manual labor is in reporting test results.",
        "f139aba52f9fa1394b4034a7954b2220 (16:29): 587bf8b858e15d03428e1415c33c38ef, roughly how many test cases would you estimate we would need for the whole spec?  (just a rough figure to the nearest 1000 or so)",
        "587bf8b858e15d03428e1415c33c38ef (16:30): f139aba52f9fa1394b4034a7954b2220, there's no way to make a compelling argument about how long something will take. June 2009 is my best guess based on what I know today. Maybe in a few months I'll know different.",
        "587bf8b858e15d03428e1415c33c38ef (16:30): I think I've estimated 15,000 to 50,000 test cases.",
        "f139aba52f9fa1394b4034a7954b2220 (16:31): I just don't understand why you're being so persistent with your estimates, despite getting feedback about them being unrealisting on several occasions.",
        "f139aba52f9fa1394b4034a7954b2220 (16:31): *unrealistic",
        "587bf8b858e15d03428e1415c33c38ef (16:31): because I want to get finished, and repeating something does make it come true.",
        "587bf8b858e15d03428e1415c33c38ef (16:32): I'm not sure what you mean by &quot;so persistent&quot;. I've changed my estimates several times",
        "f139aba52f9fa1394b4034a7954b2220 (16:32): I think we all want to get finished.  I just want to be realistic.",
        "f139aba52f9fa1394b4034a7954b2220 (16:33): 587bf8b858e15d03428e1415c33c38ef, your estimates have always been fairly close to those given in the charter, varying only by a few months",
        "587bf8b858e15d03428e1415c33c38ef (16:33): I want to be realistic too; keep in mind that postponing features to a later release is always an option, and often a good one.",
        "f139aba52f9fa1394b4034a7954b2220 (16:34): so in order to get done by your time frame, you would suggest moving some features to HTML6, and publishing a smaller HTML5?",
        "587bf8b858e15d03428e1415c33c38ef (16:34): yes",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:35): in HTML 5 we need to define current browser features, even if no more.",
        "587bf8b858e15d03428e1415c33c38ef (16:35): &quot;need&quot; is a strong word.",
        "587bf8b858e15d03428e1415c33c38ef (16:35): we need to advance the state of the art; we don't need to solve all problems in one rev",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (16:36): test results are hardly the issue",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:36): 587bf8b858e15d03428e1415c33c38ef: as someone who would like to create a HTML UA, yet someone who doesn't have huge amounts of time to spend reverse engineering current behaviour, it seems pointless to not define something interoperability",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (16:36): creating the tests and getting implementors to fix the bugs is",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (16:36): always has been the issue",
        "587bf8b858e15d03428e1415c33c38ef (16:37): yes, e3fb62ebfa4f36acf5cbff6a6ed0f2e0 ; we should focus testing effort toward that end",
        "587bf8b858e15d03428e1415c33c38ef (16:37): that's why assertion testing is less interesting to me; there's little bang-for-the-buck in writing test cases for stuff that is already interoperably deployed",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:38): I'm sure given politics at the time, DTDs had to be in XML, but wow they sure are a pain for implementations",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (16:38): also, going from CR to REC in 13 months seems optimistic if the test suite isn't ready by the time we go to CR",
        "587bf8b858e15d03428e1415c33c38ef (16:38): there's still _some_ value in it, and I hope somebody does it. but it's not a high priority",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (16:38): (and even then it would be optimistic)",
        "587bf8b858e15d03428e1415c33c38ef (16:38): the test suite will be in some state of readiness as we go to CR",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:38): 587bf8b858e15d03428e1415c33c38ef: I'd question how you can be sure the stuff is interoperably deployed without test suites",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (16:38): sure, they're in some state of readyiness now :)",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (16:39): i guess we'll see how it goes",
        "587bf8b858e15d03428e1415c33c38ef (16:39): a11aabeeceeae6b8cb5d12ea06b56554, indeed, it's easier to be sure with more data."
    ],
    "person_ids": [
        "f139aba52f9fa1394b4034a7954b2220",
        "587bf8b858e15d03428e1415c33c38ef",
        "a11aabeeceeae6b8cb5d12ea06b56554",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0"
    ]
}