{
    "id": "5f622a5faec561be97ce67024cb8d0d5",
    "messages": [
        "467f6d43402c6573237052cefcc252db (10:55): Hixie, I basically haven't found time to work on CSSOM for the past year or so",
        "467f6d43402c6573237052cefcc252db (10:56): Hixie, though resize and scroll could I suppose be part of the subset that is CSSOM Vie",
        "467f6d43402c6573237052cefcc252db (10:56): w",
        "b25b6b77a0087ff8385941e5545d32ea (11:01): What happens if I have some HTML like &lt;body bgcolor=&quot;black&quot;&gt;&lt;article&gt;&lt;font color=&quot;white&quot;&gt;... and the &lt;article&gt; contents ends up in a feed? ill it be unreadable? Taking some but not all style information seems like it could be dangerous",
        "b25b6b77a0087ff8385941e5545d32ea (11:01): s/ill/will/",
        "a924fb58d2c25874322f4e5126f608b9 (11:03): b25b6b77a0087ff8385941e5545d32ea: Well, that's &quot;wrong&quot; to begin with",
        "b25b6b77a0087ff8385941e5545d32ea (11:03): a924fb58d2c25874322f4e5126f608b9: In what way?",
        "b25b6b77a0087ff8385941e5545d32ea (11:03): Under the assumption that anything that works in a UA is conforming",
        "a924fb58d2c25874322f4e5126f608b9 (11:03): You should set text color on the body element as well",
        "a924fb58d2c25874322f4e5126f608b9 (11:04): Always specify foreground and background together",
        "b25b6b77a0087ff8385941e5545d32ea (11:04): a924fb58d2c25874322f4e5126f608b9: According to whom? Not according to the supposed no-author-requirements HTML spec",
        "a924fb58d2c25874322f4e5126f608b9 (11:05): According to the best practices that are supposed to replace them",
        "a924fb58d2c25874322f4e5126f608b9 (11:05): No requirements includes the freedom to shoot yourself in the foot",
        "b25b6b77a0087ff8385941e5545d32ea (11:06): Yeah but I'm trying to work out why that's a good thing",
        "a924fb58d2c25874322f4e5126f608b9 (11:06): Has anyone claimed that?",
        "b25b6b77a0087ff8385941e5545d32ea (11:07): That having no author requirements is a good thing? Sure",
        "a924fb58d2c25874322f4e5126f608b9 (11:07): That's a choice between evils, not goods",
        "b25b6b77a0087ff8385941e5545d32ea (11:07): Can you explain more?",
        "a924fb58d2c25874322f4e5126f608b9 (11:07): Requirements come with ratholes, bikesheds, and aren't enforced",
        "a924fb58d2c25874322f4e5126f608b9 (11:08): The argument (as I read it) goes that avoiding all those weighs up for the loss of the guideance authority that could be provided",
        "b25b6b77a0087ff8385941e5545d32ea (11:08): Lack of requirments will come with a huge rathole, at the bottom of which will be the original ratholes but renamed &quot;best practices&quot;",
        "b25b6b77a0087ff8385941e5545d32ea (11:09): So I don't see any possibility for gain here",
        "a924fb58d2c25874322f4e5126f608b9 (11:09): That is the gain",
        "a924fb58d2c25874322f4e5126f608b9 (11:09): That huge rathole will always be there, that's what good authoring is all about",
        "a924fb58d2c25874322f4e5126f608b9 (11:09): But without requirements, we outsource the war over where the hole should be",
        "b25b6b77a0087ff8385941e5545d32ea (11:10): As far as I can tell the main agenda here is that some people don't like the HTML5 draft because it doesn't endorse something that they hold dear to them. So they have decided that the only way out is to try to remove all restrictions and be told &quot;do what you like&quot;",
        "a924fb58d2c25874322f4e5126f608b9 (11:10): Well, the basic complaint holds: What use are requirements that no one actually requires?",
        "b25b6b77a0087ff8385941e5545d32ea (11:11): Sometimes this is wrapped up in theoretical RFC 2119 arguments",
        "b25b6b77a0087ff8385941e5545d32ea (11:12): a924fb58d2c25874322f4e5126f608b9: The point of authoring requirements in a language with error correcting clients is not to describe the only possible way of doing things",
        "b25b6b77a0087ff8385941e5545d32ea (11:12): It is to reduce the authoring surface of the language so that it does not grow without bounds and so there are as  few sharp edges as possible",
        "a924fb58d2c25874322f4e5126f608b9 (11:13): But nobody reads those requirements",
        "b25b6b77a0087ff8385941e5545d32ea (11:13): a924fb58d2c25874322f4e5126f608b9: Demonstrably untrue",
        "a924fb58d2c25874322f4e5126f608b9 (11:13): They read second- or third-hand references that also includes local author intent, best practices, misconceptions, urban legends, etc etc",
        "b25b6b77a0087ff8385941e5545d32ea (11:14): There has been a huge movement toward following standards. Yes there is a lot of cargo cult nonsense. But there is enough essentially good stuff that we should no thro the whole thing away just to make the lives of spec authors better",
        "b25b6b77a0087ff8385941e5545d32ea (11:14): We even have a design principle about that",
        "a924fb58d2c25874322f4e5126f608b9 (11:14): Nobody's saying we should throw it away",
        "b25b6b77a0087ff8385941e5545d32ea (11:14): a924fb58d2c25874322f4e5126f608b9: They really are",
        "a924fb58d2c25874322f4e5126f608b9 (11:15): They may think so",
        "a924fb58d2c25874322f4e5126f608b9 (11:15): But those references people use will still exist",
        "a924fb58d2c25874322f4e5126f608b9 (11:15): It's only mark's assholes that will be weakened",
        "b25b6b77a0087ff8385941e5545d32ea (11:17): a924fb58d2c25874322f4e5126f608b9: I would expect one effect of removing conformance requirements to be that people will start to reject HTML5 for cargo-cult reasons",
        "a924fb58d2c25874322f4e5126f608b9 (11:17): Oh, sure. But there wouldn't be anything for them to reject. It would be a user agent spec full and whole.",
        "b25b6b77a0087ff8385941e5545d32ea (11:17): a924fb58d2c25874322f4e5126f608b9: Not really.",
        "b25b6b77a0087ff8385941e5545d32ea (11:18): It still will define a language",
        "b25b6b77a0087ff8385941e5545d32ea (11:18): It just won't tell you which bits are a really bad idea",
        "a924fb58d2c25874322f4e5126f608b9 (11:18): Now we're back at html4 ground",
        "b25b6b77a0087ff8385941e5545d32ea (11:18): ?",
        "a924fb58d2c25874322f4e5126f608b9 (11:18): The language in the spec does not matter for authors, authors and users only go via user agents",
        "b25b6b77a0087ff8385941e5545d32ea (11:19): But we just discussed this. Authors learn from somewhere and that somewhere often has looked at the spec",
        "b25b6b77a0087ff8385941e5545d32ea (11:19): And authors do use vaidators",
        "b25b6b77a0087ff8385941e5545d32ea (11:20): and validators have read the spec for sure",
        "a924fb58d2c25874322f4e5126f608b9 (11:20): But again the authors don't go directly to the spec",
        "a924fb58d2c25874322f4e5126f608b9 (11:20): They see the validator's rules, which would include all kinds of best practices",
        "b25b6b77a0087ff8385941e5545d32ea (11:21): a924fb58d2c25874322f4e5126f608b9: What kind of best practices are encoded by validator.w3.org or validator.nu, beyond what is in the spec?",
        "a924fb58d2c25874322f4e5126f608b9 (11:21): All the author requirements",
        "b25b6b77a0087ff8385941e5545d32ea (11:22): I mean today",
        "a924fb58d2c25874322f4e5126f608b9 (11:22): Today there isn't much need, henri gets it put into the spec instead",
        "a924fb58d2c25874322f4e5126f608b9 (11:22): In particular the downplayed errors, he seems to be the main driving force there",
        "b25b6b77a0087ff8385941e5545d32ea (11:23): a924fb58d2c25874322f4e5126f608b9: The concept of downplayed errors is silly",
        "b25b6b77a0087ff8385941e5545d32ea (11:23): That is a UI issue",
        "a924fb58d2c25874322f4e5126f608b9 (11:23): If so, that strenghtens the point",
        "a924fb58d2c25874322f4e5126f608b9 (11:24): These are things he doesn't want the validator to mark as errors. Now he's working inside the spec, if the spec dropped author reqs he would just go ahead and do it directly",
        "ab7faae5d7b250ea8606486575f8f79c (11:24): What if someone else writing a different validator has different ideas of what should be considered an error or a warning?",
        "b25b6b77a0087ff8385941e5545d32ea (11:25): a924fb58d2c25874322f4e5126f608b9: So in the future what do you envison? validator.w3.org uses best practices document A. commercial.validator.org uses weaker best practices document B to iucrease marketshare. Validator validate.net is written by areholes and has a whole load of additional requirements. An author tries to validate her document. What does she conclude?",
        "a924fb58d2c25874322f4e5126f608b9 (11:25): Then you get competition in who validates the best",
        "ab7faae5d7b250ea8606486575f8f79c (11:25): Putting those requirements in the spec prevents the benefits of competition, because there will only be one official blessed notion of validity",
        "ab7faae5d7b250ea8606486575f8f79c (11:25): which seems similar to the argument against putting machine-readable schemas in the spec",
        "b25b6b77a0087ff8385941e5545d32ea (11:25): a924fb58d2c25874322f4e5126f608b9: Re: dowwnplayed errors, Henri can already choose to downplay any error he likes. It is a pure UI issue",
        "a924fb58d2c25874322f4e5126f608b9 (11:26): b25b6b77a0087ff8385941e5545d32ea: Again, sure. It's not material to my point. The point is that he puts effort into convincing Hixie to mark them as downplayed. That means he cares.",
        "b25b6b77a0087ff8385941e5545d32ea (11:27): ab7faae5d7b250ea8606486575f8f79c: The problem with putting schemas in the spec is that it is not possible to express all conformance requirements in schema and there is the possibility of divergence between the actual requirements and the schema (due either to the limitations or to bugs)",
        "a924fb58d2c25874322f4e5126f608b9 (11:28): This situation exists even now, of course",
        "a924fb58d2c25874322f4e5126f608b9 (11:28): There are requirements outside the HTML5 spec",
        "b25b6b77a0087ff8385941e5545d32ea (11:28): a924fb58d2c25874322f4e5126f608b9: And I still maintain it is silly to have the requirements in the spec. So I don't see that I'm taking an inconsistent position",
        "a924fb58d2c25874322f4e5126f608b9 (11:28): This whole thing would just be moving one set of requirements into some other (possible more than one) location",
        "b25b6b77a0087ff8385941e5545d32ea (11:29): s/requirements/downplayed errors/",
        "a924fb58d2c25874322f4e5126f608b9 (11:29): It's not your position. His effort suggests that even if the spec did not have author requirements, he personally cares enough about these issues that his validator would have best practices for them",
        "a924fb58d2c25874322f4e5126f608b9 (11:30): So no, validators would not just be windows onto the UA spec",
        "b25b6b77a0087ff8385941e5545d32ea (11:30): a924fb58d2c25874322f4e5126f608b9: I don't understand your argument at all",
        "b25b6b77a0087ff8385941e5545d32ea (11:30): specifically the sentence &quot;validators would not just be windows onto the UA  spec",
        "b25b6b77a0087ff8385941e5545d32ea (11:30): &quot;",
        "a924fb58d2c25874322f4e5126f608b9 (11:31): [10:17:05] &lt b25b6b77a0087ff8385941e5545d32ea&gt; a924fb58d2c25874322f4e5126f608b9: What kind of best practices are encoded by validator.w3.org or validator.nu, beyond what is in the spec?",
        "b25b6b77a0087ff8385941e5545d32ea (11:31): &quot;The spec&quot; in this case is not just a &quot;UA spec&quot; though",
        "a924fb58d2c25874322f4e5126f608b9 (11:32): Now we're just repeating ourselves",
        "a924fb58d2c25874322f4e5126f608b9 (11:32): The validator doesn't have its own requirements because they're in the spec. If they're not in the spec, they would be in the validator instead (so the validator itself wouldn't change)",
        "b25b6b77a0087ff8385941e5545d32ea (11:34): There is no disagreement about what the requirements are. There is only the issue of whether some errors should be displayed with greater weight. That, to me, is a UI issue and I think that it shouldn't be in the spec",
        "a924fb58d2c25874322f4e5126f608b9 (11:35): Leave that issue. It's just an example to show that henri personally cares about some of the requirements, to support the claim that the validator would still have requirements if they weren't in the spec",
        "b25b6b77a0087ff8385941e5545d32ea (11:35): So I disagree with Henri here. But I don't feel bad about it too much because I disagree with Henri less than almost anyone else involved with HTML5 :)",
        "b25b6b77a0087ff8385941e5545d32ea (11:36): a924fb58d2c25874322f4e5126f608b9: Your argument seems totally unjustified. Unless you can point to things that are not in the spec but Henri has included as requirements anyway I don't think that you can conclude that he would do such a thing",
        "b25b6b77a0087ff8385941e5545d32ea (11:37): I also don't think it's very relevant to whether, overall, there is any benefit to be gained by removing all the author requirements from HTML5",
        "b25b6b77a0087ff8385941e5545d32ea (11:37): Anyway, I guess I should do something more useful...",
        "a924fb58d2c25874322f4e5126f608b9 (11:38): We were there earlier",
        "a924fb58d2c25874322f4e5126f608b9 (11:39): It's related because it claims that validators wouldn't change much. And validators and non-primary sources are where authors go",
        "a924fb58d2c25874322f4e5126f608b9 (11:39): =&gt; Things would not change for authors and users",
        "b25b6b77a0087ff8385941e5545d32ea (11:40): I still disagree but there se go",
        "b25b6b77a0087ff8385941e5545d32ea (11:40): *we",
        "a924fb58d2c25874322f4e5126f608b9 (11:40): Sure, you might get small civil wars over what best practices are best, but that would be hidden to most people. And it already happens, just look at WCAG Samurai",
        "b25b6b77a0087ff8385941e5545d32ea (11:43): Actually the accessibility space is a great example of wwhy this kind of thing can be a disaster. There are so many documents relating to WCAG that it is almost impossible to tell where you should look for any given thing. And so you ask an &quot;expert&quot; and get an answer. And ask another &quot;expert&quot; and get a different answer. And so on...",
        "ab7faae5d7b250ea8606486575f8f79c (11:44): Does anyone take any notice of the WCAG Samurai's suggestions, or is it evidence that everyone just follows the most official sounding guidelines (from the W3C) and ignores everything else regardless of merits?",
        "a924fb58d2c25874322f4e5126f608b9 (11:44): I think the evidence is that people ignore everything, period"
    ],
    "person_ids": [
        "467f6d43402c6573237052cefcc252db",
        "b25b6b77a0087ff8385941e5545d32ea",
        "a924fb58d2c25874322f4e5126f608b9",
        "ab7faae5d7b250ea8606486575f8f79c"
    ]
}