{
    "id": "621560fa0b913a3d7197895e77c5a402",
    "messages": [
        "3f2e2531201cfbf853f16f668132eaf2 (00:49): a9b326df4e6da61c5b6f5e1058be83a2: About putting tests on dev.w3.org: Is there some existing infrastructure that could be used for running cross-domain tests?",
        "f47636673b14c54021a69dc06f6a19fb (00:50): didn't know there was a new chair or maybe staff contact in the group - &quot;With this, I am happy to publish this working draft as a WD.&quot; http://lists.w3.org/Archives/Public/public-html/2009Jan/0367.html",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:50): ?",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (00:51): f47636673b14c54021a69dc06f6a19fb, Sam asked for objections against publishing, 69b0d3dfe919a6b860a9fac82de52a7e gave one, a9b326df4e6da61c5b6f5e1058be83a2 addressed it, 69b0d3dfe919a6b860a9fac82de52a7e was ok with the change",
        "a9b326df4e6da61c5b6f5e1058be83a2 (00:52): 3f2e2531201cfbf853f16f668132eaf2: If you mean a test harness that supports such, I don't know. Maybe the CSS WG or mobile-Web test suites WG have something.",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (00:52): CSS WG does not",
        "f47636673b14c54021a69dc06f6a19fb (00:52): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: that might be my loosy English grammar :)",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (00:53): ah, I see what you mean now, I don't think 69b0d3dfe919a6b860a9fac82de52a7e intended to say that :)",
        "3f2e2531201cfbf853f16f668132eaf2 (00:53): a9b326df4e6da61c5b6f5e1058be83a2: Not necessarily a harness, just a domain that is not dev.w3.org but can serve the same files",
        "a9b326df4e6da61c5b6f5e1058be83a2 (00:53): f47636673b14c54021a69dc06f6a19fb: yeah, I think you could just read that as &quot;to have this published as...&quot; or whatever",
        "f47636673b14c54021a69dc06f6a19fb (00:54): a9b326df4e6da61c5b6f5e1058be83a2: this makes more sense indeed",
        "a9b326df4e6da61c5b6f5e1058be83a2 (00:54): 3f2e2531201cfbf853f16f668132eaf2: I see. I would think we could get something set up as needed",
        "1adba86c435b5fe0f7ea043370b1636b (00:54): &quot;working draft as a WD&quot; is funny",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (00:54): different ports and http vs https would be cool as well",
        "3f2e2531201cfbf853f16f668132eaf2 (00:55): a9b326df4e6da61c5b6f5e1058be83a2: It's not something I'd care much about myself; just a thought I had when seeing Microsoft's tests using www.asp.net as well as samples.msdn.microsoft.com",
        "a9b326df4e6da61c5b6f5e1058be83a2 (00:55): ah",
        "3f2e2531201cfbf853f16f668132eaf2 (00:55): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: That doesn't sound like something that would make the W3C sysadmin people very happy :-)",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:55): f47636673b14c54021a69dc06f6a19fb: see /msg",
        "a9b326df4e6da61c5b6f5e1058be83a2 (00:56): Well, I would vote for starting to get the tests checked in and sorting out the problems as we need",
        "a9b326df4e6da61c5b6f5e1058be83a2 (00:57): I'm recalling now that part of the reason we never made muhc progress on getting tests checked it is that we started doing a lot of hand-wringing about how we should structure the subdirs and what harness to use and even what version-control system",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:57): imho the solution to that kind of problem is to assign a test &quot;czar&quot; and give them full authority and responsibility",
        "3f2e2531201cfbf853f16f668132eaf2 (00:58): I thought the reason we didn't make much progress was that nobody had tests that they wanted to bother checking in to the W3C system",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:58): i've seen this kind of thing (specifically with test suites even) half a dozen times at least, every time there's a committee involved it devolves into a rat hole with no progress",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (00:58): there was fuss over the things a9b326df4e6da61c5b6f5e1058be83a2 mentions as well",
        "3f2e2531201cfbf853f16f668132eaf2 (00:59): At least that's my reason - I have a load of canvas tests but I don't currently see any value in moving them off philip.html5.org, because anyone who wants to use them already knows where they are and nobody wants to review or modify them",
        "a924fb58d2c25874322f4e5126f608b9 (01:00): And then you get hit by a bus one day",
        "3f2e2531201cfbf853f16f668132eaf2 (01:00): Then someone can download the source code that's also hosted on philip.html5.org and move it elsewhere :-)",
        "3f2e2531201cfbf853f16f668132eaf2 (01:01): Also, if I was hit by a bus then I wouldn't care about canvas tests",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (01:01): i was hoping we could some day merge the various &lt;canvas&gt; test suites, but maybe that is not necessary",
        "f47636673b14c54021a69dc06f6a19fb (01:01): 3f2e2531201cfbf853f16f668132eaf2: what would give value to your tests?",
        "f47636673b14c54021a69dc06f6a19fb (01:02): Would a simple mirroring be ok? with the license agreement which goes with it",
        "3f2e2531201cfbf853f16f668132eaf2 (01:03): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: I've never worried much about what the other test suites are doing, since I've just attempted to comprehensively test everything I can think of and hopefully it covers everything the others are doing",
        "3f2e2531201cfbf853f16f668132eaf2 (01:03): though in practice that probably doesn't work perfectly",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:04): wonders why f47636673b14c54021a69dc06f6a19fb is ignoring him",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (01:04): it might be too much effort to just find out",
        "f47636673b14c54021a69dc06f6a19fb (01:04): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: possibly",
        "3f2e2531201cfbf853f16f668132eaf2 (01:04): In particular, it might be nice to look at other browsers' test suites (i.e. WebKit's) since they're likely to have regression tests for real problems",
        "3f2e2531201cfbf853f16f668132eaf2 (01:05): f47636673b14c54021a69dc06f6a19fb: I'm not sure what would give value, and I don't see any particular benefits in mirroring on w3.org",
        "3f2e2531201cfbf853f16f668132eaf2 (01:05): I'm not at all opposed to doing things in the W3C space, I just don't care enough to do anything about it :-)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:06): 3f2e2531201cfbf853f16f668132eaf2: at the time we set up the CVS test dir, Maciej said he had a number of tests he would really like to check in somewhere",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:06): 69b0d3dfe919a6b860a9fac82de52a7e: I agree about having a test czar. Problem is getting someone to volunteer to do it.",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:07): a9b326df4e6da61c5b6f5e1058be83a2: yeah, not sure what to do about that. there is a dearth of volunteers.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:07): yep",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:07): a9b326df4e6da61c5b6f5e1058be83a2: though apparently not for writing the about: spec, which got about half a dozen volunteers in about an hour",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:07): go figure",
        "f47636673b14c54021a69dc06f6a19fb (01:07): 3f2e2531201cfbf853f16f668132eaf2: what I can see but not on your side indeed, is: w3c uri policy, unique point of information for devs who might not know your site, and the hit by a bus factor (which I do not wish)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:07): heh",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:07): (exaggerating a bit though not much!)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:08): I think at one time DanC was keen on getting work going on tests. I don't know if leading the test-suite work would fit in with his current responsibilities",
        "f47636673b14c54021a69dc06f6a19fb (01:08): a9b326df4e6da61c5b6f5e1058be83a2: hehe, DanC is a test gourmet",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:08): he mentioned that he was interpreting his contract with adobe as license to write tests, iirc",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:09): so he might be in a good position to do so",
        "b07211a0c7cb119232799d2119cea90f (01:11): what would be being a test czar entail?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:11): b07211a0c7cb119232799d2119cea90f: deciding what the structure for the tests directories is, deciding what test harness to use",
        "3f2e2531201cfbf853f16f668132eaf2 (01:12): Does the czar get to invade other Working Groups to expand his empire?",
        "f47636673b14c54021a69dc06f6a19fb (01:13): 3f2e2531201cfbf853f16f668132eaf2: only in bad movies and cheap novels",
        "3f2e2531201cfbf853f16f668132eaf2 (01:13): s/harness/harnesses/ hopefully",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:14): 3f2e2531201cfbf853f16f668132eaf2: no, just the normal lobbing of missiles at each other, with demands to the UN to issue formal statements that everybody then subsequently ignores",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:14): our core problem is that we are mostly an all-volunteer army",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:15): what we really need is a Web-technologies conscription/draft system",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:15): draft smart Web developers into 6 months of public service as an editor",
        "3f2e2531201cfbf853f16f668132eaf2 (01:16): Most armies work alright without conscription because they pay their volunteers",
        "3f2e2531201cfbf853f16f668132eaf2 (01:16): Also they get cool uniforms, and can shoot people",
        "b07211a0c7cb119232799d2119cea90f (01:16): the test czar could get a tshirt saying as much",
        "3f2e2531201cfbf853f16f668132eaf2 (01:16): I think those are three pillars that the W3C should adopt",
        "b07211a0c7cb119232799d2119cea90f (01:17): and can shout at web browser vendors, which is almost like shooting them",
        "3f2e2531201cfbf853f16f668132eaf2 (01:19): b07211a0c7cb119232799d2119cea90f: If you consider shouting at someone to be &quot;almost like&quot; shooting them, I would hate to imagine you in the crowd at a football match",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:20): he'd fit right in in the UK, no?",
        "b07211a0c7cb119232799d2119cea90f (01:20): grins",
        "b07211a0c7cb119232799d2119cea90f (01:21): well, I might be interested in doing testsuite management, but I haven't got much time for that in the next few weeks",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:23): b07211a0c7cb119232799d2119cea90f: how long is a few weeks? 3 weeks?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:24): W3C: Cash. Fashion. Guns.",
        "b07211a0c7cb119232799d2119cea90f (01:24): something like that.  realistically, second half of february / beginning of march",
        "f47636673b14c54021a69dc06f6a19fb (01:25): has Morricone music in the head now. thanks a9b326df4e6da61c5b6f5e1058be83a2",
        "3f2e2531201cfbf853f16f668132eaf2 (01:27): a9b326df4e6da61c5b6f5e1058be83a2: Sounds like a good premise for the next in the GTA series",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:27): b07211a0c7cb119232799d2119cea90f: If you can commit to that, I will suggest to the chairs that they take you up on the offer.",
        "b07211a0c7cb119232799d2119cea90f (01:27): is the w3c exclusively-cvs?  the thought of managing testsuite directory structures in cvs fills me with dread",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:28): b07211a0c7cb119232799d2119cea90f: yeah, W3C is currently CVS-only -- at least as far as what is supported by the systeam",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:29): though I think DanC has a mercurial or git server running somewhere",
        "b07211a0c7cb119232799d2119cea90f (01:29): hmm",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:29): I share your dread about working with CVS, but not much we can do about it in the short term",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:30): we go to war with the version-control system that we have, not the version-control system that we'd like to have",
        "b07211a0c7cb119232799d2119cea90f (01:30): :)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:30): 3f2e2531201cfbf853f16f668132eaf2: as far as uniforms, we already have those:",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:30): http://www.flickr.com/photos/sideshowbarker/2067567428/",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (01:30): Title: SW3C1Ws on Flickr - Photo Sharing! (at www.flickr.com)",
        "b07211a0c7cb119232799d2119cea90f (01:30): well, I'd be happy to put my name down",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:30): b07211a0c7cb119232799d2119cea90f: cool",
        "b07211a0c7cb119232799d2119cea90f (01:30): though I'll have to talk to the chairs about what they would need me to do--I'm sure I can pick it up",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:31): OK, I think we can take discussion about it to the list. But I will bring it up with Sam and Chris directly as well.",
        "b07211a0c7cb119232799d2119cea90f (01:32): nods",
        "3f2e2531201cfbf853f16f668132eaf2 (01:33): The pain of organising complex hierarchies in CVS sounds like it could be greater than the pain of switching to a not-yet-supported VCS",
        "3f2e2531201cfbf853f16f668132eaf2 (01:35): (particularly since DVCSs seem to make it relatively non-painful to work without a centralised repository, so it'd be alright at first even if the W3C couldn't actually host the files itself)",
        "b07211a0c7cb119232799d2119cea90f (01:35): something like using git for a masster copy which committed to cvs whenever it was updated would probably make life easier",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:36): fwiw, the team well understands that there are better version-control systems that CVS, and the plan is not to stay with the CVS forever",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:36): in the mean time, we need to work within the limitations of what we have at hand",
        "3f2e2531201cfbf853f16f668132eaf2 (01:37): Do our limitations have to include relying on the W3C's facilities?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:37): 3f2e2531201cfbf853f16f668132eaf2: no, not necessarily",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:37): b07211a0c7cb119232799d2119cea90f's suggestion about using git and pushing the commits to CVS would be fine by me",
        "3f2e2531201cfbf853f16f668132eaf2 (01:38): remembers seeing lots of XHTML2 stuff on aptest.com, so it doesn't seem that uncommon to rely on external services",
        "3f2e2531201cfbf853f16f668132eaf2 (01:38): That sounds reasonable to me",
        "3f2e2531201cfbf853f16f668132eaf2 (01:39): though is it worth pushing the commits to CVS, rather than just uploading them as static files into a web server directory somewhere?",
        "b07211a0c7cb119232799d2119cea90f (01:40): that's a fair point",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:41): I guess static copies would work fine, though I can imagine some people might be happy to have them available in CVS too",
        "3f2e2531201cfbf853f16f668132eaf2 (01:41): Maybe it would be worthwhile just so people who don't understand git could do &quot;cvs up; edit some test file; cvs diff &gt; patch-to-send-to-mailing-list&quot;",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:42): I will say that one advantage of just using CVS would be that it's a lower barrier of entry for potential contributors",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:42): in that there are more people who easy access/setup for CVS client tools than for git",
        "b07211a0c7cb119232799d2119cea90f (01:43): hmm",
        "b07211a0c7cb119232799d2119cea90f (01:43): I'm not so sure that's quite so true these days",
        "b07211a0c7cb119232799d2119cea90f (01:43): though I guess in companies it might be",
        "b07211a0c7cb119232799d2119cea90f (01:43): e.g. Windows has git with a GUI these days",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:43): I do have to say that I can see git or some other distributed VCS being much more valuable for projects where you need to do a lot of branching and merging, and need to do it quickly and easily",
        "b07211a0c7cb119232799d2119cea90f (01:44): and 'git clone branch; edit some test files; git diff &gt; patch' is not more complex than cvs",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:44): true",
        "3f2e2531201cfbf853f16f668132eaf2 (01:45): It's not more complex but it's different, and people already understand cvs and have it installed, so it's at least twice as much work if they have to have git too",
        "b07211a0c7cb119232799d2119cea90f (01:45): nods",
        "b07211a0c7cb119232799d2119cea90f (01:45): well, I don't see there'd be any problem having a cvs mirror around",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:46): b07211a0c7cb119232799d2119cea90f: anyway, this is exactly why we need a test czar",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:46): some people will object to whatever ends up getting decided",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:47): and in the end, the choice of VCS and directory structure is not critical to the success of the work",
        "3f2e2531201cfbf853f16f668132eaf2 (01:48): isn't sure that's necessarily true",
        "3f2e2531201cfbf853f16f668132eaf2 (01:48): The success of the work is dependent on volunteers contributing to the work, and that is strongly dependent on how easy it is to contribute",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:48): so it's more important that whatever choice is made is what makes it easiest for the person(s) leading and actually doing the work to manage it in the way that works best for them",
        "3f2e2531201cfbf853f16f668132eaf2 (01:49): and issues like VCS can have a fairly significant effect on how easy it is to contribute, and how much time and effort you have to waste trying to get all the latest versions and create patches and review things without getting lost",
        "3f2e2531201cfbf853f16f668132eaf2 (01:50): would agree that it makes sense for decisions to be made only by the people who will be directly affected by those decisions",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:51): The problem is everybody has different opinions about what constitutes &quot;easiest&quot;.",
        "3f2e2531201cfbf853f16f668132eaf2 (01:52): You can solve that problem by beating up everyone who is wrong",
        "f139aba52f9fa1394b4034a7954b2220 (01:52): that's only a problem if you consider everyone's opinion but your own to be equally valid",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:52): Fortunately, we can migrate among VCS systems later as needed (if people directly involved in the work decide they want to)",
        "b07211a0c7cb119232799d2119cea90f (01:52): well, from my experience running an open-source game, I would say that the VCS choice is not all that big a deal these days",
        "b07211a0c7cb119232799d2119cea90f (01:53): people who want to contribute to things will go to reasonable effort to do so",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:53): right",
        "b07211a0c7cb119232799d2119cea90f (01:54): and there is definitely at least one DVCS which is easily obtainable on all of {Windows, OS X, Unix}",
        "3f2e2531201cfbf853f16f668132eaf2 (01:54): 's experience from a not-quite-open-source game is that it is a big deal, because the artists have learnt how to use TortoiseSVN and won't understand anything else :-)",
        "b07211a0c7cb119232799d2119cea90f (01:55): heh",
        "b07211a0c7cb119232799d2119cea90f (01:55): there's TortoiseDarcs and TortoiseGit and TortoiseTheMoonOnAStick these days",
        "3f2e2531201cfbf853f16f668132eaf2 (01:56): Are they anything like TortoiseCVS/TortoiseSVN, or are they just random GUIs with &quot;Tortoise&quot; stuck in front of their names?",
        "b07211a0c7cb119232799d2119cea90f (01:56): yeah, branched from the same code",
        "b07211a0c7cb119232799d2119cea90f (01:56): so essentially the same interface",
        "3f2e2531201cfbf853f16f668132eaf2 (01:56): Ah, right",
        "3f2e2531201cfbf853f16f668132eaf2 (01:56): Do they still have a nice simple right click -&gt; &quot;update&quot;, right click -&gt; &quot;commit&quot; model?",
        "b07211a0c7cb119232799d2119cea90f (01:56): yeah",
        "3f2e2531201cfbf853f16f668132eaf2 (01:57): rather than the crazy checkout/pull/update/clone/branch/whatever model that the command-line tools tend to favour",
        "b07211a0c7cb119232799d2119cea90f (01:58): also, we're dealing with people who are competent enough to write browser tests",
        "3f2e2531201cfbf853f16f668132eaf2 (01:59): (I think DVCS wouldn't work on my game anyway because there's 5GB of stuff in the repository and nobody is going to want to have a clone of it all :-( )",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:12): b07211a0c7cb119232799d2119cea90f: you make a good point -- it's hard imagine that somebody competent enough to write a browser test that will pass review will not be competent enough able to install and learn whatever VCS client they need",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:13): which reminds me: the other thing you'd need to decide on is how to handle review",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:14): I think we had been discussing before that ideally nothing should get checked in unless it had been reviewed first",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:14): http://dev.w3.org/html5/tests/readme.txt",
        "b07211a0c7cb119232799d2119cea90f (02:34): yeah, wfm"
    ],
    "person_ids": [
        "3f2e2531201cfbf853f16f668132eaf2",
        "f47636673b14c54021a69dc06f6a19fb",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0",
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "1adba86c435b5fe0f7ea043370b1636b",
        "a924fb58d2c25874322f4e5126f608b9",
        "b07211a0c7cb119232799d2119cea90f",
        "0a39f78bcb297ab0ebe8a29c28bfed89",
        "f139aba52f9fa1394b4034a7954b2220"
    ]
}