{
    "id": "6223f52ec6286299fcc29d83e8e86105",
    "messages": [
        "65325d50b2e25aca54bc871b89758c9c (12:37): http://www.programimi.com/2007/09/14/55-reasons-to-design-in-xhtml-css/",
        "55c91f724bbdbdcd4c8ef11d65ef64f7 (12:42): 'lo",
        "55c91f724bbdbdcd4c8ef11d65ef64f7 (12:43): henry in regards to your e-mail to the list have you looked at SMIL - http://www.w3.org/TR/REC-smil/",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:44): 55c91f724bbdbdcd4c8ef11d65ef64f7: SMIL would add a huge layer of complexity compared to using the simpler features of video formats themselves",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:45): 55c91f724bbdbdcd4c8ef11d65ef64f7: also, as far as closed captioning goes, it would break stuff across files instead of making captions always travel with the video",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:48): 55c91f724bbdbdcd4c8ef11d65ef64f7: the latest SMIL is much larger: http://www.w3.org/TR/SMIL/",
        "55c91f724bbdbdcd4c8ef11d65ef64f7 (12:51): cool - if it's been considered then that's fine.  Nothing you've suggested as far as I can see would stop anyone who wants to also providing SMIL for their videos and by providing a halfway house route to improving accessibility that is easier to attain it can only improve matters",
        "f139aba52f9fa1394b4034a7954b2220 (12:56): b8810fee2f4a71f849f3f7409546d1d9, did you mean to say &quot;The spec already says that the fallback is not for old browsers.&quot;?  did you mean s/is not/is/ ?",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:57): f139aba52f9fa1394b4034a7954b2220: oops",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:58): this is what happens when I edit a sentence instead of writing it from start to finish in one go. :-(",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:02): it is hard to proof-read one's own text",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:02): when you already know what it is supposed to say and think it says that",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:04): hmm. a phpbb exploit scanner is scanning validator.nu",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:04): I guess that means phpbb is popular enough for such scan to be worthwhile",
        "f139aba52f9fa1394b4034a7954b2220 (13:07): which forum software is forums.whatwg.org running? I wonder if it's been kept up to date.",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:08): f139aba52f9fa1394b4034a7954b2220: phpbb I think",
        "0da07476c4bd14079ce4032a6f280e17 (13:09): has any thought gone in to providing external captioning files?",
        "0da07476c4bd14079ce4032a6f280e17 (13:10): so that captioning is made independent of the video stream itself",
        "f139aba52f9fa1394b4034a7954b2220 (13:10): there are external caption file formats",
        "0da07476c4bd14079ce4032a6f280e17 (13:10): f139aba52f9fa1394b4034a7954b2220: I seem to remember markp blogging about this",
        "f139aba52f9fa1394b4034a7954b2220 (13:10): it may be useful to provide a way to link to them from the HTML",
        "0da07476c4bd14079ce4032a6f280e17 (13:11): http://diveintomark.org/archives/2007/06/26/piracy-lessons",
        "f139aba52f9fa1394b4034a7954b2220 (13:12): this is one such format http://en.wikipedia.org/wiki/SubRip",
        "f139aba52f9fa1394b4034a7954b2220 (13:12): oops, wrong link",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:13): 0da07476c4bd14079ce4032a6f280e17: I guess the crucial question is: will external files be better for users than muxed captions?",
        "0da07476c4bd14079ce4032a6f280e17 (13:14): b8810fee2f4a71f849f3f7409546d1d9: potentially, since you can probably make use of browser settings to get subtitles and captioning based on what language the UA is set to prefer",
        "0da07476c4bd14079ce4032a6f280e17 (13:14): and it makes the subtitling separate from the data stream itself",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:14): 0da07476c4bd14079ce4032a6f280e17: do you mean content negotiation on the HTTP level?",
        "0da07476c4bd14079ce4032a6f280e17 (13:14): b8810fee2f4a71f849f3f7409546d1d9: yes",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:14): has severe doubts about conneg",
        "f139aba52f9fa1394b4034a7954b2220 (13:15): oh, that is the right link (the first paragraph of that wikipedia page is confusing)",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:15): conneg doesn't tell you what else was available",
        "0da07476c4bd14079ce4032a6f280e17 (13:15): b8810fee2f4a71f849f3f7409546d1d9: I have doubts as well, but there are other ways around this, using scripting",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:15): and conneg-based approaches assume that the site developer is able and competent to configure the HTTP layer",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:18): anyway, I'd expect a dedicated external timed text format to have better chances of implementation than SMIL",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:20): &quot;Unfortunately there is no exact specification of the .SRT file format.&quot; -- Wikipedia",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:20): is &quot;Unfortunately&quot; NPOV? :-)",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:23): still about conneg:",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:24): 0da07476c4bd14079ce4032a6f280e17: with captioning for accessibility, the captions are expected to be in the same language as the soundtrack",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:24): 0da07476c4bd14079ce4032a6f280e17: when you start doing translations as subtitles, it isn't accessibility anymore",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:24): 0da07476c4bd14079ce4032a6f280e17: and for subtitles, automating the choice becomes much more difficult",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:25): 0da07476c4bd14079ce4032a6f280e17: with captions, if one is deaf, a permanent &quot;Enable closed captions&quot; pref makes sense",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:25): 0da07476c4bd14079ce4032a6f280e17: with subtitles, the choice of subtitles depends not only on the language of the subtitles but also on the language of the audio content",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:27): my personal subtitle preferences are complex enough that I wouldn't think it'd be reasonable for UAs to model them and try to relieve me of choosing manually",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:30): oh, btw, if one applies the Design Principles, one could argue that translations as subtitles as well as alternative language sound tracks are out of scope",
        "f139aba52f9fa1394b4034a7954b2220 (13:40): I've been asked to write an article for a popular online magazine, called &quot;Developing with HTML5&quot; (somewhat based on the presentation I did in August)...",
        "f139aba52f9fa1394b4034a7954b2220 (13:40): I'm trying to decide which topics to discuss.",
        "f139aba52f9fa1394b4034a7954b2220 (13:41): So far, I've written about choosing HTML or XHTML and using both together, and about the sectioning elements and heading algorithm",
        "f139aba52f9fa1394b4034a7954b2220 (13:41): I want to include one more topic and would like some feedback about what to choose:",
        "f139aba52f9fa1394b4034a7954b2220 (13:42): 1. new semantics: time/meter/progress",
        "f139aba52f9fa1394b4034a7954b2220 (13:42): 2. Embedded content and multimedia (video, audio and canvas)",
        "f139aba52f9fa1394b4034a7954b2220 (13:42): 3. Form controls",
        "f139aba52f9fa1394b4034a7954b2220 (13:42): any preferences?",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:43): f139aba52f9fa1394b4034a7954b2220: does the title imply developing today? or is it about developing in the future?",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:45): f139aba52f9fa1394b4034a7954b2220: form controls and video are perhaps the most interesting things to your audience",
        "f139aba52f9fa1394b4034a7954b2220 (13:45): a little of both. I'd prefer to avoid things that won't be available for a long time, such as &lt;datagrid&gt;, but also want to give some insight into the future",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:45): f139aba52f9fa1394b4034a7954b2220: you could use &lt;progress&gt; as an example of built-in accessibility semantics",
        "f139aba52f9fa1394b4034a7954b2220 (13:46): yeah, same with time and meter",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:46): f139aba52f9fa1394b4034a7954b2220: also, the good thing about form controls and video is that they seem to be getting attention from browser vendors and might even get deployed sooner than later",
        "f139aba52f9fa1394b4034a7954b2220 (13:47): I could do video and audio.  There's already so much about canvas and it's already widely deployed",
        "cc097e0d7183ae8436e7df709553c8c0 (13:47): f139aba52f9fa1394b4034a7954b2220: will you only cover front-end development?",
        "f139aba52f9fa1394b4034a7954b2220 (13:47): (I'm also not an expert on canvas, so I'm probably not the best person to write about it)",
        "f139aba52f9fa1394b4034a7954b2220 (13:48): mostly front end, but the HTML/XHTML bit talks about using XHTML on the back end and serialsing as HTML",
        "cc097e0d7183ae8436e7df709553c8c0 (13:48): ok",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:48): f139aba52f9fa1394b4034a7954b2220: of the HTML5 features that weren't in HTML 4.01, canvas probably has the best market penetration",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:49): f139aba52f9fa1394b4034a7954b2220: to the point that it doesn't feel like a future feature anymore",
        "f139aba52f9fa1394b4034a7954b2220 (13:49): yeah, that's basically what I meant by what I said above",
        "f139aba52f9fa1394b4034a7954b2220 (13:50): I suppose further discussion of forms should really wait till the we get results from the Forms TF",
        "f139aba52f9fa1394b4034a7954b2220 (13:52): alright, I'll do video and audio",
        "f139aba52f9fa1394b4034a7954b2220 (13:58): if I do video, I should probably create a demo page with a sample video.",
        "f139aba52f9fa1394b4034a7954b2220 (13:58): I wonder if I should create a new one or just reuse one of my existing videos http://lachy.id.au/lib/media/2007/",
        "0da07476c4bd14079ce4032a6f280e17 (14:04): hixie's site is down?",
        "f139aba52f9fa1394b4034a7954b2220 (14:04): 0da07476c4bd14079ce4032a6f280e17, yes",
        "f139aba52f9fa1394b4034a7954b2220 (14:05): sometimes.  It's having the same problems as the whatwg blog, wiki and forum",
        "f139aba52f9fa1394b4034a7954b2220 (14:05): (they're all on the same server)",
        "0da07476c4bd14079ce4032a6f280e17 (14:07): Hm. And the server is not crumbling under the weight of the traffic?",
        "65325d50b2e25aca54bc871b89758c9c (14:23): b8810fee2f4a71f849f3f7409546d1d9: Apple has a proposal for how to have multiple media sources w/ different accessibility features, that integrates with CSS media queries",
        "65325d50b2e25aca54bc871b89758c9c (14:23): (since other likely reasons for choosing one of several videos include screen size and bandwidth)",
        "65325d50b2e25aca54bc871b89758c9c (14:24): b8810fee2f4a71f849f3f7409546d1d9: I need to get that sent out",
        "65325d50b2e25aca54bc871b89758c9c (14:25): b8810fee2f4a71f849f3f7409546d1d9: this will make it possible to either use a video with a separate caption track, or if preferable a whole separate video with burned-in captions",
        "65325d50b2e25aca54bc871b89758c9c (14:25): and so forth",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:30): 65325d50b2e25aca54bc871b89758c9c: cool."
    ],
    "person_ids": [
        "65325d50b2e25aca54bc871b89758c9c",
        "55c91f724bbdbdcd4c8ef11d65ef64f7",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "f139aba52f9fa1394b4034a7954b2220",
        "0da07476c4bd14079ce4032a6f280e17",
        "cc097e0d7183ae8436e7df709553c8c0"
    ]
}