{
    "id": "63ff8c63320e81ff87d6b2b728ec0a15",
    "messages": [
        "88d4d34a8064a4ff39fd5e144eea7762 (23:30): &quot;When the user views a 'my accounts' page in his browser, she sees what information the site is storing about her.&quot;  https://wiki.mozilla.org/Labs/Weave/Identity/Account_Manager/Spec/Latest",
        "88d4d34a8064a4ff39fd5e144eea7762 (23:30): That's gender-neutrality taken to an extreme, there.",
        "1f8387eb43f131d7c309a90a4e36b5cb (23:39): People just need to accept that singular &quot;they&quot; is valid.  Freaking *Shakespeare* used it.",
        "88d4d34a8064a4ff39fd5e144eea7762 (23:44): So does the Bible.",
        "88d4d34a8064a4ff39fd5e144eea7762 (23:44): Which has the even worse problem that all nouns, adjectives, and verbs are gendered, let alone pronouns.  (At least the Hebrew and Aramaic parts.)",
        "88d4d34a8064a4ff39fd5e144eea7762 (23:45): It's hopeless to even think about trying &quot;he or she&quot;-type constructions in that setting.",
        "1f8387eb43f131d7c309a90a4e36b5cb (23:45): Wait, are you talking about the bible in hebrew, or in one of the english translations?",
        "88d4d34a8064a4ff39fd5e144eea7762 (23:45): Well, in Hebrew, but I assume the translations follow suit.",
        "88d4d34a8064a4ff39fd5e144eea7762 (23:45): Let me see.",
        "88d4d34a8064a4ff39fd5e144eea7762 (23:48): Deuteronomy 17:5: &quot;Then shalt thou bring forth that man or that woman, which have committed that wicked thing, unto thy gates, even that man or that woman, and shalt stone them with stones, till they die.&quot;",
        "88d4d34a8064a4ff39fd5e144eea7762 (23:49): That's KJV.  NIV paraphrases, as usual.",
        "88d4d34a8064a4ff39fd5e144eea7762 (23:49): I avoid NIV like the plague for that reason (when I'm using a Christian translation for whatever reason).",
        "88d4d34a8064a4ff39fd5e144eea7762 (23:49): Nice and readable, because they translate it to mean whatever they happen to think it should mean.",
        "88d4d34a8064a4ff39fd5e144eea7762 (23:50): Some really egregious cases there.  Of course, the same is somewhat true for any translation, but NIV is way worse than more word-for-word translations like KJV in that regard.",
        "88d4d34a8064a4ff39fd5e144eea7762 (23:56): . . . I'm really curious to know if people have examples of real-world (malicious, not proof-of-concept) MITM attacks on the web.",
        "88d4d34a8064a4ff39fd5e144eea7762 (23:57): Maybe they've been averted by the fact that even incompetent banks/e-commerce sites/whatever tend to use HTTPS.",
        "88d4d34a8064a4ff39fd5e144eea7762 (23:57): So they get the little padlock, or to comply with some industry certification or law or something, I don't know.",
        "1f8387eb43f131d7c309a90a4e36b5cb (23:57): I think that basically *everyone* uses https who needs it.",
        "1f8387eb43f131d7c309a90a4e36b5cb (23:57): Pretty sure it's law, in the case of banks and similar.",
        "1f8387eb43f131d7c309a90a4e36b5cb (23:59): So it might be hard to find actual examples, simply because the ecosystem is so defensive against it in the first place.",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:02): We do have federal wiretapping in the US.  That's passive MITM as far as we know, no changes being done to the stream, but it's a definite example of the scenario.",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:03): And in terms of personal attacks, Hixie commits MITM attacks against people using his network on occasion.  Just when they're abusing it, and nothing bad, but again, that's an attack scenario.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:03): I guess.",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:03): Anyone using a wifi connection they don't own is subject to the owner doing things like that.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:04): Also: http://www.ex-parrot.com/pete/upside-down-ternet.html",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:04): Yeah, very similar.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:04): None of this is malicious, though, or something web developers have to worry about in practice.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:04): Most web developers, I mean.",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:04): Authoritarian governments doing wiretapping is something that a web author interested in privacy has to worry about.",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:05): That's not the average author, but still.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:05): Well, you can't do anything in that case.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:05): Because one, they can probably forge an SSL certificate.",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:05): Okay, true.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:05): As long as they have at least one root CA in their country.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:05): And two, they can still tell what IP address you're connecting to, so unless it's a big shared host or you're using something else like TOR, they can still tell where you're going.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:06): Which is enough for them to jail you already, if they felt like it.",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:06): Yeah, but that's a separate security issue entirely.",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:06): Encryption can't help with that at all.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:06): No, you need some form of indirection as well.  It's still a MITM attack, though.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:07): And worth pointing out.  If you're trying to hide your activities from the government, and they can get enough info to arrest you or search your computer anyway, then the technology isn't helping.",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:07): What, peeping your IP?  Not necessarily.  Everyone in the chain knows your IP.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:07): Well, yes.  Everyone in the chain (if by that you mean the path between client and server) is a MITM.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:07): If they bother.",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:08): Okay, yeah, you're right.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:08): Anyway, against repressive governments you've pretty much lost from the start.  You need social solutions to that, not technical.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:08): I mean, even if you used TOR, they could throw you in jail or ransack your house or whatever just for that.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:09): Modern, well-organized governments are essentially invincible to any kind of internal revolt, other than a military coup.",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:09): True.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:10): I guess you can pressure them in some ways, but technology isn't going to much help you to hide from them.  It does help make it harder for them to control information, though.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:10): . . . anyway.  Whatever the case may be, any security scenario where you're trying to defend against a government or comparably powerful organization needs to be treated as an entirely separate category.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:11): It shouldn't even be brought up in general, if it's just a general web security discussion.",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:11): So we're back to (a) open wifi means that the owner can snoop and alter your traffic easily and (b) anyone in the normal chain of routers between you and the target can do the same.",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:12): But right now, SSL's security against MITM and general ubiquity in cases where MITM would be a profitable exploit means that actual example of MITM are necessarily going to be few and far between.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:12): Yep.  I'd still like to see one real-world (malicious, non-government) case, though.  :)",
        "1f8387eb43f131d7c309a90a4e36b5cb (00:12): I'd have to poke around, and I don't feel like doing that.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:14): &quot;Every so often I receive extremely irate e-mails from people claiming that my Kittenwar site is playing host to some kind of nefarious virus preventing them from accessing the web, accusing me of practising all sorts of dark arts - to which I politely respond that I'm terribly sorry, but this only usually happens to people who are using someone else's wireless connection, and pointing them in the direction of your site. This has happened doz",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:14): ens of times over the last few years, and you know what? None of them have ever got back to me after I point this out.&quot;",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:14): Hahaha."
    ],
    "person_ids": [
        "88d4d34a8064a4ff39fd5e144eea7762",
        "1f8387eb43f131d7c309a90a4e36b5cb"
    ]
}