{
    "id": "651e7d619f1e11aa217b1def2497c005",
    "messages": [
        "cc097e0d7183ae8436e7df709553c8c0 (14:13): 65325d50b2e25aca54bc871b89758c9c: http://software.hixie.ch/utilities/js/live-dom-viewer/?%3Chtml%20test%3Da%3E%3Cscript%3Edocument.documentElement.setAttributeNS(''%2C'test'%2C'b')%3C%2Fscript%3E",
        "cc097e0d7183ae8436e7df709553c8c0 (14:13): 65325d50b2e25aca54bc871b89758c9c: results in duplicate attributes in webkit",
        "cc097e0d7183ae8436e7df709553c8c0 (14:15): for some reason i thought the dom didn't check for duplicate attributes with different prefixes",
        "fe70b49783daa65bcb249805fb3a2b24 (14:17): cc097e0d7183ae8436e7df709553c8c0: if you make the namespace parameter null it works, so the bug seems to be treating empty string and null differently",
        "65325d50b2e25aca54bc871b89758c9c (14:17): &quot;works&quot; == adds the attribute only once",
        "ab7faae5d7b250ea8606486575f8f79c (14:26): Hmm, I have a site which uses TinyMCE so non-technical users can edit bits of content, and I've been asked to remove the part of the TinyMCE image upload dialog that asks for alt text because it's too confusing for users",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:28): argh. my token name list is lacking the ruby stuff",
        "fefe4c60d912e295e59fd874577ca7f9 (14:29): ab7faae5d7b250ea8606486575f8f79c: is that merely an interface issue, or is the concept of alt text causing the confusion?",
        "ab7faae5d7b250ea8606486575f8f79c (14:30): fefe4c60d912e295e59fd874577ca7f9: I'm not quite sure what the distinction is - do you mean could the problem be fixed by changing the UI to still ask for alt text but in a different way (as opposed to fixing the interface to simply not ask for it at all)?",
        "fefe4c60d912e295e59fd874577ca7f9 (14:31): that's the distinction I'm interested in, yes",
        "cc097e0d7183ae8436e7df709553c8c0 (14:33): ab7faae5d7b250ea8606486575f8f79c: perhaps there should be a button &quot;No images view&quot; which replaces all images with editable boxes",
        "ab7faae5d7b250ea8606486575f8f79c (14:33): I can't think of any way the UI could ask for alt text without having to explain to users the concepts like the purpose of it and why they should bother, and I can't think of any way to explain that without confusing or scaring the users who are just wanting to stick an image in there",
        "cc097e0d7183ae8436e7df709553c8c0 (14:33): with an explanation that search engines and blind people will see that text instead of the images",
        "ab7faae5d7b250ea8606486575f8f79c (14:34): cc097e0d7183ae8436e7df709553c8c0: That sounds too hard to implement - I can cope with changing dialog boxes, but I don't want to fiddle with the TinyMCE code in any non-trivial way",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:34): ab7faae5d7b250ea8606486575f8f79c: I think a big problem with the whole alt debate is wanting to build tool UI for it but not wanting to explain to users what it is about",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:35): which is why the V.nu Image Report actually mentions accessibility in the UI text",
        "cc097e0d7183ae8436e7df709553c8c0 (14:35): ab7faae5d7b250ea8606486575f8f79c: but i think it would be better UI than dialog boxes",
        "ab7faae5d7b250ea8606486575f8f79c (14:36): (In this case, it's unlikely that many people will ever view the content that was created, and the creators usually won't care about search engines or blind people - they just get the satisfaction of making their own text appear on the site)",
        "cc097e0d7183ae8436e7df709553c8c0 (14:37): if they don't care then forcing them will produce bad alt text anyway",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:37): argh. the SVG stuff requires storing both the lowercase name and the case-corrected name on the stack",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:37): bad",
        "ab7faae5d7b250ea8606486575f8f79c (14:37): cc097e0d7183ae8436e7df709553c8c0: My definition of &quot;better&quot; includes &quot;possible to implement without excessive effort&quot; :-)",
        "ab7faae5d7b250ea8606486575f8f79c (14:37): b8810fee2f4a71f849f3f7409546d1d9: Can you store just the case-corrected name and use case-insensitive comparison operators in appropriate places?",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:37): ab7faae5d7b250ea8606486575f8f79c: that would kill perf",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:38): ab7faae5d7b250ea8606486575f8f79c: actual tree builders won't need to keep the case-corrected string around, but to implement streaming SAX, it has to stay around",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:39): so another round of changing interfaces it is...",
        "a9b326df4e6da61c5b6f5e1058be83a2 (14:39): b8810fee2f4a71f849f3f7409546d1d9: while recognizing the general principle of trying to avoid additional options/pragmas whenever possible, I continue to think a pretty effective UI for the specific alt case (and perhaps only the alt case) would be an option saying, &quot;Don't show me error messages about missing alt attributes.&quot;",
        "cc097e0d7183ae8436e7df709553c8c0 (14:39): b8810fee2f4a71f849f3f7409546d1d9: would making the tokenizer case-preserving and having the parser do case-insensitive checks kill perf?",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:40): cc097e0d7183ae8436e7df709553c8c0: I'm not sure",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:40): cc097e0d7183ae8436e7df709553c8c0: probably not if the tree builder dispatches on magic enums instead of strings",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:41): currently, mine dispatches on interned string identity",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:41): but I want to change it to use magic numbers instead",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:41): I'm just unsure if today is the right time to do it",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:41): that is, will Hixie change stuff in a way that requires me to reassign the magic numbers",
        "cc097e0d7183ae8436e7df709553c8c0 (14:42): probably :P",
        "ab7faae5d7b250ea8606486575f8f79c (14:46): That sounds like a sensible answer whenever the question is &quot;will Hixie cause pain to an implementor like me&quot;",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:47): that is, are there elements that are safe to coalesce into one enum value?",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:48): td and th seem to always go together",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:48): and thead, tbody and tfoot",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:48): but are those all?",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:48): oh and h1-h6",
        "ab7faae5d7b250ea8606486575f8f79c (14:48): What about things like b and i?",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:49): now I have to run some regexps on my code to find out",
        "ab7faae5d7b250ea8606486575f8f79c (14:49): Or: If you coalesce h1-h6, how do you handle &lt;h1&gt;foo&lt;/h6&gt; ?",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:49): ab7faae5d7b250ea8606486575f8f79c: I'm thinking about coalescing what the spec always has under one case",
        "ab7faae5d7b250ea8606486575f8f79c (14:50): Ah",
        "ab7faae5d7b250ea8606486575f8f79c (14:50): could probably derive that automatically from his OCamlified version of the spec, except it's old and incomplete and currently broken :-(",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:51): I could derive it almost automatically if I hadn't forgotten Perl as much as I have :-(",
        "ab7faae5d7b250ea8606486575f8f79c (14:52): TIMTOWTDI, so if you forget several ways then there's usually still another way to solve any problem with Perl",
        "a924fb58d2c25874322f4e5126f608b9 (14:55): ab7faae5d7b250ea8606486575f8f79c: And then you have two problems.",
        "ab7faae5d7b250ea8606486575f8f79c (14:57): a924fb58d2c25874322f4e5126f608b9: That's what one-liners are for - once you've solved your original problem using Perl, you just discard the Perl into the murky depths of your .bash_history and it's no longer a problem",
        "f139aba52f9fa1394b4034a7954b2220 (14:58): LOL, it's funny when comment spammers try to post on-topic comments to the whatwg blog, yet fail miserably :-)",
        "f139aba52f9fa1394b4034a7954b2220 (14:58): this is in the moderation queue for the Vim article. &quot;Your article is very interesting, Checking means verify the file. Thank you for giving this information.&quot;",
        "ab7faae5d7b250ea8606486575f8f79c (15:01): Blogs should just not accept URLs in comments at all",
        "a924fb58d2c25874322f4e5126f608b9 (15:01): It's too bad spam bot authors have no sense of humor, or they could use &quot;Your ideas are intriguing and I wish to subscribe to your newsletter.&quot;",
        "ab7faae5d7b250ea8606486575f8f79c (15:01): (including not having an explicit &quot;website&quot; field for commenters)",
        "cc097e0d7183ae8436e7df709553c8c0 (15:06): ab7faae5d7b250ea8606486575f8f79c: then spammers will just write plain text URLs",
        "cc097e0d7183ae8436e7df709553c8c0 (15:07): ab7faae5d7b250ea8606486575f8f79c: and people who actually want to link to relevant things it will just be annoying to deal with plain text URLs",
        "a924fb58d2c25874322f4e5126f608b9 (15:07): We'll avoid the whole target/window.open spectacle, though :)",
        "cc097e0d7183ae8436e7df709553c8c0 (15:20): what Julian Reschke suggests for xhr seems to go against the priority of constituencies principle",
        "cc097e0d7183ae8436e7df709553c8c0 (15:21): http://www.w3.org/mid/<email/>",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:21): sigh",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:28): Hixie: any particular reason why pre and listing don't go together when breaking out of foreign lands?",
        "cc097e0d7183ae8436e7df709553c8c0 (15:29): b8810fee2f4a71f849f3f7409546d1d9: because pre is common and listing is not?",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:29): yeah. I'm going to send email",
        "f139aba52f9fa1394b4034a7954b2220 (15:31): ab7faae5d7b250ea8606486575f8f79c, URLs and email addresses provide a convenient mechanism for giving automatic approval or rejection of repeat commenters, based on their prior comment history",
        "f139aba52f9fa1394b4034a7954b2220 (15:31): it also allows commenters to be reliably identified and help them become known if they're seen to consistently write good comments",
        "ab7faae5d7b250ea8606486575f8f79c (15:32): f139aba52f9fa1394b4034a7954b2220: But I could trivially write a comment and use someone else's email address and URL",
        "f139aba52f9fa1394b4034a7954b2220 (15:32): surprisingly, few spammers actually seem to do that",
        "ab7faae5d7b250ea8606486575f8f79c (15:32): so &quot;reliably identified&quot; seems untrue",
        "f139aba52f9fa1394b4034a7954b2220 (15:33): although there are times where trolls will falsely post as someone else, it doesn't happen frequently enough to be of great concern",
        "f139aba52f9fa1394b4034a7954b2220 (15:33): I only know it to have happened once to me in all my years of reading and posting comments on blogs",
        "cc097e0d7183ae8436e7df709553c8c0 (15:34): readers should be able to report bad comments",
        "cc097e0d7183ae8436e7df709553c8c0 (15:34): i think that results in less overhead to deal with comments",
        "ab7faae5d7b250ea8606486575f8f79c (15:34): Then spammers will start spamming the 'report bad comment' feature",
        "f139aba52f9fa1394b4034a7954b2220 (15:35): rating systems like that are used on slashdot, youtube, digg, etc.",
        "f139aba52f9fa1394b4034a7954b2220 (15:35): They're not entirely successful",
        "ab7faae5d7b250ea8606486575f8f79c (15:35): Some much less successful than others",
        "cc097e0d7183ae8436e7df709553c8c0 (15:35): ok",
        "ab7faae5d7b250ea8606486575f8f79c (15:35): (The quality of comments on Slashdot does seem somewhat higher than on Youtube)",
        "f139aba52f9fa1394b4034a7954b2220 (15:36): I'm surprised slashdot has done little to actually filter out the goatse spam.",
        "f139aba52f9fa1394b4034a7954b2220 (15:36): ab7faae5d7b250ea8606486575f8f79c, that's because the intelligence of slashdot readers is probably, on average, greater than that of your average youtube user",
        "ab7faae5d7b250ea8606486575f8f79c (15:38): f139aba52f9fa1394b4034a7954b2220: It seems to have pretty much died out by itself, just by being modded to -1 all the time so normal users will never see it",
        "f139aba52f9fa1394b4034a7954b2220 (15:39): I always have all comments shown. I don't like comments being automatically hidden, since it messes up threading and makes me wonder what I'm missing out on",
        "ab7faae5d7b250ea8606486575f8f79c (15:40): You're missing out on the goatse spam :-p",
        "f139aba52f9fa1394b4034a7954b2220 (15:40): sometimes the troll comments are funny",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:46): identified 52 magic enum items for the tree builder",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:46): of which 14 group more than one element name",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:54): implementing SVG for demonstration purposes?",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:54): edb259c0e0038f38bb200bc20c8cbf7e: I'm preparing to",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:55): edb259c0e0038f38bb200bc20c8cbf7e: I'm doing architectural changes that make the SVG case tweaking stuff not suck quite that badly for perf",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:00): Internet at home is broken :(",
        "ab7faae5d7b250ea8606486575f8f79c (16:01): Try your neighbours' internets",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:02): All require passwords (in terms of wireless, at least)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:02): is in caf?© in town",
        "ab7faae5d7b250ea8606486575f8f79c (16:03): They might be using WEP, which doesn't really count as a password ;-)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:03): :)",
        "f139aba52f9fa1394b4034a7954b2220 (16:03): a11aabeeceeae6b8cb5d12ea06b56554, most people use very simple passwords. It shouldn't be too hard to guess, or even crack",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:03): f139aba52f9fa1394b4034a7954b2220: too much effort :(",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:04): it makes no sense, because I get to SHOWTIME, before it fails to get any further.",
        "f139aba52f9fa1394b4034a7954b2220 (16:04): is it less effort to walk to the cafe, than it is to take 5 minutes to crack a password?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:04): And BT being typically BT are refusing to do anything about it and are blaming us.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:04): f139aba52f9fa1394b4034a7954b2220: It means trying to crack the password. :P",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:05): f139aba52f9fa1394b4034a7954b2220: and it's only 50m away from school",
        "ab7faae5d7b250ea8606486575f8f79c (16:06): A couple of wireless routers around my house are unsecured and have login/password &quot;admin&quot;/&quot;admin&quot;"
    ],
    "person_ids": [
        "cc097e0d7183ae8436e7df709553c8c0",
        "fe70b49783daa65bcb249805fb3a2b24",
        "65325d50b2e25aca54bc871b89758c9c",
        "ab7faae5d7b250ea8606486575f8f79c",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "fefe4c60d912e295e59fd874577ca7f9",
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "a924fb58d2c25874322f4e5126f608b9",
        "f139aba52f9fa1394b4034a7954b2220",
        "edb259c0e0038f38bb200bc20c8cbf7e",
        "a11aabeeceeae6b8cb5d12ea06b56554"
    ]
}