{
    "id": "6593493c1aaca74a3af4159bb590b7ab",
    "messages": [
        "f139aba52f9fa1394b4034a7954b2220 (11:34): I just don't understand how some people can blatantly ignore evidence and make bogus claims about XHTML2's compatibility",
        "b65a1668d3f56352ebf6e4735afeb424 (11:34): I think it's a matter of having different criteria for compatibility",
        "f139aba52f9fa1394b4034a7954b2220 (11:36): the major criteria is whether or not a) legacy markup will still work in future UAs, and b) future markup will degrade gracefully in legacy UAs",
        "f139aba52f9fa1394b4034a7954b2220 (11:36): XHTML2 doesn't fit either of those",
        "b65a1668d3f56352ebf6e4735afeb424 (11:36): that's your major criteria, sure",
        "f139aba52f9fa1394b4034a7954b2220 (11:36): what else is there?",
        "b65a1668d3f56352ebf6e4735afeb424 (11:38): well, Rob Burns seems very concerned with the semantics of the elements and attributes... to him, that's pretty important... I thought he'd made that clear",
        "b65a1668d3f56352ebf6e4735afeb424 (11:38): I'm not too concerned either way, myself",
        "b65a1668d3f56352ebf6e4735afeb424 (11:39): I have lots of opinions on it, but none of them have resolved to a single path",
        "f139aba52f9fa1394b4034a7954b2220 (11:39): yeah, but I haven't seen him describe any specific semantic incompatibilities (though, perhaps I missed it if he did)",
        "b65a1668d3f56352ebf6e4735afeb424 (11:42): anyway, this isn't actually a technical issue, but a political one",
        "139513027e8e90b5582cbc68fc733884 (11:42): f139aba52f9fa1394b4034a7954b2220: Robert Burns has pretty clearly announced that he has different criteria for what constitutes &quot;namespace integrity&quot;",
        "b65a1668d3f56352ebf6e4735afeb424 (11:42): both groups want control of the XHTML &quot;brand&quot;",
        "139513027e8e90b5582cbc68fc733884 (11:42): or whatever",
        "139513027e8e90b5582cbc68fc733884 (11:42): I actually don't care about the brand, but the namespace URI is not negotiable",
        "139513027e8e90b5582cbc68fc733884 (11:43): (the one that HTML5 will use, that is; don't really care what XHTML2 does)",
        "b65a1668d3f56352ebf6e4735afeb424 (11:43): well, you've actually argued about the name (the brand) before",
        "139513027e8e90b5582cbc68fc733884 (11:43): I also don't think we have any reason to try to be compatible with XHTML2",
        "b65a1668d3f56352ebf6e4735afeb424 (11:44): again, it's my opinion that this isn't a technical argument per se",
        "139513027e8e90b5582cbc68fc733884 (11:44): the namespace URI argument has technical impact",
        "b65a1668d3f56352ebf6e4735afeb424 (11:44): even if it's being fought with technical terms",
        "b65a1668d3f56352ebf6e4735afeb424 (11:44): yeah, but not as clear-cut as all that",
        "f139aba52f9fa1394b4034a7954b2220 (11:44): b65a1668d3f56352ebf6e4735afeb424: the namespace issue is entirely technical",
        "f139aba52f9fa1394b4034a7954b2220 (11:45): the branding issue is more political",
        "b65a1668d3f56352ebf6e4735afeb424 (11:45): I think it's part and parcel",
        "f139aba52f9fa1394b4034a7954b2220 (11:45): in what way is the namespace issue political?",
        "b65a1668d3f56352ebf6e4735afeb424 (11:45): the technical aspect of the ns issue is just a battle in the war of the brand, as far as I can see",
        "139513027e8e90b5582cbc68fc733884 (11:46): it's pretty clear-cut to me, HTML5 has to use the XHTML1 namespace to support existing XHTML1 content, which is a goal",
        "139513027e8e90b5582cbc68fc733884 (11:46): on the XHTML2 side it is political and as far as I can tell dishonest",
        "139513027e8e90b5582cbc68fc733884 (11:46): the idea that the XHTML2 spec has a different namespace but that's just a placeholder smells of revisionist history",
        "b65a1668d3f56352ebf6e4735afeb424 (11:47): I think the same change could be leveled at both sides",
        "b65a1668d3f56352ebf6e4735afeb424 (11:47): which is why I'm getting increasingly bored with it",
        "f139aba52f9fa1394b4034a7954b2220 (11:47): yeah, the XHTML2 side hasen't put forth any technical argument for having the XHTML1 namespace, and have only been ignorant/dismissive of the technical arguments from the HTML5 side",
        "b65a1668d3f56352ebf6e4735afeb424 (11:48): including the feigned outrage",
        "139513027e8e90b5582cbc68fc733884 (11:48): yeah, that's almost as much fun as being ostentatiously above-it-all",
        "b65a1668d3f56352ebf6e4735afeb424 (11:48): f139aba52f9fa1394b4034a7954b2220, I don't think the HTML5 side has any room to talk about being dismissive",
        "f139aba52f9fa1394b4034a7954b2220 (11:49): b65a1668d3f56352ebf6e4735afeb424: care to elaborate?",
        "b65a1668d3f56352ebf6e4735afeb424 (11:49): nah, being ostentatiously above-it-all is much more fun, since you can laugh at both sides",
        "b65a1668d3f56352ebf6e4735afeb424 (11:49): its the only way I can keep calm about the whole thing",
        "139513027e8e90b5582cbc68fc733884 (11:50): well, I'm not quite ready to put Robert Burns in the Dmitry Turin bucket",
        "b65a1668d3f56352ebf6e4735afeb424 (11:50): Dmitry is entertaining",
        "139513027e8e90b5582cbc68fc733884 (11:51): so I try to actually engage",
        "b65a1668d3f56352ebf6e4735afeb424 (11:51): I think Burns aluded to having some sort of product... not sure it's a browser, or authoring tool, or what",
        "b65a1668d3f56352ebf6e4735afeb424 (11:51): alluded?",
        "b65a1668d3f56352ebf6e4735afeb424 (11:52): I think Burns is being very straightforward",
        "f139aba52f9fa1394b4034a7954b2220 (11:52): Dmitry is more annoying than entertaining for me",
        "b65a1668d3f56352ebf6e4735afeb424 (11:52): well, I can understand that",
        "b65a1668d3f56352ebf6e4735afeb424 (11:53): I've deliberately taken a step back to ease my blood pressure... otherwise, reading public-html is like having road-rage for me",
        "b65a1668d3f56352ebf6e4735afeb424 (11:53): I'm only getting involved in issues I think are important",
        "f139aba52f9fa1394b4034a7954b2220 (11:53): yeah, that's probably a good idea",
        "b65a1668d3f56352ebf6e4735afeb424 (11:54): well, not exactly... a lot of it's important... but i'm only jumping in where I think the direction is going someplace I can't accept",
        "f139aba52f9fa1394b4034a7954b2220 (11:54): I think I'm going to have to stay right out of XHTML2 discussions from now on",
        "b65a1668d3f56352ebf6e4735afeb424 (11:54): the rest of it, I figure will work itself out somehow",
        "139513027e8e90b5582cbc68fc733884 (11:55): I think I will limit comments on XHTML2 to mentioning that XHTML2 is off-topic, should that seem necessary",
        "b65a1668d3f56352ebf6e4735afeb424 (11:56): well, is it?",
        "b65a1668d3f56352ebf6e4735afeb424 (11:56): I mean, the whole NS issue isn't settled... nor is the name issue",
        "b65a1668d3f56352ebf6e4735afeb424 (11:56): or did I miss something?",
        "f139aba52f9fa1394b4034a7954b2220 (11:58): b65a1668d3f56352ebf6e4735afeb424: IMHO, the name issue is settled in favour of calling it XHTML5 and ignoring the XHTML2 WG's objections, and the namespace issue is settled in favour of XHTML5 reusing the XHTML1 namespace, and letting the XHTML2 WG use whatever they like and ignoring them",
        "139513027e8e90b5582cbc68fc733884 (11:58): a proposal to change the namespace wouldn't be off-topic, just ill-conceived",
        "139513027e8e90b5582cbc68fc733884 (11:58): talking about compatibility with XHTML2 is off-topic",
        "b65a1668d3f56352ebf6e4735afeb424 (11:58): f139aba52f9fa1394b4034a7954b2220: I think that's an opinion, not a resolution",
        "b65a1668d3f56352ebf6e4735afeb424 (11:58): like I said, unless I missed something (which is very possible)",
        "b65a1668d3f56352ebf6e4735afeb424 (11:59): 139513027e8e90b5582cbc68fc733884: sure, I can see that",
        "f139aba52f9fa1394b4034a7954b2220 (11:59): well, it's resolved as far has the HTMLWG is concerned.  Let the XHTML2 WG come up with whatever resolution they like for themselves, as long as their resolution doesn't affect us.",
        "b65a1668d3f56352ebf6e4735afeb424 (12:00): was there a formal resolution?",
        "f139aba52f9fa1394b4034a7954b2220 (12:00): not a formal one",
        "b65a1668d3f56352ebf6e4735afeb424 (12:00): then it's not resolved",
        "f139aba52f9fa1394b4034a7954b2220 (12:01): but there's no point, since there have been no solid technical arguments against that resolution",
        "139513027e8e90b5582cbc68fc733884 (12:02): we didn't have an official group vote or anything",
        "139513027e8e90b5582cbc68fc733884 (12:02): but also no one seems motivated enough to call for one",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:03): b65a1668d3f56352ebf6e4735afeb424: the MIME type and the namespace URI are not negotiable for the XML serialization of HTML5, but if those say &quot;xhtml&quot;, not calling the thing &quot;XHTML something&quot; is silly",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:08): Philip`: is the zaynar.demon Philip Taylor you?"
    ],
    "person_ids": [
        "f139aba52f9fa1394b4034a7954b2220",
        "b65a1668d3f56352ebf6e4735afeb424",
        "139513027e8e90b5582cbc68fc733884",
        "b8810fee2f4a71f849f3f7409546d1d9"
    ]
}