{
    "id": "65fab489ca3462415a1bf4c80649bf52",
    "messages": [
        "a9b326df4e6da61c5b6f5e1058be83a2 (09:10): .t CET",
        "f86f03d7e99f27ce30d6373cfe093025 (09:10): Fri, 30 Jan 2009 09:08:00 CET",
        "a9b326df4e6da61c5b6f5e1058be83a2 (09:10): f139aba52f9fa1394b4034a7954b2220: can you please ping me when you are around?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (09:30): a9b326df4e6da61c5b6f5e1058be83a2: So winter is nine months?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (09:31): roughly",
        "a9b326df4e6da61c5b6f5e1058be83a2 (09:31): at that latitude at least",
        "a9b326df4e6da61c5b6f5e1058be83a2 (09:31): or another way to consider it is that it's one long month",
        "a9b326df4e6da61c5b6f5e1058be83a2 (09:32): one long, grey, depressing month",
        "a9b326df4e6da61c5b6f5e1058be83a2 (09:32): that goes on for months",
        "a11aabeeceeae6b8cb5d12ea06b56554 (09:33): realizes he is a fair bit further south",
        "f139aba52f9fa1394b4034a7954b2220 (09:35): a9b326df4e6da61c5b6f5e1058be83a2, ping",
        "a9b326df4e6da61c5b6f5e1058be83a2 (09:38): f139aba52f9fa1394b4034a7954b2220: I just wanted to apologize for the cranky replies I sent to your mail about the Audience section",
        "a9b326df4e6da61c5b6f5e1058be83a2 (09:38): replies I sent earlier today",
        "f139aba52f9fa1394b4034a7954b2220 (09:39): I'm just catching up on my mail now",
        "a9b326df4e6da61c5b6f5e1058be83a2 (09:42): f139aba52f9fa1394b4034a7954b2220: the reply that I sent to Maciej in that thread is one I wrote after taking a break and getting some sunshine",
        "a9b326df4e6da61c5b6f5e1058be83a2 (09:43): (though not literally since it's been cold and raining all day here)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (09:43): the ones I sent to you before that, I sent after getting up on the wrong side of the bed (as they say)",
        "f139aba52f9fa1394b4034a7954b2220 (09:56): ok, finished reading...",
        "f139aba52f9fa1394b4034a7954b2220 (09:58): a9b326df4e6da61c5b6f5e1058be83a2, re http://lists.w3.org/Archives/Public/public-html/2009Jan/0619.html - because the first statement is predicated on the assumption that the draft itself will be normative, and that it will contain conformance requirements",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (09:58): Title: Re: Who is the Intended Audience of the Markup Spec Proposal? from Michael(tm) Smith on 2009-01-30 (<email/> from January 2009) (at lists.w3.org)",
        "f139aba52f9fa1394b4034a7954b2220 (09:59): what's wrong with describing it as an adjuct to HTML 5?  It means &quot;Added or connected in a [...] auxiliary capacity&quot;, which seems like a fairly accurate description to me",
        "a9b326df4e6da61c5b6f5e1058be83a2 (10:00): f139aba52f9fa1394b4034a7954b2220: I see what you're saying, but I can't say I agree that the first statement is predicated on the draft being normative.",
        "f139aba52f9fa1394b4034a7954b2220 (10:01): It says &quot;intended to conform to the requirements [this document] describes&quot;. That suggests it contains conformance criteria, which indicates normativity",
        "a9b326df4e6da61c5b6f5e1058be83a2 (10:02): that's what I changed it to &quot;describes&quot;",
        "a9b326df4e6da61c5b6f5e1058be83a2 (10:02): and I guess I don't like &quot;adjunct&quot; because of what it seems to me to connote",
        "f139aba52f9fa1394b4034a7954b2220 (10:02): what does it connote to you?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (10:03): like &quot;adjunct professor&quot; -- the guy who's around to teach for one semester because the regular professor got sick or died",
        "a9b326df4e6da61c5b6f5e1058be83a2 (10:03): or &quot;adjunct professor&quot; who's the first guy to get layed off when they need to do staffing cuts",
        "a9b326df4e6da61c5b6f5e1058be83a2 (10:04): anyway, what it really gets down to is that this document is meant to stand alone as a document within the confines of the scope it sets for itself",
        "f139aba52f9fa1394b4034a7954b2220 (10:05): My purpose in describing like that was to find a way to make it clear that it's not intended, and doesn't need, to contain everything defined in HTML5, like DOM APIs or parsing requirements or whatever else.  Rather it provides auxillary material to be used in conjunction with the spec",
        "f139aba52f9fa1394b4034a7954b2220 (10:06): I don't really see how it could be used in a standalone manner, since it doesn't cover all the needs of any one particular audience",
        "f139aba52f9fa1394b4034a7954b2220 (10:07): and, the way I see it, its utility for producers is limited due to the innappropriate nature of RelaxNG schemas and regex's for descrribing content models in a human readable way",
        "a9b326df4e6da61c5b6f5e1058be83a2 (10:10): true, I do agree that in reality many or most authors don't restrict themselves to using a single reference source when they are trying to figure out how to write HTML documents",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (10:10): bugmail: &quot;[Bug 6502] should the canvas element be omitted from h:tml draft?&quot; (1 message in thread) &lt;http://lists.w3.org/Archives/Public/public-html-bugzilla/2009Jan/0058.html&gt;",
        "a9b326df4e6da61c5b6f5e1058be83a2 (10:11): and this draft is certainly not meant to be all things to all people",
        "a9b326df4e6da61c5b6f5e1058be83a2 (10:14): but if a qualifying statement of some kind (like what you proposed) were to be added to audience statement, it would seem to me to be more useful to say it's intended to be used in conjunction with all the other ways you have at your means for learning about how to use HTML correctly",
        "a9b326df4e6da61c5b6f5e1058be83a2 (10:14): and not just the HTML5 draft itself",
        "f139aba52f9fa1394b4034a7954b2220 (10:15): that's a fair point",
        "f139aba52f9fa1394b4034a7954b2220 (10:18): I'll be ok with any statement that indicates its utility for assisting with checking markup conformance (since that's what schemas are useful for) and that it's intended to be used in conjunction with the spec and authoring guides",
        "a9b326df4e6da61c5b6f5e1058be83a2 (10:19): f139aba52f9fa1394b4034a7954b2220: OK, I will try to draft up something. Right now I'm writing a reply to Hixie about the same thing.",
        "f139aba52f9fa1394b4034a7954b2220 (10:20): cool.",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (10:41): bugmail: &quot;[Bug 6507] New: Paragraphs section doesn't list all transparent elements&quot; (1 message in thread) &lt;http://lists.w3.org/Archives/Public/public-html-bugzilla/2009Jan/0059.html&gt;"
    ],
    "person_ids": [
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "f86f03d7e99f27ce30d6373cfe093025",
        "a11aabeeceeae6b8cb5d12ea06b56554",
        "f139aba52f9fa1394b4034a7954b2220",
        "0a39f78bcb297ab0ebe8a29c28bfed89"
    ]
}