{
    "id": "662d07eac0750386e9db8130a05e6cb7",
    "messages": [
        "8b7a8196348038c107614af0b08f2d21 (09:57): 8b3687499080633e1898fa1dd209ef81: pretty harsh words for ap :(",
        "8b3687499080633e1898fa1dd209ef81 (09:58): Deserved ones, IMO",
        "8b3687499080633e1898fa1dd209ef81 (09:58): He keeps hurting the web for webkit's sake",
        "8b7a8196348038c107614af0b08f2d21 (09:58): what's the path forward here?  we remove URL?",
        "8b3687499080633e1898fa1dd209ef81 (09:58): Yeah",
        "8b7a8196348038c107614af0b08f2d21 (09:58): ok",
        "8b7a8196348038c107614af0b08f2d21 (09:59): seems reasonable, but I'm sorry I don't have the energy to argue with AP on this topic",
        "8b7a8196348038c107614af0b08f2d21 (09:59): too busy arguing with him about Content-Disposition",
        "8b3687499080633e1898fa1dd209ef81 (10:00): Oh, I have lots of energy to argue ;)",
        "8b3687499080633e1898fa1dd209ef81 (10:00): Now, to fight dom2html",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:11): speaking of WebKit and hurting the Web, did Apple fork WebKit for iBooks 2?",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:11): will all WebKit devs have to deal with -ibooks stuff living on WebKit trunk?",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:12): is there already a source drop of iBooks-modified WebKit?",
        "b25b6b77a0087ff8385941e5545d32ea (10:17): a3f19f90edf0a0893c7847d08016abe3: So I still don't understand how one is supposed to algorithmically determine what is a platform object and what is not, since the definition seems to be based on intent.",
        "b25b6b77a0087ff8385941e5545d32ea (10:18): Is it intended that platform objects have some hidden state that enables one to determine that they are platform objects?",
        "b25b6b77a0087ff8385941e5545d32ea (10:19): If so is it intended that e.g. a third party javascript library can never implement an IDL interface (since the browser wouldn't know how to check for the hidden flag)",
        "8b3687499080633e1898fa1dd209ef81 (10:20): &quot;An ECMAScript library that adds support for some Web API that is not natively supported by a browser would also be considered to expose platform objects.&quot;",
        "a3f19f90edf0a0893c7847d08016abe3 (10:20): b25b6b77a0087ff8385941e5545d32ea, there's a restriction now that platform objects (ones that aren't for exceptions, or platform array objects) can only implement &quot;normal&quot; interfaces and user objects can only implement callback interfaces",
        "a3f19f90edf0a0893c7847d08016abe3 (10:20): b25b6b77a0087ff8385941e5545d32ea, but yes because we aren't doing an explicit check on [[Class]] or whatever, there is some hidden state in there",
        "a3f19f90edf0a0893c7847d08016abe3 (10:21): b25b6b77a0087ff8385941e5545d32ea, how to determine whether a given object is considered to implement a given interface isn't defined exactly",
        "b25b6b77a0087ff8385941e5545d32ea (10:21): a3f19f90edf0a0893c7847d08016abe3: Right I think that is my point. If a platform object is one that implements an interface and you can't tell what implements an interface you can't make platform objects",
        "a3f19f90edf0a0893c7847d08016abe3 (10:21): b25b6b77a0087ff8385941e5545d32ea, but there is a requirement that say an object returned from `readonly attribute Node? parentNode;` is a platform object that implements Node",
        "a3f19f90edf0a0893c7847d08016abe3 (10:22): b25b6b77a0087ff8385941e5545d32ea, just because platform objects are the only things that can implement (non-callback) interfaces",
        "a3f19f90edf0a0893c7847d08016abe3 (10:23): b25b6b77a0087ff8385941e5545d32ea, tbh I was a bit lazy, and I think the concept of platform vs user objects could probably be eliminated, since they are always distinct anyway (user objects can't implement Node, platform objects can't implement EventListener)",
        "b25b6b77a0087ff8385941e5545d32ea (10:23): I am at least pretty sure than in the current state of the spec, the browser isPlatformObject check will basically amount to &quot;is this implemented natively in the browser&quot;",
        "8b3687499080633e1898fa1dd209ef81 (10:24): Sounds like the right thing to do",
        "b25b6b77a0087ff8385941e5545d32ea (10:25): IIRC there is at least one situation where you need to take an arbitary object and determine if it is a platform object or not (overloading resolution with arrays, perhaps?)",
        "a3f19f90edf0a0893c7847d08016abe3 (10:25): &quot;natively in the browser&quot; is not exactly right; it's more like &quot;has some hidden state variable set that only the given implementation would know&quot;",
        "a3f19f90edf0a0893c7847d08016abe3 (10:25): b25b6b77a0087ff8385941e5545d32ea, there you need to know whether it is a native Array object (easy to check), a platform array object, or a platform object that also supports indexed properties",
        "b25b6b77a0087ff8385941e5545d32ea (10:26): Either that is an equivalent statement or we will be in a bad state where some magic flags will have an effect on some browsers but not others",
        "a3f19f90edf0a0893c7847d08016abe3 (10:26): ok",
        "a3f19f90edf0a0893c7847d08016abe3 (10:26): there's probably a problem",
        "a3f19f90edf0a0893c7847d08016abe3 (10:26): let's say you have the native browser C++ implementation of some APIs",
        "a3f19f90edf0a0893c7847d08016abe3 (10:26): as well as a JS library that implements some other APIs",
        "a3f19f90edf0a0893c7847d08016abe3 (10:26): the C++ implementation has an operation that takes a sequence",
        "a3f19f90edf0a0893c7847d08016abe3 (10:27): the JS library vends an object that supports indexed properties",
        "a3f19f90edf0a0893c7847d08016abe3 (10:27): how is the C++ implementation to know that the JS library objects &quot;implements&quot; the IDL interface with indexed properties",
        "a3f19f90edf0a0893c7847d08016abe3 (10:27): or even what that other IDL interface is",
        "8b7a8196348038c107614af0b08f2d21 (10:28): b8810fee2f4a71f849f3f7409546d1d9: i haven't seen any -ibook stuff in WebKit, but I don't venture into CSS land much",
        "a3f19f90edf0a0893c7847d08016abe3 (10:28): I don't think it's possible then for a native C++ implementation and a JS library implementation of APIs to coexist",
        "a3f19f90edf0a0893c7847d08016abe3 (10:28): at least if they don't share knowledge about these internal state bits",
        "a3f19f90edf0a0893c7847d08016abe3 (10:30): I should probably remove mention of JS libraries implementing APIs, and talk more generally about it not mattering what languages (JS or C++) implements given interfaces, just that they need to share this internal state information",
        "a3f19f90edf0a0893c7847d08016abe3 (10:30): b25b6b77a0087ff8385941e5545d32ea, wdyt?",
        "8b7a8196348038c107614af0b08f2d21 (10:30): i don't see anything about ibooks on http://opensource.apple.com/",
        "b25b6b77a0087ff8385941e5545d32ea (10:32): a3f19f90edf0a0893c7847d08016abe3: I am a bit skeptical about something that would allow random on-the-web javascript libraries to set some flags that have magic behaviour in some implementations. Of course if some browser wants to implement their DOM APIs in javascript or a javascript/C++ mix, that should be possible",
        "a3f19f90edf0a0893c7847d08016abe3 (10:33): b25b6b77a0087ff8385941e5545d32ea, right so I think that's all I want to enable",
        "a3f19f90edf0a0893c7847d08016abe3 (10:33): b25b6b77a0087ff8385941e5545d32ea, i.e. avoid &quot;host object&quot; vs &quot;native object&quot; terminology",
        "b25b6b77a0087ff8385941e5545d32ea (10:33): OK, so as long as it is clearly scoped to that, IO think it is fine",
        "a3f19f90edf0a0893c7847d08016abe3 (10:33): b25b6b77a0087ff8385941e5545d32ea, so I should forget about random JS libraries",
        "b25b6b77a0087ff8385941e5545d32ea (10:33): s/IO/I/",
        "a3f19f90edf0a0893c7847d08016abe3 (10:33): will have a go at writing that tomorrow",
        "b25b6b77a0087ff8385941e5545d32ea (10:34): Great, thanks",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:40): 8b7a8196348038c107614af0b08f2d21: the iBooks stuff is based on WebKit, though, right? It would be really weird for Apple to implement the common stuff a second time.",
        "8b7a8196348038c107614af0b08f2d21 (10:40): dunno",
        "8b7a8196348038c107614af0b08f2d21 (10:40): i bet they have an internal fork",
        "b25b6b77a0087ff8385941e5545d32ea (10:40): Pretty sure that at least some older Apple ePub reader was basically WebKit",
        "8b7a8196348038c107614af0b08f2d21 (10:40): it would be tough to land that proprietary stuff in WebKit",
        "a3f19f90edf0a0893c7847d08016abe3 (10:41): 8b3687499080633e1898fa1dd209ef81, &quot;I propose that we add a pointer to the contemporary specification to the following specifications: [‚Ä¶] DOM 2 Events (D3E) &quot;",
        "a3f19f90edf0a0893c7847d08016abe3 (10:41): 8b3687499080633e1898fa1dd209ef81, slip of the tongue? :)",
        "a3f19f90edf0a0893c7847d08016abe3 (10:42): 8b3687499080633e1898fa1dd209ef81, or is the bracketed spec what the old spec should be pointing to (not the shortname of the obsolete spec)",
        "a3f19f90edf0a0893c7847d08016abe3 (10:42): 8b3687499080633e1898fa1dd209ef81, (if so, nm me!)",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:42): 8b7a8196348038c107614af0b08f2d21: it would be cool to see the Apple WebKit team oppose to landing that stuff as vigorously as they opposed to landing the Dart stuff. :-)",
        "8b7a8196348038c107614af0b08f2d21 (10:43): there's certainly some tension in the webkit community around these sorts of issues",
        "8b7a8196348038c107614af0b08f2d21 (10:44): the project is wrestling with how to be innovative without going in every direction at once",
        "8b7a8196348038c107614af0b08f2d21 (10:46): (i should also say that I don't know much specifically about ibooks except what i read in articles like http://www.zdnet.com/blog/bott/how-apple-is-sabotaging-an-open-standard-for-digital-books/4378 )",
        "a3f19f90edf0a0893c7847d08016abe3 (10:46): tbh I don't really see a problem with iBooks doing this, if it doesn't impact WebKit more generally -- if Apple wishes to maintain an internal fork for their experimental syntax, that's up to them",
        "a3f19f90edf0a0893c7847d08016abe3 (10:46): it might even provide good feedback to the CSS WG for the standards based features",
        "a3f19f90edf0a0893c7847d08016abe3 (10:47): (this is wrt to web features btw; I have no idea whether their -ibook-* features are detrimental to EPUB standardisation efforts)",
        "8b7a8196348038c107614af0b08f2d21 (10:48): a3f19f90edf0a0893c7847d08016abe3: sure, but presumably the LGPL would compel them to release the source",
        "a3f19f90edf0a0893c7847d08016abe3 (10:49): 8b7a8196348038c107614af0b08f2d21, sure, but I wouldn't expect that source to be used as a web browser engine for other products",
        "2466054b396284f05e6f6e4e7d3c806d (10:56): Must say I like Opera Mobile the most on my Android devices.",
        "2466054b396284f05e6f6e4e7d3c806d (10:56): Especially great how it reopens all my tabs after it got pushed out of active memory. Most other browsers give you a clean slate when you start the browser again.",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:56): a3f19f90edf0a0893c7847d08016abe3: this sort of thing could be detrimental to writing Gecko, Presto or Trident-based ebook readers.",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:57): a3f19f90edf0a0893c7847d08016abe3: and if one believes that everything is moving to the Web, ebook readers will be Web apps, too",
        "a3f19f90edf0a0893c7847d08016abe3 (10:57): b8810fee2f4a71f849f3f7409546d1d9, that is true, and I guess I was just thinking about this from a web browser engine PoV rather than eBook",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:58): 2466054b396284f05e6f6e4e7d3c806d: Fennec Native reopens the tabs when reopening after being killed by the OS.",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:58): 2466054b396284f05e6f6e4e7d3c806d: (though there's a bug that makes the frontmost tab reopen twice.)",
        "2466054b396284f05e6f6e4e7d3c806d (10:58): b8810fee2f4a71f849f3f7409546d1d9: I found Fennec to be not so good :(",
        "a3f19f90edf0a0893c7847d08016abe3 (10:58): b8810fee2f4a71f849f3f7409546d1d9, who is to say Apple (or other WebKit contributors) are not willing to implement eventually unprefixed, standards-cooked versions of features they implemented with -ibook-* prefixes",
        "2466054b396284f05e6f6e4e7d3c806d (10:58): I tried normal, beta, aurora, and nightly.",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:58): 2466054b396284f05e6f6e4e7d3c806d: XUL or Native?",
        "2466054b396284f05e6f6e4e7d3c806d (10:58): Mmm, good question",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:58): 2466054b396284f05e6f6e4e7d3c806d: when did you try Nightly?",
        "2466054b396284f05e6f6e4e7d3c806d (10:59): about 4-5 days ago or so",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:59): a3f19f90edf0a0893c7847d08016abe3: to a large extent, the position of MS Office is based on support for .doc, not on support for ISO OOXML",
        "a3f19f90edf0a0893c7847d08016abe3 (10:59): sucks because he complains (mostly in his head, sometimes in public forums) about Firefox Native vs Firefox XUL",
        "2466054b396284f05e6f6e4e7d3c806d (10:59): b8810fee2f4a71f849f3f7409546d1d9: downloaded the apk from a mozilla page",
        "a3f19f90edf0a0893c7847d08016abe3 (10:59): should help improve Firefox Native rather than complain, of course",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:00): 2466054b396284f05e6f6e4e7d3c806d: recently?",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:00): oh. 4-5 day",
        "2466054b396284f05e6f6e4e7d3c806d (11:00): b8810fee2f4a71f849f3f7409546d1d9: 4-5 days ago",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:00): 2466054b396284f05e6f6e4e7d3c806d: that's Fennec Native",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:00): 2466054b396284f05e6f6e4e7d3c806d: please file bugs about stuff that sucks",
        "2466054b396284f05e6f6e4e7d3c806d (11:00): a3f19f90edf0a0893c7847d08016abe3: I gave up on that, I got way too many projects.",
        "2466054b396284f05e6f6e4e7d3c806d (11:00): b8810fee2f4a71f849f3f7409546d1d9: Will do",
        "2466054b396284f05e6f6e4e7d3c806d (11:00): b8810fee2f4a71f849f3f7409546d1d9: It definitely performs faster though",
        "2466054b396284f05e6f6e4e7d3c806d (11:00): b8810fee2f4a71f849f3f7409546d1d9: Than previous versions",
        "a3f19f90edf0a0893c7847d08016abe3 (11:01): I with my Galaxy S2 didn't find a huge performance difference",
        "2466054b396284f05e6f6e4e7d3c806d (11:01): a3f19f90edf0a0893c7847d08016abe3: on my Galaxy Tab 10.1 it was at least",
        "2466054b396284f05e6f6e4e7d3c806d (11:01): Didn't test on my S2",
        "a3f19f90edf0a0893c7847d08016abe3 (11:01): and there definitely are many more broken things for me in Native UI vs the old XUL UI",
        "a3f19f90edf0a0893c7847d08016abe3 (11:01): but! I have started to file or CC myself to bugs, so that's better than nothing :)",
        "a3f19f90edf0a0893c7847d08016abe3 (11:02): only updated last week once the intiial Sync implementation had landed",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:02): I still use Fennec XUL for sites that require login",
        "a3f19f90edf0a0893c7847d08016abe3 (11:02): b8810fee2f4a71f849f3f7409546d1d9, forms don't work for you?",
        "a3f19f90edf0a0893c7847d08016abe3 (11:02): b8810fee2f4a71f849f3f7409546d1d9, or is this HTTP auth?",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:02): a3f19f90edf0a0893c7847d08016abe3: credential sync and/or autofill don't work for me",
        "a3f19f90edf0a0893c7847d08016abe3 (11:03): b8810fee2f4a71f849f3f7409546d1d9, oh. autofill works for me on the ~1 site that I view on the phone that needs a login.",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:03): I'm not planning on re-entering the credentials I've entered on desktop",
        "2466054b396284f05e6f6e4e7d3c806d (11:03): One thing that's ticking me off with some recent browsers is when I copy URLs it's not giving me the scheme",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:04): 2466054b396284f05e6f6e4e7d3c806d: yeah, that's annoying with Opera Mobile",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:04): in Fennec Native, I can't copy the URL at all, though :-)",
        "a3f19f90edf0a0893c7847d08016abe3 (11:04): 2466054b396284f05e6f6e4e7d3c806d, occasionally that happens with me in Firefox, but most of the time it does the right thing",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:04): 2466054b396284f05e6f6e4e7d3c806d: desktop Firefox has more and more advanced heuristics for this",
        "a3f19f90edf0a0893c7847d08016abe3 (11:04): b8810fee2f4a71f849f3f7409546d1d9, currently nightlies having broken long tap makes them somewhat unusable for me :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:05): 2466054b396284f05e6f6e4e7d3c806d: but with desktop Firefox, you can avoid the problem by disabling the scheme hiding",
        "2466054b396284f05e6f6e4e7d3c806d (11:05): Sucks when I am making notes in Evernote and need to add complete URLs",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:05): I disabled the scheme hiding in Firefox on desktop",
        "2466054b396284f05e6f6e4e7d3c806d (11:05): Will check that. It's a bit annoying when you need to provide them to applications that do some sort of regexp matching on URLs and thus fail :)",
        "a3f19f90edf0a0893c7847d08016abe3 (11:06): goes to cook dinner and watch Hewitt v Djokovic on the telly",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:06): that Opera Mobile prefills &quot;www.&quot; is also terribly annoying when trying *paste into* Opera Mobile",
        "2466054b396284f05e6f6e4e7d3c806d (11:07): especially since www. is hardly common anymore",
        "2466054b396284f05e6f6e4e7d3c806d (11:08): so many sites droped it or use some other subdomain/host",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:11): Hixie: why aren't CR and CRLF treated as line breaks in title tooltips?",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:16): huh. how can the spec be wrong about CR and CRLF in tooltips and I don't find a bug report filed by me about it?",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:16): http:/ b8810fee2f4a71f849f3f7409546d1d9.iki.fi/test/moz/title-attribute.html I have an existing test case",
        "cc097e0d7183ae8436e7df709553c8c0 (11:17): b8810fee2f4a71f849f3f7409546d1d9: maybe you traveled back in time. in the future, you will file a bug about it",
        "b25b6b77a0087ff8385941e5545d32ea (11:18): I remember there was already some discussion about this",
        "b25b6b77a0087ff8385941e5545d32ea (11:19): tbh, I thought it was b8810fee2f4a71f849f3f7409546d1d9 who requested the current behviour",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:19): really?",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:19): seems unlikely since I have a pending Firefox patch that expects CR and CRLF to be breaks",
        "b25b6b77a0087ff8385941e5545d32ea (11:21): Well I'm not saying I am right",
        "b25b6b77a0087ff8385941e5545d32ea (11:22): That's just what I thought"
    ],
    "person_ids": [
        "8b7a8196348038c107614af0b08f2d21",
        "8b3687499080633e1898fa1dd209ef81",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "b25b6b77a0087ff8385941e5545d32ea",
        "a3f19f90edf0a0893c7847d08016abe3",
        "2466054b396284f05e6f6e4e7d3c806d",
        "cc097e0d7183ae8436e7df709553c8c0"
    ]
}