{
    "id": "6723bd57f8d2a0e5ba1845a650f3ae3e",
    "messages": [
        "69b0d3dfe919a6b860a9fac82de52a7e (01:51): wow, shelley just sent what i believe is the most honest answer as to why people want to keep summary=&quot;&quot; despite it having demonstrably failed to improve accessibility",
        "6d05f0c2942adc25946a4b02b37ffa00 (01:56): 'They've spent, what seems to me, a lot of time promoting this attribute, and accessibility in general. And now, a few people just want to yank it because &quot;it's not being used right&quot;.' -&gt; http://en.wikipedia.org/wiki/Sunk_costs",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:00): yup",
        "6d05f0c2942adc25946a4b02b37ffa00 (02:01): nn",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:01): nn",
        "a924fb58d2c25874322f4e5126f608b9 (02:02): It could be that some people believe that the bad use just doesn't count. It's just a tiny waste of time each occasion.",
        "ab7faae5d7b250ea8606486575f8f79c (02:09): &quot;wow.  fascinating.  depressing.&quot; - that's an appropriate response to pretty much any attempt to look at a random collection of real-world markup",
        "a924fb58d2c25874322f4e5126f608b9 (02:10): Or humanity in general :)",
        "ab7faae5d7b250ea8606486575f8f79c (02:10): I hope nobody is going to notice that there's some weird euc-jp decoding issues on my table-summary-values-dotbot page where it inexplicably misses the '&quot;' at the end of an attribute value",
        "ab7faae5d7b250ea8606486575f8f79c (02:11): (I assume it's an euc-jp decoding issue because all the offending values look kind of Japanese or something foreign like that)",
        "ab7faae5d7b250ea8606486575f8f79c (02:11): (I can't reproduce the problem with parsetree.validator.nu but I don't care enough to debug it further)",
        "a924fb58d2c25874322f4e5126f608b9 (02:12): Shouldn't the URL show whether it's Japanese or not?",
        "ab7faae5d7b250ea8606486575f8f79c (02:12): I guess so",
        "ab7faae5d7b250ea8606486575f8f79c (02:12): but I didn't look very closely",
        "ab7faae5d7b250ea8606486575f8f79c (02:13): and I'm not going to look now because it's a 5MB page and I have to pay the equivalent of half a chocolate digestive biscuit per megabyte of traffic",
        "a924fb58d2c25874322f4e5126f608b9 (02:14): Well, I just clicked the expand link in your summary table :)",
        "ab7faae5d7b250ea8606486575f8f79c (02:15): You could look for some of the values lower down that have strings like &quot;&lt;tr&gt;&quot; in them",
        "ab7faae5d7b250ea8606486575f8f79c (02:16): and see if those are .jp pages",
        "a924fb58d2c25874322f4e5126f608b9 (02:16): Yup",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:16): ab7faae5d7b250ea8606486575f8f79c needs a better network service provider",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:16): one that charges a flat rate",
        "f139aba52f9fa1394b4034a7954b2220 (02:16): I'm surprised by how well Shelly wrote those emails about summary.  Is she the same Shelly who's been complaining about RDFa stuff?",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:16): and not per bit",
        "a924fb58d2c25874322f4e5126f608b9 (02:17): Maybe they charge per byte, so it still costs the same if he only downloads 7 bits",
        "ab7faae5d7b250ea8606486575f8f79c (02:17): 69b0d3dfe919a6b860a9fac82de52a7e: I have one of those, but the wireless router appears to be dead, so I'm using a mobile broadband thingamy instead",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:18): ab7faae5d7b250ea8606486575f8f79c: fix the router :-P",
        "a924fb58d2c25874322f4e5126f608b9 (02:18): ab7faae5d7b250ea8606486575f8f79c: I checked a few different ones, they all contain Japanese sites. I can't say every site listed is Japanese, but it seems likely.",
        "ab7faae5d7b250ea8606486575f8f79c (02:18): 69b0d3dfe919a6b860a9fac82de52a7e: I can't fix it myself - all I can do is complain to the owners, and they're asleep now :-p",
        "f139aba52f9fa1394b4034a7954b2220 (02:19): although, I really hate it when people claim that &quot;... the folks who really want this attribute gone, really have no alternative solution in mind.&quot; because that's just complete nonsense.",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:19): ab7faae5d7b250ea8606486575f8f79c: ah",
        "ab7faae5d7b250ea8606486575f8f79c (02:20): found that most &quot;flat rate&quot; mobile broadband thingamy plans had a limit of 3GB per month, and cost ¬£15/month, which isn't so good",
        "ab7faae5d7b250ea8606486575f8f79c (02:21): (so I got one that's ¬£15/GB and doesn't expire for 6 months, which is better value when I don't use it much)",
        "b07211a0c7cb119232799d2119cea90f (02:21): ab7faae5d7b250ea8606486575f8f79c: hm, is that 3G USB stick-type stuff?  who did you get yours from?",
        "ab7faae5d7b250ea8606486575f8f79c (02:22): b07211a0c7cb119232799d2119cea90f: It is",
        "a924fb58d2c25874322f4e5126f608b9 (02:22): Bah. Why is it so hard to get that stuff like autoplay are author hints, the UA is perfectly capable of overriding.",
        "ab7faae5d7b250ea8606486575f8f79c (02:22): b07211a0c7cb119232799d2119cea90f: It's a Vodafone one",
        "b07211a0c7cb119232799d2119cea90f (02:23): ab7faae5d7b250ea8606486575f8f79c: ah cool, sounds like what I want really",
        "ab7faae5d7b250ea8606486575f8f79c (02:24): b07211a0c7cb119232799d2119cea90f: (Also it works on Linux, with a couple of configuration files found via Google)",
        "a87c4bad60e9b523297215a57e4a3c96 (02:38): what's the best way to get character indices of tags out of html5lib?",
        "a87c4bad60e9b523297215a57e4a3c96 (02:39): I had a quick look a few weeks back, and suspected that copy and pasting chunks of html5lib into my code was likely my best option",
        "a87c4bad60e9b523297215a57e4a3c96 (02:39): any other ideas?"
    ],
    "person_ids": [
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "6d05f0c2942adc25946a4b02b37ffa00",
        "a924fb58d2c25874322f4e5126f608b9",
        "ab7faae5d7b250ea8606486575f8f79c",
        "f139aba52f9fa1394b4034a7954b2220",
        "b07211a0c7cb119232799d2119cea90f",
        "a87c4bad60e9b523297215a57e4a3c96"
    ]
}