{
    "id": "6922c53e6844a973bd15f0084262ecfb",
    "messages": [
        "1d3bfcfde5ac540a616a25dff751e36f (11:24): b8810fee2f4a71f849f3f7409546d1d9: do you think it would be worhtwhile/constructive if i update your http:/ b8810fee2f4a71f849f3f7409546d1d9.iki.fi/aria-html5-bis/ to take into account landmarks and changes in the aria spec etc?",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (11:24): Title: ARIA in HTML5 Integration: Document Conformance (Draft, Take Two) (at b8810fee2f4a71f849f3f7409546d1d9.iki.fi)",
        "139513027e8e90b5582cbc68fc733884 (11:25): 1d3bfcfde5ac540a616a25dff751e36f: b8810fee2f4a71f849f3f7409546d1d9 and I were just discussing it on #whatwg",
        "139513027e8e90b5582cbc68fc733884 (11:25): well, &quot;just&quot; meaning 2 hours ago",
        "139513027e8e90b5582cbc68fc733884 (11:25): 1d3bfcfde5ac540a616a25dff751e36f: it seems like it is a little out of date with respect to both ARIA and HTML5",
        "139513027e8e90b5582cbc68fc733884 (11:26): 1d3bfcfde5ac540a616a25dff751e36f: b8810fee2f4a71f849f3f7409546d1d9 said the Relax NG schema is more current",
        "1d3bfcfde5ac540a616a25dff751e36f (11:26): yes, i have been studying the doc a bit",
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:27): 139513027e8e90b5582cbc68fc733884, b8810fee2f4a71f849f3f7409546d1d9 - I can generate human-readable HTML5+ARIA document based on Henri's aria.rnc file, if people want it",
        "139513027e8e90b5582cbc68fc733884 (11:28): a9b326df4e6da61c5b6f5e1058be83a2: I failed to human-read the raw ARIA file",
        "1d3bfcfde5ac540a616a25dff751e36f (11:28): mikesmith: that would be a useful to me",
        "139513027e8e90b5582cbc68fc733884 (11:28): 1d3bfcfde5ac540a616a25dff751e36f: b8810fee2f4a71f849f3f7409546d1d9 and I noted that templateid and datatype are gone from ARIA for example",
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:28): 1d3bfcfde5ac540a616a25dff751e36f: OK, I will try to get it done by tomorrow",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (11:28): bugmail: [Bug 7367] New: The HTMLEmbedElement interface needs to have the name and align DOM attributes as well. Web browsers do too. &lt;http://lists.w3.org/Archives/Public/public-html-bugzilla/2009Aug/0207.html&gt;",
        "1d3bfcfde5ac540a616a25dff751e36f (11:29): yes and aria-channel and some others i think",
        "1d3bfcfde5ac540a616a25dff751e36f (11:30): also in discussion with b8810fee2f4a71f849f3f7409546d1d9 a while back he agreed (as i recall) that there is a use case for the document role and also he has now allowed landmarks",
        "1d3bfcfde5ac540a616a25dff751e36f (11:32): 139513027e8e90b5582cbc68fc733884: so i thought it would be worthwhile to produce a modified and upadted doc including suggestions on how landmarks may be supported",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:32): 1d3bfcfde5ac540a616a25dff751e36f: yes, I think it would be constructive. see also aria.rnc for what I did with landmarks.",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:32): 1d3bfcfde5ac540a616a25dff751e36f: the schema has a bug around &lt;form role=search&gt;, though",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:32): 1d3bfcfde5ac540a616a25dff751e36f: the &lt;form role=search&gt; omission is unintentional",
        "1d3bfcfde5ac540a616a25dff751e36f (11:33): b8810fee2f4a71f849f3f7409546d1d9: great, will work on it",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:33): 1d3bfcfde5ac540a616a25dff751e36f: thanks",
        "139513027e8e90b5582cbc68fc733884 (11:34): 1d3bfcfde5ac540a616a25dff751e36f: anyway, I think it would be great to make an updated version since b8810fee2f4a71f849f3f7409546d1d9 doesn't have time",
        "1d3bfcfde5ac540a616a25dff751e36f (11:35): 139513027e8e90b5582cbc68fc733884: good, there are some parts i am unsure about so will hassle whoever can provide input to do so :-)",
        "139513027e8e90b5582cbc68fc733884 (11:35): 1d3bfcfde5ac540a616a25dff751e36f: I suspect Hixie will want to rejigger things when he gets around to this himself, but it can't hurt to have a solid proposal on the table",
        "139513027e8e90b5582cbc68fc733884 (11:36): the document is also out of date with respect to some HTML5 element updates (like the new hgroup, header changing in meaning, datagrid, datatemplate and event-source being gone...)",
        "1d3bfcfde5ac540a616a25dff751e36f (11:37): 139513027e8e90b5582cbc68fc733884:yes i am sure he will, yes will update in respect to html 5 elements as well",
        "9bb295af93051e68de66b2bd517b2e24 (11:39): sounds good 1d3bfcfde5ac540a616a25dff751e36f!",
        "1d3bfcfde5ac540a616a25dff751e36f (11:43): if i create an initial copy can somebody help me to get it up on the w3c cvs? i think it would be useful to have it up there",
        "1d3bfcfde5ac540a616a25dff751e36f (11:44): i have access to the cvs but have not worked out how to do it yet",
        "139513027e8e90b5582cbc68fc733884 (11:45): 1d3bfcfde5ac540a616a25dff751e36f: you can slap it on the wiki for starters if you want, and I'm sure a9b326df4e6da61c5b6f5e1058be83a2 can help you with the cvs mechanics",
        "9bb295af93051e68de66b2bd517b2e24 (11:45): I can try to help out, though if you're on Windows it might be tricky for me :)",
        "9bb295af93051e68de66b2bd517b2e24 (11:45): though then you could get Tortoise or something I believe and then it should be pretty easy",
        "1d3bfcfde5ac540a616a25dff751e36f (11:46): 139513027e8e90b5582cbc68fc733884: ok will do",
        "1d3bfcfde5ac540a616a25dff751e36f (11:47): 9bb295af93051e68de66b2bd517b2e24: yeah i have tortoise, will give it a try, just concerned that i may mess something up unintentionally",
        "1d3bfcfde5ac540a616a25dff751e36f (11:47): what is the url for the repository?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:48): 1d3bfcfde5ac540a616a25dff751e36f: for the w3c html5 repository?",
        "1d3bfcfde5ac540a616a25dff751e36f (11:49): mikesmith:yes",
        "9bb295af93051e68de66b2bd517b2e24 (11:49): 1d3bfcfde5ac540a616a25dff751e36f, http://dev.w3.org/cvsweb/ has details",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (11:49): Title: W3C Public CVS Repository (at dev.w3.org)",
        "1d3bfcfde5ac540a616a25dff751e36f (11:49): thnks",
        "9bb295af93051e68de66b2bd517b2e24 (11:49): HTML5 is in the html5 folder, you should probably create a new folder or some such in there",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (11:59): bugmail: [Bug 7368] The suggested UI for the mark element does not match the description and the examples. E.g. code highlighting is not something you want to see marked in the scrollbar. Personally I think code highlighting should just be done with strong. &lt;http://lists.w3.org/Archives/Public/public-html-bugzilla/2009Aug/0210.html&gt; ** [Bug 7367] The HTMLEmbedElement interface needs to have the name and align DOM attributes as well. Web browsers do to",
        "1d3bfcfde5ac540a616a25dff751e36f (12:03): mikesmith: i am using tortoise, it provides a dialog for repository browsing and a filed for the address, i put in 'http://dev.w3.org/cvsweb/html5' and i get a message saying &quot;repository moved permanently to 'cvsweb/html5/' please relocate&quot; any ideas?",
        "9bb295af93051e68de66b2bd517b2e24 (12:05): 1d3bfcfde5ac540a616a25dff751e36f, shouldn't you enter the server and repository separately?",
        "1d3bfcfde5ac540a616a25dff751e36f (12:06): 9bb295af93051e68de66b2bd517b2e24: only provides an url field, for example &quot;http://svn.codetalks.org/repos/trunk/tools/ARIA-DTDs&quot; works fine",
        "9bb295af93051e68de66b2bd517b2e24 (12:06): 1d3bfcfde5ac540a616a25dff751e36f, per http://sourceforge.net/apps/trac/sourceforge/wiki/TortoiseCVS%20instructions you fill in the server and repository separately",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (12:06): Title: TortoiseCVS instructions ‚Äì sourceforge (at sourceforge.net)",
        "9bb295af93051e68de66b2bd517b2e24 (12:06): 1d3bfcfde5ac540a616a25dff751e36f, this is not subversion",
        "9bb295af93051e68de66b2bd517b2e24 (12:07): 1d3bfcfde5ac540a616a25dff751e36f, W3C uses the decades old CVS :)",
        "1d3bfcfde5ac540a616a25dff751e36f (12:07): thnks, as you cna see i know little about this stuff",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:07): yeah, cvs doesn't know anything about URLs",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:08): 1d3bfcfde5ac540a616a25dff751e36f: isn't there somewhere in the Tortoise UI where it lets you choose the type of version-control system?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (12:08): 9bb295af93051e68de66b2bd517b2e24: Instead of the merely decade old SVN? :)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:08): if there is, and you set it to &quot;CVS&quot;, then it should provide a field for putting in a CVSROOT value",
        "1d3bfcfde5ac540a616a25dff751e36f (12:08): so will download tortoisecvs as trying with tortoisesvn will not work ;-)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:09): ah",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:12): it's a bit sad that right when SVN had established itself, it because clear that it's not quite the right thing but hg is",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:12): maybe svn was a necessary step on the road from cvs to hg",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:12): s/because/became/",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:13): scary typo",
        "b25b6b77a0087ff8385941e5545d32ea (12:14): In other unrelated news it turns out that virtualenv is wonderful",
        "139513027e8e90b5582cbc68fc733884 (12:14): b8810fee2f4a71f849f3f7409546d1d9: I still can't decide if hg, git, or bzr is the right thing",
        "139513027e8e90b5582cbc68fc733884 (12:14): (git is my least favorite of the lot, but seems to have the most appeal to WebKit developers who really want that kind of tool)",
        "9bb295af93051e68de66b2bd517b2e24 (12:15): hasn't used any of the fancy ones yet",
        "b25b6b77a0087ff8385941e5545d32ea (12:15): 139513027e8e90b5582cbc68fc733884: How much does it matter? As far as I can tell they are similar enough to not make much difference",
        "a924fb58d2c25874322f4e5126f608b9 (12:15): That's why svn is so great, everyone can agree it's not their favorite decentralized option",
        "b25b6b77a0087ff8385941e5545d32ea (12:15): Although bzr seems like it might be sqeezed out simply by being third most popular",
        "139513027e8e90b5582cbc68fc733884 (12:15): b25b6b77a0087ff8385941e5545d32ea: they seem to differ greatly in learnability for someone used to cvs/svn",
        "a11aabeeceeae6b8cb5d12ea06b56554 (12:16): Monotone ftw!",
        "139513027e8e90b5582cbc68fc733884 (12:16): also, people who like git tend to disdain the others for reasons I am not totally clear on",
        "b25b6b77a0087ff8385941e5545d32ea (12:16): 139513027e8e90b5582cbc68fc733884: Could be true. Git seems to be simple in principle and rather hard to learn",
        "a11aabeeceeae6b8cb5d12ea06b56554 (12:16): 139513027e8e90b5582cbc68fc733884: Probably because Linus says so",
        "a924fb58d2c25874322f4e5126f608b9 (12:16): It's in the name, &quot;git&quot;",
        "a11aabeeceeae6b8cb5d12ea06b56554 (12:17): Or rather, Linus wrote it, so they think Linus dislikes everything else",
        "139513027e8e90b5582cbc68fc733884 (12:17): also I've heard it claimed bzr does not have good perf for large repositories",
        "b25b6b77a0087ff8385941e5545d32ea (12:17): Although I get the impression it may be somewhat more powerful than hg I haven;t really wanted the extra features yet",
        "a11aabeeceeae6b8cb5d12ea06b56554 (12:17): bzr does a lot better now than it did even a year ago",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:17): sorry about starting a discussion on which DVCS is best",
        "b25b6b77a0087ff8385941e5545d32ea (12:17): :)",
        "139513027e8e90b5582cbc68fc733884 (12:18): b8810fee2f4a71f849f3f7409546d1d9: what's amazing is the total lack of flaming in this discussion",
        "a11aabeeceeae6b8cb5d12ea06b56554 (12:28): 139513027e8e90b5582cbc68fc733884: No, your wrong because you do work on an open source project controlled by an evil closed company!",
        "a11aabeeceeae6b8cb5d12ea06b56554 (12:28): *you're",
        "139513027e8e90b5582cbc68fc733884 (12:28): a11aabeeceeae6b8cb5d12ea06b56554: that's the spirit!",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (12:29): bugmail: [Bug 6853] restore meta keywords, search engines use them &lt;http://lists.w3.org/Archives/Public/public-html-bugzilla/2009Aug/0211.html&gt;",
        "a924fb58d2c25874322f4e5126f608b9 (12:29): You don't need insults when you're using the word git every two lines",
        "b25b6b77a0087ff8385941e5545d32ea (12:31): You can't insult people properly when you correct your typos and fail to use CAPS, *asterisks* or /slashes/",
        "b25b6b77a0087ff8385941e5545d32ea (12:31): In other news, I seem to have lost my editing bit on the tracker",
        "a11aabeeceeae6b8cb5d12ea06b56554 (12:31): *No*, that /cannot/ be write WHATEVER you say, because I can't even see your face. You're just an anonymous /coward/.",
        "9bb295af93051e68de66b2bd517b2e24 (12:32): oh please cut the /slashes/",
        "b25b6b77a0087ff8385941e5545d32ea (12:32): Anyone know if there is a sensible way to add metadata to the issue pages?",
        "139513027e8e90b5582cbc68fc733884 (12:32): the /slashes/ remind me of somebody from the early days of the HTML WG",
        "9bb295af93051e68de66b2bd517b2e24 (12:34): b25b6b77a0087ff8385941e5545d32ea, just add a comment as Julian suggested and scrape the entire page for that string",
        "9bb295af93051e68de66b2bd517b2e24 (12:34): b25b6b77a0087ff8385941e5545d32ea, simple solutions ftw",
        "b25b6b77a0087ff8385941e5545d32ea (12:34): 9bb295af93051e68de66b2bd517b2e24: It wasn't clear to me that that was what he was suggesting",
        "9bb295af93051e68de66b2bd517b2e24 (12:34): b25b6b77a0087ff8385941e5545d32ea, it seemed kind of implied to me with the crazy long identifier",
        "9bb295af93051e68de66b2bd517b2e24 (12:35): a9b326df4e6da61c5b6f5e1058be83a2, haven't heard from the pubteam yet, what's the plan? both for HTML5 and XHR",
        "139513027e8e90b5582cbc68fc733884 (12:35): I don't think there is a way to add &quot;real&quot; metadata",
        "b25b6b77a0087ff8385941e5545d32ea (12:35): when people use fancy words like metadata I assume they mean something more than &quot;a specially formatted piece of data&quot;",
        "b25b6b77a0087ff8385941e5545d32ea (12:36): Anyway I am quite happy to do things this way if people like but I can't do anything whilst I can't edit the tracker issues",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:36): 9bb295af93051e68de66b2bd517b2e24: I will send the publication request later today, and talk with the webmaster.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:37): 9bb295af93051e68de66b2bd517b2e24: as soon as I get a date, you and Hixie can set the dates on the docs",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:37): 9bb295af93051e68de66b2bd517b2e24: you already sent the publication request for XHR, right?",
        "9bb295af93051e68de66b2bd517b2e24 (12:38): a9b326df4e6da61c5b6f5e1058be83a2, art did, yes",
        "9bb295af93051e68de66b2bd517b2e24 (12:38): okay",
        "9bb295af93051e68de66b2bd517b2e24 (12:38): a9b326df4e6da61c5b6f5e1058be83a2, also b25b6b77a0087ff8385941e5545d32ea needs tracker privs",
        "9bb295af93051e68de66b2bd517b2e24 (12:38): ^^",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (12:53): planet: What are the pros and cons of adopting HTML 5 now for a site redesign? &lt;http://stackoverflow.com/questions/1298610/what-are-the-pros-and-cons-of-adopting-html-5-now-for-a-site-redesign&gt;",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:57): 9bb295af93051e68de66b2bd517b2e24, b25b6b77a0087ff8385941e5545d32ea - James should now have tracker privs",
        "b25b6b77a0087ff8385941e5545d32ea (13:04): a9b326df4e6da61c5b6f5e1058be83a2: great thanks"
    ],
    "person_ids": [
        "1d3bfcfde5ac540a616a25dff751e36f",
        "0a39f78bcb297ab0ebe8a29c28bfed89",
        "139513027e8e90b5582cbc68fc733884",
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "9bb295af93051e68de66b2bd517b2e24",
        "a11aabeeceeae6b8cb5d12ea06b56554",
        "b25b6b77a0087ff8385941e5545d32ea",
        "a924fb58d2c25874322f4e5126f608b9"
    ]
}