{
    "id": "6a06cf94d875c9320816eef9d78ab4cf",
    "messages": [
        "b8810fee2f4a71f849f3f7409546d1d9 (10:18): I feel so baited to reply to http://www.jenitennison.com/blog/node/160#comment-11185 even though I know I should be reviewing and writing code today",
        "7f9405da4034bf43083e64b57302a8e6 (10:20): &gt;threads on google+",
        "7f9405da4034bf43083e64b57302a8e6 (10:20): &gt;deleted a sizable amount of my friends' accounts",
        "7f9405da4034bf43083e64b57302a8e6 (10:20): do not want ;_;",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:22): what on earth does it mean to be called a &quot;Jacobin&quot;? My ancient political history apparently fails me",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:22): 7f9405da4034bf43083e64b57302a8e6: why did they delete accounts? did your friends escalate?",
        "3b14b636129945831fcfcc7294686653 (10:23): 69b0d3dfe919a6b860a9fac82de52a7e: they were a political club in revolutionary france",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:23): b8810fee2f4a71f849f3f7409546d1d9: it baffles me how people think standards have any power",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:23): 3b14b636129945831fcfcc7294686653: that much i gathered from wikipedia",
        "3b14b636129945831fcfcc7294686653 (10:23): 69b0d3dfe919a6b860a9fac82de52a7e: calling someone a Jacobin roughly implies someone who cares mainly about ideological purity",
        "7f9405da4034bf43083e64b57302a8e6 (10:24): 69b0d3dfe919a6b860a9fac82de52a7e, they used their nick names. i have gone back to a normal feedreader since then.",
        "3b14b636129945831fcfcc7294686653 (10:24): hah. just looked at wikipedia, which apparently uses the same phrase as description :)",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:25): 7f9405da4034bf43083e64b57302a8e6: you mean they violated the terms of service and then the terms of service were applied? i'm not saying i agree with the policy, but it seems silly to complain about a site doing what it said it would do.",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:25): 7f9405da4034bf43083e64b57302a8e6: anyway, they can just put in the more common names they're actually known by and the accounts will be restored",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:25): 3b14b636129945831fcfcc7294686653: but what does it mean to be called a jacobian? is that good or bad?",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:25): 3b14b636129945831fcfcc7294686653: oh, sorry, missed your answer",
        "3b14b636129945831fcfcc7294686653 (10:25): it's certainly derogatory",
        "7f9405da4034bf43083e64b57302a8e6 (10:26): sometimes the common name is just ‚Äûplomlompom‚Äú or something equally weird.",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:26): did the Gmail ToS prohibit pseudonyms, too?",
        "3b14b636129945831fcfcc7294686653 (10:26): it means you'll toss out allies who don't live up to an impossible extremist standard",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:26): b8810fee2f4a71f849f3f7409546d1d9: no (and still doesn't, to my knowledge)",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:26): the scariest part of G+ ToS getting applied is people getting their Gmail account closed, too",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:27): dunno if that's happened over pseudonyms, but, reportedly, it has happened over age requirement",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:27): 7f9405da4034bf43083e64b57302a8e6: if someone really is called that then it should be easy to demonstrate it. but i can understand people doubting that someone is called that in person.",
        "7f9405da4034bf43083e64b57302a8e6 (10:28): 69b0d3dfe919a6b860a9fac82de52a7e, i think you are absolutely right with the tos. i think they should move out of the google namespace.",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:28): maybe the age requirement is in the Gmail ToS, too, but it's terrible to close a non-American kid's email account without asking the parents when the U.S. law would allow parental consent and the kid isn't in the U.S. anyway",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:28): b8810fee2f4a71f849f3f7409546d1d9: as i understand it from media reports (i have no inside knowledge) there is one case where someone who was already violating the ToS (&lt;13) had their account suspended pending parental approval after they tried to join G+ (which is closed to &lt;18 anyway) and corrected their birthday.",
        "3b14b636129945831fcfcc7294686653 (10:28): 69b0d3dfe919a6b860a9fac82de52a7e: &quot;The Jacobins assumed more and more power during the spring of 1793, with the support of the Parisian mob, which overawed the Convention, culminating in a coup at the end of May. They were to hold power until the summer of 1794, and they repeatedly purged the Convention of those they held disloyal to the Republic, ending with a widespread program of execution, the Reign of Terror in their last months. Robesp",
        "3b14b636129945831fcfcc7294686653 (10:28): ierre, generally the spokesman for the successful faction, had great esteem for his reputation as &quot;the sea-green incorruptible&quot;, and set up the slogan of the Republic of Virtue, until the Jacobins' last purge, 9 Thermidor, July 27, 1794, Robespierre attempted suicide and only succeeded in shattering his lower jaw. He was executed the next day on Thermidor 10, July 28, 1794.[7]&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:28): b8810fee2f4a71f849f3f7409546d1d9: but we already have a system in place that lets the parents unsuspend the account in that case, so i dunno why it made the news",
        "3b14b636129945831fcfcc7294686653 (10:29): there's wikipedia again",
        "7f9405da4034bf43083e64b57302a8e6 (10:29): unfortunately, without g+ providing feeds and publish APIs, that is problematic. oh well.",
        "7f9405da4034bf43083e64b57302a8e6 (10:29): walled gardens again.",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:29): 3b14b636129945831fcfcc7294686653: wow, glad he is reconsidering!",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:29): 69b0d3dfe919a6b860a9fac82de52a7e: oh. I guess it wasn't at all clear to the parents that there was such a system",
        "7f9405da4034bf43083e64b57302a8e6 (10:29): my sister read that article. she's ten. uses google mail. though not for anything important, by her own account.",
        "7f9405da4034bf43083e64b57302a8e6 (10:29): she's scared now. i showed her IMAP and will help her migrate.",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:30): b8810fee2f4a71f849f3f7409546d1d9: either that or they were trying to get attention. I've seen several cases where that's happened.",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:30): I've become more scared of having a foreign BigCo manage my identity when I've lately been trying to unlock an old Apple ID of mine",
        "7f9405da4034bf43083e64b57302a8e6 (10:31): the funniest case in germany is a woman whone last name can be literally translated as ‚Äûunknown‚Äú. of course social networks kill her accounts.",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:31): any one vendor being in control of anything is a dangerous situation, however benevolent the vendor.",
        "7f9405da4034bf43083e64b57302a8e6 (10:32): indeed. i don't understand why my friends did that stuff. but then i consider g+ a big imageboard. though lacking features.",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:32): so far, iforgot.apple.com doesn't work for my old Apple ID, phone support directed me to iTunes email support and iTunes email support person is having scripted conversations with me and their scripts don't seem to cover dealing with decade-old Apple IDs that have never been used in the iTunes store",
        "7f9405da4034bf43083e64b57302a8e6 (10:32): and by ‚Äûdid that stuff‚Äú, i mean ‚Äûuse it instead of using their own servers‚Äú.",
        "7f9405da4034bf43083e64b57302a8e6 (10:32): oh itunes. the internet explorer 6 of the media players you are.",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:34): Are all new Apple IDs required to be email addresses? Is it even possible to register @-less Apple IDs anymore?",
        "7f9405da4034bf43083e64b57302a8e6 (10:34): regarding google+: i can only hope that people realized they should not whine when stuff breaks. unless they pay for it.",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:34): where the @-part is implied to be @mac.com for iChat purposes",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:34): the Apple ID page still talks about iChat",
        "7f9405da4034bf43083e64b57302a8e6 (10:35): it still looks like a PR problem from here. maybe only in germany.",
        "7f9405da4034bf43083e64b57302a8e6 (10:35): or maybe only with early adopters from hacker culture.",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:35): if I register an Apple ID with @whatever and whatever doesn't have the XMPP DNS stuff, how would it work in iChat?",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:43): It's so frustrating to go back and forth with a support person who is following a script instead of paying good attention to what I say.",
        "7f9405da4034bf43083e64b57302a8e6 (10:44): the only good support i ever had via phone was a short talk that amounted to ‚Äûjust remove the yellow disk on the underside with a screw driver and clean it‚Äú",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:44): If Apple has a policy against letting me revive my old Apple ID, I'd prefer them to tell me instead of spewing scripted answers to me",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:45): 7f9405da4034bf43083e64b57302a8e6: oh, Apple's phone support was clued but the phone guy wasn't empowered to poke at the Apple ID database",
        "7f9405da4034bf43083e64b57302a8e6 (10:45): oha!",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:45): 7f9405da4034bf43083e64b57302a8e6: he pointed me to iTunes Store support and it went downhill from there",
        "7f9405da4034bf43083e64b57302a8e6 (10:46): why do you need to revive it anyway? can't you just create a new one? or is stuff tied to it?",
        "7f9405da4034bf43083e64b57302a8e6 (10:47): like .mac trial or something? (i am guessing here)",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:47): 7f9405da4034bf43083e64b57302a8e6: in case the ID is now or in the future exposed in some communication service (as it used to be exposed in iChat), I want to be known as &quot b8810fee2f4a71f849f3f7409546d1d9&quot; as in other services",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:47): if it won't be exposed anywhere public, I guess then I shouldn't care",
        "7f9405da4034bf43083e64b57302a8e6 (10:47): oh well.",
        "7f9405da4034bf43083e64b57302a8e6 (10:47): namespace issues again ;)",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:50): I supposed it's rational for them to by default assume that I'm clueless, but it's still so very annoying",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:50): *suppose",
        "7f9405da4034bf43083e64b57302a8e6 (10:53): funny. one of my acquaintances was not deleted, though he has used his IRL nickname and added ‚Äûdings‚Äú (like the idiom ‚Äûfoo‚Äú)",
        "7f9405da4034bf43083e64b57302a8e6 (10:54): i wonder if there is something done manually, he is somewhat popular.",
        "7f9405da4034bf43083e64b57302a8e6 (10:54): oh well.",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:05): looks like Darth Vader got kicked out of G+, too"
    ],
    "person_ids": [
        "b8810fee2f4a71f849f3f7409546d1d9",
        "7f9405da4034bf43083e64b57302a8e6",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "3b14b636129945831fcfcc7294686653"
    ]
}