{
    "id": "6abb73b71a314715fb8caae7aa965726",
    "messages": [
        "69b0d3dfe919a6b860a9fac82de52a7e (10:53): thanks to Ms2ger, HTML5 now has an index of elements",
        "040342c014ffc1c11592948bd92e3721 (10:54): w00t!",
        "ab7faae5d7b250ea8606486575f8f79c (10:56): Rather than index, you should call it a periodic table",
        "65325d50b2e25aca54bc871b89758c9c (10:57): would anyone like to help me proofread http://dev.w3.org/html5/decision-policy/decision-policy.html before I send it to the HTML WG mailing list?",
        "ab7faae5d7b250ea8606486575f8f79c (11:01): 65325d50b2e25aca54bc871b89758c9c: Shouldn't the bug be closed in 5.b.?",
        "65325d50b2e25aca54bc871b89758c9c (11:02): Let me see",
        "ab7faae5d7b250ea8606486575f8f79c (11:02): (It seems bad to leave open bugs hanging around forever)",
        "ab7faae5d7b250ea8606486575f8f79c (11:02): s/in 5.b./somewhere in the path leading up to 5.b./",
        "65325d50b2e25aca54bc871b89758c9c (11:03): ab7faae5d7b250ea8606486575f8f79c: that's more substantive feedback than proofreading - right now by design we don't close it in that case, since the originator could come back at some later point",
        "65325d50b2e25aca54bc871b89758c9c (11:03): ab7faae5d7b250ea8606486575f8f79c: probably good feedback to post on the mailing list once I post this",
        "65325d50b2e25aca54bc871b89758c9c (11:03): ab7faae5d7b250ea8606486575f8f79c: we did discuss a possibility like tagging with a keyword or marking CLOSED with a keyword after some period of time and no reply",
        "65325d50b2e25aca54bc871b89758c9c (11:03): PS I just fixed the broken anchor links",
        "ab7faae5d7b250ea8606486575f8f79c (11:04): reads the bit later on",
        "040342c014ffc1c11592948bd92e3721 (11:04): 65325d50b2e25aca54bc871b89758c9c: that looks very helpful! will read later! gotta go talk about video a11y...",
        "ab7faae5d7b250ea8606486575f8f79c (11:04): Oh, it gets set to RESOLVED, so maybe that's enough",
        "65325d50b2e25aca54bc871b89758c9c (11:04): 040342c014ffc1c11592948bd92e3721: good luck",
        "040342c014ffc1c11592948bd92e3721 (11:04): thanks :)",
        "65325d50b2e25aca54bc871b89758c9c (11:04): 040342c014ffc1c11592948bd92e3721: it will be in VERIFY by that point",
        "040342c014ffc1c11592948bd92e3721 (11:04): just a 3 min webjam talk :)",
        "65325d50b2e25aca54bc871b89758c9c (11:04): er",
        "65325d50b2e25aca54bc871b89758c9c (11:04): meant that for ab7faae5d7b250ea8606486575f8f79c",
        "040342c014ffc1c11592948bd92e3721 (11:04): no worries :)",
        "ab7faae5d7b250ea8606486575f8f79c (11:06): 65325d50b2e25aca54bc871b89758c9c: &quot;its usually not a good idea to repeatedly reopen the same bug&quot; - s//'/",
        "65325d50b2e25aca54bc871b89758c9c (11:06): hmm, is the state really VERIFIED or is it VERIFY? Can't remember",
        "cc097e0d7183ae8436e7df709553c8c0 (11:07): the former",
        "65325d50b2e25aca54bc871b89758c9c (11:07): all righty",
        "65325d50b2e25aca54bc871b89758c9c (11:07): ab7faae5d7b250ea8606486575f8f79c: thanks, fixed in my copy",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:08): 65325d50b2e25aca54bc871b89758c9c: the arrow from 6. WG Decision to 7.a. is not properly anchored",
        "ab7faae5d7b250ea8606486575f8f79c (11:08): 65325d50b2e25aca54bc871b89758c9c: &quot;Rasied issue&quot; (in diagram)",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:08): 65325d50b2e25aca54bc871b89758c9c: in step 2, is &quot;A rationale for the change or lack of change (at least enough for the Disposition of Comments).&quot;, is saying nothing and just marking the bug fixed acceptable when the bug report is, e.g., a typo?",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:09): 65325d50b2e25aca54bc871b89758c9c: or would the editor have to say &quot;I corrected this because I agree that that is a spelling mistake&quot; or something asinine like that",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:09): 65325d50b2e25aca54bc871b89758c9c: why does a bug have to include at least one fix suggestion?",
        "ab7faae5d7b250ea8606486575f8f79c (11:09): 65325d50b2e25aca54bc871b89758c9c: &quot;settled amicably, If spec&quot; - s/,/./",
        "65325d50b2e25aca54bc871b89758c9c (11:09): 69b0d3dfe919a6b860a9fac82de52a7e: for trivial typos where you accept the comment, no rationale is needed; would you like me to clarify explicitly?",
        "65325d50b2e25aca54bc871b89758c9c (11:09): b8810fee2f4a71f849f3f7409546d1d9: it doesn't have to - that's a suggestion",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:09): 65325d50b2e25aca54bc871b89758c9c: nah, just curious",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:10): 65325d50b2e25aca54bc871b89758c9c: also, sample spec text needs to be rewritten anyway to wash away copyright",
        "65325d50b2e25aca54bc871b89758c9c (11:11): b8810fee2f4a71f849f3f7409546d1d9: I can remove that part of the suggestion, but in some cases, short pieces of sample spec text have been useful to 69b0d3dfe919a6b860a9fac82de52a7e",
        "65325d50b2e25aca54bc871b89758c9c (11:11): e.g. the XPath issue",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:11): 65325d50b2e25aca54bc871b89758c9c: oh, OK. in general 69b0d3dfe919a6b860a9fac82de52a7e has discouraged spec text",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:11): the XPath issue was a very rare exception",
        "65325d50b2e25aca54bc871b89758c9c (11:11): I can imagine that in many cases they'll be useful for Manu's HTML+RDFa draft as well",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:11): 65325d50b2e25aca54bc871b89758c9c: ok",
        "65325d50b2e25aca54bc871b89758c9c (11:11): this policy is meant to apply to all deliverables that reach at least Working Draft status",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:12): (with the XPath issue, what happened is that the commentor disagreed on an editorial basis, and I couldn't work out why without seeing what they thought was the right answer.)",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:13): 65325d50b2e25aca54bc871b89758c9c: is Bugzilla flexible enough to let bug reporters change state to CLOSED?",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:14): 65325d50b2e25aca54bc871b89758c9c: also, this doesn't cover anonymous comments from the WHATWG system",
        "65325d50b2e25aca54bc871b89758c9c (11:14): b8810fee2f4a71f849f3f7409546d1d9: if you make an anonymous comment, then it is your choice to either identify yourself in the bug or let it stay in VERIFY whatever the resolution",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:15): 65325d50b2e25aca54bc871b89758c9c: I think you need a cutoff timeout for 5.b. Otherwise, there will be huge permathreads on when we can stop waiting.",
        "65325d50b2e25aca54bc871b89758c9c (11:15): b8810fee2f4a71f849f3f7409546d1d9: I am sure MikeSmith can do the necessary bugzilla magic, but if not we can tweak that step",
        "65325d50b2e25aca54bc871b89758c9c (11:15): b8810fee2f4a71f849f3f7409546d1d9: all right - I recommend giving that feedback on the list after I post this",
        "65325d50b2e25aca54bc871b89758c9c (11:15): (don't want to make substantial changes right now)",
        "65325d50b2e25aca54bc871b89758c9c (11:15): ab7faae5d7b250ea8606486575f8f79c made the same point and I agree",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:16): If I make that point on the list, there's a risk of a huge permathread right there",
        "65325d50b2e25aca54bc871b89758c9c (11:17): I'm inclined to say you get a month to reply to the editor's disposition but I don't want to change it right now since my co-chairs signed off on the substance of what is there now",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:18): what's 5b?",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:18): isn't that the &quot;nobody replied&quot; state?",
        "65325d50b2e25aca54bc871b89758c9c (11:18): yes",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:19): there's no point having a cut-off for that -- someone not replying until after the cut-off is the same as someone filing a new bug",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:19): in fact in general there's no difference between someone disagreeing and someone filing a new bug",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:19): so there's no point having a cut-off",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:21): in that case, there should be some mechanism for deflecting dupes",
        "a924fb58d2c25874322f4e5126f608b9 (11:22): Is there a consistent meaning to squares, diamonds and ovals?",
        "65325d50b2e25aca54bc871b89758c9c (11:22): dupes should be resolved DUPLICATE unless they contain new information",
        "65325d50b2e25aca54bc871b89758c9c (11:23): rounded rects are start or end points, rectangles are process steps, diamonds are decisions",
        "65325d50b2e25aca54bc871b89758c9c (11:23): per standard flowchart usage",
        "ab7faae5d7b250ea8606486575f8f79c (11:23): notes that the change proposal deadline doesn't particularly important, because you could always raise an identical issue months later and attach your change proposal",
        "ab7faae5d7b250ea8606486575f8f79c (11:23): s/doesn't/doesn't seem/",
        "a924fb58d2c25874322f4e5126f608b9 (11:23): Escalation step 2b doesn't seem like a decision",
        "65325d50b2e25aca54bc871b89758c9c (11:24): oh that's because I forgot to add an arrow pointing to 2a",
        "65325d50b2e25aca54bc871b89758c9c (11:24): fixing...",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:26): What happens if the person who escalated a bug to ISSUE is willing to settle amicably but someone else wants to stir up trouble? does the other person have to restart the whole process?",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:27): there seems to be a loophole in the case where the editor has a co-conspirator:",
        "65325d50b2e25aca54bc871b89758c9c (11:28): then the issue stays RAISED and someone has to make a Change Proposal (presumably not the person who first raised it)",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:28): the co-conspirator escalates an issue, fails to produce a proposal and the issue gets closed and deferred to the next version of HTML",
        "65325d50b2e25aca54bc871b89758c9c (11:28): amicable resolution does not apply if somebody objects, but then it's up to them to drive the issue",
        "a924fb58d2c25874322f4e5126f608b9 (11:28): Maybe there should be an option for bug reporters to close as INVALID if they realize they misunderstood or have been convinced in other channels?",
        "a924fb58d2c25874322f4e5126f608b9 (11:29): Similar to amicable resolution in escalation",
        "65325d50b2e25aca54bc871b89758c9c (11:29): I'm assuming that is allowed, but I guess it could be spelled out more explicitly",
        "65325d50b2e25aca54bc871b89758c9c (11:30): b8810fee2f4a71f849f3f7409546d1d9: what's the alternative - that someone else would have escalated it later when they had more time to write a Change Proposal?",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:30): 65325d50b2e25aca54bc871b89758c9c: right",
        "65325d50b2e25aca54bc871b89758c9c (11:30): b8810fee2f4a71f849f3f7409546d1d9: multiple people can volunteer to make a Change Proposal, so to do that someone would have to lie about their intent to make one and convince others that it's one they will like",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:31): 65325d50b2e25aca54bc871b89758c9c: true",
        "a924fb58d2c25874322f4e5126f608b9 (11:31): Well, with the right timing, maybe the people who care are all busy with other proposals, or on vacation, or something :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:32): 65325d50b2e25aca54bc871b89758c9c: shouldn't Proposal Details be required to come with a copyright waiver?",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:33): or a super-permissive license, rather",
        "65325d50b2e25aca54bc871b89758c9c (11:33): I'm going to assume no one is going to escalate in bad faith - if we caught someone doing that, we'd likely treat it as a de facto amicable resolution (leaving someone else free to re-raise the issue or object or whatever)",
        "65325d50b2e25aca54bc871b89758c9c (11:33): we'd probably also have a stern talk with their AC rep",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:33): what if they _are_ the AC rep? :-)",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:34): (i don't understand the issue, personally. Why can't someone just write a proposal later, when they feel like it?)",
        "a924fb58d2c25874322f4e5126f608b9 (11:34): What if they're an IE?",
        "65325d50b2e25aca54bc871b89758c9c (11:34): sure, anyone can write a proposal later - it can still be considered, it just won't be a blocker to wait for it",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:35): 65325d50b2e25aca54bc871b89758c9c: oh does the decision to defer to the next version of HTML get reversed if someone else re-escaletes the same issue?",
        "65325d50b2e25aca54bc871b89758c9c (11:36): b8810fee2f4a71f849f3f7409546d1d9: I guess it's not very crisply defined as written",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:36): there's no way to prevent that, as far as i can see; someone can always claim that the issue they are raising is subtly different",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:36): (which is fine)",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:36): ok, index is checked in. File bugs if you find any. I'm going to bed. nn.",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:37): ok. in that case, the process isn't vulnerable to trying to pre-empt decision by getting them deferred but the process is vulnerable to Denial of Productivity escalation flood",
        "65325d50b2e25aca54bc871b89758c9c (11:37): a924fb58d2c25874322f4e5126f608b9: if you don't mind saying, what's your real world name (so I can credit you for finding a mistake in my commit message)",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:37): which may be something that isn't worth fixing unless a flood happens",
        "a924fb58d2c25874322f4e5126f608b9 (11:37): 65325d50b2e25aca54bc871b89758c9c: Magnus Kristiansen",
        "65325d50b2e25aca54bc871b89758c9c (11:38): b8810fee2f4a71f849f3f7409546d1d9: the intent is that for your escalation flood to really have an effect, you have to do some work - someone re-raising the same timed-out issue over and over would be bad-faith behavior though, which we'd have to address if someone did it",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:38): 65325d50b2e25aca54bc871b89758c9c: OK.",
        "65325d50b2e25aca54bc871b89758c9c (11:38): I think I'm going to mail this to public-html, if there are no more obvious typos",
        "ab7faae5d7b250ea8606486575f8f79c (11:44): 65325d50b2e25aca54bc871b89758c9c: I think there's a big typo - you accidentally wrote whole pages of text, instead of &quot 69b0d3dfe919a6b860a9fac82de52a7e decides everything.&quot;",
        "65325d50b2e25aca54bc871b89758c9c (11:44): lol",
        "a924fb58d2c25874322f4e5126f608b9 (11:45): So how does the process ensure that someone defined D.E. before a WG decision is made?",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:46): a924fb58d2c25874322f4e5126f608b9: excellent point",
        "cc097e0d7183ae8436e7df709553c8c0 (11:47): D.E. == Dead End?",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:47): hehe",
        "cc097e0d7183ae8436e7df709553c8c0 (11:51): 65325d50b2e25aca54bc871b89758c9c: you have both &quot;Full Working Group&quot; and &quot;full Working Group&quot;",
        "65325d50b2e25aca54bc871b89758c9c (11:52): the Full shouldn't be capitalized",
        "65325d50b2e25aca54bc871b89758c9c (11:52): thanks"
    ],
    "person_ids": [
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "040342c014ffc1c11592948bd92e3721",
        "ab7faae5d7b250ea8606486575f8f79c",
        "65325d50b2e25aca54bc871b89758c9c",
        "cc097e0d7183ae8436e7df709553c8c0",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "a924fb58d2c25874322f4e5126f608b9"
    ]
}