{
    "id": "6dd4c8f7acbf0fa125b41e90ecb2c9a1",
    "messages": [
        "88e1e1ca208e047be09ac68302716180 (03:01): splitscreen, indeed... but everyone knows that blue bikesheds are the best anyway",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:06): daveBSD: he is right on almost everything",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:07): from my strictly user point of view",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:13): hmmm few more months and i am gona fork netbsd, or my name is not milosn",
        "da4b3f65b028919e90489950ccac6745 (03:17): hmm, I'm quite exited about how my current efforts to improve the scheduler will be treated and if I'll make similar experiences like jmmv did.",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:19): dsieger: Sheduler is one of important works. We will support you :)",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:19): In fact, I don't understand why developers don't do anything.",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:20): dont do?",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:20): in what way?",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:20): Instead of writing letters to blog, they should write to TNF and core. And write not solitary, but together.",
        "8d102cab8535e4a2d9e4ef284cd63b16 (03:21): really they have to do both, otherwise they could easily be ignored",
        "da4b3f65b028919e90489950ccac6745 (03:22): Unex: Until now all the guys from core and tech-kern were really friendly and supportive. This gives hope :)",
        "8d102cab8535e4a2d9e4ef284cd63b16 (03:22): what's wrong with the scheduler?",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:22): nothing is wrong, just it can be better",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:24): jakllsch: Exactly. I see three developers in comments, with Julio four.",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:24): anyway, its very clear that the ppl that dont percive netbsd as some firmware base for some future &quot;embeded&quot; device are slowely droping off",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:24): Four developers - is a power. But right now they are only &quot;agreeing&quot;..",
        "9c2a560494c292580ef6bf6f74608a3e (03:26): hi all",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:26): hmmm",
        "8d102cab8535e4a2d9e4ef284cd63b16 (03:27): so, is the part of the community that's a hardcore console user going to be large enough to support themselves?",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:27): slowely but surely, netbsd will be the most portable CPU driver with sporadic disk devices support",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:27): :D",
        "8d102cab8535e4a2d9e4ef284cd63b16 (03:31): so, what direction/goal is there to take/aim for?",
        "8d102cab8535e4a2d9e4ef284cd63b16 (03:32): portability and clean, abstracted design still seem enough for me.",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:35): jakllsch: clean, anstracted design ~= portability",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:36): in a tank full of fish, where magic hand apears and throws food from time to time, netbsd is the fish the willingly sits at the bottom and waits for some of the food to fall down after beeing missed by other fish",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:36): jakllsch: But I agree with Julio that portability is not a goal in these days. In fact, I think that portability should be result, not a goal at all.",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:37): that might have worked 10 years ago, but fish above have grown much :)",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:37): eating all the food",
        "da4b3f65b028919e90489950ccac6745 (03:37): I think there are quite a few things that could easily be done to attract more developer to NetBSD.",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:38): Well, it cannot be done without some hype.",
        "da4b3f65b028919e90489950ccac6745 (03:38): But there seems to be rather few motivation to actually _do_ something about that.",
        "8d102cab8535e4a2d9e4ef284cd63b16 (03:38): no, no hype",
        "da4b3f65b028919e90489950ccac6745 (03:38): Unex: I don't think hype is required.",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:38): completely is",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:39): jakllsch, dsieger: It is required.",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:39): fish above developed magnet like capabilities",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:39): Even OpenBSD does that. But look at they sys/kern - only syncs from our kernel.",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:40): now they even make food go towards them, they dont run after it any more",
        "da4b3f65b028919e90489950ccac6745 (03:41): Unex: Ok, hype might be required. But not to attract more end-users, IMHO.",
        "c24781797c98640feb74dfa85104daaf (03:41): dsieger: why not?  Give the [typical] end user one good reason to use NetBSD over GNU/Linux?",
        "8d102cab8535e4a2d9e4ef284cd63b16 (03:42): it's better.",
        "8d102cab8535e4a2d9e4ef284cd63b16 (03:42): :]",
        "c24781797c98640feb74dfa85104daaf (03:42): jakllsch: yeah, just like Windows is.  That's not an argument.",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:42): dsieger: We NEED users. All trade is based on user needs.",
        "da4b3f65b028919e90489950ccac6745 (03:43): tp76: Problem is: The typical end user can easily name a bunch of things missing in NetBSD in comparison to Linux, for example.",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:43): its strange how ppl dont seem to see the link beetwen hype and progress",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:43): It's same for open-idealistic projects like *BSD.",
        "da4b3f65b028919e90489950ccac6745 (03:43): tp76: And I don't believe NetBSD will ever be capable to catch up in such a feature contest.",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:43): dsieger: Well, FreeBSD made a hypo as desktop OS. We shouldn't do that.",
        "8d102cab8535e4a2d9e4ef284cd63b16 (03:44): I don't want all the &quot;progress&quot; other peopel want.",
        "c24781797c98640feb74dfa85104daaf (03:44): dsieger: neither do I, so what are we supposed to sell them, then?",
        "da4b3f65b028919e90489950ccac6745 (03:44): Unex: Exactly",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:44): IMHO, our direction is to servers.",
        "c24781797c98640feb74dfa85104daaf (03:44): dsieger: &quot;it's better&quot; simply won't cut it ;)",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:44): We can do a hype as &quot;perfect server OS&quot; ;)",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:44): well that what i am saying, anybody that doesnt percive netbsd as most portable CPU driver is slowely droping of",
        "c24781797c98640feb74dfa85104daaf (03:44): dsieger: nor is &quot;it'll run on your toaster&quot;.",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:45): jakllsch: Yes, and we cannot do physically - we haven't enought workers.",
        "da4b3f65b028919e90489950ccac6745 (03:45): Unex: The server niche is already occupied by FreeBSD.",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:45): That's why our direction shouldn't be to desktops. NetBSD never be a better desktop than bloated but easy Linux distribution.",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:46): dsieger: We can takeover that :P",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:46): dsieger: heh things change is months",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:46): not to mention years",
        "8d102cab8535e4a2d9e4ef284cd63b16 (03:46): I really want a os that can do a little bit of everything relatively well.",
        "da4b3f65b028919e90489950ccac6745 (03:46): Unex: I always perceived NetBSD as a stable research and development platform. Maybe there is more we can do in this direction.",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:46): problem is, noone even states that as a goal",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:46): actualy there is ni goal",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:47): except to sit on a bottom of the tank",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:47): dsieger: Look at simple user - he lookas than NetBSD prefix is &quot;Net&quot; and thinks that this system is good for networking. I heard that even from more experienced Linux user (which, of course, never touched BSD).",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:47): Unex: i thought the same, few years back :)",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:47): funny or not",
        "da4b3f65b028919e90489950ccac6745 (03:48): milosn: Maybe the lack of direction should be communicated more clearly and _concentrated_ towards core and TNF...",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:48): dsieger: Yes, agree. I think TNF can do more work to NetBSD integration in embedded platforms.",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:49): dsieger: i am just a user, for last 3-4 years hanging around ... i got no clue how things work",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:49): IMHO, that should be conversations with commercial companies.",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:49): another issue also",
        "8d102cab8535e4a2d9e4ef284cd63b16 (03:49): that doesn't always benifit end-users",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:49): :)",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:51): Anyway, we can talk about this long.. But it means nothing, while TNF and core don't do anything to change this.",
        "da4b3f65b028919e90489950ccac6745 (03:51): milosn: Me too. That scheduler project is my first serious effort. So, I don't know how things work either :)",
        "c24781797c98640feb74dfa85104daaf (03:52): To get more end users, NetBSD at least needs a fully functional desktop environment (ala GNOME or KDE) so they can perform more or less the same tasks on NetBSD as on any GNU/Linux distribution.  That is, if getting NetBSD on the desktop is a goal.",
        "9c2a560494c292580ef6bf6f74608a3e (03:52): dsieger: as long as it is documented well, so others can learn from it, help you and maybe take it further when you drop it, it is a success imo :)",
        "da4b3f65b028919e90489950ccac6745 (03:53): Unex: Yes, but we also don't give core and TNF the chance to know what we are discussing right here.",
        "c24781797c98640feb74dfa85104daaf (03:53): jakllsch: neither do I.  If I did I'd just run Ubuntu or something.",
        "11dcbf8105451bb7a15317b15a0e60f1 (03:54): jakllsch, tp76: re: &quot;those type&quot; ... /me doesn't care what type, but I wouldn't want to see audio/gfx support go out the window because a server doesn't need either, or a toaster...",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:54): dsieger: I really don't think that is a knowlege problem.",
        "c24781797c98640feb74dfa85104daaf (03:54): The point is getting more people involved in NetBSD.  A functional desktop environment might be one &quot;carrot&quot;.",
        "da4b3f65b028919e90489950ccac6745 (03:55): tp76: fvwm is _very_ functional ;)",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:55): tp76: We should orientate to admins, researchers, developers, etc. - not desktop users.",
        "da4b3f65b028919e90489950ccac6745 (03:56): tp76: Don't take that one too serious.",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:56): but again, noone will care",
        "c24781797c98640feb74dfa85104daaf (03:56): dsieger: I do like fvwm but I don't think the average end-user would appreciate it too much ;-)",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:57): milosn: Suggest Slackware owner move to pkgsrc ;))",
        "c24781797c98640feb74dfa85104daaf (03:57): Unex: then the developers should agree that getting NetBSD on the desktop is not a goal and stop wasting time trying.",
        "11dcbf8105451bb7a15317b15a0e60f1 (03:57): Unex: for what definition of &quot;desktop user&quot; --- do you mean drop support for gnome (/me wouldn't care), or drop support for creature features like bitmapped displays and audio and consumer peripherals?",
        "da4b3f65b028919e90489950ccac6745 (03:57): tp76: Until a few months ago twm was used as the default &quot;desktop&quot; at our facutly's machines/ :)",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (03:57): yukonbob: Yeah, bitmapped displays and etc. pkgsrc is distict project.",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:58): hmmm 12",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:59): i am sleeping :)",
        "48a4fba2c4916bbc8aae694a3877dca3 (03:59): laters",
        "c24781797c98640feb74dfa85104daaf (04:00): Later, and &quot;thanks for all the fish&quot;.",
        "11dcbf8105451bb7a15317b15a0e60f1 (04:00): Unex: /me wouldn't like that -- besides using Net for development/testing/production-work, I run X, listen to streaming audio, and hobby with audio/gfx production...",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (04:02): Well, may be it's good for you.",
        "11dcbf8105451bb7a15317b15a0e60f1 (04:02): ...it is -- and I bet more people use it like that than developing ABS controllers, or automating toasters.",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (04:04): yukonbob: Yes, but why X? I just ssh mydevserver and working on them.",
        "8d102cab8535e4a2d9e4ef284cd63b16 (04:05): because there's no reason not to?",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (04:05): jakllsch: As I said - GUI enviroment will never be better than i.e. Linux.",
        "11dcbf8105451bb7a15317b15a0e60f1 (04:06): indeed.  If you want a uNetBSD, strip X out --- getting rid of bitmap displays would not help Net --- it'd make it look like it took a giant leap 30 years backward.",
        "c24781797c98640feb74dfa85104daaf (04:06): Unex: but can it be equally functional?",
        "8d102cab8535e4a2d9e4ef284cd63b16 (04:06): If I wanted a GUI, I'd be using MacOS.",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (04:07): I'm not saing that we should stop supporting i.e audio at all. Both in the servers and embedded sector audio could be needed.",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (04:07): But why to waste on, for example, audio mixing (for many channels)? Or something like that..",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (04:08): Ok, if someone needs this - make a patch and send PR.",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (04:08): But I think, for example, sheduler or good locking API is much bigger priority.",
        "c24781797c98640feb74dfa85104daaf (04:08): So you think NetBSD should stop targeting the desktop all together?",
        "11dcbf8105451bb7a15317b15a0e60f1 (04:09): It's not as if somebody who's interesting in making a software mixer will automatically start building a better task scheduler if Net stops supporting any desktop-like facilities.",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (04:09): tp76: Yes. NetBSD never reached something &quot;good&quot; in desktop and never will.",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (04:10): yukonbob: Well, I suggest them to improve i.e. Linux's mixer.",
        "11dcbf8105451bb7a15317b15a0e60f1 (04:11): sending people to other projects won't improve Net, or attract users.",
        "c24781797c98640feb74dfa85104daaf (04:11): Unex: not unless people make it a goal and start working actively towards it.  It probably won't beat GNU/Linux, but at least it should be able to serve as a viable alternative.",
        "11dcbf8105451bb7a15317b15a0e60f1 (04:11): tp76: indeed --- /me finds it _does_",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (04:13): tp76: But why it should? Remember that there is other systems. On of them, fre example, FreeBSD which has bigger developer base.",
        "11dcbf8105451bb7a15317b15a0e60f1 (04:13): I don't need an all-singing, all-dancing desktop with drag/drop --- I have ratpoison to multiplex a Xinerama display, and in fact most of my apps are text-based (mutt, irssi, shells), but that works for me --- and anybody that wants to run OpenOffice, Firefox, Thunderbird can do that --- and have a &quot;desktop&quot;",
        "b85603a5b335b6db9a0c415bcd7a13a4 (04:13): Unex, &quot;Linux Mixer&quot; would be implemented on top of LADSPA or ALSA or JACK or OSS?",
        "c24781797c98640feb74dfa85104daaf (04:14): Unex: why?  To keep NetBSD alive and moving, obviously.",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (04:14): tp76: It is not possible to be good everywhere - neither theoretically, nor pracitaclly.",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (04:14): As I said, it is not possible at all with this developers count.",
        "da4b3f65b028919e90489950ccac6745 (04:14): Hmm, maybe it's a completely stupid idea, but what about setting up something like a &quot;Letter to Core&quot; at wiki.onetbsd.org. Maybe it would be possible to formulate some of the concerns NetBSD users and developers have more clearly. OTOH, maybe I should shut up and go to bed right now :)",
        "c24781797c98640feb74dfa85104daaf (04:15): Unex: no, but you can be very good at some points and sufficient at others.  In this case, sufficient could be the desktop.  I like a good desktop.  Hell, I even like GNOME.  If I can't have a decent desktop on my workstation, I'll use another OS.",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (04:15): IMHO it's a one of open source problem - doing much, doing same, and doing in all four ways.",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (04:16): We should do what we can do good. And let other do what they can do good.",
        "11dcbf8105451bb7a15317b15a0e60f1 (04:16): the developer-count is the result of a systemic problem, though, which has nothing to do with whether net is a desktop... isn't the big issue of last few months backroom deals and politics --- no so much to do with actual development",
        "11dcbf8105451bb7a15317b15a0e60f1 (04:16): ?",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (04:18): dsieger: Well, I don't think it changes something. I see the one way - real letter to TNF core, CC'ed to netbsd-users with many developers signature.",
        "c24781797c98640feb74dfa85104daaf (04:19): dsieger: trying to communicate is a good idea, as it seems rather lacking these days.  However, there must be some consensus as to what should be communicated.",
        "da4b3f65b028919e90489950ccac6745 (04:19): Unex: That's exactly what I had in mind. I would use the wiki only to get some input to formulate such a letter in the end.",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (04:20): dsieger: First step should be private letters to developers, IMHO.",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (04:21): Otherwise it probably be same as now - &quot;clapping&quot; with eyes :)",
        "da4b3f65b028919e90489950ccac6745 (04:22): Unex: Might be the right way.",
        "11dcbf8105451bb7a15317b15a0e60f1 (04:22): how does the core group come to be? Who elects/appoints them?",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (04:23): Should be voted? Good question.",
        "da4b3f65b028919e90489950ccac6745 (04:25): Unex: Problem is: *Someone* with sufficient knowledge and reputation would have to initiate such a thing.",
        "c24781797c98640feb74dfa85104daaf (04:25): dsieger: you could always try to have Torvalds converted ;p",
        "da4b3f65b028919e90489950ccac6745 (04:26): tp76: No, thanks. ;)",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (04:28): dsieger: Well, I liked first Hannum mail. But as shown later, he was more destructive..",
        "1671f6bd3bcf7f834512fc2d93e7fab6 (04:30): But I think enough count of initiative developers would be better.",
        "da4b3f65b028919e90489950ccac6745 (04:34): Ok, I need some sleep now. Good night.",
        "c24781797c98640feb74dfa85104daaf (04:34): Good night."
    ],
    "person_ids": [
        "88e1e1ca208e047be09ac68302716180",
        "48a4fba2c4916bbc8aae694a3877dca3",
        "da4b3f65b028919e90489950ccac6745",
        "1671f6bd3bcf7f834512fc2d93e7fab6",
        "8d102cab8535e4a2d9e4ef284cd63b16",
        "9c2a560494c292580ef6bf6f74608a3e",
        "c24781797c98640feb74dfa85104daaf",
        "11dcbf8105451bb7a15317b15a0e60f1",
        "b85603a5b335b6db9a0c415bcd7a13a4"
    ]
}