{
    "id": "6de0edc051ceab90b0e0dc87f984d759",
    "messages": [
        "042dd99eb0ff8653814e445ca0093427 (01:06): grr ... why is offline GMail a Chrome app and not a Web app? https://chrome.google.com/webstore/detail/ejidjjhkpiempkbhmpbfngldlkglhimk",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:11): More general: why doesn't the Chrome Web Store support other browsers?",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:11): &quot;Sorry, we don't support your browser just yet. You'll need Google Chrome to install apps, extensions and themes.&quot;",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:11): That makes it sound like they intend to add support eventually, but . . .",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:14): I imagine they will add support for other browsers eventually, since to do otherwise seems inconsistent with their general approach to the web.  But it's pretty annoying that they seem not to view that as urgent.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:14): has no more idea than anyone what the Chrome Web Store or Gmail people are thinking, obviously",
        "042dd99eb0ff8653814e445ca0093427 (01:15): who knows, but there must certainly be a huge temptation to follow Apple and Microsoft into proprietary app stores",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:16): Why?  Google makes virtually all its money off ads, and Firefox displays ads as well as Chrome does.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:17): What money it does make directly off the store will only be increased if it allows more browsers to use it.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:18): Unlike Microsoft and Apple, Google doesn't have a history of trying to obtain lock-in, and in fact has often tended to do the opposite -- make switching to other services as easy as possible.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:18): E.g., Gmail supports unlimited forwarding, IMAP, etc. out of the box, which (AFAIK) some other major webmail providers don't.",
        "042dd99eb0ff8653814e445ca0093427 (01:19): yeah, they've been good",
        "042dd99eb0ff8653814e445ca0093427 (01:19): but if they get lots of good stuff into the Chrome app store, then that increases Chrome usage",
        "042dd99eb0ff8653814e445ca0093427 (01:20): and that translates into power over the Web, and app developers",
        "06cb330920ae58e1614c9145d983b3d6 (01:20): google's mobile browser support has been terrible for web apps, in my experience",
        "06cb330920ae58e1614c9145d983b3d6 (01:20): seems like they really don't care",
        "042dd99eb0ff8653814e445ca0093427 (01:21): we'll see how things go down",
        "06cb330920ae58e1614c9145d983b3d6 (01:21): just trying to implement a basic full-screen web app in android's browser (at least as of 2.3.x) is a nightmare",
        "042dd99eb0ff8653814e445ca0093427 (01:22): but I really want offline GMail and I don't want to have to switch to Chrome to get it (nor do I want other people to have to switch to Chrome to get it, of course)",
        "06cb330920ae58e1614c9145d983b3d6 (01:22): &quot;installed web apps&quot; should be considered an oxymoron",
        "06cb330920ae58e1614c9145d983b3d6 (01:23): all of the &quot;chrome apps&quot; and all that nonsense just kills what's great about web apps",
        "042dd99eb0ff8653814e445ca0093427 (01:30): offline GMail uses WebSQL, which is dead as a standard",
        "06cb330920ae58e1614c9145d983b3d6 (01:30): (because using a language that every programmer in the world already intuitively understands is overrated; we Need More Wheels)",
        "bdf7d7409da19264fa0c4bf6b4f2d0cc (01:33): the new offline gmail uses websql? i thought it just used filesystem (although i'm not directly involved)",
        "042dd99eb0ff8653814e445ca0093427 (01:33): in fact, the &quot;SQL&quot; every programmer in the world intuitively understands is different things to different people and often quite different to the SQLite 3.6.19 or whatever that WebSQL is",
        "042dd99eb0ff8653814e445ca0093427 (01:33): bdf7d7409da19264fa0c4bf6b4f2d0cc: khuey looked at it and that's what he says",
        "042dd99eb0ff8653814e445ca0093427 (01:33): but regardless of the detabable merits of WebSQL, its deadness as a standard is a fact",
        "bdf7d7409da19264fa0c4bf6b4f2d0cc (01:34): good thing offline gmail isn't part of the web, then",
        "042dd99eb0ff8653814e445ca0093427 (01:35): two wrongs don't make a right",
        "06cb330920ae58e1614c9145d983b3d6 (01:35): 042dd99eb0ff8653814e445ca0093427: it doesn't matter if it's different in the details, the basic language (and most of the day-to-day as well) is well-understood, which makes learning variants easy",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:35): 042dd99eb0ff8653814e445ca0093427, there's not any realistic alternative, though, given the low adoption so far of IDB.  Not to mention the fact that it's staggeringly complicated to use for even the most trivial use-cases.",
        "bdf7d7409da19264fa0c4bf6b4f2d0cc (01:35): i have no idea what lead to that decision",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:35): One line of localStorage that's instantly understandable to any web developer is so many lines of IDB that I've given up every time I tried it.",
        "042dd99eb0ff8653814e445ca0093427 (01:36): 88d4d34a8064a4ff39fd5e144eea7762: it is supported in Chrome though, so if you're going to write a Chrome app ...",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:36): Well, true.",
        "06cb330920ae58e1614c9145d983b3d6 (01:36): (similar to a major reason svn was so successful: it was very intuitive to cvs users, so you only had to learn the differences, where eg. git being so different gives it a much higher learning curve)",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:36): But I suspect it's a lot harder to learn and use, especially given that anyone writing this sort of app already knows some sort of SQL.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:37): At least, I'm pretty sure I could pick up WebSQL a heck of a lot more easily.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:37): I wouldn't be surprised if WebSQL has way more features and better performance at this point, too.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:38): Not that I'm saying people should use WebSQL instead of IDB, but there are pretty clear reasons for doing so.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:42): Does anyone know if there's a Mozilla bug for supporting Node.contains()?",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:42): If not, I'll file one.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:43): Found it: https://bugzilla.mozilla.org/show_bug.cgi?id=683852",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:45): Okay, does anyone know what the status of my reflection tests are in the HTMLWG?",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:45): They're still not &quot;approved&quot;, it seems?"
    ],
    "person_ids": [
        "042dd99eb0ff8653814e445ca0093427",
        "88d4d34a8064a4ff39fd5e144eea7762",
        "06cb330920ae58e1614c9145d983b3d6",
        "bdf7d7409da19264fa0c4bf6b4f2d0cc"
    ]
}