{
    "id": "6f235545d934216d42b454f57b6b5745",
    "messages": [
        "7d8439a26ae8a60160b3ccd92aec2595 (18:23): Ideally you only have one config file. Normally I do.",
        "a15ee8fed1f5065527e360817de91347 (18:23): Has anyone here tried coding a text-based RPG in php?  I'm planning out how, but between PHP and AJAX, I would be doing who knows how many queries per second as the script got more advanced.. is there some more efficient method around?",
        "3344192ac8b8c9a0f9bc5a11b73f42a3 (18:23): MarkR42, what do you do with the config files, they just stay in one place?",
        "dff290b3f8ee85fd8f07c425960370a4 (18:23): anyone know of a simple way to obfuscate a mail() function?",
        "b9ddfe47929d858676e673069528fa16 (18:24): MaartenB: I do, on the dev sites",
        "dff290b3f8ee85fd8f07c425960370a4 (18:24): essentially I don't want the client to know I'm being mailed, as this is spec work, I don't want theivery",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:24): MaartenB: I have a file called server_config.php which is include()'d - it just define()s stuff like database, emails, options etc. This is different in dev / staging / production and is never moved between them.",
        "3344192ac8b8c9a0f9bc5a11b73f42a3 (18:24): ok, I see",
        "3344192ac8b8c9a0f9bc5a11b73f42a3 (18:24): I try to set it up like that too, it sounds good",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:25): For example, in dev and staging, I have a define which causes a yellow label to appear on the site saying &quot;dev&quot; or &quot;staging&quot;",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:25): Also in dev, all emails go to me rather than their intended recipient",
        "3344192ac8b8c9a0f9bc5a11b73f42a3 (18:25): where is staging for?",
        "3344192ac8b8c9a0f9bc5a11b73f42a3 (18:25): that is nice too, I once ended up mailing customers from dev :)",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:25): Staging is really to demo stuff to the client before it goes live, and test major new releases on the production server without putting it on the production site",
        "3344192ac8b8c9a0f9bc5a11b73f42a3 (18:26): ok",
        "946490ad0fdc17b3b899760a445128f0 (18:26): setting up Eclipse with PHP on windows. Do I need/want web tools (wtp) for PHP development?",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:26): I don't put every new revision up on staging, some go straight from dev -&gt; live",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:26): likewise, I don't always put every new revision up on live, some only ever go as far as staging",
        "3480499ed5400b46c87156549e494972 (18:27): theDan: just don't do it - you'll be wasting bandwidth",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:27): MaartenB: Of course one should never have production data in a dev / staging database; however, to avoid confusion I also usually have all mails go to me.",
        "a15ee8fed1f5065527e360817de91347 (18:27): Drakas: Yeah, I figured, but I want something _fun_ to code :)",
        "3480499ed5400b46c87156549e494972 (18:27): (a  lot of it)",
        "3480499ed5400b46c87156549e494972 (18:27): theDan: you can always build your own client",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:27): theDan: There are a lot of issues with such a game, but it can probably be done",
        "3480499ed5400b46c87156549e494972 (18:27): theDan: and make a php socket server for the RPG",
        "3480499ed5400b46c87156549e494972 (18:27): it will always would save bandwidth and ajax complexity and the load on EVERYTHING",
        "b9ddfe47929d858676e673069528fa16 (18:28): MarkR42: I assume that you mean that you shouldn't have the dev site operating on the live database",
        "3480499ed5400b46c87156549e494972 (18:28): i agree with MarkR42 ; It can be done - but it would be so inefficient, theDan",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:28): DShadow: No, I mean that the dev site shouldn't have (sensitive) production data in its database - even though it has a different database",
        "3344192ac8b8c9a0f9bc5a11b73f42a3 (18:29): thanks for your info MarkR42 , I have a lot to do :)",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:29): Hence real users will never receive emails from the dev site, even if I switch the emails to live mode",
        "b9ddfe47929d858676e673069528fa16 (18:29): I'll have to disagree with you on that one. Our testing procedures includes copying the entirety of the live database over to the dev site.",
        "b9ddfe47929d858676e673069528fa16 (18:29): otherwise, how can you really test it to compare and make sure that it still works as expected?",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:29): That is tricky. Carefully.",
        "a15ee8fed1f5065527e360817de91347 (18:29): Well, I guess coding an RPG is out, thanks for the input :)",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:30): I might occasionally make a &quot;sanitised&quot; version of the production data with all personal data removed",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:30): theDan: No, I don't think so",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:30): theDan: It *CAN* be done and the ajax bit is not really the tricky bit. The gameplay is however.",
        "b9ddfe47929d858676e673069528fa16 (18:30): yeah, I might do that if we had personal data in the db",
        "74c66b3a2fd36092e165eb8f56a0bbc3 (18:30): theDan: i've done it before",
        "74c66b3a2fd36092e165eb8f56a0bbc3 (18:31): theDan: and if your looking to have some fun, but not a really serious project - go for it",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:31): Ok, if you have no sensitive data in the db, don't worry about it. Or if all the data belongs to you personally, fine. But if it's other peoples' data, that is tricky.",
        "3480499ed5400b46c87156549e494972 (18:32): theDan: i think you'd be best off with building a php server and a php client for that; both run from cli, the client could use php-gtk or whatever ;) but doing it in a browser+php-cgi will be resource hungry",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:33): Drakas: I disagree, doing it in browser+php is probably not too bad, but there are many issues. It would certainly be easier for users as they don't have aything to install",
        "74c66b3a2fd36092e165eb8f56a0bbc3 (18:33): theDan: depends what kind of RPG you want... something like kingdom of loathing - you could do with it, but if its real-time... it could be really difficlt (note: KoL uses AJAX)",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:33): I'm sure that a tick-based RPG is quite feasible",
        "a5fa15b2f4265fdcd550bb985266a68b (18:34): pff",
        "74c66b3a2fd36092e165eb8f56a0bbc3 (18:35): absolutely, i was under the impression by RPG you ment a client/server configuration... a tick-based RPG would be just fine",
        "3480499ed5400b46c87156549e494972 (18:35): MarkR42: for one move, you'd have to send around at least 500 bytes of data, or really more",
        "3480499ed5400b46c87156549e494972 (18:35): this is browser dependent.",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:35): Well, only if you send all the data for a move in one go. Also, how often are they going to happen? Not too frequently I imagine.",
        "3480499ed5400b46c87156549e494972 (18:35): if you do something customly, not using HTTP - then you can send data at 50bytes etc. ;)",
        "3480499ed5400b46c87156549e494972 (18:36): MarkR42: well, true",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:36): Obviously not having server-push in AJAX is tricky. I did try to implement it (and succeeded) but the PHP was pretty nasty and I have a feeling it wouldn't scale very well.",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:36): Using the &quot;continuously loading http request&quot; method, which is nasty",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:36): Even in Mozilla with its true server-push XMLHttpRequest it's still nasty on the server-side",
        "74c66b3a2fd36092e165eb8f56a0bbc3 (18:37): if AllanW would come about anymore.... he wrote on hellauva RPG in PHP.... call Talluria",
        "74c66b3a2fd36092e165eb8f56a0bbc3 (18:37): s/call/called/",
        "3480499ed5400b46c87156549e494972 (18:39): MarkR42: But i suppose you was using mod_php, while web servers have php-cgi too, which works per-request :( here's a problem",
        "3480499ed5400b46c87156549e494972 (18:40): ^^ (i am not sure)",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:40): Drakas: It should work either way, but the overhead of loading php-cgi is higher. I used a complicated system of server-side unix sockets blocking to synchronise requests, it was icky. It would still work in cgi though. Also, I used long-lived http requests so it might not be so bad.",
        "3480499ed5400b46c87156549e494972 (18:41): MarkR42: oh dear, how long did you work on that? do you have any code?:O",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:41): Drakas: Only a chat client, an hour or two. Yes I do have some code but it probably doesn't work well",
        "3480499ed5400b46c87156549e494972 (18:42): can i have a look?",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:44): Drakas: Ok, I just tested it, it still works apparently.",
        "3480499ed5400b46c87156549e494972 (18:45): cool",
        "74c66b3a2fd36092e165eb8f56a0bbc3 (18:46): alrighty... i'm board, i'm going to go watch some soccer",
        "7d8439a26ae8a60160b3ccd92aec2595 (18:46): Drakas: Uploading now, I'll PM you the URL",
        "3480499ed5400b46c87156549e494972 (18:47): yeah, great:)"
    ],
    "person_ids": [
        "7d8439a26ae8a60160b3ccd92aec2595",
        "a15ee8fed1f5065527e360817de91347",
        "3344192ac8b8c9a0f9bc5a11b73f42a3",
        "dff290b3f8ee85fd8f07c425960370a4",
        "b9ddfe47929d858676e673069528fa16",
        "946490ad0fdc17b3b899760a445128f0",
        "3480499ed5400b46c87156549e494972",
        "74c66b3a2fd36092e165eb8f56a0bbc3",
        "a5fa15b2f4265fdcd550bb985266a68b"
    ]
}