{
    "id": "70e3a6dd79668781f9add454dbff38be",
    "messages": [
        "65325d50b2e25aca54bc871b89758c9c (23:18): So is anyone going to write a counter-proposal for &quot;keep microdata in the main spec&quot;?",
        "65325d50b2e25aca54bc871b89758c9c (23:18): deadline is in 2 days",
        "66b0d785bfa15d051888c24dabba7342 (23:18): what happens if we don't?",
        "65325d50b2e25aca54bc871b89758c9c (23:18): or I can extend it if anyone volunteers to do it and names a specific deadline",
        "65325d50b2e25aca54bc871b89758c9c (23:19): chairs will likely post a CfC resolution to split it out",
        "66b0d785bfa15d051888c24dabba7342 (23:19): won't that just be forced to a vote?",
        "66b0d785bfa15d051888c24dabba7342 (23:19): has not read any of the process documents",
        "66b0d785bfa15d051888c24dabba7342 (23:20): do you think a counter-proposal is likely to change the outcome of the chairs' decision?",
        "66b0d785bfa15d051888c24dabba7342 (23:22): and can we expect that the chairs will provide actual arguments for the decision?",
        "dddbb966009bf3f66ba0270cc9762806 (23:26): If necessary, I volunteer for it.  But I'd like to see the answers to 66b0d785bfa15d051888c24dabba7342's questions too.",
        "dddbb966009bf3f66ba0270cc9762806 (23:26): ^^^ 65325d50b2e25aca54bc871b89758c9c",
        "65325d50b2e25aca54bc871b89758c9c (23:27): 66b0d785bfa15d051888c24dabba7342: if the CfC draws no objections, it will stand",
        "66b0d785bfa15d051888c24dabba7342 (23:27): 65325d50b2e25aca54bc871b89758c9c: but it will, and then what?",
        "65325d50b2e25aca54bc871b89758c9c (23:28): 66b0d785bfa15d051888c24dabba7342: if there are objections that do not have rationale, or have only weak rationale, then we will decide based on which position has the stronger rationale if that seems clear",
        "65325d50b2e25aca54bc871b89758c9c (23:28): 66b0d785bfa15d051888c24dabba7342: voting would be a last resort if the arguments on both sides seem well-balanced",
        "66b0d785bfa15d051888c24dabba7342 (23:29): ok, so basically the end result is going to be a vote, because neither side is going to give up",
        "65325d50b2e25aca54bc871b89758c9c (23:29): I think if there is a good rationale for keeping it in, it's worth writing it up now rather than expressing it piecemeal as objections to a consensus resolution",
        "fd9ef1223e855714294498ebfde79f98 (23:29): so what's the difference between emailing rationale for keeping microdata in the spec before the deadline as a counter-proposal vs. afterwards as a CfC objection?",
        "65325d50b2e25aca54bc871b89758c9c (23:31): one possible difference is that if you plan ahead, you may come up with something more coherent",
        "66b0d785bfa15d051888c24dabba7342 (23:31): sigh",
        "4e528aa62dacc1d204b6b9a06e317317 (23:31): 65325d50b2e25aca54bc871b89758c9c: while we're on the topic, what's the practical difference between an issue getting no change proposals, and an issue getting one change proposal requesting the status quo?",
        "65325d50b2e25aca54bc871b89758c9c (23:32): another possible difference is that it may be more persuasive to observers to write something up front than to object at the last minute",
        "66b0d785bfa15d051888c24dabba7342 (23:32): this process isn't very spam-proof if it forces people to do lots of work to fend off any proposal",
        "65325d50b2e25aca54bc871b89758c9c (23:32): 4e528aa62dacc1d204b6b9a06e317317: getting no change proposals, it would be closed without prejudice",
        "65325d50b2e25aca54bc871b89758c9c (23:33): 4e528aa62dacc1d204b6b9a06e317317: getting one requesting the status quo would keep the issue open, and may result in that Change Proposal getting adopted, unless its existence motivates somebody to write one requesting an actual change",
        "65325d50b2e25aca54bc871b89758c9c (23:33): 4e528aa62dacc1d204b6b9a06e317317: if a status quo Change Proposal does get adopted though, then it would be a decision of the working group and not merely a closed-without-prejudice situation",
        "65325d50b2e25aca54bc871b89758c9c (23:33): i.e. at that point the issue would be closed with prejudice",
        "4e528aa62dacc1d204b6b9a06e317317 (23:34): so if an issue is not getting any change proposals it's better to wait til the last minute and then submit a status-quo change proposal than to not do anything, because that would automatically force a decision to keep the spec as is?",
        "65325d50b2e25aca54bc871b89758c9c (23:34): 66b0d785bfa15d051888c24dabba7342: I think the chairs will review quality of Change Proposals before insisting on replies - I think the requirement to do a significant chunk of writing is a sufficient spam deterrent",
        "4e528aa62dacc1d204b6b9a06e317317 (23:34): (assuming one supports the status quo)",
        "65325d50b2e25aca54bc871b89758c9c (23:35): 4e528aa62dacc1d204b6b9a06e317317: once an issue has a Change Proposal, it stays open until the chairs take some action, with no specific deadline",
        "4e528aa62dacc1d204b6b9a06e317317 (23:35): oh",
        "4e528aa62dacc1d204b6b9a06e317317 (23:35): so what's the dec 2 deadline about for microdata?",
        "65325d50b2e25aca54bc871b89758c9c (23:35): 4e528aa62dacc1d204b6b9a06e317317: so doing that would extend the deadline for anyone else to write a different Change Proposal",
        "4e528aa62dacc1d204b6b9a06e317317 (23:36): man i miss the days of not having the w3c involved in html5",
        "66b0d785bfa15d051888c24dabba7342 (23:36): hypothetically, if the RDFa crowd have their way and get microdata removed, I trust the WHATWG would ignore it and keep it in our version of the spec?",
        "65325d50b2e25aca54bc871b89758c9c (23:36): 4e528aa62dacc1d204b6b9a06e317317: in that case, the chairs have stated an intent to move on if we don't get any alternate proposals by that date",
        "4e528aa62dacc1d204b6b9a06e317317 (23:37): 66b0d785bfa15d051888c24dabba7342: it'd be in the complete.html file, for sure",
        "4e528aa62dacc1d204b6b9a06e317317 (23:37): 66b0d785bfa15d051888c24dabba7342: it'd probably not be in html5 unless the w3c versin of html5 starts deviating too much from sanity",
        "65325d50b2e25aca54bc871b89758c9c (23:37): I think the W3C would be happy to publish it as a separate spec (afaik no one has objected to that, not even the TAG), and the WHATWG would be welcome to keep it in the WHATWG copy of the HTML5 main spec if that is their preference",
        "66b0d785bfa15d051888c24dabba7342 (23:38): dddbb966009bf3f66ba0270cc9762806, 4e528aa62dacc1d204b6b9a06e317317, are either you interested in investing some time writing a counter-proposal?",
        "dddbb966009bf3f66ba0270cc9762806 (23:39): 66b0d785bfa15d051888c24dabba7342: Yeah, I'll write one.",
        "66b0d785bfa15d051888c24dabba7342 (23:39): I can certainly spend some time too, but if you take ownership of the action (or whatever) that'd be great",
        "65325d50b2e25aca54bc871b89758c9c (23:39): my personal expectation is that if it gets split, the browser bits will still get implemented (I certainly want to see it in WebKit) and the default mode of the validator would likely be HTML+SVG+MathML+Microdata",
        "66b0d785bfa15d051888c24dabba7342 (23:40): are there any other specs which add elements/attributes on top of HTML5 except RDFa?",
        "65325d50b2e25aca54bc871b89758c9c (23:40): there's the proposed profile spec, though that has not made it to FPWD yet",
        "66b0d785bfa15d051888c24dabba7342 (23:40): it seems quite a strange way to write specs",
        "65325d50b2e25aca54bc871b89758c9c (23:41): HTML5 explicitly allows other specs to add elements and attributes",
        "66b0d785bfa15d051888c24dabba7342 (23:41): yes I know",
        "66b0d785bfa15d051888c24dabba7342 (23:41): but so far nothing stable does?",
        "65325d50b2e25aca54bc871b89758c9c (23:41): what counts as &quot;stable&quot;?",
        "66b0d785bfa15d051888c24dabba7342 (23:42): don't know :)",
        "65325d50b2e25aca54bc871b89758c9c (23:42): a truly stable spec could not depend on HTML5 yet",
        "65325d50b2e25aca54bc871b89758c9c (23:42): if the bar is FPWD, then RDFa is the only example I know of",
        "66b0d785bfa15d051888c24dabba7342 (23:42): anything except specs that exist only because the feature was rejected from HTML5",
        "65325d50b2e25aca54bc871b89758c9c (23:44): arguably SVG and MathML also define elements and attributes that extend HTML5, albeit somewhat involuntarily",
        "65325d50b2e25aca54bc871b89758c9c (23:44): (since HTML5 doesn't define the valid set of elements for those languages)",
        "66b0d785bfa15d051888c24dabba7342 (23:44): dddbb966009bf3f66ba0270cc9762806: so you'll write a full proposal before dec 2 or just take the action to extend the deadline?",
        "dddbb966009bf3f66ba0270cc9762806 (23:44): Write a full proposal.",
        "66b0d785bfa15d051888c24dabba7342 (23:44): ok",
        "dddbb966009bf3f66ba0270cc9762806 (23:45): Since I just want to keep the status quo, nothing complex is necessary.",
        "66b0d785bfa15d051888c24dabba7342 (23:45): mind if I have a look when you're done and leave feedback?",
        "dddbb966009bf3f66ba0270cc9762806 (23:45): Sure.",
        "dddbb966009bf3f66ba0270cc9762806 (23:45): I'll write it tonight and email you.",
        "65325d50b2e25aca54bc871b89758c9c (23:45): most of what you'd need to do is to collect and organize the rationale",
        "4e528aa62dacc1d204b6b9a06e317317 (23:45): personally i think everything should be in html5 if we think it's good, including microdata and rdfa and profile=&quot;&quot; and version=&quot;&quot;... i just don't think rdfa, profile=&quot;&quot;, and version=&quot;&quot; are good. :-)",
        "66b0d785bfa15d051888c24dabba7342 (23:46): should we spend time rebutting the points made by the other proposal?",
        "66b0d785bfa15d051888c24dabba7342 (23:46): tries to find the proposal",
        "65325d50b2e25aca54bc871b89758c9c (23:46): that would be useful information, sure",
        "dddbb966009bf3f66ba0270cc9762806 (23:46): I don't think we need to do so directly, though certainly pointing our rationales in those directions would be good.",
        "66b0d785bfa15d051888c24dabba7342 (23:46): certainly",
        "65325d50b2e25aca54bc871b89758c9c (23:47): you don't have to make it point-counterpoint but if you feel it makes any strong arguments for which you have a rebuttal, then it would be good to say so",
        "65325d50b2e25aca54bc871b89758c9c (23:47): btw http://lists.w3.org/Archives/Public/public-html/2009Oct/0773.html",
        "66b0d785bfa15d051888c24dabba7342 (23:48): thanks!",
        "65325d50b2e25aca54bc871b89758c9c (23:48): and earlier thread here: http://lists.w3.org/Archives/Public/public-html/2009Oct/0420.html",
        "65325d50b2e25aca54bc871b89758c9c (23:48): (that thread included a number of arguments both pro and con)",
        "66b0d785bfa15d051888c24dabba7342 (23:48): 65325d50b2e25aca54bc871b89758c9c: what mail client do you use to keep organized?",
        "66b0d785bfa15d051888c24dabba7342 (23:49): can't ever find anything that fast",
        "dddbb966009bf3f66ba0270cc9762806 (23:49): I suspect he's got a listing of issues.  ^_^",
        "66b0d785bfa15d051888c24dabba7342 (23:49): clever, you!",
        "65325d50b2e25aca54bc871b89758c9c (23:55): 66b0d785bfa15d051888c24dabba7342: I use Mail.app, the search is pretty good",
        "65325d50b2e25aca54bc871b89758c9c (23:55): but I also made an organized issues list",
        "65325d50b2e25aca54bc871b89758c9c (23:56): http://dev.w3.org/html5/status/issue-status.html",
        "66b0d785bfa15d051888c24dabba7342 (23:56): thanks"
    ],
    "person_ids": [
        "65325d50b2e25aca54bc871b89758c9c",
        "66b0d785bfa15d051888c24dabba7342",
        "dddbb966009bf3f66ba0270cc9762806",
        "fd9ef1223e855714294498ebfde79f98",
        "4e528aa62dacc1d204b6b9a06e317317"
    ]
}