{
    "id": "73834461cd81d452e89162f42cb71a5b",
    "messages": [
        "ae98fa2c663c48bc37af8f7babbc1ffd (00:07): quick question: with a web socket, is there any way to 'reopen' a socket if the socket go closed? Or do I just create a brand new WebSocket?",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:17): Hmm.  Opera seems not to update the suggestions list from &lt;datalist&gt; until you press a key.  This makes it fairly useless for dynamic scripting.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:19): data:text/html,&lt;!doctype html&gt;&lt;input list=&quot;datalist&quot; onkeypress=&quot;document.getElementById('datalist').innerHTML = '&lt;option value=&amp;quot;' + event.target.value + 'fizzle&amp;quot;&gt;'; return true&quot;&gt;&lt;datalist id=&quot;datalist&quot;&gt;&lt;/datalist&gt;",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:19): Notice how it lags behind what you type by one key.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:20): Any workaround?  Should I file this in Opera's bug tracker where I never see any response and don't get any status notifications ever?",
        "f139aba52f9fa1394b4034a7954b2220 (00:21): what does the spec say about the issue?",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:23): It doesn't, it's very vague, as with all UI issues.  But it seems wrong if I update the datalist and the suggestions don't actually display right away.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:23): I'd expect them to display immediately (if suggestions would normally be displayed right now).",
        "f139aba52f9fa1394b4034a7954b2220 (00:23): 88d4d34a8064a4ff39fd5e144eea7762, I would recommend filing a bug anyway, since it's obviosly not well optimised for the use cases it's meant for",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:23): I was going to convert mwsuggest.js to use &lt;datalist&gt; where supported, but I guess I won't if the suggestions are for what you typed in on the last key . . .",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:23): You mean a spec bug?",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:23): Or an Opera bug?",
        "f139aba52f9fa1394b4034a7954b2220 (00:23): Opera bug",
        "f139aba52f9fa1394b4034a7954b2220 (00:24): but you could file a spec bug too, if you think the spec needs to say something about this",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:24): Okay.",
        "f139aba52f9fa1394b4034a7954b2220 (00:24): though, it is a UI issue, so maybe it doesn't",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:24): Last time I filed an Opera bug (also about a problem with Opera HTML5 implementation) I never got a response.",
        "ab7faae5d7b250ea8606486575f8f79c (00:24): All you need to do is get yourself employed by Opera, so you can access the bug tracker",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:25): I don't think the spec needs to say anything here, although I'll have other suggestions about &lt;datalist&gt;.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:25): ab7faae5d7b250ea8606486575f8f79c, why didn't I ever think of that",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:25): ?",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:25): &quot;Spec violation ‚Äì Opera is performing contrary to published, interworking recommendations by the W3C&quot;  So I shouldn't use this if it violates IETF specs?  :)",
        "f139aba52f9fa1394b4034a7954b2220 (00:26): 88d4d34a8064a4ff39fd5e144eea7762, unfortunately, since we don't run an open bug tracker, external bug reporters don't automatically get notified of further discussions",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:26): enters a data: URL in the &quot;What URL triggers this bug, if any?&quot; field",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:26): f139aba52f9fa1394b4034a7954b2220, why don't you run an open bug tracker?  It's very annoying.",
        "f139aba52f9fa1394b4034a7954b2220 (00:26): I know. The issue has been discussed internally many times",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:27): I figured, but I was wondering what the reasons are for the status quo.  Since you aren't saying, and neither did the last Opera dev I talked to about this (who was possibly also you), I guess it's secret.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:27): Oh well.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:27): I guess I'll work for Wikimedia instead.  :P",
        "f139aba52f9fa1394b4034a7954b2220 (00:27): unfortunately, AIUI, we have bugs related to client work and other secret stuff that can't be revealed publicly, and there's no easy way to identify bugs that are safe for public viewing from those that aren't",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:28): Well, Apple manages.  I assume they have secret internal bug trackers, but they have a public Bugzilla too.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:28): For WebKit, I mean.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:28): I'm sure you've heard all this before, though.",
        "f139aba52f9fa1394b4034a7954b2220 (00:28): yeah, I know. But we only have one bug tracker used for both internal and external reports",
        "f139aba52f9fa1394b4034a7954b2220 (00:29): it's been suggested that bugs filed by external reporters are made public, but then the issue here is that someone internally could comment and inadvertenly mention something that's not public knowledge",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:38): f139aba52f9fa1394b4034a7954b2220, filed as DSK-276870.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:39): Oh, crud, it looks like I accidentally quoted Manu on-list when he replied to me off-list.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:39): I hate it when I do that.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:39): blames Gmail.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:40): feels really guilty.",
        "f139aba52f9fa1394b4034a7954b2220 (00:48): 88d4d34a8064a4ff39fd5e144eea7762, if you replied to an off-list mail, why would gmail add pubilc-html to the CC list?",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:48): f139aba52f9fa1394b4034a7954b2220, because I reply to all on the first post I'm replying to, then copy-paste other things to reply to from lower posts.  This is the only way I can see to respond to multiple people in the same post.",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:48): I prefer not to make five posts in a row responding to five separate people.",
        "f139aba52f9fa1394b4034a7954b2220 (00:50): wonders which meaning of the phrase 'table the discussion' Maciej was using when he wrote &quot;let's table this process discussion for now&quot;",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:50): Presumably &quot;set aside&quot;, since we were in the middle of discussing it already, so the other definition wouldn't make sense, would it?",
        "f139aba52f9fa1394b4034a7954b2220 (00:51): yeah, that was my assumption",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:51): Words shouldn't be able to mean two opposite things.  &gt;:(",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:51): &quot;ravel&quot; is another culprit, but it's less common.",
        "f139aba52f9fa1394b4034a7954b2220 (00:51): but I really hate that phrase since it has 2 contradictory meanings, and I never remember which one is the typical American meaning, and which is the typical British (or, rest of the world) meaning",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:57): It's usually clear from context, though.",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:04): Grah, it's surprising how much of a difference a little syntax makes.  I don't like passing literal arrays to functions in PHP, especially nested ones.  But passing objects in javascript is no problem at all.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:04): Yeah, it's remarkable.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:05): The syntax for arrays in PHP is ugly, and it makes them so much less usable.",
        "65325d50b2e25aca54bc871b89758c9c (01:05): f139aba52f9fa1394b4034a7954b2220: I meant it in the colloquial sense of &quot;set aside&quot;, not the formal parliamentary sense of &quot;let's put it before the group as the topic of discussion&quot;",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:07): 88d4d34a8064a4ff39fd5e144eea7762: It's especially annoying because the ugliness of the syntax is the only thing really stopping me from finally making my sql-query constructor handle table joins.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:07): Heh, so you made one too?",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:08): MediaWiki has a pretty nice one.",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:08): Of course, how can you *possibly* spend any significant amount of time hand-constructing queries?",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:08): It's horrible.",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:10): I've been thinking of switching to a chaining-based api just so I can implement joins without gobs of horrible nesting.",
        "f139aba52f9fa1394b4034a7954b2220 (01:13): in microdata, can someone clarify for me how I'm supposed to use the &quot;fn&quot; and &quot;n&quot; properties in the vcard vocabulary?",
        "f139aba52f9fa1394b4034a7954b2220 (01:14): I don't get why both &quot;fn&quot; and &quot;n&quot; exist, or why &quot;fn&quot; must be present if &quot;n&quot; is present",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:16): I think it's legacy constraints from the original vcard format.",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:16): The microformats wiki page should explain their use pretty well.",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:16): It was sensical enough for me to use it on my pages, at least.",
        "f139aba52f9fa1394b4034a7954b2220 (01:19): But if I use &lt;span itemprop=&quot;fn n&quot;&gt;, then &quot;n&quot; actually needs to be an item, so that would become &lt;span itemscope itemprop=&quot;fn n&quot;&gt;, but &quot;fn&quot; is supposed to be a string, not an item, so then I would have to split them into two separate elements.",
        "f139aba52f9fa1394b4034a7954b2220 (01:19): or otherwise rely on the implied &quot;n&quot; optimisation",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:21): Hrm.  Yeah, I think you can't use them together in Microdata, and have to either put both of them in or use the implied &quot;n&quot; optimizations.",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:22): i'm baffled by the number of people who don't want the spec to encourage user agents to try to make things better for AT users in the face of authoring mistakes",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:22): why do people want to pubish users for authoring mistakes?",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:23): it's like the whole draconican parsing thing all over again",
        "65325d50b2e25aca54bc871b89758c9c (01:24): 69b0d3dfe919a6b860a9fac82de52a7e: I think people are either misreading the spec, or buying into a subtle argument about giving authors incorrect expectations",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:24): 69b0d3dfe919a6b860a9fac82de52a7e, I think they're mostly asking to rephrase to be vaguer at this point, aren't they?",
        "f139aba52f9fa1394b4034a7954b2220 (01:24): I don't think people are opposed to ATs providing a better user experience. They seem to be opposed to the spec setting seemingly unrealistic requirements and somehow giving authors unrealistic expectaions and choosing not to give alternative text",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:25): +1 to f139aba52f9fa1394b4034a7954b2220.",
        "f139aba52f9fa1394b4034a7954b2220 (01:26): and since the purpose of the statement in the spec is to give implementations permission to use alternative techniques, it seems reasonable to say so without indicating what those techniques may be, especially when it could be misconstrued as referring to futuristic technologies",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:26): That is, I certainly don't want to punish users because authors were bad.  It totally makes sense that image-reading heuristics, when they exist and are practical, should be used in the absence of @alt.",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:27): OCR is not a futuristic technology",
        "65325d50b2e25aca54bc871b89758c9c (01:27): I think it would probably fine to say that if alt is missing, UAs can present any other information they are able to get in lieu of a text alternative",
        "f139aba52f9fa1394b4034a7954b2220 (01:27): I don't think it's clear to everyone that &quot;image analysis heuristics&quot; refers to things like OCR.",
        "65325d50b2e25aca54bc871b89758c9c (01:27): and if specific examples are listed at all, they should be clearly realistic examples like using the filename or performing OCR",
        "f139aba52f9fa1394b4034a7954b2220 (01:28): people seem to be thinking it refers to some kind of futuristic AI, that can look at a picture and determine what it is and what it means in context",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:28): there is shipping technology today that does painting recognition, OCR, landmark recognition, etc, on arbitrary images",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:28): which would really help users who can't see images",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:28): &quot;User agents may also apply image analysis heuristics‚Ä¶&quot; does seem to imply that such heuristics exist, when outside of OCR they don't reliably.",
        "f139aba52f9fa1394b4034a7954b2220 (01:29): yes, but those things, like Google Goggles, require large collections of sample images with which to compare the subject image with",
        "65325d50b2e25aca54bc871b89758c9c (01:29): there are in fact heuristics that can recognize all kinds of images other than images of text",
        "1f8387eb43f131d7c309a90a4e36b5cb (01:29): Outside of images of text, though, you run into the intent problem.  A description of the image may not be valid alt text.",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:29): sure",
        "65325d50b2e25aca54bc871b89758c9c (01:29): mostly either research projects, or somewhat experimental, and often requiring a huge corpus",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:29): but it's better than nothing!",
        "65325d50b2e25aca54bc871b89758c9c (01:30): it's not even that clear to me how I'd use the shipping Google Goggles to build an accessibility feature for a UA - uploading every image that lacks alt text seems like a bad idea for both bandwidth and privacy reasons",
        "f139aba52f9fa1394b4034a7954b2220 (01:31): 69b0d3dfe919a6b860a9fac82de52a7e, I just think you should try to find a way that makes the intent of the statement clear, without making people think the spec is setting unrealistic expectations",
        "65325d50b2e25aca54bc871b89758c9c (01:31): that being said, it seems like a much more general statement would both be less objectionable, and more broadly applicable",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:31): well i'd be happy to make the text even vaguer so long as we still explicitly allow such behaviour",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:32): (no bug was ever filed for this as far as i know, btw)",
        "f139aba52f9fa1394b4034a7954b2220 (01:33): personally, I thought image analysis heuristics was a rather general statement already, and I don't agree with most of the rationale that was given in the change proposal",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:33): yeah i'm not exactly sure how to make it vaguer",
        "f139aba52f9fa1394b4034a7954b2220 (01:33): maybe use less jargon",
        "f139aba52f9fa1394b4034a7954b2220 (01:36): Change it to &quot;User agents may also utilise any other available techniques or technologies to help the user make sense of the image when the user is unable to make direct use of the image, ...&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:37): well it's not _any_ other",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:37): e.g. iirc we explicitly discourage use of the filename",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:37): since that has been shown to hurt more than help",
        "f139aba52f9fa1394b4034a7954b2220 (01:38): that's an implementation decision though. There's no reason to have the spec explicitly disallow it",
        "65325d50b2e25aca54bc871b89758c9c (01:39): I think it might also help to say &quot;get information about the image&quot; instead of &quot;make sense of the image&quot;",
        "65325d50b2e25aca54bc871b89758c9c (01:39): since the latter seems to be what makes people think the technology described is science-fictional",
        "f139aba52f9fa1394b4034a7954b2220 (01:39): also, the file name is not always useless. It is when it's a bunch of random letters or numbers, but if the AT recognises the file name as being readable words (e.g. by checking a dictionary), then why not use the file name as a last resort?",
        "65325d50b2e25aca54bc871b89758c9c (01:40): yeah, many filenames are bad, but not all - the best thing would be for AT to use heuristics to determine if the file name is human-understandable",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:40): i could live with that",
        "f139aba52f9fa1394b4034a7954b2220 (01:42): Here the suggested text again with some changes: &quot;User agents may also utilise any other available techniques or technologies to help the user obtain information about the image when the user is unable to make direct use of the image, ...&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:43): sounds wishy washy",
        "f139aba52f9fa1394b4034a7954b2220 (01:43): yep",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:43): we should just come out and say what we mean",
        "65325d50b2e25aca54bc871b89758c9c (01:43): if you can find text that people find satisfactory then I'd be happy to try to put this one through as an amicable resolution",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:47): the amount of time i spend each day just dealing with new e-mail is getting ridiculous",
        "65325d50b2e25aca54bc871b89758c9c (01:49): 69b0d3dfe919a6b860a9fac82de52a7e: Sam and I are both trying hard to curtail threads that don't seem to be going anywhere, and to kick process debates off the list",
        "65325d50b2e25aca54bc871b89758c9c (01:50): (as of now, anyway)",
        "f139aba52f9fa1394b4034a7954b2220 (01:50): I was quite pleased when I saw both you and sam put a stop to process threads today :-)",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:51): 65325d50b2e25aca54bc871b89758c9c: sadly public-html ain't hte half of it these days",
        "65325d50b2e25aca54bc871b89758c9c (01:51): 69b0d3dfe919a6b860a9fac82de52a7e: well, that's the only part I can really help with :-)",
        "f139aba52f9fa1394b4034a7954b2220 (01:52): yeah, whatwg has been difficult to keep up with too sometimes",
        "f139aba52f9fa1394b4034a7954b2220 (01:52): I'm still behind on that by about 1500 messages",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:57): my problem is it's lots of little amounts of e-mail on lots of lists",
        "f139aba52f9fa1394b4034a7954b2220 (01:58): you have to learn to ignore more lists.",
        "f139aba52f9fa1394b4034a7954b2220 (01:58): Like how I ignore pretty much most internal mailing lists within opera, and only skim those that I do read",
        "f139aba52f9fa1394b4034a7954b2220 (01:59): I figure if it's important information, I'll hear about it some other way",
        "65325d50b2e25aca54bc871b89758c9c (02:00): I have a pretty small set of lists I read constantly, a somewhat larger set of daily reading, a few I read about weekly, and then a lot that I only read occasionally when I have spare time",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:02): f139aba52f9fa1394b4034a7954b2220: none of this is internal google mail, which is a whole other mailbox with even more mail...",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:03): 1f8387eb43f131d7c309a90a4e36b5cb: re the thread with the guy who wants to do concatenation with microdata",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:03): 1f8387eb43f131d7c309a90a4e36b5cb: it's a bad idea for us to make &lt;div itemscope itemtype=&quot;http://example.com/&quot;&gt;&lt;span itemprop=&quot;a/b&quot;/&gt;&lt;/div&gt; mean the same as &lt;div itemscope itemtype=&quot;http://example.com/a/&quot;&gt;&lt;span itemprop=&quot;b&quot;/&gt;&lt;/div&gt;",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:04): which is why microdata goes to such lengths to make sure that can't happen",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:04): he should just use owl:equivalentProperty if he's using RDF, the same way the work vocabulary does",
        "f139aba52f9fa1394b4034a7954b2220 (02:12): does such concatenation work in RDFa? e.g. is &lt;span xmlns:dc=&quot;http://purl.org/dc/terms/&quot; property=&quot;dc:title&quot;&gt; the same as &lt;span xmlns:dc=&quot;http://purl.org/dc/&quot; property=&quot;dc:terms/title&quot;&gt;?",
        "ab7faae5d7b250ea8606486575f8f79c (02:18): f139aba52f9fa1394b4034a7954b2220: That's just CURIEs, not anything specific to RDFa",
        "ab7faae5d7b250ea8606486575f8f79c (02:19): RDFa just gets full URIs from its CURIE processor, it doesn't care how they're split up",
        "ab7faae5d7b250ea8606486575f8f79c (02:19): (in theory)",
        "f139aba52f9fa1394b4034a7954b2220 (02:19): so, then both of those would be semantically identical for RDF?",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:20): yes",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:20): that's one of the biggest problems with RDFa, imho",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:29): 5:30pm and I'm done with mail.",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:29): sheesh."
    ],
    "person_ids": [
        "ae98fa2c663c48bc37af8f7babbc1ffd",
        "88d4d34a8064a4ff39fd5e144eea7762",
        "f139aba52f9fa1394b4034a7954b2220",
        "ab7faae5d7b250ea8606486575f8f79c",
        "1f8387eb43f131d7c309a90a4e36b5cb",
        "65325d50b2e25aca54bc871b89758c9c",
        "69b0d3dfe919a6b860a9fac82de52a7e"
    ]
}