{
    "id": "74ad42d6a1871918479b90839e397978",
    "messages": [
        "932b433e8e456828a538f138916e4fc4 (20:52): Anyone know if the Patent Policy implications of the WHAT WG submission has been dealt with?",
        "932b433e8e456828a538f138916e4fc4 (20:54): checks userlist...",
        "932b433e8e456828a538f138916e4fc4 (20:55): pings anne and Hixie...",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:56): 932b433e8e456828a538f138916e4fc4: which implications specifically?",
        "932b433e8e456828a538f138916e4fc4 (20:56): The proposal only mentions copyright assignment; has it been vetted for Royalty-Free Patent Licensing as well?",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:57): 932b433e8e456828a538f138916e4fc4: as in patent searches?",
        "932b433e8e456828a538f138916e4fc4 (20:58): No, as in with normal submissions from companies to the W3C. The WHAT WG submission is a little out of the ordinary for this.",
        "b8810fee2f4a71f849f3f7409546d1d9 (21:00): pardon my ignorance. how are normal submissions vetted?",
        "932b433e8e456828a538f138916e4fc4 (21:01): IOW, do the undersigned on the proposal claim they either are not aware of any patents covering the material, or any patents are available for license on a Royalty-Free basis.",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:03): from what I gather that doesn't matter",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:03): when the spec goes to call for comments any vendors must explicitly object to any content that is under their patent control",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:03): and if they don't, it's free for use in the final spec",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:04): Apple has already said they won't do that for &lt;canvas&gt; etc.",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:04): (the above was gleaned from several list posts)",
        "932b433e8e456828a538f138916e4fc4 (21:04): Hmm. Ok. So we assume it won't be a problem, but it hasn't been explicitly dealt with?",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:05): it was explicitly addressed on the list. check the earliest archives...probably in the first 50 threads",
        "932b433e8e456828a538f138916e4fc4 (21:05): can barely keep up with the latest threads... :-)",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:06): has just been marking all unread threads as read for the past week",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:06): it's just more of the same",
        "932b433e8e456828a538f138916e4fc4 (21:07): Yeah, too much noise to pick out the productive bits.",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:07): I just drop in on Maciej's or Ian's replies every now and then to see what's going on :)",
        "932b433e8e456828a538f138916e4fc4 (21:07): looks accusingly in the Chairs' general direction...",
        "932b433e8e456828a538f138916e4fc4 (21:09): checks clock to find out how long he has to decide whether to object or not...",
        "b8810fee2f4a71f849f3f7409546d1d9 (21:15): 932b433e8e456828a538f138916e4fc4: surely you aren't going to object on patent grounds?",
        "932b433e8e456828a538f138916e4fc4 (21:15): No, no. :-)",
        "932b433e8e456828a538f138916e4fc4 (21:16): If it was an actual problem I would, but mainly just to make sure it got handled.",
        "932b433e8e456828a538f138916e4fc4 (21:16): I'm reviewing the questions up for vote against the Charter, among other things.",
        "932b433e8e456828a538f138916e4fc4 (21:18): Trying to figure out which of my misgivings are for substantive reasons and which are just preference, subjective, etc.",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:19): bahs at John Boyer's reasoning for a &quot;no&quot;",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:20): it's a semantically invalid argument if we're going to be picky",
        "b65a1668d3f56352ebf6e4735afeb424 (21:21): 932b433e8e456828a538f138916e4fc4, what issues are you concerned with?",
        "932b433e8e456828a538f138916e4fc4 (21:22): Trying to figure that out, actually. :-)",
        "932b433e8e456828a538f138916e4fc4 (21:22): I think at the base I'm concerned with the attitude and goals underlying, in particular, the ‚ÄúHTML5‚Äù submission.",
        "b65a1668d3f56352ebf6e4735afeb424 (21:22): I can totally understand that",
        "932b433e8e456828a538f138916e4fc4 (21:23): But I'm as yet undecided on whether or not there is anything in there that constitutes a substantive issue.",
        "b65a1668d3f56352ebf6e4735afeb424 (21:23): I think they have made a very poor attempt at explaining why this would be a good idea",
        "b65a1668d3f56352ebf6e4735afeb424 (21:23): the arguments have been, in tone if not in substance, &quot;shut up and let us have what we want&quot;",
        "932b433e8e456828a538f138916e4fc4 (21:24): Particularly since the Charter, on further review, seems to one of the things I'm concerned about (and the Charter is out of scope for the current vote).",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:24): I think good explanations have been made, but have been drowned out in confusion and misunderstandings",
        "b65a1668d3f56352ebf6e4735afeb424 (21:24): 62e1e89124794c1ee4b8ec5965cfb90e: I agree, there have been very lucid posts",
        "932b433e8e456828a538f138916e4fc4 (21:24): Another concern for me is the navel-gazing quality of the arguments.",
        "b65a1668d3f56352ebf6e4735afeb424 (21:25): 932b433e8e456828a538f138916e4fc4: that's been on both sides",
        "932b433e8e456828a538f138916e4fc4 (21:25): yes",
        "b8810fee2f4a71f849f3f7409546d1d9 (21:25): notes that the attitude and goals have translated to results: http://ln.hixie.ch/?start=1172653243&amp;count=1",
        "1adba86c435b5fe0f7ea043370b1636b (21:25): b65a1668d3f56352ebf6e4735afeb424: which &quot;this&quot; are you referring to above? the current vote for editor/starting point/name?",
        "b65a1668d3f56352ebf6e4735afeb424 (21:26): 1adba86c435b5fe0f7ea043370b1636b: yes, specifically taking the WHAWG proposal",
        "932b433e8e456828a538f138916e4fc4 (21:27): b8810fee2f4a71f849f3f7409546d1d9: Yes, I'm the first to lambast the recent hostory of W3C WG's, the late HTML WG in particular, particularly on secrecy and non-responsiveness.",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:27): have you read the reasons given in the survey next to the &quot;yes&quot; answers?",
        "b65a1668d3f56352ebf6e4735afeb424 (21:27): I think it's reasonable to expect people to read it before judging, but I also think that it's unreasonable to demand an immediate vote on it without giving people a chance to read it",
        "932b433e8e456828a538f138916e4fc4 (21:27): b8810fee2f4a71f849f3f7409546d1d9: However, that was not the issue I was referring to.",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:28): b65a1668d3f56352ebf6e4735afeb424: to be fair, it's asking whether or not the spec should be admitted for discussion -- reading it is not a prerequisite",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:28): knowing the gist is, however",
        "b65a1668d3f56352ebf6e4735afeb424 (21:28): 62e1e89124794c1ee4b8ec5965cfb90e: I don't think that's realistic... in a way, it is a fiat, because of momentum",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:29): I don't see it as fiat at all. the resulting discussions in this WG could invalidate everything in the current spec",
        "b8810fee2f4a71f849f3f7409546d1d9 (21:29): 932b433e8e456828a538f138916e4fc4: it illustrates getting stuff done vs. discussing it in a committee",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:29): fiat would be mandating its inclusion in the final spec somehow",
        "932b433e8e456828a538f138916e4fc4 (21:30): b8810fee2f4a71f849f3f7409546d1d9: Sure. But the WHAT WG does not represent the needs of the sum total of the web.",
        "b65a1668d3f56352ebf6e4735afeb424 (21:30): 62e1e89124794c1ee4b8ec5965cfb90e: but it also includes buying into Hixie as the editor, and he's very tenacious, and would strongly resist any attempts at changing it, right?",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:30): the WHAT WG represented and championed the needs of web authors and browser vendors (two of the largest groups on the web) for several years",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:31): b65a1668d3f56352ebf6e4735afeb424: that's a completely separate question",
        "932b433e8e456828a538f138916e4fc4 (21:31): b8810fee2f4a71f849f3f7409546d1d9: And that realization has not been particularly prominent in their interactions with those who dissent.",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:31): and Hixie doesn't resist changes to the spec when they're presented with a strong argument and real evidence",
        "1adba86c435b5fe0f7ea043370b1636b (21:31): b65a1668d3f56352ebf6e4735afeb424: I don't think it's fair to say that Hixie would resist any attempt to change the spec",
        "62e1e89124794c1ee4b8ec5965cfb90e (21:31): he's one of the most rational people I've had the pleasure of interacting with on specs",
        "1adba86c435b5fe0f7ea043370b1636b (21:32): b65a1668d3f56352ebf6e4735afeb424: he has been convinced to change things, and has said there are things he'd like to change",
        "b65a1668d3f56352ebf6e4735afeb424 (21:32): 932b433e8e456828a538f138916e4fc4: fwiw, I have decided that on most of the substantive issues, it's most productive to go with the flow on this vote",
        "932b433e8e456828a538f138916e4fc4 (21:32): I would have formally objected to Hixie as Editor if the Charter hadn't explicitly said that the HTML WG should ‚Äúactively seek convergence with the WHAT WG‚Äù.",
        "932b433e8e456828a538f138916e4fc4 (21:33): b65a1668d3f56352ebf6e4735afeb424: I'm, as mentioned, as yet undecided on whether any of my misgivings represent actual substantive issues.",
        "b65a1668d3f56352ebf6e4735afeb424 (21:34): fair enough",
        "ab7faae5d7b250ea8606486575f8f79c (21:34): I believe any reading of the spec requires discussion beforehand - there are several obvious areas (like &lt;font style&gt;, WF2 repetition) where the spec says something that most WHATWG people are unhappy with and which are very likely to be changed, but you can't tell that just from reading it; so the reading and arguments against features need to be guided carefully so that they're usefully targetted",
        "ab7faae5d7b250ea8606486575f8f79c (21:35): Uh, I've forgotten why I thought that was a relevant point, except I guess that means reviewing the spec before judging it will take quite a bit of time and cooperation",
        "b65a1668d3f56352ebf6e4735afeb424 (21:36): 932b433e8e456828a538f138916e4fc4: let your conscience decide, but also consider what the implications of a formal objection are, and if that meets your goals",
        "ab7faae5d7b250ea8606486575f8f79c (21:37): Oh, maybe the point was that that reading would require significant commitment too, hence the value of formally voting before starting to do that work",
        "932b433e8e456828a538f138916e4fc4 (21:47): Ugh. Anyone else occasionally getting the raw markup instead of cooked display for the ballot page in Safari?"
    ],
    "person_ids": [
        "932b433e8e456828a538f138916e4fc4",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "62e1e89124794c1ee4b8ec5965cfb90e",
        "b65a1668d3f56352ebf6e4735afeb424",
        "1adba86c435b5fe0f7ea043370b1636b",
        "ab7faae5d7b250ea8606486575f8f79c"
    ]
}