{
    "id": "751ea102f87c6c8aad382bcfad8302ba",
    "messages": [
        "69b0d3dfe919a6b860a9fac82de52a7e (00:17): aw, hsivonen didn't reply to mjs' idea",
        "65325d50b2e25aca54bc871b89758c9c (00:37): were you hoping he would?",
        "65325d50b2e25aca54bc871b89758c9c (00:38): I guess his opinion on it is pretty relevant",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:41): i asked him to :-)",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:41): i'm waiting for his opinion before replying myself",
        "b07211a0c7cb119232799d2119cea90f (00:50): mjs's idea?",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:52): introducing a level of conformance between &quot;conforming&quot; and &quot;down-played errors&quot; that shows a validator warning but is still conforming",
        "b07211a0c7cb119232799d2119cea90f (00:52): I guess that makes sense",
        "150ca666565bfcb850b2e2ee3c0f0c64 (00:53): I don't see any downsides",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:54): personally i'm not a big fan of new conformance levels",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:54): we've already got three",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:55): and generally i don't see the point",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:55): Transitional showed that people don't hesitate to use the low-level ones",
        "b07211a0c7cb119232799d2119cea90f (00:56): what stuff is downplayed errors atm?  presentational guff?",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:56): and XHTML has shown that other people try to be as strict as possible regardless of whether it's ok or not",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:56): so it doesn't really have the desired effect",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:57): http://www.whatwg.org/specs/web-apps/current-work/#conformance-checkers-0",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:57): b07211a0c7cb119232799d2119cea90f: ^",
        "b07211a0c7cb119232799d2119cea90f (01:00): mm",
        "b07211a0c7cb119232799d2119cea90f (01:00): I don't know what I'd do in this situation",
        "b07211a0c7cb119232799d2119cea90f (01:00): four levels of conformance seems a little silly",
        "150ca666565bfcb850b2e2ee3c0f0c64 (01:01): the point is that peope don't like being told that they are non-conformant",
        "150ca666565bfcb850b2e2ee3c0f0c64 (01:01): yet they might like being told that they're wrong",
        "150ca666565bfcb850b2e2ee3c0f0c64 (01:01): and since the distinction doesn't really matter in practice, you might as well accomodate them",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:02): i think i might be more happy to making the others downplayed errors into this &quot;warning&quot; class than introducing a new class altogether",
        "b07211a0c7cb119232799d2119cea90f (01:02): I'm just worried about falling into the HTML4 Transitional trap",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:02): but anyway, i'd like hsivonen's input on the topic",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:02): since right now, he's the main one this affects",
        "b07211a0c7cb119232799d2119cea90f (01:02): 69b0d3dfe919a6b860a9fac82de52a7e: yeah, I was thinking that might be an idea",
        "b07211a0c7cb119232799d2119cea90f (01:03): probably make people happier about profile=&quot;&quot; too",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:03): yeah i'm really worried about doing another transitional",
        "b07211a0c7cb119232799d2119cea90f (01:03): (though I'm not sure that's necessarily a good thing. :))",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:03): well that's the thing",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:03): profile=&quot;&quot; and summary=&quot;&quot; are very similar in this respect. They make people think they're doing something useful while really they are only wasting their time, even though in theory it could have been useful",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:03): s/it/they/",
        "65325d50b2e25aca54bc871b89758c9c (01:17): 69b0d3dfe919a6b860a9fac82de52a7e: I think making downplayed errors into warnings (that must be reported but don't break conformance) would be a good change and one that hsivonen could probably go along with",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:18): 65325d50b2e25aca54bc871b89758c9c: i'm worried about making teh HTML4 Transitional mistake.",
        "f139aba52f9fa1394b4034a7954b2220 (01:18): 69b0d3dfe919a6b860a9fac82de52a7e, profile is worse than summary in that respect. The usefulness of summary is dependent upon the competence of the author writing it",
        "150ca666565bfcb850b2e2ee3c0f0c64 (01:18): what were the consequences of &quot;the HTML4 transitional mistake&quot;?",
        "fd9ef1223e855714294498ebfde79f98 (01:18): right, whereas the usefulness of profile is zero, regardless of the competence of the author using it. :)",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:18): f139aba52f9fa1394b4034a7954b2220: yeah, arguably profile is worse, but then arguably summary is worse because when the author inevitably screws up, he hurts more users.",
        "150ca666565bfcb850b2e2ee3c0f0c64 (01:18): doesn't really know the history",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:19): 150ca666565bfcb850b2e2ee3c0f0c64: people never transitioned.",
        "f139aba52f9fa1394b4034a7954b2220 (01:19): whereas the usefulness of profile is dependent upon a majority of authors getting it right, not just the one who chooses to use it",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:19): 150ca666565bfcb850b2e2ee3c0f0c64: basically, people went to the lowest common denominator",
        "150ca666565bfcb850b2e2ee3c0f0c64 (01:19): how is that relevant to this case? you're afraid people won't transition to the better markup unless it's a conformance error?",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:20): 150ca666565bfcb850b2e2ee3c0f0c64: i guess we might avoid that if hsivonen makes these downplayed errors into warnings that are always present, and doesn't just say &quot;yup you're valid&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:20): 150ca666565bfcb850b2e2ee3c0f0c64: yeah, more or less",
        "f139aba52f9fa1394b4034a7954b2220 (01:20): I know. summary isn't particularly conducive to people getting it right",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:20): f139aba52f9fa1394b4034a7954b2220: arguably summary=&quot;&quot; is useless because too many people have gotten it wrong already. :-)",
        "150ca666565bfcb850b2e2ee3c0f0c64 (01:20): seems like we're mostly debating semantics :)",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:21): worse than semantics",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:21): psychology :-/",
        "150ca666565bfcb850b2e2ee3c0f0c64 (01:21): maybe the validator can call them &quot;conformant errors&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:21): hah",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:22): 65325d50b2e25aca54bc871b89758c9c: so you'd be ok with the proposal i described, if we just made the downplayed errors into frowned-upon-but-ok? i.e. changed from &quot;not serious errors&quot; to &quot;discouraged non-errors&quot;?",
        "f139aba52f9fa1394b4034a7954b2220 (01:22): 69b0d3dfe919a6b860a9fac82de52a7e, that depends on the ability of ATs being able to reliably filter out useless values, which we've been told they do, but been given no details about how",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:22): f139aba52f9fa1394b4034a7954b2220: yeah, that information would definitely help",
        "f139aba52f9fa1394b4034a7954b2220 (01:22): nor how reliable it is",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:22): we really should do usability testing of this",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:22): it's hard to do usability testing for AT users, though",
        "ab7faae5d7b250ea8606486575f8f79c (01:22): Maybe the validator should do like what the Yahoo and Google page speed tools do, giving each message a red/yellow/green severity and showing them in decreasing order of severity, so you can see which issues are the most worth fixing",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:23): because you have to go to their setups, you can't just have them come in",
        "f139aba52f9fa1394b4034a7954b2220 (01:23): if they have laptops, then you could have them come in with them",
        "65325d50b2e25aca54bc871b89758c9c (01:23): 69b0d3dfe919a6b860a9fac82de52a7e: I think that would be a good improvement beyond even the summary=&quot;&quot; issue",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:23): from what i've seen of usability studies of AT users here at google, they don't. at least not the ones we found for our studies.",
        "65325d50b2e25aca54bc871b89758c9c (01:24): 69b0d3dfe919a6b860a9fac82de52a7e: and yes, I would be in favor of that proposal",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:25): 65325d50b2e25aca54bc871b89758c9c: ok. i'll see what hsivonen thinks, and will see if i can find a way to phrase it that satisfies both the desire to keep these things as second-class citizens, and the desire to allow them to some extent.",
        "f139aba52f9fa1394b4034a7954b2220 (01:25): how is that different from the downplayed errors we already have in the spec?",
        "65325d50b2e25aca54bc871b89758c9c (01:26): a document containing a downplayed error is nonconforming",
        "f139aba52f9fa1394b4034a7954b2220 (01:27): so maybe we should have conformance levels, conceptually like the WCAG accessibility levels?",
        "ab7faae5d7b250ea8606486575f8f79c (01:27): Sounds like it's going to be horrendously confusing to someone who just wants to be told whether their page is okay or not",
        "f139aba52f9fa1394b4034a7954b2220 (01:27): but then, that's getting closer to the idea of Strict/Transitional conformance",
        "150ca666565bfcb850b2e2ee3c0f0c64 (01:30): ab7faae5d7b250ea8606486575f8f79c: &quot;good&quot;, &quot;ok, with some problems&quot; and &quot;bad&quot; doesn't seem that confusing",
        "150ca666565bfcb850b2e2ee3c0f0c64 (01:31): but even with those three buckets there are going to be arguments as to what goes where",
        "f139aba52f9fa1394b4034a7954b2220 (01:33): yeah, my idea sucks. Don't listen to me.",
        "a924fb58d2c25874322f4e5126f608b9 (01:33): &quot;strict&quot;, &quot;transitional&quot;, &quot;invalid&quot;",
        "65325d50b2e25aca54bc871b89758c9c (01:34): I think &quot;good with no warnings&quot;, &quot;good with warnings&quot; and &quot;bad, there are some errors&quot; are sensible states",
        "65325d50b2e25aca54bc871b89758c9c (01:34): that is what programmers get from compilers and such",
        "f139aba52f9fa1394b4034a7954b2220 (01:37): that seems reasonable. Though it still sucks having to settle for compromises like this just to stop the arguments.",
        "65325d50b2e25aca54bc871b89758c9c (01:37): my personal point of view is that it's the right thing to do, not just a compromise",
        "65325d50b2e25aca54bc871b89758c9c (01:38): because sometimes, there are things that are often but not universally bad, and the right treatment is a mandatory but nonfatal diagnostic",
        "65325d50b2e25aca54bc871b89758c9c (01:38): some people will only care about error-free and take the warnings on a case-by-case basis, some will want their pages warning-free too",
        "f139aba52f9fa1394b4034a7954b2220 (01:39): I disagree, but fair enough",
        "a924fb58d2c25874322f4e5126f608b9 (01:39): That's fair enough, I think the problem are the people who just see &quot;Okay&quot; and ignore the &quot;but&quot;",
        "ab7faae5d7b250ea8606486575f8f79c (01:39): The validator could let you specify -Werror and Wno-foo",
        "65325d50b2e25aca54bc871b89758c9c (01:39): yes, the validator should be able to toggle warning classes and also optionally treat warnings as fatal",
        "ab7faae5d7b250ea8606486575f8f79c (01:39): (for all values of foo)",
        "65325d50b2e25aca54bc871b89758c9c (01:39): I personally would want to use it in that mode, I think",
        "f139aba52f9fa1394b4034a7954b2220 (01:40): 65325d50b2e25aca54bc871b89758c9c, are you suggesting this be applied to all attributes that are currently considered downplayed errors, or just to summary?",
        "65325d50b2e25aca54bc871b89758c9c (01:42): f139aba52f9fa1394b4034a7954b2220: 69b0d3dfe919a6b860a9fac82de52a7e proposed converting the whole &quot;downplayed error&quot; class into something warning-like (i.e. does not break conformance)",
        "65325d50b2e25aca54bc871b89758c9c (01:43): I think having &quot;error&quot; and &quot;warning&quot; instead of &quot;error&quot; and &quot;downplayed error&quot; as the two classes of diagnostics makes sense",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:43): yeah, i could reluctantly be convinced of that, i think",
        "65325d50b2e25aca54bc871b89758c9c (01:43): I haven't reviewed every current use of downplayed error, so I don't have an opinion on which should become nonfatal and which should be fatal",
        "65325d50b2e25aca54bc871b89758c9c (01:44): it would probably merit case-by-case review, since for some it may make sense to just convert them back to errors",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:44): (i was reading a scifi story recently where people could run simulations of their mental processes on a computer, and at one point one of the characters is in a debate",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:44): and he just ran 15,000 simulations of how the argument might play out with his simulated mental processes in &quot;vm&quot;s",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:45): in 95% of cases he was convinced. so he just decided to assume he'd be convinced, and skip the 15 minutes discussion that would otherwise ensue.",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:45): i find this a fascinating concept.)",
        "65325d50b2e25aca54bc871b89758c9c (01:46): I suppose that is meta-rational",
        "65325d50b2e25aca54bc871b89758c9c (01:46): (though sometimes it's important to know why you have been convinced)",
        "f139aba52f9fa1394b4034a7954b2220 (01:47): begins simulating tomorrow's public-html discussions",
        "ab7faae5d7b250ea8606486575f8f79c (01:47): Isn't that kind of missing the part of the debate that involves exchanging information with the other participant and becoming better informed?",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:47): the simulation included a simulation of the other participant",
        "65325d50b2e25aca54bc871b89758c9c (01:48): hmm, did annevk ever put the client rect and caret from point stuff in the CSSOM Editor's Draft?",
        "65325d50b2e25aca54bc871b89758c9c (01:48): or is it somewhere else?",
        "ab7faae5d7b250ea8606486575f8f79c (01:49): A simulation based on the first person's mental representation of the second person? (in which case the first person still wouldn't be able to learn anything new)",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:49): i don't recall the specifics",
        "ab7faae5d7b250ea8606486575f8f79c (01:51): &quot;authors should be aware that additional media resources might be necessary&quot; - but they are allowed to be unaware if they have valid reasons to be, though presumably they will have to somehow wipe their minds after carefully weighing the full implications and deciding to become unaware of it",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:51): is that in html5?",
        "ab7faae5d7b250ea8606486575f8f79c (01:52): notes that he is aware he is making a trivial point and ignoring all the important issues presented in the email",
        "ab7faae5d7b250ea8606486575f8f79c (01:52): 69b0d3dfe919a6b860a9fac82de52a7e: No, in sayrer's recent post to public-html",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:53): ah ok",
        "ab7faae5d7b250ea8606486575f8f79c (01:58): supposes a more constructive way to phrase the feedback would be to say that the proposed text uses the word &quot;should&quot; with no intended normative meaning, which is inconsistent with how that word is used throughout the rest of HTML 5",
        "ab7faae5d7b250ea8606486575f8f79c (01:58): but that's a boring way to say it",
        "f139aba52f9fa1394b4034a7954b2220 (02:07): &quot;New standards shouldn't carry the burden of backwards compatibility, that's the browser's (implementor's) job!&quot; -- http://twitter.com/minusfive/statuses/2522138950"
    ],
    "person_ids": [
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "65325d50b2e25aca54bc871b89758c9c",
        "b07211a0c7cb119232799d2119cea90f",
        "150ca666565bfcb850b2e2ee3c0f0c64",
        "f139aba52f9fa1394b4034a7954b2220",
        "fd9ef1223e855714294498ebfde79f98",
        "ab7faae5d7b250ea8606486575f8f79c",
        "a924fb58d2c25874322f4e5126f608b9"
    ]
}