{
    "id": "77c1859426801a0791efedd00cbd97e8",
    "messages": [
        "6132ec92889c0ce747ae9f7e44f90514 (16:24): b25b6b77a0087ff8385941e5545d32ea: ping?",
        "b25b6b77a0087ff8385941e5545d32ea (16:25): a480104b0e570389c6f4284a88c7cd9d: Hej",
        "a480104b0e570389c6f4284a88c7cd9d (16:25): notice should not be a problem for prior contributors to html5lib, but may be a headache.  Let me explain.",
        "a480104b0e570389c6f4284a88c7cd9d (16:26): for starters, html5lib is licensed in a way that allows other to take that work and incorporate it into a bigger project under a more restrictive license (say, GPL or proprietary).   With me so far?",
        "b25b6b77a0087ff8385941e5545d32ea (16:26): OK",
        "b25b6b77a0087ff8385941e5545d32ea (16:27): (er that OK was to the first line but I am OK with the second one too)",
        "a480104b0e570389c6f4284a88c7cd9d (16:28): the same thing is true in a smaller scale.  I contributed some code to html5lib under MIT.  Nothing in my contribution precludes you from having a notice which says &quot;these parts are licensed under MIT, those parts under cc-by&quot;.  Doing so does not require you to get my permission.",
        "b25b6b77a0087ff8385941e5545d32ea (16:28): a480104b0e570389c6f4284a88c7cd9d: OK",
        "a480104b0e570389c6f4284a88c7cd9d (16:29): cool",
        "b25b6b77a0087ff8385941e5545d32ea (16:30): a480104b0e570389c6f4284a88c7cd9d: But the problem I had in mind is redistribution of html5lib",
        "f139aba52f9fa1394b4034a7954b2220 (16:30): a480104b0e570389c6f4284a88c7cd9d, personally, I have a bad feeling about using a CC licence; even if it is the most permissive CC-by licence",
        "b25b6b77a0087ff8385941e5545d32ea (16:31): According to what you have said it is OK to have a file that is mixed MIT/CC",
        "a480104b0e570389c6f4284a88c7cd9d (16:31): b25b6b77a0087ff8385941e5545d32ea: I didn't mean to suggest doing so on the sub-file level.",
        "f139aba52f9fa1394b4034a7954b2220 (16:31): I personally prefer MIT, especially for the authroing guide (if not public domain), but modified-BSD seems like it would be ok too",
        "a480104b0e570389c6f4284a88c7cd9d (16:31): f139aba52f9fa1394b4034a7954b2220: it would be helpful if we can convert the &quot;bad feelings&quot; into tangible arguments.",
        "b25b6b77a0087ff8385941e5545d32ea (16:32): a480104b0e570389c6f4284a88c7cd9d: In that case it is a problem if I want to take a chunk of text about how the tokenizer should work and mix it up with my implementation of the tokenizer (say)",
        "f139aba52f9fa1394b4034a7954b2220 (16:32): a480104b0e570389c6f4284a88c7cd9d, the big problem I see is the GPL incompatibility.",
        "a480104b0e570389c6f4284a88c7cd9d (16:33): I've emailed a friend at the FSF.",
        "f139aba52f9fa1394b4034a7954b2220 (16:33): I think GPL compatibility should be an absolute requirement for any licence we choose",
        "3f2e2531201cfbf853f16f668132eaf2 (16:33): Google Code has a very limited selection of licences allowed for projects it hosts, and &quot;partly MIT and partly CC-by&quot; is not one of them",
        "b25b6b77a0087ff8385941e5545d32ea (16:34): 3f2e2531201cfbf853f16f668132eaf2: In principle one could host outside google code",
        "3f2e2531201cfbf853f16f668132eaf2 (16:34): It's a pain for anyone who wants to use html5lib as part of their project if they have the burden of understanding and following the extra requirements imposed by CC-by",
        "3f2e2531201cfbf853f16f668132eaf2 (16:35): (so it's a problem regardless of whether the licences are compatible (i.e. you can mix the code and distribute it all legally))",
        "f47636673b14c54021a69dc06f6a19fb (16:35): sent an email for collecting use cases and then we can do a grid with what each license authorizes or forbids to do",
        "a480104b0e570389c6f4284a88c7cd9d (16:35): My sense is that the W3C is going to demand attribution; I want to quantify the pain that such a demand costs.",
        "f47636673b14c54021a69dc06f6a19fb (16:36): I have the feeling that we are creating issues where there is none.",
        "3f2e2531201cfbf853f16f668132eaf2 (16:36): The practical pain is zero because people can copy-and-paste from the WHATWG version of the spec instead",
        "b25b6b77a0087ff8385941e5545d32ea (16:36): 3f2e2531201cfbf853f16f668132eaf2: I agree mixed licenses are a pain. And, if they don't work on the sub-file level really a blocker",
        "b25b6b77a0087ff8385941e5545d32ea (16:36): (maybe that applies to Apache 2 as well)",
        "f47636673b14c54021a69dc06f6a19fb (16:37): For 15 years, many open sources projects have implemented W3C technologies without any issues at all. :) There might be issue but that would be more reasonnable to start with concrete cases than saying we need this license",
        "3f2e2531201cfbf853f16f668132eaf2 (16:37): b25b6b77a0087ff8385941e5545d32ea: I'm not sure why the sub-file levels matters - what matters is whether the project as a whole can claim to be usable under the MIT licence or something more complex",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (16:38): f47636673b14c54021a69dc06f6a19fb, for a long time HTML4 was considered good enough too :p",
        "f47636673b14c54021a69dc06f6a19fb (16:38): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: ;) still good for me too ;) as a Web author",
        "f139aba52f9fa1394b4034a7954b2220 (16:38): a480104b0e570389c6f4284a88c7cd9d, even MIT says in the conditions that &quot;The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.&quot;, and the copyright statement would state the W3C",
        "f139aba52f9fa1394b4034a7954b2220 (16:39): isn't that enough for attribution?",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (16:39): f47636673b14c54021a69dc06f6a19fb, sure, w3schools wfm too",
        "b25b6b77a0087ff8385941e5545d32ea (16:39): 3f2e2531201cfbf853f16f668132eaf2: I think with CC-By the whole project can't claim to be MIT. I think a480104b0e570389c6f4284a88c7cd9d's argument is that you can work around that by mixing different licenses together. My concern is that you need to mix different licenses in the same file",
        "a480104b0e570389c6f4284a88c7cd9d (16:40): f139aba52f9fa1394b4034a7954b2220: I certainly intend to include MIT on the set of licenses that this group is OK with.",
        "f139aba52f9fa1394b4034a7954b2220 (16:40): a480104b0e570389c6f4284a88c7cd9d, BSD too?",
        "a480104b0e570389c6f4284a88c7cd9d (16:41): I have no issue with BSD without the advertising clause, or the Apache License.  Both would present similar challenges to html5lib.",
        "a480104b0e570389c6f4284a88c7cd9d (16:42): The Apache License would potentially pose additional problems to LGPLv2 but not LGPLv3.",
        "a480104b0e570389c6f4284a88c7cd9d (16:42): I say potentially, because there is disagreement over this.  My feeling is that when there is disagreement, it is better to avoid the issue.",
        "a480104b0e570389c6f4284a88c7cd9d (16:43): Meanwhile, I'd like to hear a clear answer to the question Karl posed on the mailing list.",
        "f139aba52f9fa1394b4034a7954b2220 (16:43): a480104b0e570389c6f4284a88c7cd9d, which question?",
        "f139aba52f9fa1394b4034a7954b2220 (16:44): oh, just got the mail",
        "a480104b0e570389c6f4284a88c7cd9d (16:44): http://lists.w3.org/Archives/Public/public-html/2009Feb/0062.html",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (16:44): Title: Re: Spec license from Karl Dubost on 2009-02-03 (<email/> from February 2009) (at lists.w3.org)",
        "b25b6b77a0087ff8385941e5545d32ea (16:47): has no idea what legally constitutes a derivative work",
        "3f2e2531201cfbf853f16f668132eaf2 (16:48): Another possible use case: Years in the future, some group of people are fed up with the stagnation of HTML5, and they decide to form a (non-W3C, non-WHATWG) working group to develop something informally called HTML6, and want to base their work on the existing HTML5 spec",
        "3f2e2531201cfbf853f16f668132eaf2 (16:49): Even less hypothetical: Someone wants to write http://html4all.org/wiki/index.php/HTML_Draft and copy some parts from the HTML5 spec",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (16:49): Title: HTML Draft - html4all (at html4all.org)",
        "f139aba52f9fa1394b4034a7954b2220 (16:49): 3f2e2531201cfbf853f16f668132eaf2, I agree. Forking the spec should be fine as long as they don't misrepresent the forked copy as being endorsed by the W3C",
        "f139aba52f9fa1394b4034a7954b2220 (16:50): but I think that would be a trademark issue anyway"
    ],
    "person_ids": [
        "6132ec92889c0ce747ae9f7e44f90514",
        "b25b6b77a0087ff8385941e5545d32ea",
        "a480104b0e570389c6f4284a88c7cd9d",
        "f139aba52f9fa1394b4034a7954b2220",
        "3f2e2531201cfbf853f16f668132eaf2",
        "f47636673b14c54021a69dc06f6a19fb",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0",
        "0a39f78bcb297ab0ebe8a29c28bfed89"
    ]
}