{
    "id": "780883b6f154dcec7aeb26e38e7b905e",
    "messages": [
        "edb259c0e0038f38bb200bc20c8cbf7e (15:47): b8810fee2f4a71f849f3f7409546d1d9, isn't XML 1.1 dead?",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:53): I wonder why the chairs are so vocal about splitting... I guess there was some backchannel chatter",
        "040342c014ffc1c11592948bd92e3721 (15:59): edb259c0e0038f38bb200bc20c8cbf7e: I think it has a lot to do with keeping the choice of external text format independent of HTML5",
        "040342c014ffc1c11592948bd92e3721 (16:00): png, jpeg, ogg, mpeg4 - none of these are specified as part of HTML5",
        "040342c014ffc1c11592948bd92e3721 (16:00): and nor should they by - there may be better formats in the future that the video, audio and img elements will have to support!",
        "040342c014ffc1c11592948bd92e3721 (16:01): it's really the same for external text associations for video and audio and a format definition should not be inside the spec",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:02): text/cache-manifest is in HTML5",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:02): as are text/ping, text/html-sandboxed, application/microdata+json",
        "ab7faae5d7b250ea8606486575f8f79c (16:03): Has anyone argued that it *should* be defined in the HTML5 document? (rather than arguing that it doesn't matter where the text exists for now and it's a waste of effort to worry about it before we even know whether it's a good enough solution that it should continue to exist)",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:03): Ian has",
        "ab7faae5d7b250ea8606486575f8f79c (16:04): Ah",
        "040342c014ffc1c11592948bd92e3721 (16:04): edb259c0e0038f38bb200bc20c8cbf7e: are those supposed to be used outside the Web by other apps, too?",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:05): 040342c014ffc1c11592948bd92e3721, whether there will be better formats in the future is somewhat orthogonal to where formats are specified",
        "040342c014ffc1c11592948bd92e3721 (16:05): not if the only format that is acceptable is the one inside the spec",
        "7f9405da4034bf43083e64b57302a8e6 (16:05): 040342c014ffc1c11592948bd92e3721, at least where the consensus is clear ‚Äî with the img element ‚Äî it would be good to document it. after all, png, gif, jpeg ARE all supported in almost every browser.",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:06): if we want to make more formats acceptable we change the spec",
        "7f9405da4034bf43083e64b57302a8e6 (16:06): without baseline formats you get compatibility nightmares",
        "7f9405da4034bf43083e64b57302a8e6 (16:06): what edb259c0e0038f38bb200bc20c8cbf7e said.",
        "040342c014ffc1c11592948bd92e3721 (16:06): you can call a format a baseline format without having it specified inside the spec",
        "040342c014ffc1c11592948bd92e3721 (16:06): we wouldn't include the theora specification into html5, either, to make it a baseline format",
        "7f9405da4034bf43083e64b57302a8e6 (16:07): 040342c014ffc1c11592948bd92e3721, how would an implementor know then if it isn't included ?",
        "040342c014ffc1c11592948bd92e3721 (16:07): a mere sentence that this is the baseline format and a link to its specification would be completely sufficient",
        "040342c014ffc1c11592948bd92e3721 (16:08): honestly, my mind boggles at the sheer idea that somebody implementing support for WebSRT in their desktop captioning application has to deal with the whole HTML5 spec!",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:08): why would they have to deal with the whole spec?",
        "040342c014ffc1c11592948bd92e3721 (16:09): because as it's part of the HTML5 spec, how will they know there is nothing in the rest of the spec that is not relevant to their implementation",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:09): also these are not the reasons brought forward for splitting",
        "040342c014ffc1c11592948bd92e3721 (16:09): they are my reasons",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:09): sure",
        "040342c014ffc1c11592948bd92e3721 (16:09): and I have brought them forward",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:10): sure",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:10): but they are not what started this IRC thread :)",
        "040342c014ffc1c11592948bd92e3721 (16:10): oh!",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:10): anyway, it seems that simply reading the WebSRT section should give them all the answers",
        "040342c014ffc1c11592948bd92e3721 (16:11): seems I have to keep up with the spec reading!",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:12): e.g. text/cache-manifest might get separate tool support as well",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:13): it's pretty easy to just read the part on text/cache-manifest to figure out how to construct such files and how to read them (e.g. if you write some kind of optimization tool)",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:13): some definitions are reused but they are all clearly hyperlinked",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:14): I don't really see what all the fuss is about; it mostly seems a lot of hand waving without much clear scenarios",
        "040342c014ffc1c11592948bd92e3721 (16:16): look at it this way: software is not written as one big main function either - stuff that is reused elsewhere is split into libraries - WebSRT is a &quot;library&quot; for me",
        "040342c014ffc1c11592948bd92e3721 (16:17): and the spec is too long for its own good anyway - takes ages to load in any browser!",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:17): edb259c0e0038f38bb200bc20c8cbf7e: Some aspects of XML 1.1 are undead, though",
        "040342c014ffc1c11592948bd92e3721 (16:18): btw: does anyone know why the links in the ToC at http://dev.w3.org/html5/spec/Overview.html don't work?",
        "040342c014ffc1c11592948bd92e3721 (16:18): I guess it's just the #websrt one that doesn't ...",
        "ab7faae5d7b250ea8606486575f8f79c (16:19): 040342c014ffc1c11592948bd92e3721: http://www.whatwg.org/specs/web-apps/current-work/complete/video.html#websrt loads faster",
        "040342c014ffc1c11592948bd92e3721 (16:20): yeah, I know, but I wanted to check what's in the w3c's spec",
        "040342c014ffc1c11592948bd92e3721 (16:20): I always use the whatwg link :)",
        "ab7faae5d7b250ea8606486575f8f79c (16:20): Oops, I got confused and forgot it was still in the HTML5 documents too",
        "040342c014ffc1c11592948bd92e3721 (16:20): hmm‚Ä¶ it seems it had to do with the page not being properly loaded by my browser - forget it :)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (16:29): 040342c014ffc1c11592948bd92e3721: that link probably doesn't work because that section is recently added and so the splitter has generated a new output file for it, and I've not yet committed that to cvs",
        "a9b326df4e6da61c5b6f5e1058be83a2 (16:29): I'll take a look noew",
        "040342c014ffc1c11592948bd92e3721 (16:29): it worked after a reaload actually",
        "040342c014ffc1c11592948bd92e3721 (16:29): nothing to worry about"
    ],
    "person_ids": [
        "edb259c0e0038f38bb200bc20c8cbf7e",
        "040342c014ffc1c11592948bd92e3721",
        "ab7faae5d7b250ea8606486575f8f79c",
        "7f9405da4034bf43083e64b57302a8e6",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "a9b326df4e6da61c5b6f5e1058be83a2"
    ]
}