{
    "id": "7a902f8346e7eb51229a7edc2e9e1c1d",
    "messages": [
        "b25b6b77a0087ff8385941e5545d32ea (23:18): Sigh",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:19): notices people have been having fun over the weekend",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:19): played Super Mario World and Call of Duty 4",
        "b25b6b77a0087ff8385941e5545d32ea (23:20): heh",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:21): and I used my friends high upload bandwidth to get my Cambridge photos on flickr",
        "a924fb58d2c25874322f4e5126f608b9 (23:21): edb259c0e0038f38bb200bc20c8cbf7e: I'm sure you could make a game out of public-html. They managed to come up with buzzword bingo, after all :)",
        "b25b6b77a0087ff8385941e5545d32ea (23:22): wonders if the a11y people only play text based adventures",
        "a924fb58d2c25874322f4e5126f608b9 (23:24): b25b6b77a0087ff8385941e5545d32ea: Making textual alternates available would make most games very prone to macroing/botting/etc",
        "b25b6b77a0087ff8385941e5545d32ea (23:24): edb259c0e0038f38bb200bc20c8cbf7e: Did you have fun punting in the rain?",
        "cc097e0d7183ae8436e7df709553c8c0 (23:25): b8810fee2f4a71f849f3f7409546d1d9: fwiw, i now didn't get that error message when filing a bug",
        "ab7faae5d7b250ea8606486575f8f79c (23:26): I like how some games (at least Portal, and probably the Half Life 2 games too) have closed captioning, so you can get all the audio cues even without any audio",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:27): ef6f2287bae00ba79475fbf56c2b6fee: There's indeed tension between saying &quot;this stuff sucks so you shouldn't use it for new content&quot; and &quot;this stuff sucks so badly that you should go and remove if from the content you are upgrading&quot;",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:27): ef6f2287bae00ba79475fbf56c2b6fee: I think we don't have a good solution that respects both the time of upgraders and of authors starting from a clean slate",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:28): well, one could actually differentiate between the two",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:28): btw, if you like Mario, http://www.youtube.com/watch?v=in6RZzdGki8 is quite funny",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:28): whether it's good to do so or not I don't know.",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:28): b25b6b77a0087ff8385941e5545d32ea, there wasn't too much rain actually",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:29): b8810fee2f4a71f849f3f7409546d1d9: for example one could error in response to &amp;gt= but only warn for &amp;name=",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:29): b25b6b77a0087ff8385941e5545d32ea, it was fun to do",
        "b25b6b77a0087ff8385941e5545d32ea (23:29): Ah, I saw Hakon had his umbrella out",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:30): it's from Bert iirc",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:30): but the drops were hardly noticable for most of it",
        "b25b6b77a0087ff8385941e5545d32ea (23:36): Sigh**2",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:38): maybe you should set up a proxy that filters out WHATWG and HTML5 related e-mail until your thesis is done :)",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:38): though I guess it gives some distraction",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:42): ef6f2287bae00ba79475fbf56c2b6fee: the problem is how to distinguish them in a way that doesn't fail like HTML 4.01 Strict vs. Transitional?",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:42): ef6f2287bae00ba79475fbf56c2b6fee: it seems a bit pointless to make the validator emit messages at all where the messages are meant to be ignored",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:42): b8810fee2f4a71f849f3f7409546d1d9: warnings aren't &quot;meant to be ignored&quot;.",
        "b25b6b77a0087ff8385941e5545d32ea (23:43): edb259c0e0038f38bb200bc20c8cbf7e: Not such a bad idea I guess. But I think my thesis will get done. It's just annoying to try and explain something clearly and then realise that you didn't get your message across at all",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:43): ef6f2287bae00ba79475fbf56c2b6fee: I'm getting into the game of analyzing millions of pages in order to get data about what kind of errors are the ones that would particularly waste the time of upgraders",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:44): b8810fee2f4a71f849f3f7409546d1d9: I think the &quot;failure&quot; (if there was one) had to do with choices about what went into strict that disagreed with what authors wanted to use and that worked in the browsers they cared about.",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:44): b25b6b77a0087ff8385941e5545d32ea, maybe you should try to enforce your points by law",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:45): b8810fee2f4a71f849f3f7409546d1d9: I suppose target and iframe being the most important examples.",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:45): b25b6b77a0087ff8385941e5545d32ea, they'll probably be familiar with that",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:45): hides",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:45): ef6f2287bae00ba79475fbf56c2b6fee: as far as HTML tables and IE installed base are concerned, we have that kind of problem with HTML5",
        "a924fb58d2c25874322f4e5126f608b9 (23:45): ef6f2287bae00ba79475fbf56c2b6fee: Didn't stop target from being a point of contention in html5 as well :)",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:46): a924fb58d2c25874322f4e5126f608b9: Well of course not. Authors wanting to use doesn't make it a great idea.",
        "a924fb58d2c25874322f4e5126f608b9 (23:46): Whether it's a good idea or not doesn't mean much if it leads to scrapping your strict version by authors",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:47): depends on what the point of the versioning is",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:47): if the point of conformance is to get &quot;good practice&quot; but you can only get conformance by sanctioning &quot;bad practice&quot; that's a largely pointless exercise.",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:48): fwiw, I'm not so much concerned about pushing an ideal of good practice",
        "a924fb58d2c25874322f4e5126f608b9 (23:48): ef6f2287bae00ba79475fbf56c2b6fee: Not if allowing one bad practice means they fix a dozen others",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:48): I'm more interested in producing a tool that allows authors catch mistakes they didn't make",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:49): although Validator.nu does have political good practice aspects",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:49): what are &quot;mistakes they didn't make&quot;?",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:49): oops",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:49): didn't *intend* to make",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:50): how can you intend to make a mistake?",
        "a924fb58d2c25874322f4e5126f608b9 (23:50): E.g. if you're using a bad practice on purpose",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:50): is that good or bad? using a &quot;bad practice&quot; on purpose.",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:50): ef6f2287bae00ba79475fbf56c2b6fee: if you use &lt;embed&gt; in HTML 4.01 on purpose, for example",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:51): that's not a &quot;mistake&quot;. that's a conformance error.",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:51): or an instance of deliberate non-conformance",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:52): validators can't really do much about instances of deliberate non-conformance",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:52): wonders what the point of this conversation is",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:52): the point for me, is increasing puzzlement about what conformance in HTML5 is, and its integrity as a single thing.",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:53): edb259c0e0038f38bb200bc20c8cbf7e: I guess the point on my side is that I don't believe as much in the wishful part of conformance as I think Hixie does",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:53): edb259c0e0038f38bb200bc20c8cbf7e: when it comes to removing &quot;bad&quot; legacy features from the conforming language",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:54): it seems to me the one bit of conformance everyone (?) would buy into is where you recommend features that work in lots of user agents over features that do the same thing but in fewer user agents.",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:56): Hixie seems keen to use conformance to protect future extension points, which is a good idea, but of less widespread appeal.",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:56): works for CSS",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:57): ef6f2287bae00ba79475fbf56c2b6fee: that's not what making align on td non-conforming is about, though",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:57): edb259c0e0038f38bb200bc20c8cbf7e: CSS has extension points built into the language.",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:57): edb259c0e0038f38bb200bc20c8cbf7e: I don't think CSS validation/conformance has been a particularly powerful force for authors.",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:57): e.g. non-validating hacks, opacity, filter, vendor-specific extensions",
        "ef6f2287bae00ba79475fbf56c2b6fee (23:58): with the last one built-in, but forbidden",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:58): I stopped paying attention to CSS validation when I couldn't configure the validator to grok Prince extensions",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:58): the validator should probably group extensions as a single error",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:59): edb259c0e0038f38bb200bc20c8cbf7e: this was the CSS validator running inside Oxygen",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:59): my impression has always been that quite a few authors do use the CSS validator, but that's anecdotical",
        "ef6f2287bae00ba79475fbf56c2b6fee (00:00): Then there's conformance for trying to change authoring practices that could lead to errors, even when they in fact aren't errors that cause problems. e.g. &amp;name in href.",
        "b8810fee2f4a71f849f3f7409546d1d9 (00:00): or spaces in URLs most of the time",
        "ef6f2287bae00ba79475fbf56c2b6fee (00:00): While I'm glad of a tool to check that, I suspect that will reduce the amount of conformance considerably.",
        "ef6f2287bae00ba79475fbf56c2b6fee (00:01): e.g. lots of relatively conforming webpages fail to encode ampersands now",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:01): &amp;name could cause a problem going forward",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:01): though that is somewhat avoided by requiring ; for new entities",
        "ef6f2287bae00ba79475fbf56c2b6fee (00:01): edb259c0e0038f38bb200bc20c8cbf7e: yeah well I'm talking about &amp;name= not &amp;name;",
        "ef6f2287bae00ba79475fbf56c2b6fee (00:02): and if one didn't require ; that would break _old_ content using &amp;name=",
        "ef6f2287bae00ba79475fbf56c2b6fee (00:02): of which there's plenty",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:02): &amp;name is slightly suboptimal from a parser point of view",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:02): so an author might want to optimize that",
        "ef6f2287bae00ba79475fbf56c2b6fee (00:03): yeah. they _might_.",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:03): anyway, if you want &amp;name to be conforming, you want <email/>",
        "ef6f2287bae00ba79475fbf56c2b6fee (00:04): personally, I don't care whether it's conforming or not particularly (I just use &amp;amp; ). I just think it's interesting as an aspect of the emerging picture of HTML5 conformance.",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:05): ok",
        "ef6f2287bae00ba79475fbf56c2b6fee (00:07): my guess (it's only a guess) is that there will be more websites failing conformance because of ampersand rules than would if HTML5 required alt (for example), since I see lots of websites with alt but that fail to encode ampersands",
        "ef6f2287bae00ba79475fbf56c2b6fee (00:07): Flickr probably won't conform whatever the conformance rules are (alt isn't a &quot;problem&quot; for Flickr now, it just uses alt=&quot;&quot; on the main photo page; it doesn't encode ampersands however).",
        "ef6f2287bae00ba79475fbf56c2b6fee (00:08): given those speculations, I find much of the alt debate rather odd",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:08): b8810fee2f4a71f849f3f7409546d1d9 has stats on that",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:09): I find it rather odd for very different reasons :D",
        "ef6f2287bae00ba79475fbf56c2b6fee (00:09): oh there are other odd things said by most correspondents",
        "b8810fee2f4a71f849f3f7409546d1d9 (00:12): edb259c0e0038f38bb200bc20c8cbf7e: what do I have stats on?",
        "ef6f2287bae00ba79475fbf56c2b6fee (00:13): b8810fee2f4a71f849f3f7409546d1d9: websites with/without alt, with/without ampersands encoded properly, combinations thereof, I think?",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:13): common conformance errors on pages",
        "ef6f2287bae00ba79475fbf56c2b6fee (00:13): oh, pages is somewhat different",
        "ef6f2287bae00ba79475fbf56c2b6fee (00:13): e.g. photo sharing sites have lots of pages, few links.",
        "b8810fee2f4a71f849f3f7409546d1d9 (00:13): when I ran the alexa 500 through the validator, absent alt wasn't a machine-checkable conformance error",
        "ef6f2287bae00ba79475fbf56c2b6fee (00:14): note I said &quot;websites failing conformance&quot;",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:14): nm then b8810fee2f4a71f849f3f7409546d1d9, seems I missed his point",
        "b8810fee2f4a71f849f3f7409546d1d9 (00:15): hmm. looks like my mass validation harness is broken or the disk image containing the test data has a corrupt file system...",
        "b8810fee2f4a71f849f3f7409546d1d9 (00:15): or both...",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:17): http://serialseb.blogspot.com/2008/08/proposing-syntax-to-attach-behaviors-to.html#c8752145182107351356 ?",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:17): zcorpen ? ^^",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:18): http://ajaxworld.com/general/sessiondetail1008.htm?id=57",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:19): people from Kaazing Corporation will speak about HTML5..."
    ],
    "person_ids": [
        "b25b6b77a0087ff8385941e5545d32ea",
        "edb259c0e0038f38bb200bc20c8cbf7e",
        "a924fb58d2c25874322f4e5126f608b9",
        "cc097e0d7183ae8436e7df709553c8c0",
        "ab7faae5d7b250ea8606486575f8f79c",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "ef6f2287bae00ba79475fbf56c2b6fee"
    ]
}