{
    "id": "7b0c928959ea390b7f824ecb2fd1d8e5",
    "messages": [
        "ab7faae5d7b250ea8606486575f8f79c (20:07): b25b6b77a0087ff8385941e5545d32ea: Haven't you set something up so you can collect that kind of data yourself? :-)",
        "ab7faae5d7b250ea8606486575f8f79c (20:08): by which I mean I probably won't be motivated to find time to look at it myself, since I'd probably have to write lots of Java to extract the right data, and I don't like writing DOM/SAX code in Java",
        "a11aabeeceeae6b8cb5d12ea06b56554 (20:29): sighs at some of the arguments around the intarwebs about HTML 5",
        "a11aabeeceeae6b8cb5d12ea06b56554 (20:29): Would it not be more productive to send substantial comments about the spec rather than write substantial blog posts bitching about the process (whether fair or not).",
        "ab7faae5d7b250ea8606486575f8f79c (20:32): a11aabeeceeae6b8cb5d12ea06b56554: No, because substantial comments about the spec would get disregarded due to the problems with the process",
        "ab7faae5d7b250ea8606486575f8f79c (20:32): and the solution to such a problem is not to send more substantial comments that will all get disregarded",
        "a11aabeeceeae6b8cb5d12ea06b56554 (20:32): OK, then bitch to W3C management and not on blogs?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (20:33): Fork the spec?",
        "69b301143beca31e76cf7bfdbd4d5537 (20:33): a11aabeeceeae6b8cb5d12ea06b56554: not for people who have disengaged with the process by choice",
        "a11aabeeceeae6b8cb5d12ea06b56554 (20:33): They all seem more productive things to do in that case.",
        "69b301143beca31e76cf7bfdbd4d5537 (20:33): forking the spec sounds like work",
        "a11aabeeceeae6b8cb5d12ea06b56554 (20:33): Bitching on blogs will _not_ fix any problems.",
        "69b301143beca31e76cf7bfdbd4d5537 (20:33): which doesn't really satisfy the same human urges that bitching does ;)",
        "ab7faae5d7b250ea8606486575f8f79c (20:34): a11aabeeceeae6b8cb5d12ea06b56554: Those are worse options in the cost/benefit ratio, because complaining on blogs and is easy and it might possibly eventually cause some change, whereas the other options require a lot more effort",
        "ab7faae5d7b250ea8606486575f8f79c (20:35): The current evidence indicates it takes years of work for an unofficial fork of HTML to be seen as legitimate",
        "69b301143beca31e76cf7bfdbd4d5537 (20:36): and that's with the backing of major browser developers",
        "ab7faae5d7b250ea8606486575f8f79c (20:37): It's like the current HTML 5 is an asteroid heading catastrophically towards Earth, and blog comments are like bouncing little rocks off it in an attempt to deflect it onto a course that won't destroy the things those people care about",
        "ab7faae5d7b250ea8606486575f8f79c (20:38): whereas you're suggesting building an entire new asteroid and making sure that hits Earth first and knocks it out of the way so the other asteroid won't have any detrimental impact",
        "ab7faae5d7b250ea8606486575f8f79c (20:40): and your other suggestion is that those people should complain to God so that He declares the asteroid as unholy in the hope that the asteroid will realise the error of its ways",
        "a11aabeeceeae6b8cb5d12ea06b56554 (20:40): stops bitching about the bitchers",
        "ab7faae5d7b250ea8606486575f8f79c (20:40): I like this analogy",
        "69b301143beca31e76cf7bfdbd4d5537 (20:41): people who see the standards process as a way to strong-arm browser developers are unlikely to find satisfaction in the current process",
        "a11aabeeceeae6b8cb5d12ea06b56554 (20:41): wonders how Content-Type is parsed",
        "69b301143beca31e76cf7bfdbd4d5537 (20:42): (or in any other process that has a realistic chance to displace it)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (20:42): Short immediately apparent answer: not how the spec says.",
        "69b301143beca31e76cf7bfdbd4d5537 (20:43): so I think there is some fallout from the breakdown of unrealistic expectations that had seemed reasonable for a few years",
        "a11aabeeceeae6b8cb5d12ea06b56554 (20:44): How boring. That page now has sane headers.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (20:45): Garbage at the end is ignored.",
        "b25b6b77a0087ff8385941e5545d32ea (20:48): ab7faae5d7b250ea8606486575f8f79c: Er, the point is that I haven't finished writing the data parsing tools",
        "b25b6b77a0087ff8385941e5545d32ea (20:49): Particularly the more advanced stuff like integrating the validator.nu parser",
        "ab7faae5d7b250ea8606486575f8f79c (20:49): b25b6b77a0087ff8385941e5545d32ea: Sounds like you've now got an excellent reason to finish them ;-)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (20:49): Actually, garbage in general is ignored.",
        "b25b6b77a0087ff8385941e5545d32ea (20:50): ab7faae5d7b250ea8606486575f8f79c: so would it obviously be horrendously slow to pipe sax output from validator.nu to other, saner, programming languages?",
        "b25b6b77a0087ff8385941e5545d32ea (20:51): Or is there some other reason that is a bad idea?",
        "ab7faae5d7b250ea8606486575f8f79c (20:51): b25b6b77a0087ff8385941e5545d32ea: That does sound horrendously slow",
        "ab7faae5d7b250ea8606486575f8f79c (20:51): b25b6b77a0087ff8385941e5545d32ea: You could use Jython",
        "ab7faae5d7b250ea8606486575f8f79c (20:51): (which shouldn't be as horrendously slow)",
        "b25b6b77a0087ff8385941e5545d32ea (20:51): Yeah, maybe Jython would be a good idea",
        "ab7faae5d7b250ea8606486575f8f79c (20:52): The overhead of serialisation and IPC and parsing seems like a really bad idea when there's so much data",
        "ab7faae5d7b250ea8606486575f8f79c (20:52): so processing the data as close to the parser as possible is a good thing",
        "ab7faae5d7b250ea8606486575f8f79c (20:52): Ooh, you could use Scala!",
        "b25b6b77a0087ff8385941e5545d32ea (20:53): ab7faae5d7b250ea8606486575f8f79c: The idea, I guess, would be to pre-filter the data s much as possible (e.g. using regexps)",
        "ab7faae5d7b250ea8606486575f8f79c (20:53): I don't know what that is but people have talked about it so it must be alright",
        "ab7faae5d7b250ea8606486575f8f79c (20:53): b25b6b77a0087ff8385941e5545d32ea: Regexps are slow :-p",
        "b25b6b77a0087ff8385941e5545d32ea (20:53): Faster than parsing :-p",
        "ab7faae5d7b250ea8606486575f8f79c (20:53): Hmm, not sure how much difference there'd be",
        "ab7faae5d7b250ea8606486575f8f79c (20:54): (particularly for streaming SAX parsing)",
        "b25b6b77a0087ff8385941e5545d32ea (20:54): Yeah but with the SAX parsing you still have to do more work to get useful information out",
        "ab7faae5d7b250ea8606486575f8f79c (20:55): Depends what information you want to get out",
        "ab7faae5d7b250ea8606486575f8f79c (20:55): 's Java stuff uses SAX for some things and DOM for other things, depending on which seemed easier",
        "b25b6b77a0087ff8385941e5545d32ea (20:56): generally wants to end up writing processing code in something less painful than java",
        "b25b6b77a0087ff8385941e5545d32ea (20:56): Since it will just be a bunch of one-shot filters",
        "ab7faae5d7b250ea8606486575f8f79c (20:56): I haven't found it painful to write processing code in Java",
        "b25b6b77a0087ff8385941e5545d32ea (20:57): ab7faae5d7b250ea8606486575f8f79c: You have found it painful enough that you don't want to do this for me :p",
        "ab7faae5d7b250ea8606486575f8f79c (20:57): It helps that the Java code is just extracting information and outputting a giant XML stream, and then I use command-line tools and Perl to do the rest of the analysis and summarisation",
        "ab7faae5d7b250ea8606486575f8f79c (20:58): b25b6b77a0087ff8385941e5545d32ea: That would be equally painful in any language :-)",
        "ab7faae5d7b250ea8606486575f8f79c (20:58): because I'd have to work out what you actually want, and then how to extract it from a document tree, and then how to present it, and all of those things are language-independent"
    ],
    "person_ids": [
        "ab7faae5d7b250ea8606486575f8f79c",
        "a11aabeeceeae6b8cb5d12ea06b56554",
        "69b301143beca31e76cf7bfdbd4d5537",
        "b25b6b77a0087ff8385941e5545d32ea"
    ]
}