{
    "id": "7ee4ad160fbb90b3c9423e4a785155c2",
    "messages": [
        "62cea188fdc23e71aef586be47712375 (20:42): hello",
        "a96824aae97f64637144aac03289cdeb (20:42): asl?",
        "62cea188fdc23e71aef586be47712375 (20:43): 16fusa",
        "a96824aae97f64637144aac03289cdeb (20:43): 16 yr old male, chicago",
        "62cea188fdc23e71aef586be47712375 (20:44): Oh. Sir, we might be neighbors. No, I live close though... like, 15 to 20 minute drive up to Chicago...",
        "a96824aae97f64637144aac03289cdeb (20:44): you still there?",
        "62cea188fdc23e71aef586be47712375 (20:44): yea",
        "a96824aae97f64637144aac03289cdeb (20:44): nice, its a great city, huh",
        "62cea188fdc23e71aef586be47712375 (20:44): that it is.",
        "a96824aae97f64637144aac03289cdeb (20:44): why are you on omegle this fine afternoon?",
        "62cea188fdc23e71aef586be47712375 (20:45): Ah, bored and looking for excitement. You?",
        "a96824aae97f64637144aac03289cdeb (20:45): same thing here, and I&apos;m pretty horny to tell you the truth ;-)",
        "62cea188fdc23e71aef586be47712375 (20:45): I figured. Most peopleon here are... hehe.",
        "62cea188fdc23e71aef586be47712375 (20:46): well sir, I can tell you I&apos;m not wearing a shirt. Or a bra",
        "a96824aae97f64637144aac03289cdeb (20:46): you in the same mood as me?",
        "62cea188fdc23e71aef586be47712375 (20:47): Clearly if I haven&apos;t disconnected yet...",
        "a96824aae97f64637144aac03289cdeb (20:47): that means that were both DTF, you want to start or want me to?",
        "62cea188fdc23e71aef586be47712375 (20:47): DTF? and you can",
        "a96824aae97f64637144aac03289cdeb (20:48): DTF= down to fuck",
        "a96824aae97f64637144aac03289cdeb (20:48): lets get this party started",
        "62cea188fdc23e71aef586be47712375 (20:48): heh",
        "a96824aae97f64637144aac03289cdeb (20:48): were in your bedroom, I&apos;m helping you with homework",
        "a96824aae97f64637144aac03289cdeb (20:48): your parents are at a movie, and were home alone",
        "62cea188fdc23e71aef586be47712375 (20:49): hehe. Ok. I go to a Catholic school, so we have to wear those little plaid uniforms. You&apos;re helping me with my algebra, whcih I don&apos;t quite get...",
        "a96824aae97f64637144aac03289cdeb (20:50): these math problems take alot of effort huh, mabey we should take a break?",
        "62cea188fdc23e71aef586be47712375 (20:50): Yeah, I&apos;m beat. Wanna grab a soda?\r\nI stand up and head towards the kitchen, pulling down on my rising skirt",
        "a96824aae97f64637144aac03289cdeb (20:52): alright, lets go, I&apos;ve been thirsty for you, uh, i mean thirsty for a soda, ever since we started this homework",
        "62cea188fdc23e71aef586be47712375 (20:52): I laugh but pretend as if I didn&apos;t catch your slip of the tongue. I reach up into the cabinet, but I&apos;m too short. I have to jump a little, but I still can&apos;t reach the glasses.",
        "a96824aae97f64637144aac03289cdeb (20:53): i like watching your tits bounce up and down as you jump, but i don&apos;t say anything, and i grab the glass for you",
        "62cea188fdc23e71aef586be47712375 (20:54): I take them from you, letting my hand linger lightly on yours, and open the fridge. The soda&apos;s are on the bottom shelf so I bend down to grab it.",
        "a96824aae97f64637144aac03289cdeb (20:56): i can&apos;t restrain myself anymore, when you come up with the sodas, I grab you and give you best kiss you&apos;ve ever felt, and say &quot;I&apos;ve waited long enough&quot;",
        "62cea188fdc23e71aef586be47712375 (20:56): I jump a little, suprised, but kiss back. I put the soda on the counter and wrap my arms around your neck",
        "a96824aae97f64637144aac03289cdeb (20:57): i begin to kiss you more passionatly than you&apos;ve ever felt, and my tounge is swirling in your mouth",
        "62cea188fdc23e71aef586be47712375 (20:58): I respond fast, gently pushing against your tongue with mine.",
        "62cea188fdc23e71aef586be47712375 (20:59): My parents might be home soon...\r\nI say, breaking the kiss",
        "a96824aae97f64637144aac03289cdeb (21:00): my hands slowly creep downwards towards your firm ass, and I squeeze, gently massaging it. I grab you hand as we stop kissing, and lead you back towards the bedroom",
        "a96824aae97f64637144aac03289cdeb (21:00): how about we practice a different subject than algebra?",
        "62cea188fdc23e71aef586be47712375 (21:01): Oh, and what subject is that?\r\nI lay down on my bed anxiously, nervous",
        "a96824aae97f64637144aac03289cdeb (21:01): its called sex ed, and i&apos;m more than certified to teach it to a student as good as you",
        "a96824aae97f64637144aac03289cdeb (21:02): I slowly unbutton your shirt as my hand creeps up your skimpy plaid skirt",
        "62cea188fdc23e71aef586be47712375 (21:02): I giggle and shift.\r\nI&apos;ve never done this before you know... \r\nI nervously run my hand over the zipper of your pants.",
        "62cea188fdc23e71aef586be47712375 (21:04): (I&apos;m warning you I have to leave in 23 minutes(",
        "a96824aae97f64637144aac03289cdeb (21:04): its alright, everyone has a first time.... my hand finally reaches your pretty little pussy, and as I move your panties aside, you push my hand aside and say lets actually do this. you take off your shirt and skirt, lying in lingerie on the bed",
        "62cea188fdc23e71aef586be47712375 (21:05): I stare up at you and rub my legs together before spreading them I grab your hand and put it on my tit and you start to rub",
        "a96824aae97f64637144aac03289cdeb (21:06): my mouth moves down towards your spread legs, as i start to eat you out like you never have beenm",
        "62cea188fdc23e71aef586be47712375 (21:07): Mmmm. \r\nI moan loud as you eat my virgin pussy. I press my palm against your head and feel you&apos;re mouth...",
        "a96824aae97f64637144aac03289cdeb (21:08): I eat you until I feel you squirt, and as I stand up, I ask can you return the favor",
        "62cea188fdc23e71aef586be47712375 (21:09): I blush and nervously sit at the edge of the bed. I look up at you and pull down your pants and stare at your dick. I pick it up and lick it, top to bottom once, then stick it as deep in my mouth as it will go, bobbin my head up and dow",
        "62cea188fdc23e71aef586be47712375 (21:09): m",
        "62cea188fdc23e71aef586be47712375 (21:09): m*",
        "62cea188fdc23e71aef586be47712375 (21:09): N**",
        "a96824aae97f64637144aac03289cdeb (21:10): Fuck that feels sooo good!! Are you sure this is your first time? I grab your head and force it back and forth on my dick, as you moan and suck harder",
        "62cea188fdc23e71aef586be47712375 (21:10): I gag a little but take it sucking you off.",
        "a96824aae97f64637144aac03289cdeb (21:11): fuck yeah, I slowly pull out of your mouth, my dick now lubed and ready to go, I lay you back down on the bed, and spread your legs",
        "62cea188fdc23e71aef586be47712375 (21:12): I moan and wait",
        "a96824aae97f64637144aac03289cdeb (21:13): and slip it into your pussy, and start to slowly go in and out, increasing with each thrust, faster and deeper",
        "a96824aae97f64637144aac03289cdeb (21:14): you like that??"
    ],
    "person_ids": [
        "62cea188fdc23e71aef586be47712375",
        "a96824aae97f64637144aac03289cdeb"
    ]
}