{
    "id": "7fd9b241fe02e9f4dd82c5a3a4290410",
    "messages": [
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (12:34): omg, role= fanboys",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:39): and a +1 with an exclamation point. nice variation, that",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:40): I think I'm going to write a filter for the list server that replaces all &quot;+1&quot; instances with &quot;Aye, matey&quot;",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (12:40): just deletes those e-mails for now until someone starts giving the idea serious consideration",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (12:40): a9b326df4e6da61c5b6f5e1058be83a2, e-mail that to <email/>",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (12:40): (the script)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:42): will do",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:50): b8810fee2f4a71f849f3f7409546d1d9 - question: what are the main things you use your N770 for? checking e-mail? browsing?",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:56): a9b326df4e6da61c5b6f5e1058be83a2: I use it mainly when I'm going somewhere using public transport",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:57): a9b326df4e6da61c5b6f5e1058be83a2: If I'm not familiar with my destination, I use the 770 to access http://reittiopas.fi/ which is the Helsinki area public transport travel planner",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:57): a9b326df4e6da61c5b6f5e1058be83a2: If I know where I'm going, I use it as an HTML ebook reader",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:57): a9b326df4e6da61c5b6f5e1058be83a2: or a Planet Intertwingly client",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:58): a9b326df4e6da61c5b6f5e1058be83a2: and I use it as an ssh client to connect to screen/irssi",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:00): a9b326df4e6da61c5b6f5e1058be83a2: I don't use it for email, because it doesn't like the broken SSL setup of the IMAP server I use",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:03): b8810fee2f4a71f849f3f7409546d1d9 - OK. was just curious. Do you also have a mobile phone with a browser running on it?",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:05): a9b326df4e6da61c5b6f5e1058be83a2: my phone runs Opera Mini, but I stopped using Opera Mini when I started using the big Opera on the 770",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:07): b8810fee2f4a71f849f3f7409546d1d9 - I see",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:07): wishes he had a handset here that Mini could run on ...",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:08): recent versions of Mini have a feature for intelligent detection and collapsing of navigation menus",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:08): so you don't have scroll through them",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:08): smart stuff",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:08): oh. I haven't updated Mini for a while",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:09): try out the newest. you might be surprised the stuff it does",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:11): anyway, main handset I use every day has full native Opera 8.6 mobile running on it",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:12): use it for all kinds of stuff - checking Gmail, reading feeds, news, search",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:12): b8810fee2f4a71f849f3f7409546d1d9 - you don't do much feed reading on your 770?",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:12): I understood the the 770 was for real when I saw timeless read his bugmail in Gmail on the 770",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:12): a9b326df4e6da61c5b6f5e1058be83a2: no feed reading. I read the front page of Planet Intertwingly",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:13): although now I have a flat-rate GPRS plan, so I could start reading feeds",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:13): ah yes",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:14): flat-rate makes all the difference. no point in having phat bandwidth if you gotta pay for all the packets",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:33): nice 139513027e8e90b5582cbc68fc733884",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:33): thought the same thing about the role= message",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:34): (well, except for the possible performance gain)",
        "139513027e8e90b5582cbc68fc733884 (13:35): I'm not sure how much time to spend deflecting silly ideas",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:35): well, that was one reason I didn't reply",
        "139513027e8e90b5582cbc68fc733884 (13:35): role, global src and global href seem to be the most persistent",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:35): sometimes I've the feeling that Hixie will reply in the end anyway and that making the same point over and over again isn't really worth it",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:36): I think Hixie has constrained the applicability of the predefined classes too much",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:36): I often hope people would invest a little bit more time in finding out why HTML5 specified it in a certain way instead of thinking directly that it's incorrect",
        "139513027e8e90b5582cbc68fc733884 (13:36): based on the &quot;copyright&quot; example I would guess you are right",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:36): b8810fee2f4a71f849f3f7409546d1d9, yeah, maybe",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:36): but the whole class= thing isn't done yet afaik",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:37): conflicing class values are not yet addressed for instance",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:37): There was also a global cite= attribute proposal btw",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:37): for example, I use &quot;warning&quot; and &quot;error&quot; on &lt;li&gt;",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:38): e3fb62ebfa4f36acf5cbff6a6ed0f2e0 - would help to have &quot;finding out why HTML5 specified it in a certain way&quot; stuff documented more",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:38): other than just in the list archive",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:38): as for conflicts, people need to think about this in terms of engineering tolerances instead of having the mathematician hat on",
        "139513027e8e90b5582cbc68fc733884 (13:38): some of the predefined class names also seem limited in their applicability",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:39): (I mean it would help in getting people to understand why)",
        "139513027e8e90b5582cbc68fc733884 (13:39): as in, they seem like they are only useful for writing standards documents",
        "139513027e8e90b5582cbc68fc733884 (13:40): the set of allowed elements is definitely too limited",
        "139513027e8e90b5582cbc68fc733884 (13:40): &quot;copyright&quot; is especially funny in not allowing &lt;small&gt;, since &lt;small&gt; &quot;represents small print (part of a document often describing legal restrictions, such as copyrights or other disadvantages)&quot;",
        "139513027e8e90b5582cbc68fc733884 (13:41): it would probably be better to allow the predefined class names on anything as a going-in assumption",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:53): a9b326df4e6da61c5b6f5e1058be83a2, design principles cover that in a general way",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:53): true",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:55): i suppose at some point we could create wiki pages such as &quot;WhyNotRole&quot; etc.",
        "139513027e8e90b5582cbc68fc733884 (13:55): seems like a good thing to do for recurring topics",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:56): aye, maties",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:56): wonders what the plural of &quot;matey&quot; is",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:57): e3fb62ebfa4f36acf5cbff6a6ed0f2e0 - what's going on with Web APIs WG these days? not much activity there ...",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:59): all the &quot;networking APIs for server-push, asynchronous two-way client-server communication, peer-to-peer communication, and client-side cross-domain communication&quot; stuff that HTML spec will have a depenency on",
        "f139aba52f9fa1394b4034a7954b2220 (14:03): a9b326df4e6da61c5b6f5e1058be83a2: there is some activity going on within the webapi wg"
    ],
    "person_ids": [
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0",
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "139513027e8e90b5582cbc68fc733884",
        "f139aba52f9fa1394b4034a7954b2220"
    ]
}