{
    "id": "805e6b41f71ca9ce0a0a18791f311874",
    "messages": [
        "69b0d3dfe919a6b860a9fac82de52a7e (22:58): b8810fee2f4a71f849f3f7409546d1d9: why do you think it would be interesting to see me on the arch panel?",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:00): 69b0d3dfe919a6b860a9fac82de52a7e: you clearly have opinions about architecture, and those opinions presumably differ from the opinions of TAG members",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:00): 69b0d3dfe919a6b860a9fac82de52a7e: so it would be interesting to hear how they respond to your opinions and you to theirs",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:00): we know how they'll respond",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:00): &quot;sending passwords in the clear is always wrong.&quot;",
        "ab7faae5d7b250ea8606486575f8f79c (23:05): They don't seem to be able to agree that it's always wrong",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:06): which is ridiculous, because it _is_ always wrong, it's just that correctness isn't the only constraint",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:06): sometimes one has to compromise on ideals",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:07): b45082526d2f65fa02eee54f1a7995fc: do you or your colleagues have a position on whether we should keep the looping attributes on &lt;video&gt;?",
        "b45082526d2f65fa02eee54f1a7995fc (23:07): 69b0d3dfe919a6b860a9fac82de52a7e: I was just going to reply to the thread",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:07): cool, great",
        "ab7faae5d7b250ea8606486575f8f79c (23:08): But if you're writing a normative document with MUSTs and SHOULDs and PROBABLY OUGHT TOs and so on then you shouldn't write down MUST requirements that might have to be compromised on, which seems like it might be their problem",
        "b45082526d2f65fa02eee54f1a7995fc (23:09): 69b0d3dfe919a6b860a9fac82de52a7e: I do think that looping can be useful, and it can be very difficult to make it seamless in script",
        "b45082526d2f65fa02eee54f1a7995fc (23:10): 69b0d3dfe919a6b860a9fac82de52a7e:  &quot;loopstart&quot; and &quot;loopend&quot; aren't essential",
        "4b5f96b5acaa36dc96cebf4c5a1598dd (23:10): Javascript shouldn't be assumed, it's for joining actions together. One example of a loop might be for a complex animated background of sorts. Ancillary uses of &quot;video&quot;.",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:10): b45082526d2f65fa02eee54f1a7995fc: there are lots of things that fall into that category, the question is are they common enough to warrant supporting in version 1, really",
        "4b5f96b5acaa36dc96cebf4c5a1598dd (23:11): Also, if you think of a DVD menu. It has looping animated video buttons / background. (S5+Video ?µ_o)",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:12): dvd menus are pretty much the pinacle of what i want to avoid us ever doing :-P",
        "4b5f96b5acaa36dc96cebf4c5a1598dd (23:13): I'm just thinking broadly, I could cringe too :)",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:13): i agree that dvd menus have looping",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:14): does anyone on the web want to do looping of video in that way?",
        "b45082526d2f65fa02eee54f1a7995fc (23:14): 69b0d3dfe919a6b860a9fac82de52a7e: I think a valid use-case for looping is background audio.",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:15): hmm, very good point",
        "4b5f96b5acaa36dc96cebf4c5a1598dd (23:15): With the HTML5 changes, I'm thinking of the content / design issues of my site, where I have no classes and no javascript. HTML5 not being Javascript or CSS, should ensure that my site is fully functional without replicating document-structure in Javascript/CSS. (My main complaint-example is the removal of  the &quot;type&quot; attribute on OL/UL)",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:15): so the current features we have totally fail at looping background audio",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:15): seems like if that's our use case, we should replace the whole set of features with a single boolean attribute, &quot;loop when you get to the end&quot;",
        "b45082526d2f65fa02eee54f1a7995fc (23:15): 69b0d3dfe919a6b860a9fac82de52a7e: agreed",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:16): ok that would be nice and easy to do",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:16): and would get out of our way on the issue of picking the start point",
        "4b5f96b5acaa36dc96cebf4c5a1598dd (23:16): What about ads? They loop. Would beat using Flash.",
        "b45082526d2f65fa02eee54f1a7995fc (23:17): While we are simplifying things, I don't think that &quot;loopstart&quot; and &quot;loopend&quot; are common enough to keep.",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:18): i would be dropping all five attributes -- start, end, loopstart, loopend, and playcount -- and replacing them with a single attribute, loop, that is either on or off",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:18): at least, that's what i'd like to do",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:18): leaving just two DOM attributes, one to reflect loop, and one to report the current loop number",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:18): which starts at zero and increments on end",
        "4b5f96b5acaa36dc96cebf4c5a1598dd (23:20): What if they were one and the same. 0 = false, &gt;1 = true, count.",
        "4b5f96b5acaa36dc96cebf4c5a1598dd (23:20): correction &gt;=1",
        "b45082526d2f65fa02eee54f1a7995fc (23:21): 69b0d3dfe919a6b860a9fac82de52a7e: &quot;start&quot; and &quot;end&quot; *can* be very useful",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:22): b45082526d2f65fa02eee54f1a7995fc: oh i agree, but i think we should use a better story for &quot;start&quot;, and it's unclear that &quot;end&quot; really has enough of a solid story and enough use cases for us to really do it in version 1",
        "b45082526d2f65fa02eee54f1a7995fc (23:23): 69b0d3dfe919a6b860a9fac82de52a7e: wasn't it you that was just arguing that addCueRange() needs the pauseOnExit parameter because it is too difficult to stop precisely from script :)",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:25): b45082526d2f65fa02eee54f1a7995fc: sure, but you can use addCueRange() to implement end=&quot;&quot; for that case. :-)",
        "b45082526d2f65fa02eee54f1a7995fc (23:29): 69b0d3dfe919a6b860a9fac82de52a7e: true, but you won't be able to loop a portion of file.",
        "b45082526d2f65fa02eee54f1a7995fc (23:29): 69b0d3dfe919a6b860a9fac82de52a7e: or limit playback to just a portion, eg one chapter.",
        "4b5f96b5acaa36dc96cebf4c5a1598dd (23:30): What about a game",
        "4b5f96b5acaa36dc96cebf4c5a1598dd (23:30): ^ What about the SFX for a game. To reduce HTTP requests, put the soundbank in one audio file",
        "4b5f96b5acaa36dc96cebf4c5a1598dd (23:31): (I'm writing a Javascript/Canvas game, and sound is an unknown atm)",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:31): b45082526d2f65fa02eee54f1a7995fc: is that needed much?",
        "b45082526d2f65fa02eee54f1a7995fc (23:31): 69b0d3dfe919a6b860a9fac82de52a7e: good question",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:32): 4b5f96b5acaa36dc96cebf4c5a1598dd: there has been talk of doing that using archive files",
        "b45082526d2f65fa02eee54f1a7995fc (23:32): 69b0d3dfe919a6b860a9fac82de52a7e: and it is possible if you also don't use the native controls",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:32): 4b5f96b5acaa36dc96cebf4c5a1598dd: so you download a zip file of audio files and play them",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:32): b45082526d2f65fa02eee54f1a7995fc: yeah",
        "4b5f96b5acaa36dc96cebf4c5a1598dd (23:33): 69b0d3dfe919a6b860a9fac82de52a7e: Excellent, so good. It'd be nice to support JARs too, so you can include 10 js files all in one or something. Or a whole file structure of js/audio/images in a jar file, all inserted into a virtual file system as if the files were in the website's normal file structure. That sort of thing would be good for web apps / games.",
        "b45082526d2f65fa02eee54f1a7995fc (23:33): 69b0d3dfe919a6b860a9fac82de52a7e: OK, I agree that it is not a common usage, and it is possible to do with a custom controller.",
        "b45082526d2f65fa02eee54f1a7995fc (23:34): 69b0d3dfe919a6b860a9fac82de52a7e: still not possible to do seamless looping of a portion of a file, but I am not sure that is a common need.",
        "4d647473081c3ad729446a01a377813b (23:35): 69b0d3dfe919a6b860a9fac82de52a7e, also, it provides a way to get feedback from W3C Members in a way they like giving feedback",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:36): 4b5f96b5acaa36dc96cebf4c5a1598dd: yeah, jar=zip",
        "4d647473081c3ad729446a01a377813b (23:36): 69b0d3dfe919a6b860a9fac82de52a7e, since you're around anyway losing an hour of HTML editing time doesn't seem much of a loss and there's potential gain",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:36): b45082526d2f65fa02eee54f1a7995fc: well there's always going to be things we can't do, the key is to make sure we can do the important ones, and do the others later",
        "b45082526d2f65fa02eee54f1a7995fc (23:37): 69b0d3dfe919a6b860a9fac82de52a7e: Agreed",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:37): 4d647473081c3ad729446a01a377813b: i see no potential gain (there was no gain from the panels i was in last year, or the year before, or the year before that) and an hour is a lot of time.",
        "4d647473081c3ad729446a01a377813b (23:38): but it probably has benefited other people",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:38): i'm unclear on that",
        "4d647473081c3ad729446a01a377813b (23:39): more mutual understanding helps communication going forward",
        "b45082526d2f65fa02eee54f1a7995fc (23:39): 69b0d3dfe919a6b860a9fac82de52a7e:  while we are on the subject of &quot;is that needed much&quot;, I am not sure that &quot;pixelRatio&quot; passes the smell test",
        "4d647473081c3ad729446a01a377813b (23:39): if you're wasting two weeks for that one week (as you mentioned) you might as well lose another hour imo",
        "4d647473081c3ad729446a01a377813b (23:39): I for one thought the panels were worth listening to",
        "15acf9951f4c900b4605265783e17a5d (23:40): b45082526d2f65fa02eee54f1a7995fc: heheh. &quot;passes the smell test&quot; is one of the kindest euphemisms I've heard in quite some time. 8-}",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:41): b45082526d2f65fa02eee54f1a7995fc: pixelratio came out of feedback from the youtube guys, iirc, apparently there is a lot of misencoded video out there and having a way to fix it would really help such sites",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:41): b45082526d2f65fa02eee54f1a7995fc: note that it is intentionally done in an obtuse way so as to discourage authors from setting it (e.g. that's why height/width don't override the aspect ratio)",
        "b45082526d2f65fa02eee54f1a7995fc (23:45): 69b0d3dfe919a6b860a9fac82de52a7e: having width/height only set the canvas size is absolutely the right thing to do.",
        "b45082526d2f65fa02eee54f1a7995fc (23:45): 69b0d3dfe919a6b860a9fac82de52a7e: but aspect ratio is much harder to get right.",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:45): you'd be surprised how many people beg for width/height to control the aspect ratio",
        "b45082526d2f65fa02eee54f1a7995fc (23:45): 69b0d3dfe919a6b860a9fac82de52a7e: for example, a DV NTSC movie has a Rec.601 pixel aspect ratios (10:11)",
        "b45082526d2f65fa02eee54f1a7995fc (23:46): 69b0d3dfe919a6b860a9fac82de52a7e: but you can't take the 720x480 and multiply by 10:11",
        "b45082526d2f65fa02eee54f1a7995fc (23:46): 69b0d3dfe919a6b860a9fac82de52a7e: you need to crop to clean aperture (CLASP) to 704x480, then multiply by 10:11 and you get the proper 640x480",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:47): don't think we really want to expose the clean aperture as well",
        "b45082526d2f65fa02eee54f1a7995fc (23:47): 69b0d3dfe919a6b860a9fac82de52a7e: exactly!",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:47): i mean the main use case here is crappily-encoded videos anyway",
        "ab7faae5d7b250ea8606486575f8f79c (23:48): YouTube has proved that people are perfectly able to put up with 320x240, so we might as well just standardise on that so we don't have to worry about sizes and aspect ratios and all that junk",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:49): YouTube has shown that people will upload all kinds of anamorphic content without correctly setting the metadata in the files they upload",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:49): hence youtube's desire to be able to correct it on the fly later",
        "4d647473081c3ad729446a01a377813b (23:50): arguably we could have two ints separated by an &quot;x&quot;",
        "4d647473081c3ad729446a01a377813b (23:51): gives the precision that's not really needed, is already required for &lt;link sizes&gt; and is more compatible with how aspect ratios are usually provided",
        "ab7faae5d7b250ea8606486575f8f79c (23:51): Why does YouTube want to fix anything on the client rather than on the server?",
        "ab7faae5d7b250ea8606486575f8f79c (23:52): 4d647473081c3ad729446a01a377813b: I don't think I've ever seen aspect ratios with an 'x' - it's always written like &quot;16:9&quot;, as far as I'm aware",
        "4d647473081c3ad729446a01a377813b (23:52): ab7faae5d7b250ea8606486575f8f79c, true, if the : is really needed it would be slightly more verbose",
        "4b5f96b5acaa36dc96cebf4c5a1598dd (23:53): Be wary of copy-paste web-developers too. They'll spoil all your plans.",
        "4d647473081c3ad729446a01a377813b (23:53): though still doable using mostly the same algorithm as &lt;link sizes&gt;, you'd just have the separator as variable",
        "4d647473081c3ad729446a01a377813b (23:53): 4b5f96b5acaa36dc96cebf4c5a1598dd, HTML5 is designed for them :)",
        "4b5f96b5acaa36dc96cebf4c5a1598dd (23:53): :D",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:54): ab7faae5d7b250ea8606486575f8f79c: i believe it's so that they can change things on the fly",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:55): but if there is pushback on pixelratio, please e-mail the list so that i can point them to the pushback",
        "040342c014ffc1c11592948bd92e3721 (00:00): how does YouTube notice the wrong pixel aspect ratio anyway?",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:00): right now they don't",
        "042dd99eb0ff8653814e445ca0093427 (00:01): surely there's a great machine learning algorithm for that",
        "040342c014ffc1c11592948bd92e3721 (00:01): if they don't notice it, how can an attribute fix it?",
        "61831986744b882b4371990cc1863b19 (00:01): hixie: do you object to installing analytics on the whatwg blog?",
        "040342c014ffc1c11592948bd92e3721 (00:02): are they expecting users to fix it in their embed (uhh video) tags?",
        "4b5f96b5acaa36dc96cebf4c5a1598dd (00:02): Interesting side note. The CSS @media queries use a slash‚Äî16/9.",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:04): 61831986744b882b4371990cc1863b19: go ahead",
        "a11aabeeceeae6b8cb5d12ea06b56554 (00:06): 61831986744b882b4371990cc1863b19: Some of the Atom Autodiscovery tests are broken",
        "61831986744b882b4371990cc1863b19 (00:06): really?",
        "61831986744b882b4371990cc1863b19 (00:06): which ones?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (00:06): checks",
        "a11aabeeceeae6b8cb5d12ea06b56554 (00:06): Some on remote domain",
        "4d647473081c3ad729446a01a377813b (00:07): 69b0d3dfe919a6b860a9fac82de52a7e, why not let &lt;video&gt; be like &lt;img&gt; for .height/.width?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (00:08): 61831986744b882b4371990cc1863b19: 47‚Äì50",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:08): 4d647473081c3ad729446a01a377813b: i don't really care either way, feel free to send feedback on it",
        "a11aabeeceeae6b8cb5d12ea06b56554 (00:08): 61831986744b882b4371990cc1863b19: They fail on both my impl. and your impl, and it really does appear to be broken looking at it",
        "4d647473081c3ad729446a01a377813b (00:09): I guess I don't either, it just seems that the string behavior is less desirable",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:10): i just changed it to be consistent with the things it was already consistent with",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:10): i have no opinion",
        "b45082526d2f65fa02eee54f1a7995fc (00:11): 4d647473081c3ad729446a01a377813b: what do you mean by &quot;be like &lt;img&gt; for .height/.width&quot;?",
        "4d647473081c3ad729446a01a377813b (00:11): b45082526d2f65fa02eee54f1a7995fc, see http://html5.org/tools/web-apps-tracker?from=2332&amp;to=2333",
        "b45082526d2f65fa02eee54f1a7995fc (00:12): 4d647473081c3ad729446a01a377813b: ah, thanks",
        "61831986744b882b4371990cc1863b19 (00:19): hixie: i don't have access to the design section of blog.whatwg.org",
        "61831986744b882b4371990cc1863b19 (00:19): perhaps lachy could give me access?",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:20): lachy is your man, yes",
        "61831986744b882b4371990cc1863b19 (00:20): a11aabeeceeae6b8cb5d12ea06b56554: i'll try to look into it tonight",
        "4d647473081c3ad729446a01a377813b (00:20): do you need admin access?",
        "4d647473081c3ad729446a01a377813b (00:20): or something else?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (00:20): 61831986744b882b4371990cc1863b19: Much thanks",
        "61831986744b882b4371990cc1863b19 (00:20): i need access to the design section so i can change the template to include the tracking code",
        "61831986744b882b4371990cc1863b19 (00:21): i don't know much about the different levels of wordpress privileges",
        "61831986744b882b4371990cc1863b19 (00:21): but i need more than i have right now :)",
        "4d647473081c3ad729446a01a377813b (00:21): you're an admin now",
        "4d647473081c3ad729446a01a377813b (00:21): feel free to abuse your new power",
        "4d647473081c3ad729446a01a377813b (00:21): oh, wait!",
        "61831986744b882b4371990cc1863b19 (00:22): mwahahahaha",
        "61831986744b882b4371990cc1863b19 (00:22): that did it, thanks",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:22): jesus christ, i got about 50 e-mails on video overnight",
        "4d647473081c3ad729446a01a377813b (00:26): seems that &quot;issues&quot; have gained some ground again http://www.whatwg.org/issues/data.html",
        "4d647473081c3ad729446a01a377813b (00:26): guess that was mostly due to WF2",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:27): the uptick was when i took the huge mess of notes at the bottom of the html5 spec as well as the list of notes at the bottom of the wf2 spec and merged them into one clean list of notes with XXX markers for each issue",
        "4d647473081c3ad729446a01a377813b (00:28): yeah, I meant e-mail issues though",
        "4d647473081c3ad729446a01a377813b (00:28): the green line",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:29): oh",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:29): yeah",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:29): six weeks without replying to mail will do that",
        "4d647473081c3ad729446a01a377813b (00:32): sigh",
        "4d647473081c3ad729446a01a377813b (00:32): http://feeds.feedburner.com/~r/ajaxian/~3/421961005/fancyupload-for-flash-10",
        "4d647473081c3ad729446a01a377813b (00:32): we need HTMLInputElement.fileList and XHR.send(FileList) soonish",
        "4b5f96b5acaa36dc96cebf4c5a1598dd (00:39): Gtg. Have a nice evening all."
    ],
    "person_ids": [
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "ab7faae5d7b250ea8606486575f8f79c",
        "b45082526d2f65fa02eee54f1a7995fc",
        "4b5f96b5acaa36dc96cebf4c5a1598dd",
        "4d647473081c3ad729446a01a377813b",
        "15acf9951f4c900b4605265783e17a5d",
        "040342c014ffc1c11592948bd92e3721",
        "042dd99eb0ff8653814e445ca0093427",
        "61831986744b882b4371990cc1863b19",
        "a11aabeeceeae6b8cb5d12ea06b56554"
    ]
}