{
    "id": "836afa45d17cf93f09a3d610adb52bc3",
    "messages": [
        "f139aba52f9fa1394b4034a7954b2220 (16:29): woah, Rubys has now said flat out that Hixie should accept John's changes and move on! WTF?",
        "a924fb58d2c25874322f4e5126f608b9 (16:35): Reading about &lt;cite&gt; led me to @cite, which made me wonder if no one in the RDF circles had tried to also let it accept a person URI instead of only a document URI",
        "cc097e0d7183ae8436e7df709553c8c0 (16:36): b8810fee2f4a71f849f3f7409546d1d9: it was only proposed by Hixie as an attempt to be compatible with ie",
        "cc097e0d7183ae8436e7df709553c8c0 (16:39): b8810fee2f4a71f849f3f7409546d1d9: btw a11aabeeceeae6b8cb5d12ea06b56554 found an infinite loop in the html5 parser",
        "cc097e0d7183ae8436e7df709553c8c0 (16:39): b8810fee2f4a71f849f3f7409546d1d9: something with &lt;select&gt;.innerHTML='&lt;keygen&gt;' iirc",
        "ef6f2287bae00ba79475fbf56c2b6fee (16:40): abeb4c0ac6ffb27ee5fbbc20aca0b2f4: What is the point of features that only authors will buy into?",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:40): cc097e0d7183ae8436e7df709553c8c0: thanks.",
        "abeb4c0ac6ffb27ee5fbbc20aca0b2f4 (16:40): ef6f2287bae00ba79475fbf56c2b6fee: what is the point of features that authors won't buy into?",
        "ef6f2287bae00ba79475fbf56c2b6fee (16:41): abeb4c0ac6ffb27ee5fbbc20aca0b2f4: Very little.",
        "abeb4c0ac6ffb27ee5fbbc20aca0b2f4 (16:41): ef6f2287bae00ba79475fbf56c2b6fee: agreed.",
        "ef6f2287bae00ba79475fbf56c2b6fee (16:43): abeb4c0ac6ffb27ee5fbbc20aca0b2f4: My point is that the effect on the user experience is what matters (or at least, what should matter), for anything other than syntactic sugar.",
        "a924fb58d2c25874322f4e5126f608b9 (16:43): Is there a one-liner about &quot;author education&quot; similar to &quot;the tools will save us&quot;?",
        "cc097e0d7183ae8436e7df709553c8c0 (16:44): Zeldman will save us",
        "ef6f2287bae00ba79475fbf56c2b6fee (16:44): So if different elements for wrapping form controls have an effect on the user experience, I don't see why HTML5 shouldn't have conformance criteria about it.",
        "a924fb58d2c25874322f4e5126f608b9 (16:44): (and &quot;search engines can use it&quot;)",
        "abeb4c0ac6ffb27ee5fbbc20aca0b2f4 (16:45): ef6f2287bae00ba79475fbf56c2b6fee: so you aren't distinguishing between features that extend the platform (canvas, video, etc.) and features that extend the language (header, footer, cite). I think it's unwise to treat all features as being in the same class. There are clearly differences between browser features (which, as you say, directly effect the UX) and language features (which affect semantics ...invisible but still important).",
        "ef6f2287bae00ba79475fbf56c2b6fee (16:46): I think all semantic distinctions have a /potential/ effect on user agents.",
        "abeb4c0ac6ffb27ee5fbbc20aca0b2f4 (16:46): ef6f2287bae00ba79475fbf56c2b6fee: I certainly don't equate semantics with &quot;syntactic sugar.&quot; HTML is a markup, not a programming, language (or, now with HTML5) it is a markup *and* a programming language.",
        "ef6f2287bae00ba79475fbf56c2b6fee (16:46): For example, screen readers offer keys for navigating list elements, tables, and &quot;paragraphs&quot; independently.",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:46): abeb4c0ac6ffb27ee5fbbc20aca0b2f4: header and footer should be considered to extend the platform, IMO",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:46): abeb4c0ac6ffb27ee5fbbc20aca0b2f4: as far as exposure to AT goes",
        "abeb4c0ac6ffb27ee5fbbc20aca0b2f4 (16:48): hsivoven: help me think of a better example of &quot;extending the language&quot; i.e. new semantics that don't require undue work from browser makers in order for authors to use them.",
        "ef6f2287bae00ba79475fbf56c2b6fee (16:48): abeb4c0ac6ffb27ee5fbbc20aca0b2f4: I don't equate semantics with syntactic sugar. But the important thing about semantic features (as opposed to mere naming conventions) is that user agents can /do/ things with those semantics.",
        "a924fb58d2c25874322f4e5126f608b9 (16:48): Was I the only one laughing when Sam assumed wcag had peer review?",
        "a924fb58d2c25874322f4e5126f608b9 (16:49): I wasn't even involved in the process, but I still remember all the blog posts about how it ignored input and feedback",
        "abeb4c0ac6ffb27ee5fbbc20aca0b2f4 (16:50): ef6f2287bae00ba79475fbf56c2b6fee: even naming conventions *can* be used by user agents (see: microformats) so I don't think there's such a clear distinction between semantics and naming conventions. Both can be potentially used by user agents.",
        "ef6f2287bae00ba79475fbf56c2b6fee (16:50): abeb4c0ac6ffb27ee5fbbc20aca0b2f4: (My point about syntactic sugar is that unlike other features, it's only of interest to authors.)",
        "b25b6b77a0087ff8385941e5545d32ea (16:50): guesses that Sam has never been a working scientist",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:51): Yes, yes, whatever you said Dr Graham",
        "b25b6b77a0087ff8385941e5545d32ea (16:51): Fuck off",
        "ef6f2287bae00ba79475fbf56c2b6fee (16:51): abeb4c0ac6ffb27ee5fbbc20aca0b2f4: That's true, and to the extent that user agents can do things with them, it's appropriate for them to specified (see: microformat specs).",
        "abeb4c0ac6ffb27ee5fbbc20aca0b2f4 (16:51): ef6f2287bae00ba79475fbf56c2b6fee: I disagree. When enough authors agree on semantic usage, user agents can make use of that collective decision. Admittedly, this doesn't happen that often but it doesn't happen that often with regular elements either.",
        "b25b6b77a0087ff8385941e5545d32ea (16:51): :p",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:51): s/said/say/",
        "a924fb58d2c25874322f4e5126f608b9 (16:51): Analogies to lumiferous aether and phlogiston come to mind",
        "abeb4c0ac6ffb27ee5fbbc20aca0b2f4 (16:51): ef6f2287bae00ba79475fbf56c2b6fee; the &quot;I disagree&quot; was for your previous comment, not what you just said which I agree with. :-)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (16:52): I disagree.",
        "cc097e0d7183ae8436e7df709553c8c0 (16:54): b8810fee2f4a71f849f3f7409546d1d9: http://twitter.com/davidpaulsson/statuses/3103355788 - you need to relaunch v.nu for the wiki microsyntax changes to take effect",
        "cc097e0d7183ae8436e7df709553c8c0 (17:12): http://code.google.com/p/wp-basis-theme/source/browse/trunk/basis-html5/footer.php?spec=svn118&amp;r=118",
        "cc097e0d7183ae8436e7df709553c8c0 (17:14): http://code.google.com/p/wp-basis-theme/source/browse/trunk/basis-html5/header.php?spec=svn118&amp;r=118"
    ],
    "person_ids": [
        "f139aba52f9fa1394b4034a7954b2220",
        "a924fb58d2c25874322f4e5126f608b9",
        "cc097e0d7183ae8436e7df709553c8c0",
        "ef6f2287bae00ba79475fbf56c2b6fee",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "abeb4c0ac6ffb27ee5fbbc20aca0b2f4",
        "b25b6b77a0087ff8385941e5545d32ea",
        "a11aabeeceeae6b8cb5d12ea06b56554"
    ]
}