{
    "id": "870bbc503614a27e036c4467978e7745",
    "messages": [
        "f5af272b5b04154c260eec46f4deb905 (03:44): 167b638f5d93441b9eb82625ea3cc9c4 Olsen style named timelines were previously rejected long ago from microformats' timezone microsyntaxes.",
        "167b638f5d93441b9eb82625ea3cc9c4 (03:45): f5af272b5b04154c260eec46f4deb905: Fair enough. I think they do make life easier for implementors who want perfect accuracy, but they're not going to be typed by most actual users.",
        "f5af272b5b04154c260eec46f4deb905 (03:45): The short version for why no Olsen named TZs is that people notoriously get them wrong especially with respect to DST",
        "167b638f5d93441b9eb82625ea3cc9c4 (03:45): As in, notoriously implement interpreting them improperly?",
        "f5af272b5b04154c260eec46f4deb905 (03:46): They dot actually make life easier for higher data quality - which is the right way to evaluate anything an author/coder might emit into HTML",
        "f5af272b5b04154c260eec46f4deb905 (03:46): s/dot/don't",
        "f5af272b5b04154c260eec46f4deb905 (03:47): Smart folks all the time write/say PDT when they mean PST and vice versa.",
        "167b638f5d93441b9eb82625ea3cc9c4 (03:48): Yes, but I was thinking the full Olsen zones, America/Los_Angeles and so on.",
        "167b638f5d93441b9eb82625ea3cc9c4 (03:48): I agree that the three-letter TZs are an abomination.",
        "f5af272b5b04154c260eec46f4deb905 (03:48): Better to address it with numerical precision upfront (with offset from Z) than provide the illusion of precision with named TZs",
        "f5af272b5b04154c260eec46f4deb905 (03:49): And it's yet another named registry dependency",
        "f5af272b5b04154c260eec46f4deb905 (03:49): Worse, one that's political and unpredictable",
        "f5af272b5b04154c260eec46f4deb905 (03:50): Never mind the DMCA takedown of the NIH FTP URL",
        "171db427cee236fc04af9e5de94e7c39 (03:50): Yeah, the city-based registry changes over time.",
        "167b638f5d93441b9eb82625ea3cc9c4 (03:51): I suppose numerical offsets do give you accuracy.",
        "f5af272b5b04154c260eec46f4deb905 (03:51): All those RFCs with references to Olsen now have broken links",
        "167b638f5d93441b9eb82625ea3cc9c4 (03:51): Even if the DST changeover goes to some other date in the future, your time is still accurate--it's just not in the TZ that that location would have, when you actually get to that date.",
        "167b638f5d93441b9eb82625ea3cc9c4 (03:52): I see the problems of trying to bake the Olsen DB into clients.",
        "06cb330920ae58e1614c9145d983b3d6 (03:53): well, the biggest problem with named timezones is it's a moving target",
        "167b638f5d93441b9eb82625ea3cc9c4 (03:53): Right, that's the problem with baking it into clients.",
        "167b638f5d93441b9eb82625ea3cc9c4 (03:54): And people who want to use them on the server-side already have libraries for it that can emit times with numeric offsets if they want to send those to the client, so that does seem fine.",
        "f5af272b5b04154c260eec46f4deb905 (03:58): Mkanat, worse than baking into clients, with HTML/microformats it's a matter of baking into *documents* which must be much more reliable than clients.",
        "167b638f5d93441b9eb82625ea3cc9c4 (03:59): f5af272b5b04154c260eec46f4deb905: Yeah, that's a good point.",
        "f5af272b5b04154c260eec46f4deb905 (04:07): Also tried to send this earlier but I think I was already too far off the ground:",
        "f5af272b5b04154c260eec46f4deb905 (04:07): Hixie, fine with omitting fixed point numbers or now til examples documented on wiki, however we should be similarly conservative with out of order unit values etc until someone finds backward compat reasons/examples.",
        "171db427cee236fc04af9e5de94e7c39 (04:08): f5af272b5b04154c260eec46f4deb905: Don't quite agree.  Allowing out-of-order unit values makes both parsing and generation somewhat easier.",
        "f5af272b5b04154c260eec46f4deb905 (04:09): Disagree because it makes simple transposition errors more difficult to detect",
        "171db427cee236fc04af9e5de94e7c39 (04:10): Hmm, transposition seems like a minor issue here.",
        "171db427cee236fc04af9e5de94e7c39 (04:10): Because the units are separate from each other by at least one digit.",
        "f5af272b5b04154c260eec46f4deb905 (04:11): Not that way",
        "f5af272b5b04154c260eec46f4deb905 (04:11): But like this",
        "f5af272b5b04154c260eec46f4deb905 (04:11): Writing 1m5h when 1h5m is intended",
        "f5af272b5b04154c260eec46f4deb905 (04:11): Also easy to miss that error web reviewing.",
        "171db427cee236fc04af9e5de94e7c39 (04:12): Hm, maybe.",
        "f5af272b5b04154c260eec46f4deb905 (04:12): Because people see the order of digits and assign relevance more to the order than to he unit suffixes",
        "f5af272b5b04154c260eec46f4deb905 (04:14): This is all about optimizing ease of authoring high quality data.",
        "f5af272b5b04154c260eec46f4deb905 (04:15): so i'd rather start with a more conservative syntax",
        "f5af272b5b04154c260eec46f4deb905 (04:16): Where errors are earlier / more easily detected and corrected",
        "f5af272b5b04154c260eec46f4deb905 (04:17): Speaking if errors - typing on an iPod sucks. I'm going to dinner and will resume later tonight in a laptop",
        "f5af272b5b04154c260eec46f4deb905 (04:19): didn't mean to have hat message be self-supporting. :/",
        "171db427cee236fc04af9e5de94e7c39 (04:19): ^_^"
    ],
    "person_ids": [
        "f5af272b5b04154c260eec46f4deb905",
        "167b638f5d93441b9eb82625ea3cc9c4",
        "171db427cee236fc04af9e5de94e7c39",
        "06cb330920ae58e1614c9145d983b3d6"
    ]
}