{
    "id": "898e33bde913918fa6d8edd19fe94ca8",
    "messages": [
        "69b0d3dfe919a6b860a9fac82de52a7e (08:50): 65325d50b2e25aca54bc871b89758c9c: have you sent all the offline feedback you intend to send or is there more?",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:51): 's next task is the offline storage stuff",
        "69b0d3dfe919a6b860a9fac82de52a7e (08:51): since i've done the template stuff first draft now",
        "65325d50b2e25aca54bc871b89758c9c (08:51): 69b0d3dfe919a6b860a9fac82de52a7e: it's on the todo list for tonight",
        "65325d50b2e25aca54bc871b89758c9c (08:51): 69b0d3dfe919a6b860a9fac82de52a7e: after I finish rewriting the next two design principles",
        "65325d50b2e25aca54bc871b89758c9c (08:51): I gotta tell you, I enjoy writing prose a lot less than I enjoy writing code",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (08:52): b8810fee2f4a71f849f3f7409546d1d9: http://lists.xiph.org/pipermail/advocacy/2007-September/001441.html",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (08:52): (hi!)",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (08:53): (ewww... why don't I see typos/grammar mistakes *before* sending mail?)",
        "65325d50b2e25aca54bc871b89758c9c (08:59): 69b0d3dfe919a6b860a9fac82de52a7e: I'm reading the last few emails now",
        "65325d50b2e25aca54bc871b89758c9c (09:00): 69b0d3dfe919a6b860a9fac82de52a7e: I have something to say about the query string idea, but I want to make sure the follow-up emails haven't obsoleted it",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:07): b8810fee2f4a71f849f3f7409546d1d9: http://www.annodex.net/TR/draft-pfeiffer-cmml-03.html &lt;-- the CMML spec",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:11): b8810fee2f4a71f849f3f7409546d1d9: and the good news is that Firefox with Chris Double's video patch is actually well-prepared for annodex/cmml as liboggplay apparently has support for it",
        "f139aba52f9fa1394b4034a7954b2220 (09:11): 99a3bfa1a9430e7df6358b5f3e9e1e17, that seems complicated. It's annoying having so many different formats that do the same thing (i.e. Ogg Writ, ASS, CMML - and theyr'e just the ones I saw mentioned in those emails)",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:12): well, Ogg Writ is actually buried",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:12): so one can take that off the list",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:12): ASS seems to be proprietary, so similar rules apply",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:12): 65325d50b2e25aca54bc871b89758c9c: k",
        "f139aba52f9fa1394b4034a7954b2220 (09:12): CMML seems to do more than just captioning/subtitles",
        "65325d50b2e25aca54bc871b89758c9c (09:13): 69b0d3dfe919a6b860a9fac82de52a7e: writing the email now about the query thing, and I'll have more to come",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:13): k",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:13): f139aba52f9fa1394b4034a7954b2220: yeah, which makes it so cool",
        "f139aba52f9fa1394b4034a7954b2220 (09:13): also complicated",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:13): you don't have to implement all of that",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:14): if you want just captioning I assume you can ignore e.g. the links to other annotated media",
        "f139aba52f9fa1394b4034a7954b2220 (09:15): 99a3bfa1a9430e7df6358b5f3e9e1e17, what's the Skeleton thing that was mentioned? How does it relate to CMML?",
        "f139aba52f9fa1394b4034a7954b2220 (09:16): ah http://wiki.xiph.org/OggSkeleton",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:16): f139aba52f9fa1394b4034a7954b2220: Skeleton is a &quot;codec&quot; to embed meta information about streams into Ogg",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:17): Ogg will carry anything and for some applications it's useful to have information in place what *exactly* is in some multiplexed Ogg thingie",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:17): one nice property of CMML is that it's not just Ogg only",
        "f139aba52f9fa1394b4034a7954b2220 (09:17): is there a simple diagram or flowchart that shows how the Ogg Container format, Ogg Vorbis, Ogg Theora, Ogg Skeleton, CMML and whatever else fit together?",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:17): (I love Ogg, but one cannot expect it to be the only game around)",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:18): not that I'm aware of, but here it is in a nutshell:",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:18): - Ogg: simply a container, lightweight, low overhead",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:19): - Ogg Skeleton: a &quot;codec&quot; delivered by Ogg carrying information about other encapsulated streams (MIME-type etc. and whatnot)",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:19): - Ogg Vorbis and Ogg Theora are the most common codecs for audio (Vorbis) and video (Theora)",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:20): - CMML in Ogg is &quot;serialized&quot; CMML embedded as multiplexed stream in Ogg",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:23): actually the most common video files around are plain Ogg with just Theora and Vorbis multiplexed. One does neither need Skeleton nor CMML for basic video + audio",
        "65325d50b2e25aca54bc871b89758c9c (09:23): 69b0d3dfe919a6b860a9fac82de52a7e: &quot;query string&quot; email sent",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:23): k",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:23): you sending the others tonight?",
        "65325d50b2e25aca54bc871b89758c9c (09:24): 69b0d3dfe919a6b860a9fac82de52a7e: the short version is that I find it in bad taste to special-case the query part of the URI",
        "65325d50b2e25aca54bc871b89758c9c (09:25): 69b0d3dfe919a6b860a9fac82de52a7e: but I think it's probably useful to have some sort of fallback mechanism for resources not in the offline cache, and you need either that or the ability to exlpicity insert data into the cache to have offline apps support editing not just viewing",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:25): f139aba52f9fa1394b4034a7954b2220: basically Ogg Skeleton is additional semantics for streams (low level), CMML is additional semantics on content (high level)",
        "65325d50b2e25aca54bc871b89758c9c (09:25): I proposed something that I think is better than special-casing the query",
        "65325d50b2e25aca54bc871b89758c9c (09:25): 69b0d3dfe919a6b860a9fac82de52a7e: I'll be sending more, yeah",
        "f139aba52f9fa1394b4034a7954b2220 (09:29): 99a3bfa1a9430e7df6358b5f3e9e1e17, ok, so for example. If I wanted a video with 2 main audio tracks and a director commentary track and a captions for each, I would use Vorbis for the main audio, probably Speex for the commentary, CMML for each of the caption/subtitle tracks...",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:29): f139aba52f9fa1394b4034a7954b2220: yes",
        "f139aba52f9fa1394b4034a7954b2220 (09:29): and then use Skeleton to describe each of those (i.e. language, etc.)",
        "f139aba52f9fa1394b4034a7954b2220 (09:30): then pack it all up in an ogg container",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:30): well, Skeleton is auto-generated",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:30): 65325d50b2e25aca54bc871b89758c9c: k then i'll go to bed now and start writing tomorrow",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:30): nn",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:30): but right, that's the general setup",
        "65325d50b2e25aca54bc871b89758c9c (09:30): 69b0d3dfe919a6b860a9fac82de52a7e: all righty",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:30): and if annodex.net wouldn't be down I'd now point you to the user tools existing to actually do just that ;)",
        "f139aba52f9fa1394b4034a7954b2220 (09:31): are the tools easy to use?",
        "f139aba52f9fa1394b4034a7954b2220 (09:32): one of the big problems with ogg at the moment is that mainstream authoring tools don't support it.",
        "65325d50b2e25aca54bc871b89758c9c (09:33): 69b0d3dfe919a6b860a9fac82de52a7e: I'm still having a bit of trouble following the use of the 'new cache' flag in your second proposal",
        "f139aba52f9fa1394b4034a7954b2220 (09:33): I've made Ogg videos in the past by outputting MPEG4 from Adobe Premiere and then using ffmpeg2theora to convert it, which is annoying",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:34): well, ffmpeg2theora is the best known way, but there are actually GUI driven convertes by now",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:34): plus if you have e.g. the QuickTime components installed your iMovie-Apple thingie e.g. can suddenly export Ogg",
        "f139aba52f9fa1394b4034a7954b2220 (09:34): any available for Windows?",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:35): f139aba52f9fa1394b4034a7954b2220: several. http://wiki.xiph.org/index.php/TheoraSoftwareEncoders",
        "f139aba52f9fa1394b4034a7954b2220 (09:35): my Mac isn't powerful enough to do much video encoding and I don't particularly like iMovie",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:36): :)",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:37): many frontends to Theora don't expose all interesting tuning parameters, though - which is why I usually still use ffmpeg2theora",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:37): and in worst case there's always http://mux.am/ ;)",
        "f139aba52f9fa1394b4034a7954b2220 (09:40): hmm. having lots of parameters can be useful, but it's a pain for anyone that just wants to say convert myvideo.mov to Ogg. It took me a little while to figure out which settings worked best.",
        "f139aba52f9fa1394b4034a7954b2220 (09:42): I tried using VLC to do it once, but it just crashed",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:44): well, VLC apparently also doesn't get the Ogg muxing right",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (09:44): I added a warning to the wiki",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (10:03): hi doublec",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:04): 99a3bfa1a9430e7df6358b5f3e9e1e17: thank you",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (10:05): you're welcome :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:05): I get the impression that this area is being worked on but not quite there yet, as the people on the advocate list didn't have a single canned solution",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (10:12): well, CMML is ready and in use, it's just that it isn't a &quot;caption-only&quot; thing",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:12): it seems to me that one foreseeable issue with closed captioning and closed audio description is that for content provider buy-in, content providers need to be reasonably confident that the &quot;closed&quot; tracks don't play with browser defaults",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (10:13): aye",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:14): 99a3bfa1a9430e7df6358b5f3e9e1e17: the CmmlSubtitles wiki page gives the impression that CMML captioning/subtitles aren't done yet",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (10:14): this is sorta confusing, yes",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (10:15): I'll better request if there e.g. are demo files",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (10:15): read: a real-life working solution",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:16): since this is confusing, I think it would be good for the spec to have a note pointing to the Right Way once the stakeholders agree what the right way is",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:16): the HTML 5 spec, that is",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (10:17): yeah",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (10:19): if HTML 5 raises special needs for captioning it may make sense to e.g. have a list of requirements to be met somewhere",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (10:19): if captioning in CMML isn't set in stone yet it should be possible to make sure the spec turns out well-shaped for those needs",
        "f139aba52f9fa1394b4034a7954b2220 (10:20): 99a3bfa1a9430e7df6358b5f3e9e1e17, does VLC support captions made with CMML?",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (10:23): f139aba52f9fa1394b4034a7954b2220: well, VLC supports CMML since 2004, but I don't know to what extend",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (10:24): the cmml code hooks e.g. into the OSD code - which may be used for captions",
        "99a3bfa1a9430e7df6358b5f3e9e1e17 (10:24): http://www.videolan.org/developers/vlc/doc/doxygen/html/cmml_8c.html",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:36): does the cmml code do its own cross-platform text layout or is text layout and compositing the responsibility of the player application?",
        "3fa12707a9b53d1080a8f7c829a09da2 (10:56): hi",
        "3fa12707a9b53d1080a8f7c829a09da2 (10:56): b8810fee2f4a71f849f3f7409546d1d9, it's the responsibility of the player",
        "3fa12707a9b53d1080a8f7c829a09da2 (10:57): http://trac.annodex.net/wiki/CmmlStyleSheets",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:58): 3fa12707a9b53d1080a8f7c829a09da2: ok.",
        "3fa12707a9b53d1080a8f7c829a09da2 (10:59): it would probably be good to spec that up together with html5",
        "3fa12707a9b53d1080a8f7c829a09da2 (11:00): we designed cmml to use existing xhtml4(?) modules where possible",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:00): CMML looks rather complex. there have already been question of reinventing SMIL",
        "3fa12707a9b53d1080a8f7c829a09da2 (11:00): hmm, cmml is pretty simple, and the goals are different to those of smil",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:02): it looks like supporting captioning will involve more in a browser than just flipping a switch in an off-the-shelf library :-/",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:02): whereas one might hope that implementing audio descriptions would be a matter of conditionally playing an audio track based on prefs and metadata",
        "3fa12707a9b53d1080a8f7c829a09da2 (11:03): ok, so for just getting caption text without styling it, using plain cmml is fine",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:03): good",
        "3fa12707a9b53d1080a8f7c829a09da2 (11:04): so eg. xine will just display the contents of the &lt;desc&gt; tag as a caption, without styling",
        "3fa12707a9b53d1080a8f7c829a09da2 (11:06): an earlier annodex firefox extension displayed a line of plain text under the video",
        "3fa12707a9b53d1080a8f7c829a09da2 (11:06): a symbian browser we did just displayed on-screen as a caption",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:14): http://wiki.whatwg.org/wiki/Video_accessibility",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:14): I wrote up the issues without solutions as a wiki page"
    ],
    "person_ids": [
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "65325d50b2e25aca54bc871b89758c9c",
        "99a3bfa1a9430e7df6358b5f3e9e1e17",
        "f139aba52f9fa1394b4034a7954b2220",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "3fa12707a9b53d1080a8f7c829a09da2"
    ]
}