{
    "id": "89eab9fec0a572d924de848282d641f1",
    "messages": [
        "d114be1698421a7cec050e2207d29631 (20:02): i wonder if the net effect of publishing a spec draft with warnings will be that people are disinclined to submit feedback on the items marked controversial",
        "2c39bccd623947fa6224ea57d2a727de (20:06): it's likely we'll publish that draft then?",
        "d114be1698421a7cec050e2207d29631 (20:07): i think the poll shows without-warnings 10 ahead, and publishing one only as a majority",
        "a924fb58d2c25874322f4e5126f608b9 (20:10): It's only 6 ahead, and shrinking :)",
        "a480104b0e570389c6f4284a88c7cd9d (20:13): My only hope was that it ends up with one side being a clear winner.  Looks like I'm not likely to get that.",
        "a924fb58d2c25874322f4e5126f608b9 (20:13): Well, 'one draft' is a solid winner",
        "ab7faae5d7b250ea8606486575f8f79c (20:17): We should start a grassroots get-out-the-vote campaign",
        "a924fb58d2c25874322f4e5126f608b9 (20:18): ab7faae5d7b250ea8606486575f8f79c: Ask Ericsson",
        "f139aba52f9fa1394b4034a7954b2220 (20:19): the with warnings draft still has over 50% voting no, though it is close",
        "ab7faae5d7b250ea8606486575f8f79c (20:21): Manu says: &quot;Clearly /something/ caused the WAI/PFWG to object, en masse, to the way things were being handled re: @summary in HTML5:  http://lists.w3.org/Archives/Public/public-html/2009Jul/0556.html&quot;",
        "ab7faae5d7b250ea8606486575f8f79c (20:21): Maybe someone should point him to http://lists.w3.org/Archives/Public/public-html/2009Jul/0583.html - &quot;Of course it is not from WAI&quot;",
        "a924fb58d2c25874322f4e5126f608b9 (20:22): goes to check up on that &quot;microdata makes sense&quot; email, to see if there's any response",
        "ab7faae5d7b250ea8606486575f8f79c (20:23): I think the only discussion on that list has been with someone who seems to not understand XML Namespaces",
        "a924fb58d2c25874322f4e5126f608b9 (20:24): 0 replies, how surprising",
        "f139aba52f9fa1394b4034a7954b2220 (20:26): ab7faae5d7b250ea8606486575f8f79c, feel free to do so.",
        "2c39bccd623947fa6224ea57d2a727de (20:26): 'The &quot;real&quot; reason why xmlns should &quot;not&quot; be used' is a nice thread",
        "ab7faae5d7b250ea8606486575f8f79c (20:26): f139aba52f9fa1394b4034a7954b2220: No thanks",
        "ab7faae5d7b250ea8606486575f8f79c (20:27): I'll just mention it on IRC and maybe he'll read the logs",
        "a924fb58d2c25874322f4e5126f608b9 (20:28): ab7faae5d7b250ea8606486575f8f79c: Or maybe he'll accidentally skip over your line",
        "ab7faae5d7b250ea8606486575f8f79c (20:28): Quite possibly",
        "ab7faae5d7b250ea8606486575f8f79c (20:29): Anyway it doesn't seem a point worth wasting tens of man-minutes on by posting to the list",
        "a924fb58d2c25874322f4e5126f608b9 (20:29): That's what www-archive is for :P",
        "ab7faae5d7b250ea8606486575f8f79c (20:30): It doesn't seem a point worth wasting man-minutes on by posting to www-archive",
        "f139aba52f9fa1394b4034a7954b2220 (20:30): yeah, that's why I'm not doing it myself. The claim about all the objections coming from WAI has been debunked several times before. Once more probably won't help",
        "f139aba52f9fa1394b4034a7954b2220 (20:31): just like so many other debunked claims people keep repeating",
        "a924fb58d2c25874322f4e5126f608b9 (20:31): ab7faae5d7b250ea8606486575f8f79c: Anyone reading www-archive has accepted waste up-front",
        "f139aba52f9fa1394b4034a7954b2220 (20:36): spending a few seconds deciding to ignore waste on www-archive is outweighed by the good stuff that often gets posted there",
        "a480104b0e570389c6f4284a88c7cd9d (20:41): I've got Richard Schwerdtfeger to agree to discuss the current state of the answers to Ian's questions on ARIA on tomorrow's call, and it is my opinion that these answers will be enough to unblock Ian.  Now the question is: what does it take to get Hixie to join this *one* call?",
        "2c39bccd623947fa6224ea57d2a727de (20:42): why can't Richard just say it over email?",
        "2c39bccd623947fa6224ea57d2a727de (20:42): will give us a clearer log of the state too...",
        "a480104b0e570389c6f4284a88c7cd9d (20:43): why is the sky blue?",
        "2c39bccd623947fa6224ea57d2a727de (20:43): I'm not a physicist",
        "a924fb58d2c25874322f4e5126f608b9 (20:43): It's not just Ian who doesn't attend the calls",
        "a924fb58d2c25874322f4e5126f608b9 (20:44): Don't the rest of the non-callers deserve to hear the answers too?",
        "a480104b0e570389c6f4284a88c7cd9d (20:44): I am not a psychologist.",
        "a480104b0e570389c6f4284a88c7cd9d (20:44): the answers will be minuted.",
        "2c39bccd623947fa6224ea57d2a727de (20:45): well, that's all I had",
        "a480104b0e570389c6f4284a88c7cd9d (20:45): I believe a dialog is necessary.  And what has been going on the mailing list is not exactly a dialog.",
        "2c39bccd623947fa6224ea57d2a727de (20:45): I assumed that since you were able to talk directly with Richard that much would be clear",
        "a480104b0e570389c6f4284a88c7cd9d (20:46): I think I've been pretty clear: http://intertwingly.net/blog/2009/08/12/Mountain-Mohammed-Mohammed-Mountain-Please-Talk",
        "a480104b0e570389c6f4284a88c7cd9d (20:46): Looks like I",
        "a480104b0e570389c6f4284a88c7cd9d (20:46): 've pissed of Matt May.",
        "2c39bccd623947fa6224ea57d2a727de (20:47): that blog entry was not clear on whether answers to ARIA LC comments would be discussed on the call",
        "f139aba52f9fa1394b4034a7954b2220 (20:47): notes that the sky is blue due to refraction of light",
        "2c39bccd623947fa6224ea57d2a727de (20:47): in any case, it seems absurd that they can be discussed there, but that we cannot get a reply to our emails for another couple of months",
        "a924fb58d2c25874322f4e5126f608b9 (20:48): Well, as long as PF's ASAP is as fast as it is, it doesn't seem like dialog can happen any faster than it currently is",
        "a480104b0e570389c6f4284a88c7cd9d (20:51): FWIW, Richard and I not only work for the same company (so I can catch him via internal IM), we are in the same department.",
        "a480104b0e570389c6f4284a88c7cd9d (21:00): In case is still isn't clear: Ian's ARIA LC comments will be discussed on tomorrow's call.",
        "a480104b0e570389c6f4284a88c7cd9d (21:08): http://intertwingly.net/blog/2009/08/12/Mountain-Mohammed-Mohammed-Mountain-Please-Talk#c1250100182",
        "65325d50b2e25aca54bc871b89758c9c (21:14): a480104b0e570389c6f4284a88c7cd9d: if the PFWG folks are willing to give a sneak preview of their answers on the phone, I can tell them to high degree of certainty if Hixie will find their answer acceptable",
        "a480104b0e570389c6f4284a88c7cd9d (21:14): excellent.",
        "65325d50b2e25aca54bc871b89758c9c (21:15): a480104b0e570389c6f4284a88c7cd9d: I can also help clarify Hixie's request if needed, because based on things I've heard, I believe they may be confused between implementation requirements and authoring conformance requirements",
        "65325d50b2e25aca54bc871b89758c9c (21:15): &quot;they&quot; meaning the people trying to come up with an answer",
        "a480104b0e570389c6f4284a88c7cd9d (21:15): A summary of what I understand to be the answer to the key issue: &quot;Other than the role attribute, the host language takes precedence&quot;.",
        "65325d50b2e25aca54bc871b89758c9c (21:16): whose key issue is that?",
        "a480104b0e570389c6f4284a88c7cd9d (21:16): based on your answer, it is clear that I don't understand Ian's issue.",
        "65325d50b2e25aca54bc871b89758c9c (21:17): Hixie's key issue is simply that he'd like to make &quot;nonsensical&quot; combinations of native markup and ARIA nonconforming",
        "65325d50b2e25aca54bc871b89758c9c (21:17): it's fine to let ARIA take precedence in behavior if someone actually does it",
        "65325d50b2e25aca54bc871b89758c9c (21:17): but ARIA apparently doesn't let host languages make any ARIA markup nonconforming",
        "65325d50b2e25aca54bc871b89758c9c (21:18): the idea being that if you tell ARIA that your radio button is a checkbox, you probably did something wrong",
        "a480104b0e570389c6f4284a88c7cd9d (21:18): my understanding is that in the case on nonsensical combinations, non comforming is not only OK, it is preferred; furthermore, the host language takes precedence in everything but role.",
        "65325d50b2e25aca54bc871b89758c9c (21:19): maybe I should talk to Hixie and make sure *I* understand his issues",
        "65325d50b2e25aca54bc871b89758c9c (21:20): wait, are you stating what you think Hixie's position is, or what you think ARIA currently says?",
        "a480104b0e570389c6f4284a88c7cd9d (21:20): even better, convince him to attend this one meeting.  I'm willing to clear the calendar of other items if that is what it takes.",
        "a480104b0e570389c6f4284a88c7cd9d (21:20): I am stating what I believe the next draft of ARIA will state.",
        "65325d50b2e25aca54bc871b89758c9c (21:21): I think convincing Hixie to attend a telecon is beyond my powers",
        "a480104b0e570389c6f4284a88c7cd9d (21:22): See my latest comment on my latest blog post.",
        "a480104b0e570389c6f4284a88c7cd9d (21:23): It is a damn shame when principles stand in the way of progress.",
        "f139aba52f9fa1394b4034a7954b2220 (21:33): a480104b0e570389c6f4284a88c7cd9d, am I correct in understanding that it would be inappropriate for Shelly to formatlly object to canvas being in HTML5 due to our previous vote on the issue in which the group formally decided to include it?",
        "f139aba52f9fa1394b4034a7954b2220 (21:33): or is it possible for such a formal objection to actually hold up progress?",
        "a480104b0e570389c6f4284a88c7cd9d (21:34): Did you see Dan's response?   (by the way Cynthia Shelly isn't talking about an objection, Shell***E***y Powers is)",
        "a480104b0e570389c6f4284a88c7cd9d (21:35): I do believe that the course of action that Shelley described would be treated as out-of-order",
        "f139aba52f9fa1394b4034a7954b2220 (21:35): a480104b0e570389c6f4284a88c7cd9d, I know. I didn't mention Cynthia",
        "a480104b0e570389c6f4284a88c7cd9d (21:36): no, but you misspelled shelley",
        "f139aba52f9fa1394b4034a7954b2220 (21:36): oh",
        "f139aba52f9fa1394b4034a7954b2220 (21:36): sorry. I didn't realise you'd associated my typo with Cynthia's last name",
        "a480104b0e570389c6f4284a88c7cd9d (21:37): oh, joy, matt responded again to my post",
        "f139aba52f9fa1394b4034a7954b2220 (21:38): I'm not sure which response from Dan you're talking about though. He hasn't responded to this http://lists.w3.org/Archives/Public/public-html/2009Aug/0604.html (nor the one before that in that thread)",
        "a480104b0e570389c6f4284a88c7cd9d (21:59): f139aba52f9fa1394b4034a7954b2220: I was talking about DanC's response before that point.  I do believe that objecting to canvas is out of order, and I do believe that the last call date is in jeopardy -- the latter mostly because the right people aren't volunteering to help.",
        "a480104b0e570389c6f4284a88c7cd9d (22:00): Does anybody know of a javascript implementation of the HTML5 progress element that can be used on legacy browsers?",
        "ab7faae5d7b250ea8606486575f8f79c (22:02): doesn't remember having heard of one",
        "2c39bccd623947fa6224ea57d2a727de (22:08): a480104b0e570389c6f4284a88c7cd9d, what parts need helping with in your opinion?",
        "a480104b0e570389c6f4284a88c7cd9d (22:11): Whatever parts won't be ready until December. :-)",
        "a480104b0e570389c6f4284a88c7cd9d (22:11): I don't have insight into a more granular breakdown of the tasks.",
        "a480104b0e570389c6f4284a88c7cd9d (22:11): I take it that DaveSinger and RichardS do.",
        "2c39bccd623947fa6224ea57d2a727de (22:12): so given those names you think the issues are primarily with accessibility and maybe video codecs?",
        "2c39bccd623947fa6224ea57d2a727de (22:13): given your statement &quot;the latter mostly because the right people aren't volunteering to help&quot; I was asking the above question, fwiw",
        "a480104b0e570389c6f4284a88c7cd9d (22:23): just to make sure that we are talking about the same issue, two links: http://www.w3.org/html/wg/tracker/actions/133 and http://lists.w3.org/Archives/Public/public-html/2009Aug/0611.html and I should have said RichardS and Maciej"
    ],
    "person_ids": [
        "d114be1698421a7cec050e2207d29631",
        "2c39bccd623947fa6224ea57d2a727de",
        "a924fb58d2c25874322f4e5126f608b9",
        "a480104b0e570389c6f4284a88c7cd9d",
        "ab7faae5d7b250ea8606486575f8f79c",
        "f139aba52f9fa1394b4034a7954b2220",
        "65325d50b2e25aca54bc871b89758c9c"
    ]
}