{
    "id": "8b7581f7172a2f2bd529e9b7f6c9fb12",
    "messages": [
        "b25b6b77a0087ff8385941e5545d32ea (20:04): b8810fee2f4a71f849f3f7409546d1d9: I note that the wiring laws in Sweden are insane (or have been so historically) and the design of the plug allows unsafe wiring",
        "b25b6b77a0087ff8385941e5545d32ea (20:05): Specifically grounding sockets is distressingly uncommon in residential properties (I think it is now required in new-build)",
        "b25b6b77a0087ff8385941e5545d32ea (20:06): And the plug fails-unsafe if you plug into a non-grounded socket (i.e. it is possible to plug an appliance that should be grounded into a non-grounded socket and have it work, just without grounding)",
        "b25b6b77a0087ff8385941e5545d32ea (20:07): So I would not really call that ideal design",
        "b25b6b77a0087ff8385941e5545d32ea (20:09): (by contrast the UK plug design with a mandatoy ground pin seems safer)",
        "fd9ef1223e855714294498ebfde79f98 (20:12): UK shaver/bathroom plugs only have two pins",
        "b25b6b77a0087ff8385941e5545d32ea (20:13): Indeed",
        "b25b6b77a0087ff8385941e5545d32ea (20:13): They are low volatge though",
        "b25b6b77a0087ff8385941e5545d32ea (20:14): (in general we don't have much in the way of electrics in the bathroom)",
        "b25b6b77a0087ff8385941e5545d32ea (20:14): (because, uh, we don't like dying)",
        "3aa4c68c2ceb0521f6c25f50e2e0950e (20:16): We just make sure that bathroom sockets have a breaker built-in, so they'll cut out quicker.",
        "9dfea2f9bd9114520591dceb20d528a1 (20:16): Swiss use three plugs, but apparently the middle one is optional because standard two-plug plugs work fine with three-hole sockets",
        "1f8387eb43f131d7c309a90a4e36b5cb (20:18): Yeah, that's American sockets too.",
        "1f8387eb43f131d7c309a90a4e36b5cb (20:18): high-fives the swiss.",
        "b25b6b77a0087ff8385941e5545d32ea (20:20): TabAtkins: OTOH the US plugs fricking *spark* when you insert them",
        "1f8387eb43f131d7c309a90a4e36b5cb (20:20): b25b6b77a0087ff8385941e5545d32ea: They do!  It's kinda cool.",
        "b25b6b77a0087ff8385941e5545d32ea (20:20): So you have nothing to be proud of",
        "1f8387eb43f131d7c309a90a4e36b5cb (20:22): I have never known anyone to have ever actually been shocked by the sparking, so shrug.",
        "9dfea2f9bd9114520591dceb20d528a1 (20:22): Standard European plugs are the only worthwhile ones",
        "9dfea2f9bd9114520591dceb20d528a1 (20:22): Everyone else needs to get in line",
        "b25b6b77a0087ff8385941e5545d32ea (20:26): hopes like crazy Sweden at least has radial wiring",
        "b25b6b77a0087ff8385941e5545d32ea (20:28): umm... I'm not sure if that's what I mean",
        "b25b6b77a0087ff8385941e5545d32ea (20:28): reads more",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:29): b25b6b77a0087ff8385941e5545d32ea: yeah, the plug design isn't ideal",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:30): but I assume the ability to plug to a non-grounded socket is a deliberate design decision",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:30): IIRC, the North American gounding pin has the opposite design",
        "1f8387eb43f131d7c309a90a4e36b5cb (20:32): Yes.",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:32): (it blew my mind when I learned that the UK design isn't electrically equivalent to the continental design)",
        "44e337dbc6d9f96f198a624c820b03ba (20:32): b25b6b77a0087ff8385941e5545d32ea: I misread that as ‚Äúbecause, uh, we don't like drying‚Äù ‚Äî which also kind-of works as an explanation.",
        "1f8387eb43f131d7c309a90a4e36b5cb (20:32): non-grounded plugs can go to a grounded socket, but not the other way around.",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:33): (that is, in UK and Ireland, there's a device-side fuse in each plug, while the Continental design puts the fuse in a fuse box on the socket side)",
        "b25b6b77a0087ff8385941e5545d32ea (20:33): b8810fee2f4a71f849f3f7409546d1d9: In what way &quot;not electrically equivalent&quot; the ring main vs radial thing? Or something else?",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:33): b25b6b77a0087ff8385941e5545d32ea: fuse placement. see above",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:33): b25b6b77a0087ff8385941e5545d32ea: and whatever ring vs. radial stuff comes with that",
        "b25b6b77a0087ff8385941e5545d32ea (20:33): notes that the UK also typically has circuit breakers on the whole circuit",
        "b25b6b77a0087ff8385941e5545d32ea (20:34): AFAICT from wikipedia the whole UK design was inspired by a need to save copper when everything was rebuild post WW2",
        "b25b6b77a0087ff8385941e5545d32ea (20:35): It seems that a ring main is a way to achieve that but you have to also have fuses in the appliances",
        "b25b6b77a0087ff8385941e5545d32ea (20:36): (because the saving coppewr thing means that you are running lots of appliances off the same circuit)",
        "1f8387eb43f131d7c309a90a4e36b5cb (20:37): Is there a name for rgb color units?  The things that there are 255 of in each channel?",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:37): putting the fuse on the plug side implies that the treat model assumes the devices are trusted and cooperative",
        "b25b6b77a0087ff8385941e5545d32ea (20:37): b8810fee2f4a71f849f3f7409546d1d9: Howso?",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:38): I was aware that European voltages saved copper compared to American, but I wasn't aware that the UK design saved even more",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:38): b25b6b77a0087ff8385941e5545d32ea: if the design requires a device-side fuse, the system isn' fused right if you plug in a rogue (cheap?) device that doesn't have a fuse",
        "b25b6b77a0087ff8385941e5545d32ea (20:39): b8810fee2f4a71f849f3f7409546d1d9: The whole circuit is still fused",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:39): has seen cheap adapters that allow fuseless devices to be plugged into UK sockets",
        "ab7faae5d7b250ea8606486575f8f79c (20:39): thought it was a legal requirement that devices do things correctly (i.e. have fuses, and are grounded or double-insulated)",
        "b25b6b77a0087ff8385941e5545d32ea (20:39): ab7faae5d7b250ea8606486575f8f79c: I think so too",
        "b25b6b77a0087ff8385941e5545d32ea (20:40): I guess maybe you could buy an unfused travel adaptor and bring it to the UK",
        "44e337dbc6d9f96f198a624c820b03ba (20:40): b8810fee2f4a71f849f3f7409546d1d9: And the adapters themselves don't have fuses in them?",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:40): 44e337dbc6d9f96f198a624c820b03ba: proper ones have, but I've seen bogus ones",
        "b25b6b77a0087ff8385941e5545d32ea (20:41): b8810fee2f4a71f849f3f7409546d1d9: Yes, in that specific case you are in marginally more danger. Although wikipedia claims that modern circuit breakers are likely to trip before the fuse blows anyway",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:41): 44e337dbc6d9f96f198a624c820b03ba: the bogus ones are a piece of plastic that has an extended that goes into the grounding hole openin the other slots for a continental plug",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:41): s/extended/extender/",
        "b25b6b77a0087ff8385941e5545d32ea (20:42): In the common case (UK devices on a UK circuit) you are marginally better off since you can set the fuse to the right level for the device",
        "ab7faae5d7b250ea8606486575f8f79c (20:43): I guess it's also easier to replace the fuse when it's in the plug",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:43): ab7faae5d7b250ea8606486575f8f79c: nope",
        "b25b6b77a0087ff8385941e5545d32ea (20:44): No one uses real fuses now anyway",
        "1f8387eb43f131d7c309a90a4e36b5cb (20:44): I'd assume just the opposite.",
        "b25b6b77a0087ff8385941e5545d32ea (20:44): Except in plugs",
        "44e337dbc6d9f96f198a624c820b03ba (20:44): b8810fee2f4a71f849f3f7409546d1d9: A plastic earth pin just means it isn't earthed. Double-insulated devices are allowed to do that anyway. But they can still have a fuse, which is in the connection to the live pin.",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:45): the UK design has merit, but the most annoying part is that the plugs are so big, so a person with a UK laptop power supply plus an adapter takes up 2 or 3 sockets at a conference",
        "b25b6b77a0087ff8385941e5545d32ea (20:46): Yeah, the bigness is unfortunate",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:46): the same problem repeats with continental plugs in American conferences, though it tends to be less serious",
        "b25b6b77a0087ff8385941e5545d32ea (20:46): has that problem a lot at home :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:49): I guess the only redeeming feature of the Danish plug is that the gounding pin is on the plug side as in North America"
    ],
    "person_ids": [
        "b25b6b77a0087ff8385941e5545d32ea",
        "fd9ef1223e855714294498ebfde79f98",
        "3aa4c68c2ceb0521f6c25f50e2e0950e",
        "9dfea2f9bd9114520591dceb20d528a1",
        "1f8387eb43f131d7c309a90a4e36b5cb",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "44e337dbc6d9f96f198a624c820b03ba",
        "ab7faae5d7b250ea8606486575f8f79c"
    ]
}