{
    "id": "8c277865b44fa5d461433d7d6f93af06",
    "messages": [
        "b8810fee2f4a71f849f3f7409546d1d9 (10:16): 69b0d3dfe919a6b860a9fac82de52a7e: I'll fix when I get to my work computer",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:17): sweet :-)",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:17): I hadn't realized RDFa had this random restriction: http://www.w3.org/TR/rdfa-syntax/#col_Metainformation",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:18): Did I read right that Shane called UAs that lowercase names &quot;legacy&quot;?",
        "65325d50b2e25aca54bc871b89758c9c (10:19): b8810fee2f4a71f849f3f7409546d1d9: well they haven't updated to XHTML2 yet",
        "65325d50b2e25aca54bc871b89758c9c (10:19): so obviously",
        "ab7faae5d7b250ea8606486575f8f79c (10:20): b8810fee2f4a71f849f3f7409546d1d9: Which restriction are you referring to?",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:20): ab7faae5d7b250ea8606486575f8f79c: not generating triples for rels not on that list",
        "ab7faae5d7b250ea8606486575f8f79c (10:21): b8810fee2f4a71f849f3f7409546d1d9: Ah",
        "ab7faae5d7b250ea8606486575f8f79c (10:21): Seems a really bad idea in terms of forward-compatibility",
        "ab7faae5d7b250ea8606486575f8f79c (10:22): (At least one implementation (rdfQuery) throws a fatal error if you have a rel keyword that's not on the list, which can't be good)",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:22): ab7faae5d7b250ea8606486575f8f79c: are you implying compliance isn't good? :-)",
        "ab7faae5d7b250ea8606486575f8f79c (10:24): b8810fee2f4a71f849f3f7409546d1d9: Compliance doesn't require implementations to throw fatal errors, just to ignore the value, as far as I can tell",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:24): ah",
        "8fc019e59244da41feafed752bc36331 (10:41): wondering what in http://www.w3.org/TR/rdfa-syntax/#col_Metainformation is random to b8810fee2f4a71f849f3f7409546d1d9",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:44): 8fc019e59244da41feafed752bc36331: the admittance of non-HTML4 relations seems arbitrary",
        "8fc019e59244da41feafed752bc36331 (10:44): ahm. and if you compare that to http://wiki.whatwg.org/wiki/RelExtensions  -  this is good practice, then, right? ;)",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:45): 8fc019e59244da41feafed752bc36331: license is there. also role. nofollow isn't there",
        "8fc019e59244da41feafed752bc36331 (10:45): if nofollow isn't there then it's a bug, IMHO",
        "8fc019e59244da41feafed752bc36331 (10:45): I'll check and bring it up at next telecon, thanks",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:46): 8fc019e59244da41feafed752bc36331: the whatwg wiki doesn't make future-limiting processing restrictions",
        "8fc019e59244da41feafed752bc36331 (10:46): is not in the position to judge, but I personally like and prefer the 'open' vocabulary world",
        "ab7faae5d7b250ea8606486575f8f79c (10:47): will refrain from making any suggestions on handling rel=&quot;alternate stylesheet&quot; similarly to how HTML5 microdata handles it (as a single token)",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:47): a wiki page seems more 'open' than a list created by a TF",
        "8fc019e59244da41feafed752bc36331 (10:47): experience tells that even if you allow people to come up with their own voc, over time the economics enforce few vocs per topic to survive",
        "ab7faae5d7b250ea8606486575f8f79c (10:48): also refrains from commenting on rel=&quot;STYLESHEET&quot; etc, which seemingly won't be accepted by an RDFa processor",
        "8fc019e59244da41feafed752bc36331 (10:48): b8810fee2f4a71f849f3f7409546d1d9: open in the sense of everyone can publish everywhere everything (why a single Wiki?)",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:49): 8fc019e59244da41feafed752bc36331: to avoid the step where you have overlapping vocabularies",
        "8fc019e59244da41feafed752bc36331 (10:49): b8810fee2f4a71f849f3f7409546d1d9: in my world this does not happen as each voc lives in its own namespace",
        "ab7faae5d7b250ea8606486575f8f79c (10:49): Regardless of where valid rel values are defined, they're going to be defined somewhere outside of RDFa, and so if RDFa defines it own parallel list then it's going to get out of sync at some point",
        "ab7faae5d7b250ea8606486575f8f79c (10:49): s/it/its",
        "8fc019e59244da41feafed752bc36331 (10:50): I guess the Java and other communities have experienced this for years and it seems to work fine",
        "8fc019e59244da41feafed752bc36331 (10:50): I have absolutely no idea why people oppose namespaces (note: I'm not talking about XMLNS per se)",
        "8fc019e59244da41feafed752bc36331 (10:53): BRB, gotta grab some coffee ;)",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:02): 8fc019e59244da41feafed752bc36331: I meant semantically overlapping",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:03): ab7faae5d7b250ea8606486575f8f79c: already got out of sync",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:03): (even for XHTML2!)",
        "8fc019e59244da41feafed752bc36331 (11:03): b8810fee2f4a71f849f3f7409546d1d9: ok. but I don't see the problem there",
        "8fc019e59244da41feafed752bc36331 (11:04): take for example Goolge. they decided not to reuse the already available vocs such as FOAF, etc.",
        "8fc019e59244da41feafed752bc36331 (11:04): fine. no problem. see for example http://iandavis.com/blog/2009/05/googles-rdfa-a-damp-squib#comment-1407",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:05): 8fc019e59244da41feafed752bc36331: some people who seem to care more about RDF than about RDFa cheerleading see it as a problem",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:05): 8fc019e59244da41feafed752bc36331: http://www.jenitennison.com/blog/node/104 (incl. comments)",
        "8fc019e59244da41feafed752bc36331 (11:06): b8810fee2f4a71f849f3f7409546d1d9: not sure if I understand this. RDFa is just an RDF serialisation",
        "8fc019e59244da41feafed752bc36331 (11:07): yes, I know Jeni's post and have left my 0.02‚Ç¨ at http://lists.w3.org/Archives/Public/public-lod/2009May/0095.html",
        "ab7faae5d7b250ea8606486575f8f79c (11:07): It sounds like Google is using it as a serialisation of a non-RDF data format, rather than of RDF",
        "ab7faae5d7b250ea8606486575f8f79c (11:07): (and they're using microformats as a different serialisation of the same internal non-RDF data format)",
        "8fc019e59244da41feafed752bc36331 (11:07): ab7faae5d7b250ea8606486575f8f79c: there you might be right ;)",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:08): ab7faae5d7b250ea8606486575f8f79c: indeed, but it's stille cheered as a success for RDFa. go figure",
        "8fc019e59244da41feafed752bc36331 (11:08): the thing is: I'm interested in the Web of Data where data comes from whatever nicely machine-processable format",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:09): ab7faae5d7b250ea8606486575f8f79c: anything that has the slightest appearance of using RDFa is cheered as a success, regardless of conformance or RDF model alignment",
        "ab7faae5d7b250ea8606486575f8f79c (11:09): b8810fee2f4a71f849f3f7409546d1d9: Kind of like cheering when Google starts using &quot;&lt;!doctype html&gt;&quot; on some of their pages? :-)",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:10): ab7faae5d7b250ea8606486575f8f79c: cheering for just the privacy page is embarrassing",
        "65325d50b2e25aca54bc871b89758c9c (11:10): it does seem like there is some degree of fanboyism around RDFa",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:10): ab7faae5d7b250ea8606486575f8f79c: but at least it validated as HTML5 instead of just using the doctype",
        "65325d50b2e25aca54bc871b89758c9c (11:10): like excitement about its superficial aspects instead of about the goals it is meant to achieve",
        "8fc019e59244da41feafed752bc36331 (11:11): b8810fee2f4a71f849f3f7409546d1d9: IIRC the microformats community even had a party celebrating it, but this is not the point (and I don't care)",
        "65325d50b2e25aca54bc871b89758c9c (11:11): I'll be excited when Web pages use new HTML5 tags/attributes/APIs",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:12): 8fc019e59244da41feafed752bc36331: celebrating what?",
        "65325d50b2e25aca54bc871b89758c9c (11:12): the doctype is not remotely exciting",
        "8fc019e59244da41feafed752bc36331 (11:12): b8810fee2f4a71f849f3f7409546d1d9: that Google supports microformats",
        "ab7faae5d7b250ea8606486575f8f79c (11:12): It seems there's some degree of fanboyism around every technology",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:12): 8fc019e59244da41feafed752bc36331: wow",
        "8fc019e59244da41feafed752bc36331 (11:13): to be fair Gentlemen, I think each and everyone of us who has invested couple of years into a technology is happy when there is an uptake",
        "8fc019e59244da41feafed752bc36331 (11:13): saying this is not the case is a simply dishonest",
        "65325d50b2e25aca54bc871b89758c9c (11:13): I like it when people use WebKit",
        "8fc019e59244da41feafed752bc36331 (11:13): s/is a/is",
        "ab7faae5d7b250ea8606486575f8f79c (11:13): I guess it still could be useful for each group to point out the unjustified fanboyism of each other group, even if we're all doing it",
        "8fc019e59244da41feafed752bc36331 (11:13): ab7faae5d7b250ea8606486575f8f79c: +1",
        "65325d50b2e25aca54bc871b89758c9c (11:14): but I have distinctly mixed feelings if they use it in a way where they make significant changes which they don't contribute back",
        "65325d50b2e25aca54bc871b89758c9c (11:14): I think what's most important is to be aware of your own unjusfified fanboyism",
        "65325d50b2e25aca54bc871b89758c9c (11:14): and try to keep it from influencing technical decisions in a bad way",
        "ab7faae5d7b250ea8606486575f8f79c (11:14): It seems the kind of situation that makes self-awareness difficult, which is why it's helpful to have other people point it out",
        "ab7faae5d7b250ea8606486575f8f79c (11:17): (...though preferably in a way that's not too rude or condescending, I guess)",
        "8fc019e59244da41feafed752bc36331 (11:17): as for me I just say: whatever data comes in there I'm happy (bonus if it links to other data, as this is the Web, right?)",
        "8fc019e59244da41feafed752bc36331 (11:17): two examples: just started reading the wonderful RESTful Web Services book -  awesome. so much useful stuff in it (and I see perfectly how linked data connects to it)",
        "8fc019e59244da41feafed752bc36331 (11:17): other example: started to work with Erik on  RESTful RDF (http://dret.typepad.com/dretblog/2009/05/rest-and-rdf-granularity.html)",
        "8fc019e59244da41feafed752bc36331 (11:18): ab7faae5d7b250ea8606486575f8f79c: yes. being polite and honest doesn't exclude each other ;)",
        "8fc019e59244da41feafed752bc36331 (11:20): ok, back to some hacking ... cya laters",
        "65325d50b2e25aca54bc871b89758c9c (11:31): &quot;These are the kind of pipe dreams that I used to ridicule semantic web folk about back before they body-snatched me!&quot;",
        "65325d50b2e25aca54bc871b89758c9c (11:31): now that's a high degree of self-awareness"
    ],
    "person_ids": [
        "b8810fee2f4a71f849f3f7409546d1d9",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "65325d50b2e25aca54bc871b89758c9c",
        "ab7faae5d7b250ea8606486575f8f79c",
        "8fc019e59244da41feafed752bc36331"
    ]
}