{
    "id": "8d6a9ecd80fe4cf91ee26d0992f98491",
    "messages": [
        "3c6e0b8a9c15224a8228b9a98ca1531d (23:06): hey guys, i've spent a few days trying to solve this issue and the ppl in #css/#html5 are stuck too.. maybe some html/css genius in here can do it: http://www.pastie.org/private/xo1w15miulgzf3ho9oya",
        "3c6e0b8a9c15224a8228b9a98ca1531d (23:06): basically i just need the sub menu lower and left aligned to the main menu regardless of which main menu LI the sub menu UL is attached to",
        "cc7bcfbc58c467939c5987584fc882cb (23:08): 3c6e0b8a9c15224a8228b9a98ca1531d, wrong channel",
        "3c6e0b8a9c15224a8228b9a98ca1531d (23:08): only douches in here?",
        "cc7bcfbc58c467939c5987584fc882cb (23:08): today's youth",
        "cc7bcfbc58c467939c5987584fc882cb (23:08): *shrug*",
        "06cb330920ae58e1614c9145d983b3d6 (23:08): also yesterday's youth and tomorrow's youth",
        "cc7bcfbc58c467939c5987584fc882cb (23:09): :&gt;",
        "06cb330920ae58e1614c9145d983b3d6 (23:09): the only thing special about today's youth is they happen to be the ones you'll see ... today",
        "cc7bcfbc58c467939c5987584fc882cb (23:10): 06cb330920ae58e1614c9145d983b3d6, it was just an empty &quot;get off my lawn&quot; phrase. it was entirely meaningless :&gt;",
        "06cb330920ae58e1614c9145d983b3d6 (23:11): don't worry, i'm sitting on the porch shaking my fist at those damned kids too :P",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:12): so I'm still awake and apparently Ms2ger needs not be summoned to IRC for regenerating the spec",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:12): http://dvcs.w3.org/hg/domcore/raw-file/tip/Overview.html#events",
        "06cb330920ae58e1614c9145d983b3d6 (23:15): seems sort of odd that &quot;propagation flag&quot; and &quot;immediate propagation flag&quot; seem more like &quot;stop propagation flag&quot; ... as if the values are reversed",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:16): hmm yeah",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:16): I wanted to shorten their length but that does not make it clearer indeed",
        "06cb330920ae58e1614c9145d983b3d6 (23:17): just flip the booleans? maybe given their purpose that would be odd (since they would be inverted from &quot;canceled flag&quot;)",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:18): no I am adding stop back in",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:19): you want to be in the list of acknowledgments as &quot 06cb330920ae58e1614c9145d983b3d6&quot; or some other name?",
        "06cb330920ae58e1614c9145d983b3d6 (23:19): The timeStamp attribute must be useless.",
        "06cb330920ae58e1614c9145d983b3d6 (23:19): heh",
        "06cb330920ae58e1614c9145d983b3d6 (23:20): Glenn Maynard",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:20): aha",
        "06cb330920ae58e1614c9145d983b3d6 (23:21): i've wished the timeStamp attribute worked in the past ... when doing things like emulating double-clicks from mouse (actually, touch) events",
        "06cb330920ae58e1614c9145d983b3d6 (23:21): guess it's just too far outside of browser event models to be able to do that reasonably",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:24): I think the way it works in Gecko enables that",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:24): not really sure how to define it yet",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:24): I wouldn't mind dropping it or having it always return 0 like in Opera, but that's not really the most useful",
        "06cb330920ae58e1614c9145d983b3d6 (23:37): &quot;Because createEvent() is located on the Document object it cannot be used by Web Workers.&quot; hmm ... although it clearly amtters less in workers (without the DOM, the more complex uses of events go away anyway), it does seem like an odd missing piece, given that events are still used; no particular use cases come to mind off-hand, though (possibly just due to not having used workers in complex enough ways yet)",
        "07c42ad49ef5c29784dce33083aec77a (23:38): Now that WHATWG HTML is versionless, the W3C copy is the only thing that can be referred to as &quot;HTML5&quot;, ending confusion.",
        "07c42ad49ef5c29784dce33083aec77a (23:38): And making the relationship between the two very clear.",
        "07c42ad49ef5c29784dce33083aec77a (23:40): edb259c0e0038f38bb200bc20c8cbf7e: It is sad that your blog don't have comments.",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:41): I saw your tweet... I don't really want to have to maintain such discussions anymore.",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:42): But this is the web, you do not have to be constrained with what I am offering on my site ;)",
        "07c42ad49ef5c29784dce33083aec77a (23:43): edb259c0e0038f38bb200bc20c8cbf7e: Except that as it happened, IE9 went RC around that time.",
        "07c42ad49ef5c29784dce33083aec77a (23:48): edb259c0e0038f38bb200bc20c8cbf7e: To summarize: IE stagnated for five years, then it took another five years for it to finally implement XHTML!",
        "06cb330920ae58e1614c9145d983b3d6 (23:48): am I the only person that keeps trying to define javascript functions as &quot;var func() { }&quot;? it's an instinct I just can't override, heh",
        "06cb330920ae58e1614c9145d983b3d6 (23:57): &quot;The list of event listeners can be manipulated while event listeners are being run.&quot; a bit vague--will the particulars of that be specified?",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:58): 06cb330920ae58e1614c9145d983b3d6, it's just a statement of fact",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:58): addEventListener and removeEventListener already define how the list is manipulated",
        "edb259c0e0038f38bb200bc20c8cbf7e (23:58): the rest is just going through a live list",
        "06cb330920ae58e1614c9145d983b3d6 (00:00): well, it seems that event handlers added during dispatch aren't being called, but ones removed also aren't (that is, removals during invocation are honored, but additions aren't) ... trying to see if that behavior is defined by the spec",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:01): that is not",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:03): hmm yeah",
        "06cb330920ae58e1614c9145d983b3d6 (00:03): it could be: define step 4 of invocation as operating on a copy of the event handler list, and have removeEventListener mark the event listener unused (for example, set its name to null, so 4.3 always terminates)",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:05): you can dispatch empty string events but yeah, something like that might work",
        "06cb330920ae58e1614c9145d983b3d6 (00:06): that would also avoid any ambiguity if, for example, an event handler is removed from the list then re-added in the same event",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:08): it would not be triggered then right?",
        "06cb330920ae58e1614c9145d983b3d6 (00:08): right",
        "06cb330920ae58e1614c9145d983b3d6 (00:08): since logically it's a new listener",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:08): so for nodes this is per &quot;current target&quot; I assume?",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:09): that is, a current target can manipulate the listeners for the next current target as pleased",
        "06cb330920ae58e1614c9145d983b3d6 (00:09): right ... i havn't checked that part of browser behavior though",
        "06cb330920ae58e1614c9145d983b3d6 (00:12): http://pastebin.com/kzscSk01 clicking text alerts in Opera but not FF3.6 or Chrome",
        "06cb330920ae58e1614c9145d983b3d6 (00:14): http://pastebin.com/ZTRw2iga same results when removing and adding in the same handler",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:14): so Opera has the DOM3Events behavior of having a static copy",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:15): whoa, so adding it again marks it &quot;used&quot; or some such?",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:15): in Gecko/WebKit",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:15): hmm, I should try sleeping again and maybe play with IEs implementation tomorrow",
        "06cb330920ae58e1614c9145d983b3d6 (00:16): i imagine that removing it marks the listener as &quot;dead&quot;, and adding it later adds an entirely new listener",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:16): oh right, see, I'm tired",
        "06cb330920ae58e1614c9145d983b3d6 (00:16): which was what I was going for above with the notion of clearing &quot;name&quot; (which was just a shorthand hack, of course, should be a named property or something in a spec)",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:18): fun stuff",
        "06cb330920ae58e1614c9145d983b3d6 (00:21): re: manipulating listeners the next ancestor target, yes in all of those browsers: http://pastebin.com/NEdKDMHT",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:21): thanks man",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:22): I wonder if Opera has any bugs filed against it for having a completely static list",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:22): and what IE does",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:23): not having to add a &quot;dead flag&quot; might be nice",
        "06cb330920ae58e1614c9145d983b3d6 (00:23): did you do the work boiling down the dispatch/invocation rules? because that's pretty well done",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:23): anyway, sleep",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:23): yeah, you can see how i went about it here: https://bitbucket.org/ms2ger/web-dom-core",
        "06cb330920ae58e1614c9145d983b3d6 (00:24): later, go to sleep before you get dragged into something else, that's what IRC does :P",
        "edb259c0e0038f38bb200bc20c8cbf7e (00:24): heh :)"
    ],
    "person_ids": [
        "3c6e0b8a9c15224a8228b9a98ca1531d",
        "cc7bcfbc58c467939c5987584fc882cb",
        "06cb330920ae58e1614c9145d983b3d6",
        "edb259c0e0038f38bb200bc20c8cbf7e",
        "07c42ad49ef5c29784dce33083aec77a"
    ]
}