{
    "id": "91c121554bbafd6b8aca1cbe3d38cf3b",
    "messages": [
        "99d799105c5630cb16b3a7b54e6ae26e (15:30): http://www.w3.org/TR/2010/WD-html5-20100304/ yay.",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (15:30): Title: HTML5 (at www.w3.org)",
        "3f2e2531201cfbf853f16f668132eaf2 (15:31): I thought the 2010 was going to be removed?",
        "3f2e2531201cfbf853f16f668132eaf2 (15:32): Oh, maybe that was just for the short names",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (15:53): planet: IEBlog : How IE8 Determines Document Mode &lt;http://blogs.msdn.com/ie/archive/2010/03/02/how-ie8-determines-document-mode.aspx&gt;",
        "8d5c0dd1af8dbfd69120fd4882cb3a68 (15:54): 3f2e2531201cfbf853f16f668132eaf2, yes, that was for the shortnames",
        "f139aba52f9fa1394b4034a7954b2220 (16:02): why does /TR/html5/ still point to the old draft?",
        "8d5c0dd1af8dbfd69120fd4882cb3a68 (16:04): because the webmaster isn't done yet",
        "60659cfda992013e610f285c46692d28 (16:24): it would have been nice if the published WD didn't contain stuff we already agreed should be removed, but I guess I'll have to wait for the next draft then (and in the meantime explain to outsiders why we publish stuff we  agreed to drop)",
        "c92ee57335b2094856a53a7e2230b369 (16:25): heh, which stuff is this?",
        "60659cfda992013e610f285c46692d28 (16:25): &quot;hyperlink auditing&quot;",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (16:25): bugmail: [Bug 9187] New: Need transparency in issue and bug status in databases &amp; document. &lt;http://lists.w3.org/Archives/Public/public-html-bugzilla/2010Mar/0024.html&gt;",
        "3f2e2531201cfbf853f16f668132eaf2 (16:29): It doesn't sound like a complex explanation to me - there's always a lot of known bugs and issues, which will be resolved over time, and any publication is necessarily a snapshot at a time when some have not yet been resolved",
        "3f2e2531201cfbf853f16f668132eaf2 (16:30): It'd be better if it didn't take six months to publish the next snapshot, though",
        "b25b6b77a0087ff8385941e5545d32ea (16:30): In fact we could just take the limit as t-&gt;0 and not bother with snapshots at all",
        "3f2e2531201cfbf853f16f668132eaf2 (16:32): I don't think the W3C staff would appreciate having to go through the publication process for every CVS commit",
        "3f2e2531201cfbf853f16f668132eaf2 (16:33): and given the W3C's requirement that something is published regularly, the publication process can't be ignored entirely",
        "3f2e2531201cfbf853f16f668132eaf2 (16:33): but the published snapshots shouldn't lag so much behind the editors' drafts",
        "60659cfda992013e610f285c46692d28 (16:36): published WDs are very important for people outside the W3C/WhatWG lookinh",
        "60659cfda992013e610f285c46692d28 (16:36): g",
        "b25b6b77a0087ff8385941e5545d32ea (16:37): 60659cfda992013e610f285c46692d28: All the people outside the process I have encountered have been horribly confused by the snapshots",
        "b25b6b77a0087ff8385941e5545d32ea (16:37): since they are always out of date",
        "b25b6b77a0087ff8385941e5545d32ea (16:38): 3f2e2531201cfbf853f16f668132eaf2: Sure, I'm not suggesting that it would work with the current W3C rules",
        "b25b6b77a0087ff8385941e5545d32ea (16:38): but presumably the rules are a means to an end rather than an end unto themselves",
        "60659cfda992013e610f285c46692d28 (16:44): people outside the process want to get a signal &quot;please look now&quot;, not following commits",
        "60659cfda992013e610f285c46692d28 (16:44): also, they want something stable to comment on",
        "60659cfda992013e610f285c46692d28 (16:44): deal with it",
        "60659cfda992013e610f285c46692d28 (16:44): that also means that a good moment to publish is when there was a significant change",
        "60659cfda992013e610f285c46692d28 (16:44): or improvement",
        "60659cfda992013e610f285c46692d28 (16:45): therefore getting the change applied for ISSUE-1 and 2 would have been good",
        "b25b6b77a0087ff8385941e5545d32ea (16:47): I would like some evidence to back up &quot;people want&quot;",
        "a924fb58d2c25874322f4e5126f608b9 (16:47): &quot;good moment to publish&quot; seems incompatible with heartbeat",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (16:54): planet: Is there a way to create a custom HTML validation schema for Visual Studio? &lt;http://stackoverflow.com/questions/2380346/is-there-a-way-to-create-a-custom-html-validation-schema-for-visual-studio&gt;",
        "3f2e2531201cfbf853f16f668132eaf2 (16:56): a924fb58d2c25874322f4e5126f608b9: The HTML WG already seems incompatible with heartbeat",
        "3f2e2531201cfbf853f16f668132eaf2 (16:59): Anyway, delaying an already-slow publication cycle for a good moment would be bad, but publishing regularly whenever there's a good moment would be good and better satisfy the heartbeat desires",
        "60659cfda992013e610f285c46692d28 (17:01): 3f2e2531201cfbf853f16f668132eaf2, exactly",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (17:03): 60659cfda992013e610f285c46692d28, what you say people outside the process want does not at all meet my experience",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (17:04): 60659cfda992013e610f285c46692d28, almost always the people asking me questions would've had no issue if they looked at the equivalent editor's draft",
        "a924fb58d2c25874322f4e5126f608b9 (17:07): 3f2e2531201cfbf853f16f668132eaf2: The overhead of doing a publication seems incompatible with a higher frequency, though",
        "3f2e2531201cfbf853f16f668132eaf2 (17:09): a924fb58d2c25874322f4e5126f608b9: Maybe increasing frequency would lower overhead",
        "3f2e2531201cfbf853f16f668132eaf2 (17:09): e.g. people wouldn't bother objecting to publication of the new draft, when it's not changed much since the draft that was published a month ago",
        "b25b6b77a0087ff8385941e5545d32ea (17:11): 3f2e2531201cfbf853f16f668132eaf2: That was roughly the original plan, but it turns out that people are confused into thinking that publication is somehow meaningful",
        "b25b6b77a0087ff8385941e5545d32ea (17:11): and so fight tooth and nail for their changes to be taken before publication",
        "b25b6b77a0087ff8385941e5545d32ea (17:12): even though the snapshot is useless",
        "3f2e2531201cfbf853f16f668132eaf2 (17:13): b25b6b77a0087ff8385941e5545d32ea: That seems like a positive feedback loop",
        "3f2e2531201cfbf853f16f668132eaf2 (17:13): People think publication is important, so they fight to delay it a bit and so it takes much longer",
        "3f2e2531201cfbf853f16f668132eaf2 (17:14): and since publication takes much longer, each snapshot hangs around for a long time and becomes more important",
        "b25b6b77a0087ff8385941e5545d32ea (17:15): 3f2e2531201cfbf853f16f668132eaf2: Apart from the bit about snapshots being more important (they are posibly percieved as more important but are actually less important the longer lived they are), that is exactly what has happened",
        "3f2e2531201cfbf853f16f668132eaf2 (17:15): So the solution is to break the loop by forcing a few quick publication cycles",
        "3f2e2531201cfbf853f16f668132eaf2 (17:15): s/the/a/",
        "3f2e2531201cfbf853f16f668132eaf2 (17:16): and then people will realise it doesn't matter if this version isn't perfect, there'll be another version coming along soon",
        "b25b6b77a0087ff8385941e5545d32ea (17:16): The loop could be broken by making publication strictly date based",
        "b25b6b77a0087ff8385941e5545d32ea (17:16): But people wouldn't like that because it would be obvious that it is pointless"
    ],
    "person_ids": [
        "99d799105c5630cb16b3a7b54e6ae26e",
        "0a39f78bcb297ab0ebe8a29c28bfed89",
        "3f2e2531201cfbf853f16f668132eaf2",
        "8d5c0dd1af8dbfd69120fd4882cb3a68",
        "f139aba52f9fa1394b4034a7954b2220",
        "60659cfda992013e610f285c46692d28",
        "c92ee57335b2094856a53a7e2230b369",
        "b25b6b77a0087ff8385941e5545d32ea",
        "a924fb58d2c25874322f4e5126f608b9",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0"
    ]
}