{
    "id": "971fef06e6416b7b975d0479c6db0526",
    "messages": [
        "f139aba52f9fa1394b4034a7954b2220 (22:08): We should just put one giant red box at the top of the spec that says: ...",
        "a924fb58d2c25874322f4e5126f608b9 (22:09): There have been objections to HTML5 as a whole, so it's only fair",
        "f139aba52f9fa1394b4034a7954b2220 (22:09): There are many people who collectively disagree with the entire content of this specification, and many others who collectively agree with the entire specification. As such, nothing in this draft is stable..",
        "b25b6b77a0087ff8385941e5545d32ea (22:11): f139aba52f9fa1394b4034a7954b2220: we have text that says that. Does making it a red box make any difference?",
        "f139aba52f9fa1394b4034a7954b2220 (22:20): b25b6b77a0087ff8385941e5545d32ea, yes. We put a big red border around the whole spec to make people happy",
        "f139aba52f9fa1394b4034a7954b2220 (22:35): on a more serious note, I wonder if we could address this issue by somehow linking the issues in the issue tracker from the status markers in the draft",
        "a924fb58d2c25874322f4e5126f608b9 (22:38): f139aba52f9fa1394b4034a7954b2220: These &quot;issues&quot; in manu's draft aren't really issues in the sense of the issue tracker",
        "f139aba52f9fa1394b4034a7954b2220 (22:38): a924fb58d2c25874322f4e5126f608b9, I know that, but by doing what I suggest, we guarantee that the issues tracked in both are in sync",
        "f139aba52f9fa1394b4034a7954b2220 (22:39): doing what Manu suggests amounts to arbitrarily inserting notes where random people disagree with something in a section",
        "a924fb58d2c25874322f4e5126f608b9 (22:39): Yup",
        "f139aba52f9fa1394b4034a7954b2220 (22:39): takes a look at what it would take to add that to the annotation system",
        "f5af272b5b04154c260eec46f4deb905 (22:47): f139aba52f9fa1394b4034a7954b2220 - your approach makes more sense to me than duplicating issue content in the spec.",
        "f5af272b5b04154c260eec46f4deb905 (22:48): I should say, a partial duplication of some existing issue content mixed with a bunch of new opinion content that has not been actually captured as an issue.",
        "f139aba52f9fa1394b4034a7954b2220 (23:00): Looks like we will need to add an &lt;issue&gt; element (or similar) to the XML output by status.cgi for each section, and then update status.js to include the information in the status boxes if present.",
        "f139aba52f9fa1394b4034a7954b2220 (23:01): Will also need to update the updateEntry function to be able to send a new status with the patch",
        "f139aba52f9fa1394b4034a7954b2220 (23:01): and update add something to the UI that allows issues to be recorded",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:02): hm?",
        "a480104b0e570389c6f4284a88c7cd9d (23:02): +1 to linking status to issues",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:02): if we make the status boxes link to issues it'll be perennially out of date",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:03): with the exception of the issues tracked on the issue tracker, the turnover rate is very high",
        "a480104b0e570389c6f4284a88c7cd9d (23:03): if it is out of date, poke me, and I'll update",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:03): you realise i go through about 500 issues a week right?",
        "f139aba52f9fa1394b4034a7954b2220 (23:03): if we only link them directly with the issue number, then they won't be out of date for too long",
        "a480104b0e570389c6f4284a88c7cd9d (23:03): (I was referring to the W3C issues)",
        "f139aba52f9fa1394b4034a7954b2220 (23:03): since the issues in the W3C issue tracker don't get updated that frequently",
        "ab7faae5d7b250ea8606486575f8f79c (23:04): If people care about what W3C WDs say, then the WHATWG status boxes would have to be folded into the WD somehow",
        "f139aba52f9fa1394b4034a7954b2220 (23:04): besides, all it would take is a link to the issue. We don't necessarily need something in the status box itself to report on the status of the issue",
        "f139aba52f9fa1394b4034a7954b2220 (23:04): no-one should care what a W3C WD should say, as it's out of date by the time its published",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:04): you mean the issue tracker that has such issues as &quot;tools that can't generate &lt;!DOCTYPE html&gt;&quot;, which was resolved almost 9 months ago?",
        "f139aba52f9fa1394b4034a7954b2220 (23:05): obviously we wouldn't need to bother linking to issues that are already closed",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:05): or &quot;HTML Versioning and DOCTYPEs&quot; that was resolved about 4 years ago?",
        "f139aba52f9fa1394b4034a7954b2220 (23:05): but just from the relevant sections to the open issues. Like linking the table section to ISSUE-32 (I think)",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:06): the whatwg status tracker is going to track actual issues. If the W3C HTMLWG wants to track bogus non-issues that are open purely for political reasons, then the HTMLWG can do it using its own scripts on its own copy of the draft.",
        "f139aba52f9fa1394b4034a7954b2220 (23:06): fair enough",
        "f5af272b5b04154c260eec46f4deb905 (23:12): prefers links to issues (in whichever issue tracking system is more up to date etc.) in the spec over inline snapshots of issue text in the spec.",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:15): i prefer to just resolve the issues when i get to them :-)",
        "f5af272b5b04154c260eec46f4deb905 (23:16): 69b0d3dfe919a6b860a9fac82de52a7e, perhaps links to unresolved emails to WHATWG list is your most up to date issue tracking system then.",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:16): www.whatwg.org/issues is my issue tracking system",
        "f5af272b5b04154c260eec46f4deb905 (23:17): Thanks 69b0d3dfe919a6b860a9fac82de52a7e.",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:22): ms2ger is awesome",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:22): he basically just did 90% of the references work for me",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:22): wonders who ms2ger is",
        "a924fb58d2c25874322f4e5126f608b9 (23:23): Your new competitor",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:23): 69b0d3dfe919a6b860a9fac82de52a7e: Did he find that there are dupes in the refs still?",
        "f5af272b5b04154c260eec46f4deb905 (23:25): a11aabeeceeae6b8cb5d12ea06b56554, according to http://wiki.whatwg.org/wiki/User:Ms2ger , he is https://secure.wikimedia.org/wikipedia/en/wiki/User:Ms2ger",
        "f5af272b5b04154c260eec46f4deb905 (23:26): a fairly frequent editor/contributor to Wikipedia: https://secure.wikimedia.org/wikipedia/en/wiki/Special:Contributions/Ms2ger",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:28): 69b0d3dfe919a6b860a9fac82de52a7e: Like RFC2616 and HTTP",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:28): 69b0d3dfe919a6b860a9fac82de52a7e: XMLNAMES and XMLNS",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:29): 69b0d3dfe919a6b860a9fac82de52a7e: http://pastebin.ca/1524312",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:29): f5af272b5b04154c260eec46f4deb905: ah"
    ],
    "person_ids": [
        "f139aba52f9fa1394b4034a7954b2220",
        "a924fb58d2c25874322f4e5126f608b9",
        "b25b6b77a0087ff8385941e5545d32ea",
        "f5af272b5b04154c260eec46f4deb905",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "a480104b0e570389c6f4284a88c7cd9d",
        "ab7faae5d7b250ea8606486575f8f79c",
        "a11aabeeceeae6b8cb5d12ea06b56554"
    ]
}