{
    "id": "98695586604a52da3e1ec8bfd09fabdf",
    "messages": [
        "3f2e2531201cfbf853f16f668132eaf2 (01:52): http://www.dame-mehri.com/ - all the images there are served as &quot;Forbidden&quot; (so the site breaks in Opera 9.2, since that doesn't display images unless it got a 200 response, but works in HTML5 since that says to violate HTTP)",
        "fd9ef1223e855714294498ebfde79f98 (01:53): unbelievable. http://html4all.org/mailman/archives/list_html4all.org/2008-June/000909.html",
        "78885357e970c69de0c33081760a04c9 (01:55): woah.",
        "78885357e970c69de0c33081760a04c9 (01:56): that's a kinda of uh, extreme interpretation of events.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:58): f139aba52f9fa1394b4034a7954b2220: about Erik forwarding to the list all bugzilla messages for the issue he raised, yeah, that's problem",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:58): but I understand why he's doing it",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:59): he wants to keep others aware of the fact that active discussion about it is taking place",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:59): but I think there are alternative ways to do that",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:00): like, once a week I or some volunteer can agree to look through the set of open issues in bugzilla a post a summary to the list",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:00): with URLs for the issues",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:01): and say, if you are interested in following any of these issues more closely, add yourself as a subscriber in the Cc field for the issue",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:01): or if you want to keep up with all bugzilla discussions, subscribe to the public-html-bugzilla list",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:02): there are going to be some hiccups along the way here before we work out all the kinks",
        "78885357e970c69de0c33081760a04c9 (02:03): Yeah, I was thinking along the same lines... that it might make sense to have someone present a high-level bugzilla summary to the issue-tracking telecons every two weeks",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:03): for now, Understanding and support for the fact that we are trying something new here to solve the problems we're dealing with would be much appreciated",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:04): 78885357e970c69de0c33081760a04c9: if you can help out with that, it would be a big help",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:04): Erik's issue is so far the only one we have",
        "78885357e970c69de0c33081760a04c9 (02:04): Sure, I can take that on.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:04): thanks very much",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:09): f139aba52f9fa1394b4034a7954b2220: I will send a notification to the public-html list about the public-html-bugzilla list",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:10): and btw, about the spam posted there, I will get that fixed",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:10): so that the list is closed to posting by anybody expect the bugzilla mailbog",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:10): mailbot",
        "f139aba52f9fa1394b4034a7954b2220 (02:13): a9b326df4e6da61c5b6f5e1058be83a2, thanks",
        "f139aba52f9fa1394b4034a7954b2220 (02:13): I think bugzilla will work a whole lot better than the wiki, which I think should be largely abandoned",
        "f139aba52f9fa1394b4034a7954b2220 (02:14): or at least only used for documentation purposes, not issue tracking",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:15): in practice, large parts of most Wikis in effect become write-only",
        "f139aba52f9fa1394b4034a7954b2220 (02:16): the wiki seemed to encourage people to write placeholder pages and leave things incomplete, even if they intended to return later. But that leaves a low signal to noise ratio",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:16): I think we can make better use of the wiki",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:16): but not so much for using it to track active issues",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:17): f139aba52f9fa1394b4034a7954b2220: btw, to be clear, I don't mind at all you pinging me to remind me about things or to make suggestions",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:18): and IRC is probably the best place to do it",
        "f139aba52f9fa1394b4034a7954b2220 (02:18): a9b326df4e6da61c5b6f5e1058be83a2, I know. that's why I ping you so often.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:18): heh :)",
        "f139aba52f9fa1394b4034a7954b2220 (02:18): btw, it still doesn't look like you followed up on that other issue I've been bugging you about all week :-)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:19): yeah, will do that right now",
        "f139aba52f9fa1394b4034a7954b2220 (02:19): cool",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:19): have allowed this other stuff to delay that for long enough",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:30): f139aba52f9fa1394b4034a7954b2220: ok, just replied to Kobi and kept you in the Cc field + added Karl Dubost",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:30): Karl is officially now the W3C &quot;Web Community Liaison&quot;",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:31): so I think Karl can and will be a help on this",
        "f139aba52f9fa1394b4034a7954b2220 (02:38): a9b326df4e6da61c5b6f5e1058be83a2, it appears Kobi's reply didn't make it into www-archive. Could it be still sitting in the moderation queue or something for that list?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:41): f139aba52f9fa1394b4034a7954b2220: reply to me just now, you mean?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:41): oh",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:41): I understand",
        "f139aba52f9fa1394b4034a7954b2220 (02:41): yeah, his message that you replied to",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:41): yeah",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:41): it is probably in a state that's waiting for him to him to agree to have it archived",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:42): not for moderation from our side"
    ],
    "person_ids": [
        "3f2e2531201cfbf853f16f668132eaf2",
        "fd9ef1223e855714294498ebfde79f98",
        "78885357e970c69de0c33081760a04c9",
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "f139aba52f9fa1394b4034a7954b2220"
    ]
}