{
    "id": "99f1691109693bfc7ea5d0c8ea16d01c",
    "messages": [
        "3c1a153d81002878b83df957ee534f47 (21:18): because without using existing microformats, you lack some of the necessary experience and wisdom to successfully create a new microformat.",
        "3c1a153d81002878b83df957ee534f47 (21:21): also, as the above-linked FAQ says: From that experience you will then be able to figure out what is left to be specified. Otherwise it is too hard to approach the &quot;whole problem&quot;.",
        "7f284971d1056987a11632f6f879ee0f (21:21): yeah, I understand..",
        "3c1a153d81002878b83df957ee534f47 (21:22): wacky_ what is your website?",
        "7f284971d1056987a11632f6f879ee0f (21:22): it's just that I understand most of the things, I just don't have that many websites full of vcards, hcards, hcalendar to be :)",
        "3c1a153d81002878b83df957ee534f47 (21:22): if you haven't used microformats on your websites then you can't &quot;understand most of the things&quot;",
        "3c1a153d81002878b83df957ee534f47 (21:22): some understanding is only gained through real world use and experience.",
        "7f284971d1056987a11632f6f879ee0f (21:26): I'm implemented some hCalendar stuff on a yet-to-be-released website, I've tweaked with hCards, but assuming I don't understand because I don't have some websites show it off is a bit weird, isn't it ? :P",
        "3c1a153d81002878b83df957ee534f47 (21:27): pretty much every website has an about section with contact info that should be marked up as hCard",
        "3c1a153d81002878b83df957ee534f47 (21:27): it is a good assumption as it is made from experience",
        "7f284971d1056987a11632f6f879ee0f (21:27): *blush* :P",
        "3c1a153d81002878b83df957ee534f47 (21:27): those who think they understand but don't have real world sites with microformats have pretty much never actually understood",
        "7f284971d1056987a11632f6f879ee0f (21:28): maybe you can tell if I have suffucient experience with a rough spec. I've come up with ?",
        "3c1a153d81002878b83df957ee534f47 (21:28): no that's usually a waste of time as well",
        "3c1a153d81002878b83df957ee534f47 (21:28): specs without real world experience beforehand are not worth the time",
        "3c1a153d81002878b83df957ee534f47 (21:28): do you have your own website?",
        "7f284971d1056987a11632f6f879ee0f (21:29): http://www.bourget.cc",
        "7f284971d1056987a11632f6f879ee0f (21:29): but it's an old php website..",
        "7f284971d1056987a11632f6f879ee0f (21:30): but.. still, if you're curious: http://pastebin.ca/1217122",
        "3c1a153d81002878b83df957ee534f47 (21:31): even something like the Copyright &amp;copy; 2005 - Alexandre Bourget in the footer of your site could/should be marked up with an &lt;address&gt; hCard",
        "3c1a153d81002878b83df957ee534f47 (21:32): also, you may want to consider making your site valid: http://validator.w3.org/check?uri=http://ip.bourget.cc:8080/",
        "3c1a153d81002878b83df957ee534f47 (21:33): if you don't take the time to add microformats to your site, why should/would anyone else take the time to add your microformat proposal to their site?",
        "7f284971d1056987a11632f6f879ee0f (21:33): because it'd be useful to them and to others",
        "7f284971d1056987a11632f6f879ee0f (21:33): whereas my site is an old piece of junk :P and I'll probably take it offline before I revamp it",
        "7f284971d1056987a11632f6f879ee0f (21:34): I have hCard support on http://www.vigilia.info but it's an internal tool",
        "7f284971d1056987a11632f6f879ee0f (21:36): ok :P so you really aren't curious :P",
        "3c1a153d81002878b83df957ee534f47 (21:36): that's the problem - because you haven't implemented microformats in real world sites, you don't have sufficient experience to know what would be &quot;useful ... to others&quot;. this is why such experience is a requirement.",
        "3c1a153d81002878b83df957ee534f47 (21:38): about once a month or so people propose microformats who either have no or haven't shown any real world experience, and rarely are those proposals even worth the time to read. so no, from experience, there is insufficient curiosity to merit the time to read proposals without sufficient experience.",
        "7f284971d1056987a11632f6f879ee0f (21:39): ok, I understand..",
        "7f284971d1056987a11632f6f879ee0f (21:41): Do you guys try to standarize (X)HTML-only microformats ?",
        "3c1a153d81002878b83df957ee534f47 (21:44): there's no such thing as non-(X)HTML microformats, see: http://microformats.org/wiki/what-are-microformats",
        "7f284971d1056987a11632f6f879ee0f (21:51): Microformats are simple conventions for embedding semantics in HTML to enable decentralized development.",
        "7f284971d1056987a11632f6f879ee0f (21:52): in human-readable (X)HTML/XML documents, Atom/RSS feeds, and &quot;plain&quot; XML",
        "7f284971d1056987a11632f6f879ee0f (21:53): ok.. so microformats are XML/(X)HTML only",
        "7f284971d1056987a11632f6f879ee0f (21:54): and you're not interested in anything else ?",
        "c74f596e4fe95fc3bb8726dbde2031b0 (21:57): What do you mean by &quot;anything else&quot;?  Nothing else falls inside scope.",
        "c74f596e4fe95fc3bb8726dbde2031b0 (21:58): Also, on real world exp, your pastebin states: &quot;#&quot;",
        "c74f596e4fe95fc3bb8726dbde2031b0 (21:58): The author is aware that some other microformats are pending that deal with",
        "c74f596e4fe95fc3bb8726dbde2031b0 (21:58): #",
        "c74f596e4fe95fc3bb8726dbde2031b0 (21:58): parts of this specification or overlaps certain area",
        "7f284971d1056987a11632f6f879ee0f (21:58): there aren't many standardisation bodies that do what you do, try to push for small open standards on the web...",
        "c74f596e4fe95fc3bb8726dbde2031b0 (21:58): overlaps are the sort of thing real world exp helps avoid",
        "7f284971d1056987a11632f6f879ee0f (21:59): c74f596e4fe95fc3bb8726dbde2031b0: I'm talking about the code-formats in the Wiki, but it's the code formats tries to do too much..",
        "c74f596e4fe95fc3bb8726dbde2031b0 (21:59): 7f284971d1056987a11632f6f879ee0f: Your pastebin describes something that overlaps very nearly to &lt;code&gt; + rel-tag",
        "7f284971d1056987a11632f6f879ee0f (22:00): c74f596e4fe95fc3bb8726dbde2031b0: ok, let me check",
        "7f284971d1056987a11632f6f879ee0f (22:01): c74f596e4fe95fc3bb8726dbde2031b0: by the &quot;anything else&quot;, I mean that &quot;SNIPPET:&quot;  format (inspired by AsciiDoc)..",
        "7f284971d1056987a11632f6f879ee0f (22:02): no one will standardize on how you write an e-mail, really :P so I though microformats.org would fit best",
        "7f284971d1056987a11632f6f879ee0f (22:02): the rel-tag isn't what I want.. since it's not necessarily a link..",
        "c74f596e4fe95fc3bb8726dbde2031b0 (22:02): text-based standards are more the purview of IETF",
        "7f284971d1056987a11632f6f879ee0f (22:02): someone in an e-mail isn't going to put some links there, and most of the time, there won't be any links, the rel-tag doesn't really apply here.. and &lt;code&gt; itself it way too broad.",
        "7f284971d1056987a11632f6f879ee0f (22:03): You can't say there's a concise example whenever you see a &lt;code&gt; block..",
        "c74f596e4fe95fc3bb8726dbde2031b0 (22:03): You can say that it is source code.  Which is all that can really be useful in a general way.",
        "7f284971d1056987a11632f6f879ee0f (22:03): c74f596e4fe95fc3bb8726dbde2031b0: are you aware of any such standardisation, of some &quot;common&quot; methods to write an mail ?",
        "7f284971d1056987a11632f6f879ee0f (22:04): c74f596e4fe95fc3bb8726dbde2031b0: sometimes, snippets are going to be (like in the pastebin) config files examples, you might use &lt;code&gt; or not..",
        "7f284971d1056987a11632f6f879ee0f (22:04): but for sure &lt;code&gt; doesn't convey enough semantics for the purpose here..",
        "c74f596e4fe95fc3bb8726dbde2031b0 (22:04): http://www.ietf.org/rfc/rfc3676.txt",
        "c74f596e4fe95fc3bb8726dbde2031b0 (22:05): What is the purpose here?",
        "7f284971d1056987a11632f6f879ee0f (22:06): to have means to search for clear, concise, self-contained examples",
        "7f284971d1056987a11632f6f879ee0f (22:06): what I see, is for example, having the documentation of the &quot;iptables&quot; project, and let's say, it's mailing list, crawled by some webbot, and taking out all the examples that were given",
        "c74f596e4fe95fc3bb8726dbde2031b0 (22:07): That doesn't sound particularly useful... such examples only make sense in the context of their threads",
        "c74f596e4fe95fc3bb8726dbde2031b0 (22:07): Anyway, such a format is *definitely* out of scope for Microformats",
        "7f284971d1056987a11632f6f879ee0f (22:07): centralize them, and use the &quot;snippet&quot; keyword as a new (which isn't true, there are already many snippets websites) way to search for code examples",
        "7f284971d1056987a11632f6f879ee0f (22:07): even the HTML-based one, you think ?",
        "c74f596e4fe95fc3bb8726dbde2031b0 (22:08): The &quot;HTML-based one&quot; overlaps existing work considerably and does not solve a real-world problem",
        "7f284971d1056987a11632f6f879ee0f (22:09): hmm,.. it does for programmers, sysadmins, anyone searching for ready-made code",
        "c74f596e4fe95fc3bb8726dbde2031b0 (22:09): code.google.com handles that",
        "7f284971d1056987a11632f6f879ee0f (22:10): somehow..",
        "7f284971d1056987a11632f6f879ee0f (22:10): code.google.com will dump you *all* the source code for some projects.. which is okay..",
        "7f284971d1056987a11632f6f879ee0f (22:11): but not really what you'd expect when you're searching for a particular feature demonstration",
        "7f284971d1056987a11632f6f879ee0f (22:11): and it searches code.. not config files examples, which is really useful to sysadmins...",
        "c74f596e4fe95fc3bb8726dbde2031b0 (22:12): Perhaps you are looking to create a resource for such then.  I do not see a use case for publishing arbitrary code and marking it &quot;useful example&quot;.",
        "7f284971d1056987a11632f6f879ee0f (22:13): that,s what would happen if we based only on &lt;code&gt; .. which isn,t what we want",
        "7f284971d1056987a11632f6f879ee0f (22:13): we want people to high-light in their documentation, or on their blogs, or on forums, or in mailing lists, what *is* an actual &quot;useful example&quot;",
        "7f284971d1056987a11632f6f879ee0f (22:14): but we need a standard way to do that.. .. we need a microformat :P",
        "c74f596e4fe95fc3bb8726dbde2031b0 (22:16): but those examples are not useful out of context",
        "7f284971d1056987a11632f6f879ee0f (22:17): first, the crawler keeps track of the context (and save backlinks)",
        "7f284971d1056987a11632f6f879ee0f (22:18): second, we want people to write a simple description, and have it self-contained, thus useful out of context (if taken from a forum, or a mailing list)",
        "7f284971d1056987a11632f6f879ee0f (22:19): people would know that the Snippet is supposed to be self-contained (I'll probably have to specify that in the spec. though)",
        "7f284971d1056987a11632f6f879ee0f (22:29): you think I should just trash the idea ? :P",
        "04312876a741571b99a014875f66a651 (22:33): it is not likely that people adopt it, actually",
        "7f284971d1056987a11632f6f879ee0f (22:37): what do you see stopping it ?"
    ],
    "person_ids": [
        "3c1a153d81002878b83df957ee534f47",
        "7f284971d1056987a11632f6f879ee0f",
        "c74f596e4fe95fc3bb8726dbde2031b0",
        "04312876a741571b99a014875f66a651"
    ]
}