{
    "id": "9bfdb6f3258d8d277ea47734eb30ae02",
    "messages": [
        "73eaf221abca1b8244e34b0b9e76ac46 (13:36): a11aabeeceeae6b8cb5d12ea06b56554: do you intend to work on web dom core anything this month?",
        "dbde75631ef339edeacdd46db97ced4f (13:36): 73eaf221abca1b8244e34b0b9e76ac46: A bit, not much. I don't intend on doing much web stuff this month in general.",
        "73eaf221abca1b8244e34b0b9e76ac46 (13:45): dbde75631ef339edeacdd46db97ced4f: ok",
        "6d05f0c2942adc25946a4b02b37ffa00 (13:48): the TAG is making a case: http://www.w3.org/2001/tag/2009/09/TagHTMLIssues.html",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:02): finds a future-proofing argument: http://krijnhoetmer.nl/irc-logs/whatwg/20090903#l-147",
        "6d05f0c2942adc25946a4b02b37ffa00 (14:03): ah yeah, I was trying to track that one down to point it out to you",
        "6d05f0c2942adc25946a4b02b37ffa00 (14:04): it seems they might be misinformed on how those things work",
        "73eaf221abca1b8244e34b0b9e76ac46 (14:26): &quot;Relating to the above, there is also the provision in 3.2.3(3.3.3) that global attributes &quot;may be specified on all HTML elements (even those not defined in this specification)&quot;; this strongly suggests some sort of extensibility at the element level.&quot;",
        "6d05f0c2942adc25946a4b02b37ffa00 (14:30): point?",
        "73eaf221abca1b8244e34b0b9e76ac46 (14:32): from TagHTMLIssues",
        "6d05f0c2942adc25946a4b02b37ffa00 (14:33): what's the point of highlighting it here",
        "6d05f0c2942adc25946a4b02b37ffa00 (14:33): :)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (14:34): 73eaf221abca1b8244e34b0b9e76ac46: http://hg a11aabeeceeae6b8cb5d12ea06b56554.com/web-dom-core/ fwiw",
        "f139aba52f9fa1394b4034a7954b2220 (14:34): a11aabeeceeae6b8cb5d12ea06b56554, are you taking over web dom core from 73eaf221abca1b8244e34b0b9e76ac46?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (14:35): f139aba52f9fa1394b4034a7954b2220: I have some intention to write a test suite for it, whether I take over editing of the spec is another question. I'll probably make some edits, but nothing that involves changing much text :P",
        "73eaf221abca1b8244e34b0b9e76ac46 (14:35): 6d05f0c2942adc25946a4b02b37ffa00: i find it interesting that they're reading between the lines",
        "73eaf221abca1b8244e34b0b9e76ac46 (14:36): a11aabeeceeae6b8cb5d12ea06b56554: cool",
        "6d05f0c2942adc25946a4b02b37ffa00 (14:36): 73eaf221abca1b8244e34b0b9e76ac46, ah, yeah, maybe they're still used to all those specifications where that is sort of required if you want to truly understand them :p",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:39): 73eaf221abca1b8244e34b0b9e76ac46: I thought it was no secret that HTML5 is written to allow deltaspecs",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:40): 73eaf221abca1b8244e34b0b9e76ac46: e.g. if &lt;keygen&gt; were spun off the language the TAG quotes would make a proper delta spec easier",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:40): 73eaf221abca1b8244e34b0b9e76ac46: maybe the TAG isn't considering this use case for the quoted spec language",
        "73eaf221abca1b8244e34b0b9e76ac46 (14:46): b8810fee2f4a71f849f3f7409546d1d9: the words &quot;decentralized extensibility&quot; are present in TagHTMLIssues",
        "73eaf221abca1b8244e34b0b9e76ac46 (14:47): more specifically in the point above what i quoted",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:58): b8810fee2f4a71f849f3f7409546d1d9: could you explain what the problem you are referring to in http://lists.w3.org/Archives/Public/public-html/2009Aug/1433.html is?",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:01): 69b0d3dfe919a6b860a9fac82de52a7e: the problem is that you have designed a feedback loop from validators to authors. however, the tool developer sits in between and deflects the feedback before it reaches the author",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:01): 69b0d3dfe919a6b860a9fac82de52a7e: and in doing so, probably violates ATAG 2",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:02): &quot;deflects the feedback&quot;?",
        "6d05f0c2942adc25946a4b02b37ffa00 (15:02): i'd love for the TAG to replace decentralized extensibility with XML namespace-based extensibility because that's what they want",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:02): 69b0d3dfe919a6b860a9fac82de52a7e: makes the tool generate output that makes the validator stay silent",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:02): (let's pretend for the sake of this discussion that I don't care about ATAG2 and only care about making editors help authors create accessible documents.)",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:02): why would a tool generate output that makes the validator stay silent?",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:03): 69b0d3dfe919a6b860a9fac82de52a7e: do you believe that &lt;img alt=&quot;&quot;&gt; for a critical content image is an epsilon less accessible than &lt;img&gt; (if that's the dichotomy you have to work with)?",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:03): b8810fee2f4a71f849f3f7409546d1d9: yes.",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:04): 69b0d3dfe919a6b860a9fac82de52a7e: because the tool developer thinks that the validation is about syntax and that it is the job of the tool to hide the syntax from the user of the tool",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:04): 69b0d3dfe919a6b860a9fac82de52a7e: also, because the tool developer think that the tool will get better reviews if it produces syntactically errorless output",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:04): so what you're saying is you want tools to write documents that trigger different validation modes than hand-writing authors?",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:05): would tool developers not feel that they had done their part if they warned the user that their documents were non-conforming when saving if their user hasn't provided suitable information?",
        "ab7faae5d7b250ea8606486575f8f79c (15:05): presumes it should be possible to test that assertion by looking at current HTML editing tools, and seeing what lengths they go to to produce valid output (vs invalid output that works equally well (or better) in practice)",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:05): 69b0d3dfe919a6b860a9fac82de52a7e: yes if validators are required to show messages to hand-writing authors that are motivated by WCAG and not by strictly syntactic matters",
        "ab7faae5d7b250ea8606486575f8f79c (15:05): (By &quot;that assertion&quot; I mean one several lines earlier)",
        "ab7faae5d7b250ea8606486575f8f79c (15:06): wonders if anyone has already done that looking and summarised the results",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:06): b8810fee2f4a71f849f3f7409546d1d9: i don't understand what your last sentence means",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:06): 69b0d3dfe919a6b860a9fac82de52a7e: evidently, BlueGriffon and iWeb developers have felt the need to output stuff that silences validators",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:06): b8810fee2f4a71f849f3f7409546d1d9: (&quot;motivated by WCAG&quot;?)",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:07): 69b0d3dfe919a6b860a9fac82de52a7e: substitute with &quot;motivated by promoting accessibility awareness&quot;",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:07): 69b0d3dfe919a6b860a9fac82de52a7e: or whatever awareness that isn't a strictly syntactic matter",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:08): b8810fee2f4a71f849f3f7409546d1d9: ok. so, let's reintroduce the &lt;meta name=generator&gt; hack that made the validation rules different for documents from editors.",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:08): 69b0d3dfe919a6b860a9fac82de52a7e: that would be one way of removing my ATAG 2 contradiction concern",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:10): 69b0d3dfe919a6b860a9fac82de52a7e: as I've said before, I've decided not to bikeshed the mechanism, so I'll refrain from discussing whether I prefer that hack or the missing marker approach mentioned by the WAI CG",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:10): k",
        "f139aba52f9fa1394b4034a7954b2220 (15:17): wait, perhaps I'm missing something. But what issue specifically does the spec require validators to flag, which is motivated by promoting accessibility awareness?",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:17): f139aba52f9fa1394b4034a7954b2220: alt",
        "f139aba52f9fa1394b4034a7954b2220 (15:17): since when is alt now required?",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:18): f139aba52f9fa1394b4034a7954b2220: since quite a while now",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:18): f139aba52f9fa1394b4034a7954b2220: as in since months ago",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:19): f139aba52f9fa1394b4034a7954b2220: except when there are certain larger structures that aren't practical for WYSIWYG tools to treat as units",
        "8caa48a7f22029eec0468581fda5a6cf (15:21): http://validator.w3.org/check?uri=http://www.w3.org/2001/tag/2009/09/TagHTMLIssues.html&amp;charset=(detect+automatically)&amp;doctype=Inline&amp;group=0 is amusing",
        "a924fb58d2c25874322f4e5126f608b9 (15:22): How surprising",
        "f139aba52f9fa1394b4034a7954b2220 (15:23): b8810fee2f4a71f849f3f7409546d1d9, it still says it can be omitted, dependent on meeting other specified conditions",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:24): f139aba52f9fa1394b4034a7954b2220: see &quot;except when there are certain larger structures that  aren't practical for WYSIWYG tools to treat as units&quot;",
        "f139aba52f9fa1394b4034a7954b2220 (15:27): b8810fee2f4a71f849f3f7409546d1d9, I can't find that phrase anywhere in the spec",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:27): f139aba52f9fa1394b4034a7954b2220: it's my phrase here on IRC",
        "f139aba52f9fa1394b4034a7954b2220 (15:28): oh, oops",
        "8caa48a7f22029eec0468581fda5a6cf (15:28): more from TagHTMLIssues: &quot;I was surprised to see that doc ument.write() is not supported when parsing the XML serialization. This seems to put the nail in the coffin of XML as a serialization format for colloquial HTML.&quot;",
        "8caa48a7f22029eec0468581fda5a6cf (15:28): i love how they're just noticing this now",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:29): 8caa48a7f22029eec0468581fda5a6cf: wow",
        "f139aba52f9fa1394b4034a7954b2220 (15:29): It does say &quot;As a last resort, implementors should either set the alt  attribute to the empty string, under the assumption that the image is a purely decorative image that doesn't add any information but is still specific to the surrounding content, or omit the alt  attribute altogether, under the assumption that the image is a key part of the content.&quot;",
        "f139aba52f9fa1394b4034a7954b2220 (15:29): I'm guessing that's where you see the contradiction since it's telling authoring tools that they can output non-conforming markup?",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:29): f139aba52f9fa1394b4034a7954b2220: seems like a contradiction to me",
        "f139aba52f9fa1394b4034a7954b2220 (15:29): ... or validator-silencing alt=&quot;&quot;",
        "6d05f0c2942adc25946a4b02b37ffa00 (15:30): 8caa48a7f22029eec0468581fda5a6cf, even more surprising is that they'd like the XML syntax to become turing-complete too where they did not like that when they found out about the HTML syntax being that",
        "8caa48a7f22029eec0468581fda5a6cf (15:31): &quot;...my intuition is that it could be done reasonably cleanly&quot;",
        "a924fb58d2c25874322f4e5126f608b9 (15:31): 8caa48a7f22029eec0468581fda5a6cf: Maybe they want to kill off the off-the-shelf parser",
        "f139aba52f9fa1394b4034a7954b2220 (15:31): dammit. I don't like how the spec has slowly gone from the sensible requirements to allow alt to be omitted, to the now contradictory requirements that make accessibility people happy. :-(",
        "a924fb58d2c25874322f4e5126f608b9 (15:31): That would make transitioning to XML5 a lot easier",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:33): 8caa48a7f22029eec0468581fda5a6cf: I can assure you that even trying to implement document.write cleanly leads to dirtiness",
        "6d05f0c2942adc25946a4b02b37ffa00 (15:33): ah, XML5; still a good idea, but unclear whether it's worth the effort",
        "8caa48a7f22029eec0468581fda5a6cf (15:35): willful violations, global version identifiers",
        "8caa48a7f22029eec0468581fda5a6cf (15:35): it just goes on and on",
        "8caa48a7f22029eec0468581fda5a6cf (15:36): it's like a laundry list of all the things the WHATWG has rejected in the past five years",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:36): Am I missing something or is WebKit non-compliant if you try to use document.open() merely to flip the HTMLness bit?",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:36): the spec just changed such that the bit doesn't flip",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:37): and webkit is compliant to neither the old text nor the new text",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:37): whoa",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:37): (it throws, now)",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:37): 69b0d3dfe919a6b860a9fac82de52a7e: why?",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:37): bz asked me to change it",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:37): ok",
        "6d05f0c2942adc25946a4b02b37ffa00 (15:37): no, jonas did",
        "8caa48a7f22029eec0468581fda5a6cf (15:37): &quot;It may be that this 'willful violation' describes current web practice, but bringing the web into coherence with other applications should be a priority, and efforts made to reduce the causes of interoperability.&quot; yes, please go do that. and come back when you're bitter and disillusioned.",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:37): my bad",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:37): jonas asked",
        "8caa48a7f22029eec0468581fda5a6cf (15:38): &quot;HTML 5 calls for user agents to ignore normative Content-type in certain cases.&quot;",
        "8caa48a7f22029eec0468581fda5a6cf (15:38): sigh",
        "8caa48a7f22029eec0468581fda5a6cf (15:39): i can't go on, it's just too depressing",
        "f139aba52f9fa1394b4034a7954b2220 (15:39): 69b0d3dfe919a6b860a9fac82de52a7e, in webdatabase, the arguments parameter in executeSql() is, unfortunately, very prone to accidental omission. I've done it several times now, and each time I fail to detect that as that as the actual cause of the error",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:40): f139aba52f9fa1394b4034a7954b2220: suggested solutino?",
        "f139aba52f9fa1394b4034a7954b2220 (15:40): I don't know yet. I'm just whinging about how badly the API has been designed.",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:42): let me know when you have a better design :-P",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:42): i don't think it's that badly designed, it's a very constrained space which doesn't leave one with many options.",
        "f139aba52f9fa1394b4034a7954b2220 (15:45): so the issue is that when a statement doesn't require variable substitutions, it should be possible to invoke executeSql() by providing just a SQL statement and a callback, without having to also specify an empty array in between.",
        "6d05f0c2942adc25946a4b02b37ffa00 (15:46): I don't think we should do that",
        "f139aba52f9fa1394b4034a7954b2220 (15:46): so maybe if the variable substituion step was somehow separated from the executeSql call",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:46): we could make the argument optional",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:46): (well, overload the method with two calls)",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:46): since you can distinguish and array from a function",
        "f139aba52f9fa1394b4034a7954b2220 (15:46): 6d05f0c2942adc25946a4b02b37ffa00, from experince, I know how much it sucks to have to remember to write the null in the middle of executeSql(&quot;SELECT * FROM t&quot;, null, callback)",
        "6d05f0c2942adc25946a4b02b37ffa00 (15:46): the whole reason it was required was to make sure people would not do their own thing",
        "f139aba52f9fa1394b4034a7954b2220 (15:47): 69b0d3dfe919a6b860a9fac82de52a7e, I know, that's the problem",
        "6d05f0c2942adc25946a4b02b37ffa00 (15:47): I don't think we should be making too many changes at this point based on limited feedback",
        "6d05f0c2942adc25946a4b02b37ffa00 (15:47): We need more Web developers to give feedback on the API first, imo",
        "f139aba52f9fa1394b4034a7954b2220 (15:48): 6d05f0c2942adc25946a4b02b37ffa00, the problem is, once we've shipped and developers start using it, it's too late to fix problems like this",
        "6d05f0c2942adc25946a4b02b37ffa00 (15:48): no it's not",
        "6d05f0c2942adc25946a4b02b37ffa00 (15:48): making an argument optional is always possible later and there's no universal adoption of the API yet anyway",
        "f139aba52f9fa1394b4034a7954b2220 (15:52): 69b0d3dfe919a6b860a9fac82de52a7e, our developer said he's not comfortable with making the arguments parameter optional",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:52): f139aba52f9fa1394b4034a7954b2220: well then i don't know what else we can do",
        "f139aba52f9fa1394b4034a7954b2220 (15:52): but he's fixed our implementation so that at least we get a more meaningful error message than before",
        "6d05f0c2942adc25946a4b02b37ffa00 (15:53): i think the reason for having it required was justified when the API was initially designed and that's mostly the reason I'd not like to change; at least not until more feedback demonstrates it's an issue",
        "f139aba52f9fa1394b4034a7954b2220 (15:56): 69b0d3dfe919a6b860a9fac82de52a7e, also, can you make the webdatabase spec clearer in step 10 of the processing model, where it says:",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:56): yes, but send mail or file a bug",
        "f139aba52f9fa1394b4034a7954b2220 (15:56): ok, will do",
        "6d05f0c2942adc25946a4b02b37ffa00 (16:00): 8caa48a7f22029eec0468581fda5a6cf, you may want to read http://www.w3.org/mid/<email/> (near the end)",
        "6d05f0c2942adc25946a4b02b37ffa00 (16:00): 8caa48a7f22029eec0468581fda5a6cf, no need to get upset just yet it seems ;)",
        "ab7faae5d7b250ea8606486575f8f79c (16:03): But getting upset is fun!",
        "6d05f0c2942adc25946a4b02b37ffa00 (16:04): you know what else is fun? charset stats :p",
        "b07211a0c7cb119232799d2119cea90f (16:05): some of the TAG's feedback reminds me of 69b0d3dfe919a6b860a9fac82de52a7e's &quot;Writnig specifications: knowing when to stop&quot; post",
        "69b0d3dfe919a6b860a9fac82de52a7e (16:05): heh",
        "ab7faae5d7b250ea8606486575f8f79c (16:06): 6d05f0c2942adc25946a4b02b37ffa00: You seem to be obsessed :-p",
        "ab7faae5d7b250ea8606486575f8f79c (16:07): hopes he can find all his old scripts and stuff",
        "b07211a0c7cb119232799d2119cea90f (16:07): 69b0d3dfe919a6b860a9fac82de52a7e: though amusingly, one of the the TAG's comments is that in 3.2.5.1.7, the spec says &quot;pointing device&quot; without a definition, and that's one of the things you mention in your blog post as needing a definition",
        "69b0d3dfe919a6b860a9fac82de52a7e (16:07): heh"
    ],
    "person_ids": [
        "73eaf221abca1b8244e34b0b9e76ac46",
        "dbde75631ef339edeacdd46db97ced4f",
        "6d05f0c2942adc25946a4b02b37ffa00",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "a11aabeeceeae6b8cb5d12ea06b56554",
        "f139aba52f9fa1394b4034a7954b2220",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "ab7faae5d7b250ea8606486575f8f79c",
        "8caa48a7f22029eec0468581fda5a6cf",
        "a924fb58d2c25874322f4e5126f608b9",
        "b07211a0c7cb119232799d2119cea90f"
    ]
}