{
    "id": "9c47a27de117e09602cd157dbb138e33",
    "messages": [
        "f47636673b14c54021a69dc06f6a19fb (11:04): hmmm not sure I 100% agree with david. Or more exactly everything which is touching humans with stong implications is indeed political.",
        "f47636673b14c54021a69dc06f6a19fb (11:04): The way the issue is framed is more about the use of public &quot;private&quot;/space on the Web.",
        "f47636673b14c54021a69dc06f6a19fb (11:05): The Web has challenged a bit these definitions by making things available in the public space.",
        "f47636673b14c54021a69dc06f6a19fb (11:05): even if the usage is intended for a few.",
        "f47636673b14c54021a69dc06f6a19fb (11:05): it's often where the friction starts",
        "f47636673b14c54021a69dc06f6a19fb (11:07): the comparison for the access ramp for example is not that good. It would be better if it was used for a private company, a restaurant or a shop which are not public space (aka govs) but used by the public",
        "f47636673b14c54021a69dc06f6a19fb (11:07): that makes it slightly different in terms of thinking.",
        "f47636673b14c54021a69dc06f6a19fb (11:09): the last paragraph of the post will put fire on the oil too. Not very clever. Basically it says to the web accessibility community, I know better than you. Usually this kind of comments creates walls",
        "f47636673b14c54021a69dc06f6a19fb (11:10): This was the good part &quot;Sensible choices along this spectrum can vary depending on how the Web is being used; there's a big difference between publishing to an audience of five (that might be larger later, if you happen to succeed) and publishing to an audience already known to be in the millions.&quot;",
        "b25b6b77a0087ff8385941e5545d32ea (11:11): f47636673b14c54021a69dc06f6a19fb: I don't really think that if I post a photo to flickr that is the same as if I open a shop",
        "b25b6b77a0087ff8385941e5545d32ea (11:11): Just because both happen to be publically avaliable",
        "f47636673b14c54021a69dc06f6a19fb (11:11): b25b6b77a0087ff8385941e5545d32ea: society choice and how the Web challenges the notion of public/private I said it in the second sentence.",
        "a924fb58d2c25874322f4e5126f608b9 (11:12): It's not just about public and private, there's also money",
        "b25b6b77a0087ff8385941e5545d32ea (11:12): f47636673b14c54021a69dc06f6a19fb: I don't think that public/private is the big issue",
        "f47636673b14c54021a69dc06f6a19fb (11:12): a924fb58d2c25874322f4e5126f608b9: this sentence will always be right",
        "a924fb58d2c25874322f4e5126f608b9 (11:12): Then why do you ignore it?",
        "b25b6b77a0087ff8385941e5545d32ea (11:12): I don't think that all public things need to be accessible",
        "f47636673b14c54021a69dc06f6a19fb (11:12): ?",
        "a924fb58d2c25874322f4e5126f608b9 (11:13): When I put up pictures on flickr, it's not the public nature that matters, it's that I'm not doing it to make money",
        "f47636673b14c54021a69dc06f6a19fb (11:13): ?",
        "f47636673b14c54021a69dc06f6a19fb (11:14): a924fb58d2c25874322f4e5126f608b9: if I go to an extreme behavior in terms of society choice I have the right to exclude someone for his skin color because it's not about money? ;) that would not fly very far.",
        "f47636673b14c54021a69dc06f6a19fb (11:15): but it's an interesting dimension in the discussion.",
        "a924fb58d2c25874322f4e5126f608b9 (11:15): It flies just fine",
        "b25b6b77a0087ff8385941e5545d32ea (11:15): f47636673b14c54021a69dc06f6a19fb: If I make a public statue it doesn't also need an audio caption",
        "a924fb58d2c25874322f4e5126f608b9 (11:15): There's no law against only having asian friends",
        "f47636673b14c54021a69dc06f6a19fb (11:15): so let's say, not money, but services.",
        "f47636673b14c54021a69dc06f6a19fb (11:16): has difficulty to follow a924fb58d2c25874322f4e5126f608b9",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:16): has difficulty following f47636673b14c54021a69dc06f6a19fb :p",
        "f47636673b14c54021a69dc06f6a19fb (11:16): what you choose to do, and what you choose to express in public are two very different things",
        "f47636673b14c54021a69dc06f6a19fb (11:17): hehe edb259c0e0038f38bb200bc20c8cbf7e. This is normal ;)",
        "a924fb58d2c25874322f4e5126f608b9 (11:17): It's also fully legal to say &quot;I only want asian friends&quot;, so I don't quite follow",
        "b25b6b77a0087ff8385941e5545d32ea (11:17): thought that David's exampl of the telephone was rather compelling",
        "b25b6b77a0087ff8385941e5545d32ea (11:18): a924fb58d2c25874322f4e5126f608b9: Except in the UK, maybe",
        "f47636673b14c54021a69dc06f6a19fb (11:18): a924fb58d2c25874322f4e5126f608b9: it depends on which country. It's why indeed accessibility is political. Maybe the difference I have with dbaron is that I don't think political is bad",
        "a924fb58d2c25874322f4e5126f608b9 (11:19): It's bad because it distracts you from the actual issues",
        "f47636673b14c54021a69dc06f6a19fb (11:21): b25b6b77a0087ff8385941e5545d32ea: a better example than audio caption, would have been, when I discussed in a cafe with a group of friends, I do not need to do sign languages of what I say because I'm in the cafe.",
        "f47636673b14c54021a69dc06f6a19fb (11:23): Maybe there is a question of target and it is how the Web challenges the society for its notions of public/private. The target is not clearly identified AND the access rights do not make it easy to identify a target for users. ACLs not being widely deployed.",
        "b25b6b77a0087ff8385941e5545d32ea (11:23): f47636673b14c54021a69dc06f6a19fb: I still think you are hung up on the public/private thing. But I don't think that is the issue",
        "f47636673b14c54021a69dc06f6a19fb (11:24): b25b6b77a0087ff8385941e5545d32ea: that might be. :) but I do think the public &lt;-shades-&gt; private is part of the issue among others.",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:25): I have a yet different Flickr use case: I make some of my photos public under CC-by in order to give away surplus usefulness that is easy to give away. Having to write text alternatives for all those photos or alternatively hide the photos would block the giving",
        "b25b6b77a0087ff8385941e5545d32ea (11:25): f47636673b14c54021a69dc06f6a19fb: Consider buskers, or gigs (stand-up, music, etc.). They are public but not generally accessible",
        "b25b6b77a0087ff8385941e5545d32ea (11:26): (to the deaf for example)",
        "f47636673b14c54021a69dc06f6a19fb (11:26): (I would love people stop obsess on flickr) it is becoming a red herring",
        "b25b6b77a0087ff8385941e5545d32ea (11:26): Or those people that paint on the street",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:26): my use case is not tied to the service used",
        "f47636673b14c54021a69dc06f6a19fb (11:27): b8810fee2f4a71f849f3f7409546d1d9: yes making things accessible is a constraint. That's understood.",
        "a924fb58d2c25874322f4e5126f608b9 (11:28): So it comes back to the telephone, would you restrict 99% people from accessing something just because 1% can't?",
        "f47636673b14c54021a69dc06f6a19fb (11:28): here to communicate with you I'm constrained to speak English. If I speak French that would not go very far.",
        "f47636673b14c54021a69dc06f6a19fb (11:28): [06:16]  &lt a924fb58d2c25874322f4e5126f608b9&gt; It's bad because it distracts you from the actual issues",
        "b25b6b77a0087ff8385941e5545d32ea (11:30): f47636673b14c54021a69dc06f6a19fb: Feel free to speak french if you like. It will of course limit your audience to those who understand you. That is (in this case) your choice",
        "b25b6b77a0087ff8385941e5545d32ea (11:30): The accessibility issue concerns when people should be bound to a particular choice to serve the needs of a minority",
        "a924fb58d2c25874322f4e5126f608b9 (11:31): Commerical nature is a good test because it means the publisher stands to lose something. In b8810fee2f4a71f849f3f7409546d1d9's case, the publisher doesn't lose anything from restricting, just everyone else.",
        "b25b6b77a0087ff8385941e5545d32ea (11:31): e.g. if I had to translate everything I say into French so that a French speaker with little English could follow",
        "b25b6b77a0087ff8385941e5545d32ea (11:32): Of course that woud prevent me saying anything at all",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:33): I'll invent my own language where every word or sentence is &quot;a&quot; and then I can use that as alternative text and nobody can complain :p",
        "f47636673b14c54021a69dc06f6a19fb (11:34): edb259c0e0038f38bb200bc20c8cbf7e: raymond queneau",
        "f47636673b14c54021a69dc06f6a19fb (11:34): exercise de style",
        "a924fb58d2c25874322f4e5126f608b9 (11:34): edb259c0e0038f38bb200bc20c8cbf7e: How do you mark up the language of the alt attribute?",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:34): I'm already quite lazy with respect to actually get photos online in the first place. I used to entertain myself with tagging for a while but now I usually don't bother anymore.",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:35): a924fb58d2c25874322f4e5126f608b9, language annotation is usually wrong so I won't bother",
        "f47636673b14c54021a69dc06f6a19fb (11:35): a924fb58d2c25874322f4e5126f608b9: alt=&quot;this image is not for you if you are asian or if you don't want to make money&quot;. if I understood you.",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:35): Having to actually write text for each of those photos would completely stop me from publishing photos which would be bad for friends and family",
        "a924fb58d2c25874322f4e5126f608b9 (11:35): f47636673b14c54021a69dc06f6a19fb: No, just no @alt",
        "a924fb58d2c25874322f4e5126f608b9 (11:36): I also develop a game that discriminates brutally against people who don't support OpenGL 2",
        "f47636673b14c54021a69dc06f6a19fb (11:36): edb259c0e0038f38bb200bc20c8cbf7e: if there are for friends and family why do you put them in public?",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:36): f47636673b14c54021a69dc06f6a19fb, because that's the easiest thing to do",
        "f47636673b14c54021a69dc06f6a19fb (11:37): ting!",
        "a924fb58d2c25874322f4e5126f608b9 (11:37): And it gives added value to other users",
        "b25b6b77a0087ff8385941e5545d32ea (11:37): f47636673b14c54021a69dc06f6a19fb: That is a crazy way to view the problem",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:37): f47636673b14c54021a69dc06f6a19fb, I already told you I'm lazy",
        "f47636673b14c54021a69dc06f6a19fb (11:37): cf what I was saying above",
        "f47636673b14c54021a69dc06f6a19fb (11:37): edb259c0e0038f38bb200bc20c8cbf7e: ;) I do not think that is true but that's a way to put it",
        "b25b6b77a0087ff8385941e5545d32ea (11:37): f47636673b14c54021a69dc06f6a19fb: Some of the &quot;freinds&quot; that my photos are for are friends that I have made by putting my photos in public",
        "f47636673b14c54021a69dc06f6a19fb (11:38): ACL management on the Web",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:38): &quot;Backups are for wimps. Real men upload their data to an FTP site and have everyone else mirror it.&quot; -Linus Torvalds",
        "a924fb58d2c25874322f4e5126f608b9 (11:38): I can't see why he shouldn't make them public",
        "f47636673b14c54021a69dc06f6a19fb (11:38): public-private",
        "a924fb58d2c25874322f4e5126f608b9 (11:38): It seems like &quot;Well, if I can't have alt, you can't have the image either.&quot;",
        "b25b6b77a0087ff8385941e5545d32ea (11:38): So there is significant value to me in making this stuff public in the hope that people like it",
        "f47636673b14c54021a69dc06f6a19fb (11:38): ACL is dumb and under defined on the Web with regards to social behavior and then has strong implications on other issues on the society such as accessibility",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:39): There are other reasons too fwiw. E.g. pointing other people to certain photos without having to go through trouble",
        "a924fb58d2c25874322f4e5126f608b9 (11:39): f47636673b14c54021a69dc06f6a19fb: Better question, what is the problem with anne making his photos public?",
        "f47636673b14c54021a69dc06f6a19fb (11:39): I do have photos I share with friends only, but I do not make them public",
        "b25b6b77a0087ff8385941e5545d32ea (11:39): I can also get signifiant value from feedback on the photos I place in public",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:39): I don't see how public/non-public matters. My blind friends still can't deal with the photos.",
        "f47636673b14c54021a69dc06f6a19fb (11:39): the photos I put in public, I give them the necessary information.",
        "a924fb58d2c25874322f4e5126f608b9 (11:40): That's your choice",
        "b25b6b77a0087ff8385941e5545d32ea (11:40): edb259c0e0038f38bb200bc20c8cbf7e: AFAICT f47636673b14c54021a69dc06f6a19fb has the crazy notion that you should entirely deny your blind friends access to those photos",
        "b25b6b77a0087ff8385941e5545d32ea (11:41): I fail to see how that is at all preferable to the situation where you just put them in public and they access them or not",
        "f47636673b14c54021a69dc06f6a19fb (11:41): b25b6b77a0087ff8385941e5545d32ea: think",
        "b25b6b77a0087ff8385941e5545d32ea (11:41): f47636673b14c54021a69dc06f6a19fb: Anything in particular",
        "b25b6b77a0087ff8385941e5545d32ea (11:41): ?",
        "f47636673b14c54021a69dc06f6a19fb (11:41): the notion of self in society",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:41): f47636673b14c54021a69dc06f6a19fb: the photo of &quot;La Grange&quot; at http://www.la-grange.net f47636673b14c54021a69dc06f6a19fb/ says nothing about what information the photo of the hut conveys...",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (11:41): Title: Karl Dubost (at www.la-grange.net)",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:42): b25b6b77a0087ff8385941e5545d32ea, really?",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:42): how can other people visiting my blind friends describe the photos to them then?",
        "f47636673b14c54021a69dc06f6a19fb (11:42): b8810fee2f4a71f849f3f7409546d1d9: quite the opposite",
        "a924fb58d2c25874322f4e5126f608b9 (11:42): edb259c0e0038f38bb200bc20c8cbf7e: You add those people as friends instead of the blind people",
        "f47636673b14c54021a69dc06f6a19fb (11:42): La Grange = The Barn",
        "3f2e2531201cfbf853f16f668132eaf2 (11:43): a924fb58d2c25874322f4e5126f608b9: &quot;would you restrict 99% people from accessing something just because 1% can't?&quot; - it seems like more an issue of &quot;would you require authors to give 10% less value to 99% of people, by focusing on giving 100% more value to 1% of people?&quot; because it's about the costs of having to implement accessible solutions to universal problems",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:43): but then they'd have to put their credentials on my friend's computer",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:43): I don't think that's acceptable :)",
        "b25b6b77a0087ff8385941e5545d32ea (11:43): f47636673b14c54021a69dc06f6a19fb: Is my characterisation or your position fair (apart from &quot;crazy&quot; of course)?",
        "a924fb58d2c25874322f4e5126f608b9 (11:43): 3f2e2531201cfbf853f16f668132eaf2: That's not the actual tradeoff. It's giving 10% to 99% of people, or 0% to 100% of people",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:43): f47636673b14c54021a69dc06f6a19fb: I think the alt text doesn't convey any value-added information to the paragraph above it",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:44): f47636673b14c54021a69dc06f6a19fb: but the photo is supposedly there to augment the information in the paragraph",
        "f47636673b14c54021a69dc06f6a19fb (11:44): b8810fee2f4a71f849f3f7409546d1d9: no",
        "f47636673b14c54021a69dc06f6a19fb (11:44): that is your repeated assertion that a photo should follow the logical flow of a text.",
        "f47636673b14c54021a69dc06f6a19fb (11:44): I do not agree.",
        "f47636673b14c54021a69dc06f6a19fb (11:44): a barn is a barn",
        "f47636673b14c54021a69dc06f6a19fb (11:45): this house is a barn. The photo is a representation of a barn",
        "3f2e2531201cfbf853f16f668132eaf2 (11:45): a924fb58d2c25874322f4e5126f608b9: That's not the tradeoff either - in something like Bespin, the problem of having a web-based code editor could be solved in a way that gives non-zero value to everyone, and it just might be harder to implement or have worse performance than an inaccessible solution",
        "a924fb58d2c25874322f4e5126f608b9 (11:46): 3f2e2531201cfbf853f16f668132eaf2: Now you're changing the subject. In the original case we have a service provided to some private group. You can make it public for zero or trivial cost.",
        "b25b6b77a0087ff8385941e5545d32ea (11:46): wonders if he has annoyed f47636673b14c54021a69dc06f6a19fb too much",
        "a924fb58d2c25874322f4e5126f608b9 (11:46): Making it 100% avaialble would have a non-trivial cost, so it's not an equivalent alternative.",
        "3f2e2531201cfbf853f16f668132eaf2 (11:46): a924fb58d2c25874322f4e5126f608b9: That's probably because I didn't care enough to follow the discussion in detail and work out what the subject actually was :-p",
        "f47636673b14c54021a69dc06f6a19fb (11:46): I do not agree with the assertion that Bespin should have been stopped. :) thatis as bad as other extreme of things which are said sometimes here",
        "f47636673b14c54021a69dc06f6a19fb (11:48): has difficulty to read everything. There is a swarm of whatwg people which go to drawn discussion :) So I process not every sentences",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:49): that's what we do",
        "b25b6b77a0087ff8385941e5545d32ea (11:49): f47636673b14c54021a69dc06f6a19fb: On an not quite related topic, I rather enjoy your photography so from my point of view it is sad that you chose to close your flickr account",
        "f47636673b14c54021a69dc06f6a19fb (11:50): has to move to &quot;real word&quot; (¬Æwhatwg) work ;)",
        "b25b6b77a0087ff8385941e5545d32ea (11:50): I guess I could subscribe to your blog but I wouldn't really understand any of the text so it seems odd",
        "f47636673b14c54021a69dc06f6a19fb (11:51): b25b6b77a0087ff8385941e5545d32ea: I did close it but not because of accesibility reason ;)",
        "f47636673b14c54021a69dc06f6a19fb (11:51): b25b6b77a0087ff8385941e5545d32ea: thanks for the  appreciation.",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:51): b25b6b77a0087ff8385941e5545d32ea, Google Reader has automatic translation",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:52): is waiting for the day where computers are good enough to read images",
        "b25b6b77a0087ff8385941e5545d32ea (11:52): once came across a photo of f47636673b14c54021a69dc06f6a19fb taken by a random person on flickr. That was quite surprising",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:52): according to The Economist we're getting closer",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:52): of course, that's not quite the tech magazine",
        "3f2e2531201cfbf853f16f668132eaf2 (11:54): &quot;getting closer&quot; is a bit meaningless, since we couldn't ever get further away from anything - it's only interesting if we're getting closer at a rate that means we'll actually get there soon :-)",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:54): we can get further away, look at the dark ages :)",
        "b25b6b77a0087ff8385941e5545d32ea (11:55): I fancy a spot of book buring",
        "b25b6b77a0087ff8385941e5545d32ea (11:55): *burning",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:55): the equivalent would be tearing down lots of servers",
        "3f2e2531201cfbf853f16f668132eaf2 (11:57): Computers are almost as good as a newborn baby at recognising faces, so maybe it's not totally hopeless",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:57): they're better than humans apparently at recognized facial expressions",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:58): again, according to The Economist",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:58): recognizing, even",
        "3f2e2531201cfbf853f16f668132eaf2 (11:58): They get horribly confused if you turn your head ten degrees to the side, though"
    ],
    "person_ids": [
        "f47636673b14c54021a69dc06f6a19fb",
        "b25b6b77a0087ff8385941e5545d32ea",
        "a924fb58d2c25874322f4e5126f608b9",
        "edb259c0e0038f38bb200bc20c8cbf7e",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "0a39f78bcb297ab0ebe8a29c28bfed89",
        "3f2e2531201cfbf853f16f668132eaf2"
    ]
}