{
    "id": "9cf1d86825076b93657e58f2313b3ac5",
    "messages": [
        "4d647473081c3ad729446a01a377813b (10:31): 69b0d3dfe919a6b860a9fac82de52a7e, &quot;half a driver's&quot; -&gt; &quot;have a driver's&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:37): oops thanks",
        "f139aba52f9fa1394b4034a7954b2220 (10:42): 69b0d3dfe919a6b860a9fac82de52a7e, what's in an earthquake kit, and why would anyone steal it? (re http://twitter.com 69b0d3dfe919a6b860a9fac82de52a7e/status/1371054800 )",
        "f139aba52f9fa1394b4034a7954b2220 (10:44): 69b0d3dfe919a6b860a9fac82de52a7e, also, how did you manage to get tircd up and running? I tried that about a week or two ago, but without success. My IRC client just wouldn't connect to localhost",
        "ab7faae5d7b250ea8606486575f8f79c (10:47): It's an earthquake *prevention* kit, according to http://ln.hixie.ch/",
        "ab7faae5d7b250ea8606486575f8f79c (10:47): I really can't imagine how that would work",
        "ab7faae5d7b250ea8606486575f8f79c (10:48): Maybe it contains an awful lot of duct tape, so you can stick the continental plates together and stop them wobbling against each other?",
        "b25b6b77a0087ff8385941e5545d32ea (10:49): wonders how an adoption agecy algorithm helps when your car has been broken into",
        "4d647473081c3ad729446a01a377813b (10:50): ab7faae5d7b250ea8606486575f8f79c, how would any kind of tape help when they're pushing against each other?",
        "f139aba52f9fa1394b4034a7954b2220 (10:53): 4d647473081c3ad729446a01a377813b, obviously the tape would only help in the cases where they're pulling away from each other",
        "ab7faae5d7b250ea8606486575f8f79c (10:53): 4d647473081c3ad729446a01a377813b: There's no problem with the pushing because that's a nice stable non-quakey state - the problem is when they start sliding",
        "f139aba52f9fa1394b4034a7954b2220 (10:54): ab7faae5d7b250ea8606486575f8f79c, no, when they're pushing together hard enough, they start to push upwards and make mountains",
        "b25b6b77a0087ff8385941e5545d32ea (11:15): 69b0d3dfe919a6b860a9fac82de52a7e: More to the point, surely if everyone involved fainted whilst climbing you could have a more serious accident than you suggest? After all the belayer is the only thing preventing the rope from running free so if the climber were to fall whilst the belayer was not holding the dead rope, you could fall the height climbed.",
        "ab7faae5d7b250ea8606486575f8f79c (11:17): What if you were climbing and then a dragon suddenly flew in and ate you?",
        "ab7faae5d7b250ea8606486575f8f79c (11:17): (That seems similarly likely to everyone fainting simultaneously)",
        "b25b6b77a0087ff8385941e5545d32ea (11:18): They might be characters in a Jane Austen novel who were libable to all swoon if they saw a particuarly rich, unattached,  gentleman",
        "ab7faae5d7b250ea8606486575f8f79c (11:19): Do characters in Jane Austen novels often go rock climbing?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (11:19): Sadly not",
        "ab7faae5d7b250ea8606486575f8f79c (11:20): That's a shame",
        "b25b6b77a0087ff8385941e5545d32ea (11:21): (it seems more plausible that your belayer would faint and that, in a panic, you would loose your grip on the rock)",
        "ab7faae5d7b250ea8606486575f8f79c (11:44): imagines the discussion of broken IRIs in Atom would be more useful if people had test results of how feed readers parse URL-ish strings, or data about how many feeds have invalid IRIs",
        "4d647473081c3ad729446a01a377813b (11:45): I'm not sure",
        "b25b6b77a0087ff8385941e5545d32ea (11:46): ab7faae5d7b250ea8606486575f8f79c: There is a well defined data-gathering mechanism for HTML 5 which is to say, people ay things that should be qualified with data and then you provide the data",
        "4d647473081c3ad729446a01a377813b (11:46): My main point is that I don't want two URL functions in a browser doing essentially the same thing and it's pretty clear that we need one for HTML that does it like HTML5",
        "4d647473081c3ad729446a01a377813b (11:47): I also wouldn't really want two URL functions in a feed reader and since feed readers ought to handle HTML...",
        "ab7faae5d7b250ea8606486575f8f79c (11:48): Web browsers already have a zillion functions (many for doing similar things in slightly different ways), so two functions for parsing URLs wouldn't hurt much",
        "4d647473081c3ad729446a01a377813b (11:49): Every one of those that can be avoided hurts in developer and QA time. Security analysis cost, etc.",
        "4d647473081c3ad729446a01a377813b (11:50): I'ts one of the reasons we're still trying to eliminate quirks if feasible. (Either by standardizing on them or removing them.)",
        "ab7faae5d7b250ea8606486575f8f79c (11:50): It hurts but not a huge amount, and it has to be balanced against the cost of changing every other spec and software product that uses URIs in non-HTML contexts",
        "b25b6b77a0087ff8385941e5545d32ea (11:50): grumbles about standards bodies that publish their standards in non-standard formats",
        "f139aba52f9fa1394b4034a7954b2220 (12:11): 69b0d3dfe919a6b860a9fac82de52a7e, it the status section of the web storage spec, it says to send mail to public-webapps-comments and links to the non-existent archives. It should be public-webapps",
        "4d647473081c3ad729446a01a377813b (12:12): ab7faae5d7b250ea8606486575f8f79c, and that in turn has to be balanced against bugs in those software products and specs and how much of those bugs would be fixed by changing libraries and URL specs",
        "b25b6b77a0087ff8385941e5545d32ea (12:12): Is Julian's argument that allowing whitespace in URIs is bad because authors that choose to use it may experience poor syntax highlighting? Because that seems like it could be easily fixed by choosing not to use it",
        "f139aba52f9fa1394b4034a7954b2220 (12:12): wonders who Hish is and why he has to have a name messes with my IRC's autocomplete for &quot;Hi&lt;tab&gt;&quot;",
        "4d647473081c3ad729446a01a377813b (12:13): Highlighting and autolinking fails all over the place anyway due to most code not properly taking care of punctation (and even then it could be wrong if a URL actually did end with say a dot or comma)",
        "ab7faae5d7b250ea8606486575f8f79c (12:15): notes that you already have to handle spaces in URIs in order to write an HTTP client that can retrieve web pages, regardless of anything to do with HTML",
        "4d647473081c3ad729446a01a377813b (12:15): ab7faae5d7b250ea8606486575f8f79c, why is that?",
        "ab7faae5d7b250ea8606486575f8f79c (12:19): 4d647473081c3ad729446a01a377813b: Because people put spaces in Location headers",
        "ab7faae5d7b250ea8606486575f8f79c (12:19): e.g. http://www.usafa.af.mil/ returns 302 with &quot;Location: index.cfm?catname=AFA Homepage&quot;",
        "4d647473081c3ad729446a01a377813b (12:20): cheers",
        "ab7faae5d7b250ea8606486575f8f79c (12:20): (That broke that page in my dmoz downloader since HttpClient throws an exception on invalid URIs)",
        "ab7faae5d7b250ea8606486575f8f79c (12:23): http://www.flightsimulator.nl/ gives &quot;Location: RunScript.asp?Article_type=General%20News&amp;p=ASP\\Pg0.asp&quot; where the \\ is apparently illegal",
        "ab7faae5d7b250ea8606486575f8f79c (12:24): and there's other with &quot;|&quot; and &quot;[&quot; and &quot;]&quot;",
        "ab7faae5d7b250ea8606486575f8f79c (12:24): *others",
        "ab7faae5d7b250ea8606486575f8f79c (12:25): Oops, not true, the &quot;[&quot; and &quot;]&quot; weren't in redirects, they were just in dmoz's list",
        "ab7faae5d7b250ea8606486575f8f79c (12:27): (which I suppose is a separate issue - anything parsing dmoz's RDF dump of site listings needs to deal with invalid URIs too)"
    ],
    "person_ids": [
        "4d647473081c3ad729446a01a377813b",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "f139aba52f9fa1394b4034a7954b2220",
        "ab7faae5d7b250ea8606486575f8f79c",
        "b25b6b77a0087ff8385941e5545d32ea",
        "a11aabeeceeae6b8cb5d12ea06b56554"
    ]
}