{
    "id": "9e8f608583311176ac4bd43bf9dc9c14",
    "messages": [
        "673d7d497cb7c30e46ce951bc321aafd (19:07): i have been digging through the iptables docs at netfilter.org but I still didnt manage to find a solution for following question",
        "673d7d497cb7c30e46ce951bc321aafd (19:07): if I want to filter out reserved addresses and my box has two network cards (eth0 for outside and eth1 to inside)... will I have to set drop rules on both INPUT and FORWARD chains ?",
        "673d7d497cb7c30e46ce951bc321aafd (19:08): couldnt I just use for example some PREROUTING chain and set the drops in there ?",
        "43d2e4c8ebdceba76435c1f675f8d628 (19:08): Apachez: you could use PREROUTING",
        "673d7d497cb7c30e46ce951bc321aafd (19:08): any disadvantage with that ?",
        "673d7d497cb7c30e46ce951bc321aafd (19:08): I also have -i so Im checking that the package is originated from the outside device",
        "43d2e4c8ebdceba76435c1f675f8d628 (19:09): not that I know of.  the netfilter guys say it &quot;shouldn't&quot; be done, but if you ask em why, it's because then it'll filter in both INPUT and FORWARD, but of course that's exactly what you want",
        "673d7d497cb7c30e46ce951bc321aafd (19:09): will I have to use  -t nat -A PREROUTING    or can write just -A PREROUTING ?",
        "43d2e4c8ebdceba76435c1f675f8d628 (19:10): good question.  I dunno if the filter table (the default table) has a PREROUTING chain.  try and see.",
        "673d7d497cb7c30e46ce951bc321aafd (19:10): hmpf :P",
        "673d7d497cb7c30e46ce951bc321aafd (19:10): another note",
        "673d7d497cb7c30e46ce951bc321aafd (19:11): since I altered my iptables rules to be strict and also check sourceport = 1024:65535 I have noticed some logs where some addresses try to ask my dns but they originate from sourceport 53",
        "43d2e4c8ebdceba76435c1f675f8d628 (19:11): I never-ever-ever match on source port.",
        "673d7d497cb7c30e46ce951bc321aafd (19:11): shouldnt a dns lookup originate from sourceport 1024:65535 ?",
        "43d2e4c8ebdceba76435c1f675f8d628 (19:11): not necessarily",
        "43d2e4c8ebdceba76435c1f675f8d628 (19:12): a tcp request can pretty much originate from any port it wants",
        "673d7d497cb7c30e46ce951bc321aafd (19:12): not according to rfc's :P",
        "43d2e4c8ebdceba76435c1f675f8d628 (19:12): well what they SHOULD do and what they can get away with doing, which is more like what they'll do in real life, are different",
        "673d7d497cb7c30e46ce951bc321aafd (19:13): thats why I use a firewall :P",
        "673d7d497cb7c30e46ce951bc321aafd (19:13): if machines and people just did what they SHOULD do they would be no need for firewalls ;)",
        "b37266e12bc7e627ab7b484bf96b7a36 (19:14): <a href=\"http://iownmymusic.org/\">http://iownmymusic.org/</a> <a href=\"http://iownmydvds.org/\">http://iownmydvds.org/</a> .&quot;)",
        "673d7d497cb7c30e46ce951bc321aafd (19:14): ohh finally my google skills are working",
        "43d2e4c8ebdceba76435c1f675f8d628 (19:14): well there are actually security benefits for you if you can randomize the source ports of your tcp connections, and things will still work fine unless there are source-port-filtering firewalls on the other end",
        "673d7d497cb7c30e46ce951bc321aafd (19:14): seems like the case when a new connection to destport 53 originates from sourceport 53 it is most likely a hack attempt to try to bypass stateless firewalls",
        "43d2e4c8ebdceba76435c1f675f8d628 (19:15): also iptables-tutorial.frozentux.net has WAY better docs (IMHO) than netfilter.org",
        "673d7d497cb7c30e46ce951bc321aafd (19:15): yup will try to read them through",
        "43d2e4c8ebdceba76435c1f675f8d628 (19:15): state has nothing to do with it",
        "43d2e4c8ebdceba76435c1f675f8d628 (19:15): I have a stateful firewall that doesn't care at all about source ports",
        "43d2e4c8ebdceba76435c1f675f8d628 (19:16): I'm concerned about where the packet wants to go, not so much where it came from",
        "673d7d497cb7c30e46ce951bc321aafd (19:19): well its more of a sanity check",
        "673d7d497cb7c30e46ce951bc321aafd (19:19): like pf's &quot;scrub in all&quot;",
        "673d7d497cb7c30e46ce951bc321aafd (19:20): which I saw existed like a module in iptables until kernel 2.6 where it was being removed by some odd reasons",
        "43d2e4c8ebdceba76435c1f675f8d628 (19:21): well, that's why you're seeing possibly-legitimate dns traffic bouncing off your firewall",
        "673d7d497cb7c30e46ce951bc321aafd (19:21): it was from south korea so I doubt it was even near legitimate traffic :P",
        "43d2e4c8ebdceba76435c1f675f8d628 (19:23): personally, I'd rather let a few illegitimate packets through than drop anything that ought to get through.  that preference probably comes from my belief that if you follow security best practices behind your firewall, a firewall doesn't really do much for you anyway.",
        "673d7d497cb7c30e46ce951bc321aafd (19:28): well thats not the case in here where I need to enforce strict policies",
        "673d7d497cb7c30e46ce951bc321aafd (19:42): when dealing with custom chains... is it necessary to use -j RETURN in the end of the chain ?",
        "673d7d497cb7c30e46ce951bc321aafd (19:43): or is that part added automagically by iptables ?",
        "93dede99112199d049a1bc421e564cd4 (19:50): Apachez: correct, custom chains will return to the caller if a rule is not matched",
        "673d7d497cb7c30e46ce951bc321aafd (19:52): oki then I wont need it in the end of each custom rule :)",
        "43d2e4c8ebdceba76435c1f675f8d628 (19:54): no, just at the end of the chain - and maybe not even then.  depends on what you're doing in that chain.",
        "673d7d497cb7c30e46ce951bc321aafd (19:57): ehm",
        "673d7d497cb7c30e46ce951bc321aafd (20:02): here is my example <a href=\"http://www.sqlpaste.com/?entry_id=1417\">http://www.sqlpaste.com/?entry_id=1417</a>",
        "673d7d497cb7c30e46ce951bc321aafd (20:02): Will I need an explicit &quot;iptables -A BLACKLIST -j RETURN&quot; in the end of the BLACKLIST chain ?",
        "673d7d497cb7c30e46ce951bc321aafd (20:02): or is it just best practise to always have one in the end ?",
        "673d7d497cb7c30e46ce951bc321aafd (20:17): is it possible to use --dport or --sport alone without  -p tcp   or -p udp ?",
        "43d2e4c8ebdceba76435c1f675f8d628 (20:37): Apachez: no.  if you don't specify a protocol, it assumes 'all', and not all protocols have ports."
    ],
    "person_ids": [
        "673d7d497cb7c30e46ce951bc321aafd",
        "43d2e4c8ebdceba76435c1f675f8d628",
        "b37266e12bc7e627ab7b484bf96b7a36",
        "93dede99112199d049a1bc421e564cd4"
    ]
}