{
    "id": "9fb9a6242b7418c23c8a0e2a395f5719",
    "messages": [
        "edb259c0e0038f38bb200bc20c8cbf7e (10:45): are we getting a new EventListener thingie for onX attributes?",
        "edb259c0e0038f38bb200bc20c8cbf7e (10:46): that will affect XMLHttpRequest",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:46): to match reality",
        "edb259c0e0038f38bb200bc20c8cbf7e (10:46): k",
        "edb259c0e0038f38bb200bc20c8cbf7e (10:49): jezus christ, to pay for a NOK 280 (= EUR 30) transaction they charged me EUR 20",
        "edb259c0e0038f38bb200bc20c8cbf7e (10:51): Problem: Want to reuse format consumed by browsers. Solution: Change the format to be XML-like.",
        "edb259c0e0038f38bb200bc20c8cbf7e (10:51): it's not clear to me how some TAG members make that jump",
        "b8810fee2f4a71f849f3f7409546d1d9 (10:52): edb259c0e0038f38bb200bc20c8cbf7e: huh? where's that from?",
        "edb259c0e0038f38bb200bc20c8cbf7e (10:52): though admittedly, before HTML5 it is somewhat sensible as HTML was not predictable",
        "edb259c0e0038f38bb200bc20c8cbf7e (10:52): b8810fee2f4a71f849f3f7409546d1d9, it's not a literal quote",
        "b25b6b77a0087ff8385941e5545d32ea (10:52): edb259c0e0038f38bb200bc20c8cbf7e: You have to love scandinavia, right :)",
        "edb259c0e0038f38bb200bc20c8cbf7e (10:52): it seems to be gist of http://lists.w3.org/Archives/Public/www-tag/2009Jan/0069.html",
        "edb259c0e0038f38bb200bc20c8cbf7e (10:53): b25b6b77a0087ff8385941e5545d32ea, I suppose, I think my bank charged EUR 5 and the bank charged EUR 15 and I had to pay for both",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:54): edb259c0e0038f38bb200bc20c8cbf7e: before html5, it would have been as right (or wrong) as now, except that an additional solution would have existed: &quot;write html5&quot; :-P",
        "edb259c0e0038f38bb200bc20c8cbf7e (10:54): b25b6b77a0087ff8385941e5545d32ea, I suppose they are flat fees which become ridiculous when the amount of money is small",
        "edb259c0e0038f38bb200bc20c8cbf7e (10:54): 69b0d3dfe919a6b860a9fac82de52a7e, :)",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:55): edb259c0e0038f38bb200bc20c8cbf7e: a flat fee costs the same regardless of how much you're paying, so if it's ridiculous for one amount, it's ridiculous for another too.",
        "edb259c0e0038f38bb200bc20c8cbf7e (10:55): the gist of, even",
        "edb259c0e0038f38bb200bc20c8cbf7e (10:56): 69b0d3dfe919a6b860a9fac82de52a7e, I just mean that If I were to pay EUR 2000, EUR 20 is fine",
        "edb259c0e0038f38bb200bc20c8cbf7e (10:56): 69b0d3dfe919a6b860a9fac82de52a7e, or at least neglicable",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:56): it's 20 EUR",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:56): it the same as if you're paying EUR 10",
        "b25b6b77a0087ff8385941e5545d32ea (10:56): edb259c0e0038f38bb200bc20c8cbf7e: According to economists you are wrong",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:56): still 20 EUR",
        "b25b6b77a0087ff8385941e5545d32ea (10:58): You should apparently always think about the absolute amount of money. It's just that most people are more disappointed if they pay $6 for something that they could have got for $1 rtahn if the numbers are $1E6, $1E6+5",
        "edb259c0e0038f38bb200bc20c8cbf7e (10:58): b25b6b77a0087ff8385941e5545d32ea, I just realized that, as I had read that link 69b0d3dfe919a6b860a9fac82de52a7e posted some time ago, but I suppose I think in relative amounts of money :)",
        "ab7faae5d7b250ea8606486575f8f79c (10:59): edb259c0e0038f38bb200bc20c8cbf7e: Converting between HTML and XML in the toolchain doesn't seem like a good solution in that situation, since the conversion is lossy (in both directions) - e.g. you can't write a web crawler that parses HTML then stores it in an XML database to do a load of querying on the data, because the translation will destroy some of the data",
        "b25b6b77a0087ff8385941e5545d32ea (10:59): edb259c0e0038f38bb200bc20c8cbf7e: That's a problem called &quot;being human&quot; which economists have difficulty with",
        "b25b6b77a0087ff8385941e5545d32ea (10:59): ab7faae5d7b250ea8606486575f8f79c: The conclusion seems to be that storing things in an XML datatbase is not a good idea",
        "b25b6b77a0087ff8385941e5545d32ea (11:00): (at least things that may not be XML)",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:00): ab7faae5d7b250ea8606486575f8f79c, I never said that to convert anything, you can use XML on the infoset level...",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:01): s/that//",
        "ab7faae5d7b250ea8606486575f8f79c (11:02): edb259c0e0038f38bb200bc20c8cbf7e: I would imagine any XML toolchain is very likely to serialise to XML at some point, so you've got to restrict yourself to well-formed documents",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:03): &lt;!doctype html&gt;&lt;title&gt;test&lt;/title&gt;&lt;p&gt;test can still be used within an XML toolchain",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:03): can't we just assume that the html5 documents will be conforming? non-conforming html documents surely aren't something we want to deal with",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:03): ducks",
        "a11aabeeceeae6b8cb5d12ea06b56554 (11:03): 69b0d3dfe919a6b860a9fac82de52a7e: Can we remove section 8.2 then?",
        "ab7faae5d7b250ea8606486575f8f79c (11:03): b25b6b77a0087ff8385941e5545d32ea: Rather, the conclusion is that there is a benefit if the document format is compatible with the tools you use (without needing ugly munging in the middle), so it'd be good if all were HTML or all were XML or all were anything else",
        "ab7faae5d7b250ea8606486575f8f79c (11:04): edb259c0e0038f38bb200bc20c8cbf7e: That's why I said &quot;e.g. you can't write a web crawler ...&quot;, because there are cases where you have no control over the input HTML but you want to make use of useful tools that already exist (and that today are mostly designed for XML)",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:05): the web crawler based on an HTML parser would surely be far more successful than one based on an XML parser",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:05): s/the/a/",
        "ab7faae5d7b250ea8606486575f8f79c (11:06): edb259c0e0038f38bb200bc20c8cbf7e: That's why I said &quot;e.g. you can't write a web crawler that parses HTML then stores it in an XML database to do a load of querying on the data&quot;",
        "b25b6b77a0087ff8385941e5545d32ea (11:07): ab7faae5d7b250ea8606486575f8f79c: OK, let's be clearer. &quot;Storing web pages from the public internet in an XM database is not a good idea&quot;.",
        "b25b6b77a0087ff8385941e5545d32ea (11:07): *XML",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:07): i wonder if there's a correlation between how closely search engines' parsers conform to html5 and how much market share the search engine has",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:07): and doesn't HTML5 define a way to handle those layer problems?",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:07): 69b0d3dfe919a6b860a9fac82de52a7e: but which way does the causation go? :-)",
        "ab7faae5d7b250ea8606486575f8f79c (11:08): edb259c0e0038f38bb200bc20c8cbf7e: because you've got to use an HTML parser, but then there are other useful tools you'd like to use, and you don't want to have to deal with weird artifacts introduced by the HTML-to-well-formed-XML translation process",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:08): b8810fee2f4a71f849f3f7409546d1d9: that's the next question :-)",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:08): obviously one based on an XML parser will be superior, because it's much faster",
        "b25b6b77a0087ff8385941e5545d32ea (11:08): Specifically I don't understand why &quot;the value of the layering is not primarily for the browsing-only",
        "b25b6b77a0087ff8385941e5545d32ea (11:08): scenario.  It's to give you the opportunity of using HTML documents with a",
        "b25b6b77a0087ff8385941e5545d32ea (11:08): &quot;",
        "b25b6b77a0087ff8385941e5545d32ea (11:08): lot of additional tools and in additional scenarios",
        "b25b6b77a0087ff8385941e5545d32ea (11:08): Because it doesn't actually do that.",
        "b25b6b77a0087ff8385941e5545d32ea (11:09): s/why/why he thinks/",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:10): ab7faae5d7b250ea8606486575f8f79c, why is http://www.whatwg.org/specs/web-apps/current-work/multipage/tree-construction.html#coercing-an-html-dom-into-an-infoset not a solution?",
        "ab7faae5d7b250ea8606486575f8f79c (11:10): b25b6b77a0087ff8385941e5545d32ea: As I read it, Noah was describing an advantage of XHTML and of its use of layering on XML, which is that such a language would give you that opportunity (in the hypothetical case that people used that language)",
        "ab7faae5d7b250ea8606486575f8f79c (11:11): b25b6b77a0087ff8385941e5545d32ea: and it does indeed seem to be an advantage of XHTML, even if it's overshadowed by the fact that nobody uses XHTML",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:11): xhtml has many advantages",
        "b25b6b77a0087ff8385941e5545d32ea (11:11): ab7faae5d7b250ea8606486575f8f79c: I guess that could be true. But as you say, since no one uses XHTML it's really quite irrelevant",
        "b25b6b77a0087ff8385941e5545d32ea (11:12): And therefore not worthwhile to discuss in a way that suggests it is a real world consideration",
        "ab7faae5d7b250ea8606486575f8f79c (11:12): edb259c0e0038f38bb200bc20c8cbf7e: If I write something that e.g. downloads a load of random pages and then tries to count the most common attributes, using some XML database that provides nice easy-to-use efficient querying features, I don't want to be told that there's lots of attributes named &quot;xlinkU0003Ahref&quot; because that's just an artifact of the translation process",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:13): so you translate back when you display",
        "ab7faae5d7b250ea8606486575f8f79c (11:13): edb259c0e0038f38bb200bc20c8cbf7e: Also it might irreversibly drop 'xmlns' attributes, so it's impossible to translate the results back accurately",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:15): yeah ok, so you cannot use an XML toolchain for all use cases",
        "ab7faae5d7b250ea8606486575f8f79c (11:15): The problems aren't insurmountable, they're just a bit of a pain and it'd be nicer if they weren't problems",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:15): but for the case Noah was talking about, switching to using XHTML as a storage format for Web pages, it doesn't seem worth the effort",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:15): b25b6b77a0087ff8385941e5545d32ea: the tag is not about real world considerations, it's about architecture. (And I don't mean that sarcastically -- the whole point of the TAG is to discuss how things should be designed, not to deal with the realities of how things got screwed up.)",
        "ab7faae5d7b250ea8606486575f8f79c (11:16): aways",
        "b25b6b77a0087ff8385941e5545d32ea (11:17): 69b0d3dfe919a6b860a9fac82de52a7e: &quot;How things should be designed&quot; does not seem to be a particularly useful thing to discusss when there are insurmountable problems that prevent them ever from actually being designed in that way (not to mention the fact that it tends to lead to overengineerining, poor usability considerations, etc.)",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:18): oh nice, twitter.com uses tables for layout",
        "69b0d3dfe919a6b860a9fac82de52a7e (11:19): i wasn't making value judgements about whether or not the work of the tag was useful, i was just explaining that your statement was a non-sequitur for the tag.",
        "ab7faae5d7b250ea8606486575f8f79c (11:21): edb259c0e0038f38bb200bc20c8cbf7e: I think I forgot whether I was trying to argue for any particular point, but I guess the point was that it seems better to say &quot;HTML not being XML is indeed a problem because it makes it hard to interoperate with XML tools, but it's an unfixable problem so we'll have to reduce its impact and live with it&quot; rather than saying &quot;that's not a problem at all, just stick an HTML parser on your toolchain&quot;",
        "ab7faae5d7b250ea8606486575f8f79c (11:22): but anyway I'm away :-)",
        "edb259c0e0038f38bb200bc20c8cbf7e (11:27): I think in practice those sentences are near identical (i.e. both are true), but you're away now..."
    ],
    "person_ids": [
        "edb259c0e0038f38bb200bc20c8cbf7e",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "b25b6b77a0087ff8385941e5545d32ea",
        "ab7faae5d7b250ea8606486575f8f79c",
        "a11aabeeceeae6b8cb5d12ea06b56554"
    ]
}