{
    "id": "a372c3f22ee1dade17513736bc36c800",
    "messages": [
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:41): hey",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:41): Wanna talk about anything? Get something off your chest?",
        "943b5300acc8de272fb7b5f854079c45 (10:41): not really. wanna talk about religion with me?",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:41): sure",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:42): what specifically?",
        "943b5300acc8de272fb7b5f854079c45 (10:42): what are your religious views?",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:42): i&apos;m atheist tbh",
        "943b5300acc8de272fb7b5f854079c45 (10:42): really?",
        "943b5300acc8de272fb7b5f854079c45 (10:42): im lutheran.",
        "943b5300acc8de272fb7b5f854079c45 (10:43): can you tell me why youre athiest?",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:43): just never had a calling or whatever. My parents are pretty religious, but they never forced it on me, let me make up my own mind",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:44): lutheran is based in aus right?",
        "943b5300acc8de272fb7b5f854079c45 (10:45): oh i see. do you mind if i talk to you about it? and based in what? what is aus?",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:45): australia i meant",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:45): and nah go for it",
        "943b5300acc8de272fb7b5f854079c45 (10:47): idk. it&apos;s a pretty common religion i think. im from the US. it&apos;s a denomination of christianity.",
        "943b5300acc8de272fb7b5f854079c45 (10:48): well. do you believe youve ever done anything wrong?",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:48): of course",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:48): do you mean do i feel like there is some kind of divine judgement i adhere to?",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:49): no, but i believe in certain principles",
        "943b5300acc8de272fb7b5f854079c45 (10:49): do you believe that there&apos;s anything you can do to make that better? and no that&apos;s not what i mean. haha. i just meant have you ever done anything wrong.",
        "943b5300acc8de272fb7b5f854079c45 (10:49): lol.",
        "943b5300acc8de272fb7b5f854079c45 (10:49): cus some people like to think theyre perfect. haha.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:50): ah i try my best, but no one is perfect. i could definately do better",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:51): i don&apos;t think you should strive for perfection, it&apos;s a false hope. just try your best, whatever you can do",
        "943b5300acc8de272fb7b5f854079c45 (10:51): how do you believe the earth started?",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:52): the big bang is the most current theory i guess, but i don&apos;t think science had discovered everything about it yet. It&apos;s still partly a mystery i guess",
        "943b5300acc8de272fb7b5f854079c45 (10:53): look around you. all of the amazing things that happen everyday. just the little things. you think that could happen by chance?",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:54): i honestly do, i&apos;m not trying to offend you or anything",
        "943b5300acc8de272fb7b5f854079c45 (10:54): lol youre not offending me. no worries.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:54): but imagine all the pain happening this very second, if that isn&apos;t chance what is it?",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:55): a divine creator wanted all that suffering as well?",
        "943b5300acc8de272fb7b5f854079c45 (10:56): it&apos;s not chance. i believe that there actually was a time when there was no pain or suffering. and there will be again because of the savior God sent for us. the only reason we have all this pain in our lives now is because of our sin, mistakes, and everything we do wrong.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:58): ah thats fair enough. I kinda kind it hard to argue with that, as it&apos;s in scripture, and your faith bind you to it. Kinda arrogant of me to tell you your believes are wrong. I just don&apos;t share you connection to them",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:58): *kinda find",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (10:59): But what do you think about other religions?",
        "943b5300acc8de272fb7b5f854079c45 (10:59): i think that theyre wrong. i know that may sound disrespectful, or closed minded or whatever but that&apos;s what i really believe.",
        "943b5300acc8de272fb7b5f854079c45 (11:00): i believe in one religion and one God and that&apos;s it.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:00): thats what i never understand, it&apos;s that point that cause so much hatred and pain around the world...",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:01): if you believe in something, that great. why disregard others?",
        "943b5300acc8de272fb7b5f854079c45 (11:01): i dont hate other religions. or people who believe other things. im friends with non christians.",
        "943b5300acc8de272fb7b5f854079c45 (11:01): i just believe theyre wrong.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:01): do you believe they will go to heaven?",
        "943b5300acc8de272fb7b5f854079c45 (11:02): i dont hate you because youre athiest. i dont hate you at all. how could i? i dont know you. i just believe that youre wrong. and that&apos;s why i want to share my beliefs with you.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:02): they believe just as strong as you, and i&apos;m guessing their commitment to their faith is as strong as yours",
        "943b5300acc8de272fb7b5f854079c45 (11:03): and no, i dont believe that theyre going to heaven. i believe that anyone who believes in Jesus Christ as their Savior will go to heaven. and anyone who doesnt, wont.",
        "943b5300acc8de272fb7b5f854079c45 (11:03): and yes. they may be strong in their faith. but that faith will do them no good.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:05): thats my big problem, your God, is the divine creator of all things. Can&apos;t he look past those differences. These are good people, why deserve peace after death if that exists",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:05): why should the religion they choose make any difference?",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:05): *who deserve",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:07): btw i&apos;m Shaun, it&apos;s really nice to meet you",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:08): refreshing not to have some horny guy, or weirdo on here ^^",
        "943b5300acc8de272fb7b5f854079c45 (11:09): they dont deserve peace. i believe in Jesus Christ as my savior. but i dont deserve peace either. we all deserve eternal punishment because of our sins. but God has been merciful. he sent his son to die for us so that we could go to heaven when we die. God wont look past that because he will not accept sin. he expects absolute perfection. and because we couldnt live up to that, he sent Jesus. and now in his eyes, we are perfect. but you can only go to heaven if you believe.",
        "943b5300acc8de272fb7b5f854079c45 (11:10): and yeah i know what you mean. haha. my name&apos;s Taleya. it&apos;s nice to meet you too(:",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:12): ok, take me for example. i mentor troubled kids. i&apos;ve done a ton of charity work as well. I think i&apos;m a pretty nice person. But i&apos;ve also had pre-marital sex, taken some drugs and other &apos;sins&apos;. It&apos;s perfection part that bothers be, this judgement of humanity for the sins of adam and eve.",
        "943b5300acc8de272fb7b5f854079c45 (11:16): yes. you&apos;ve done good things in your life. but you&apos;ve also done bad things. that&apos;s how all of us are i think. but it doesnt matter. cus even if you&apos;ve only done one bad thing in your entire lifetime, it doesnt matter. one sin is enough to make you deserve eternal punishment. none of us can be perfect. most of us understand that. and so does God. that&apos;s why he gave us a way to be saved.",
        "943b5300acc8de272fb7b5f854079c45 (11:16): Jesus.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:16): btw Taleya is an awesome name, really uncommon in England. But i know i&apos;m saying it wrong in my head ^^",
        "943b5300acc8de272fb7b5f854079c45 (11:18): haha thanks, im from the US though. but it&apos;s not that common here either. haha. and it&apos;s pronounced taw-lee-yuh. haha.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:20): ok, but please tell me you believe in dinosaurs though... this might be complete ignorance, but someone told me that creationists believe that the fossils left behind were a &apos;test from god&apos;",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:20): but dinosaurs looked damn awesome, would be a shame if they were faked :P",
        "943b5300acc8de272fb7b5f854079c45 (11:21): lol. bull crap. i believe there were dinosaurs. i just believe that they were living at the same time as humans. not before like a lot of people think.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:22): ah ok",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:23): i think i&apos;ve burned all the debating energy i have on religion.. remember having a heated debate about the palistine/israel conflict.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:24): but do you wanna talk about something else?",
        "943b5300acc8de272fb7b5f854079c45 (11:26): haha sure. but will you atleast give christianity a chance? just go to a lutheran church a few times. maybe talk to a pastor? please?",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:27): no converting here :P i&apos;ve looked into all religions before, kinda made my decision for right now in my life",
        "943b5300acc8de272fb7b5f854079c45 (11:27): oh come on. just try.",
        "943b5300acc8de272fb7b5f854079c45 (11:27): please?",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:28): not saying i never will, just not right now, but did make a great arguement",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:28): *you did",
        "943b5300acc8de272fb7b5f854079c45 (11:31): well thanks i think? haha. but that wasnt the point. i know that some religions believe that there&apos;s only a certain number of people who can be allowed into heaven or whatever. but my religion isnt like that. God wants everyone in heaven. he wants you there. you specifically. me specifically. everyone. that&apos;s why i wanted to talk to you about it. i wanna see you in heaven someday.",
        "943b5300acc8de272fb7b5f854079c45 (11:32): but i suppose if you want we can talk about something else. i just want you to try it out. give it another chance.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:32): that&apos;s the weirdest chat up line i&apos;ve heard in a while ^^",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:32): just kiddin",
        "943b5300acc8de272fb7b5f854079c45 (11:33): lol what do you mean?",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:33): ah i was just kidding the &apos;wanna see you in heaven someday&apos; sounds like it&apos;s straight out of some cheesey chat up line",
        "943b5300acc8de272fb7b5f854079c45 (11:34): ohhhhh lol i see whatchya mean. haha. but you know what i meant. lol.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:34): yeah no worries",
        "943b5300acc8de272fb7b5f854079c45 (11:34): im not a creeper i promise(:",
        "943b5300acc8de272fb7b5f854079c45 (11:34): haha good.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:35): well going with a religious route if you are is certainly original",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:35): never knew God was the way to a man&apos;s heart ^^",
        "943b5300acc8de272fb7b5f854079c45 (11:36): hahahah. yep.(;",
        "943b5300acc8de272fb7b5f854079c45 (11:36): so what are you up to?",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:36): ok so where are you from in the States? i&apos;m just outside London right now",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:37): in bed, need to get up in like an hour and do some shopping... but i don&apos;t wanna",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:37): far to lazy for that",
        "943b5300acc8de272fb7b5f854079c45 (11:38): haha sorry, but i dont tell people stuff like that. it&apos;s not that i think youre a creeper, i just dont tell people that stuff on here. haha. and lol. am i keeping you up? if i am, you can go to bed if you want. ahha.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:38): it&apos;s early not late don&apos;t worry. And it&apos;s  fine i get it",
        "943b5300acc8de272fb7b5f854079c45 (11:39): ohhhh okay. haha. i see.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:39): So when did you decide to be Lutheran",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:44): hey Taleya i really have to go, i&apos;m sorry. It was great talking to ya. i&apos;m guessing giving out msn and stuff isn&apos;t cool with you. Good luck with what ever you get up to. Don&apos;t worry about me, i&apos;m sure my heathen ass will make it somehow.",
        "943b5300acc8de272fb7b5f854079c45 (11:44): actually that&apos;s complicated. haha. when i was little, i dont know what religion i was. i think i knew there was a God but it wasnt like an important thing in my life. then my mom got busted for drugs and i got put into foster care. the second home i was put in was a family of jehovah&apos;s witnesses. (which in case you dont know is VERY different from what i believe now. lol.). so that&apos;s what i converted to. they taught me all that crap then i moved out of there and into a third foster home. they werent really religious. but after a while, my aunt and uncle took me in and adopted me. they sent me to a lutheran school. and for the first couple years, i didnt believe in their religion. i blocked out their teachings and i kept praying to jehovah. but after a while, i started listening to what they were actually saying. and it made a whole heck of a lot more sense than what i believed at the time.",
        "943b5300acc8de272fb7b5f854079c45 (11:44): and actually, that&apos;s fine.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:45): oh wow, ok i&apos;ll stay for a bit,just to read this!",
        "943b5300acc8de272fb7b5f854079c45 (11:46): my email is <email/> if you wanna look me up. i think that&apos;s how you&apos;d find my msn right? lol.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:46): sounds like you&apos;ve been through a lot, i&apos;m sorry. but i&apos;m glad you&apos;ve found faith to guide through whatever comes your way",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:47): i&apos;ll add u quickly now",
        "943b5300acc8de272fb7b5f854079c45 (11:47): haha no biggie. everything happens for a reason. and i know that god is always in control and doin whats best for me(: took me a while to realize it. but i know it now(:",
        "943b5300acc8de272fb7b5f854079c45 (11:48): and haha okay. im not on right now cus im on my friend&apos;s laptop. but ill check it the next time im home. haha.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:48): hey trust me i know family issues inside out, it can be seriously tough",
        "943b5300acc8de272fb7b5f854079c45 (11:49): yep. but honestly, my past doesnt bother me anymore. i used to cry every night. then i realized it didnt matter.",
        "943b5300acc8de272fb7b5f854079c45 (11:50): i think i cried myself out. lol. cus now i can talk about it without feeling anything.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:51): talking about it is the key. just having someone to vent it all out to is such a powerful thing",
        "943b5300acc8de272fb7b5f854079c45 (11:52): yep. and i had friends to vent to. i opened up a few times. but i really am over it. the past is the past and it has only made me stronger. everyone has had problems. and i know ill have more. but those ones are done and over with.",
        "943b5300acc8de272fb7b5f854079c45 (11:52): (:",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:52): definately seem like you&apos;re on top of thing, good on ya",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:52): *seems",
        "943b5300acc8de272fb7b5f854079c45 (11:53): yep. haha. but hey, didnt you say you had to go a while ago?",
        "943b5300acc8de272fb7b5f854079c45 (11:53): haha.",
        "943b5300acc8de272fb7b5f854079c45 (11:53): you can go if you want.",
        "de6dd78f0ffd619ac9fa1e1f88d976d1 (11:54): yup i kinda do. but yeah it was nice chatting. cya",
        "943b5300acc8de272fb7b5f854079c45 (11:54): haha yep you too. later dude(:"
    ],
    "person_ids": [
        "de6dd78f0ffd619ac9fa1e1f88d976d1",
        "943b5300acc8de272fb7b5f854079c45"
    ]
}