{
    "id": "a5cace057ab49be5143a1426296d0c2c",
    "messages": [
        "3c1a153d81002878b83df957ee534f47 (09:07): anyone know where to find the documentation on IE (or any other browser or plugin') autofill functionality?",
        "3c1a153d81002878b83df957ee534f47 (09:15): ah found something: http://msdn.microsoft.com/en-us/library/ms533032(VS.85).aspx",
        "3c1a153d81002878b83df957ee534f47 (09:16): e.g.",
        "3c1a153d81002878b83df957ee534f47 (09:16): &lt;INPUT TYPE = text",
        "3c1a153d81002878b83df957ee534f47 (09:16): NAME = oEmail",
        "3c1a153d81002878b83df957ee534f47 (09:16): VCARD_NAME = &quot;vCard.Email&quot;",
        "3c1a153d81002878b83df957ee534f47 (09:16): &gt;",
        "3c1a153d81002878b83df957ee534f47 (09:16): I'm going to capture this in hcard-input-formats",
        "3c1a153d81002878b83df957ee534f47 (09:16): as prior work",
        "3c1a153d81002878b83df957ee534f47 (09:17): and the full schema used: http://msdn.microsoft.com/en-us/library/ms535130(VS.85).aspx",
        "3c1a153d81002878b83df957ee534f47 (09:18): and another example of unnecessary renaming: &quot;vCard.Company&quot; instead of &quot;org&quot;",
        "8720b1bb098a8f70d156b9fc2028d7db (09:29): Tantek edited minimal-vocabulary &quot;/* renaming example org */ added Microsoft VCARD_NAME schema as yet another unnecessary renamer from vCard&quot; (+229) http://is.gd/ZwmX",
        "8720b1bb098a8f70d156b9fc2028d7db (09:30): Tantek edited minimal-vocabulary &quot;/* renaming example organization name */ clearer styling&quot; (+35) http://is.gd/Zwqo",
        "8720b1bb098a8f70d156b9fc2028d7db (09:33): Tantek edited rfc-2426 &quot;/* other variants */ added OpenID attribute exchange, Portable Contacts, Microsoft VCARD_NAME&quot; (+411) http://is.gd/Zwyx",
        "8720b1bb098a8f70d156b9fc2028d7db (09:38): Tantek edited rfc-2426 &quot;another source of info for Microsoft VCARD_NAME schema&quot; (+97) http://is.gd/ZwK7",
        "0de0bf7c8cc4c5700f6370db825561a7 (09:48): hey Tantek, did you see the initial 4th b-day logo I uploaded? Thoughts?",
        "3c1a153d81002878b83df957ee534f47 (09:48): URL?",
        "0de0bf7c8cc4c5700f6370db825561a7 (09:49): http://tinyurl.com/kkzbk9",
        "0de0bf7c8cc4c5700f6370db825561a7 (09:50): it's simple but I was going for&quot;recognizable as microformats but specific to 4 yr. b-day...",
        "3c1a153d81002878b83df957ee534f47 (09:53): yikes - I'm not sure it's good to mutate the logo that much!",
        "0de0bf7c8cc4c5700f6370db825561a7 (09:53): yeah I wasn't sure....",
        "3c1a153d81002878b83df957ee534f47 (09:53): did you have a chance to run it by Dan Cederholm to get his opinion?",
        "0de0bf7c8cc4c5700f6370db825561a7 (09:53): I should email him the linl\\",
        "0de0bf7c8cc4c5700f6370db825561a7 (09:53): link",
        "0de0bf7c8cc4c5700f6370db825561a7 (09:54): I just emailed him earlier tonight asking what the mf font was for the name &quot;microformats&quot;",
        "0de0bf7c8cc4c5700f6370db825561a7 (09:54): haven't heard back yet",
        "0de0bf7c8cc4c5700f6370db825561a7 (09:54): do you know what font he used? it's not on the site",
        "0de0bf7c8cc4c5700f6370db825561a7 (09:55): Jeremy and I both thought it was very much still recognizable as mf but specific to the b-day celebration",
        "0de0bf7c8cc4c5700f6370db825561a7 (09:56): but it's your call for sure :)",
        "3c1a153d81002878b83df957ee534f47 (09:59): My experience with corporate and non-profit brands is that typically you want to preserve at least the shape of a logo for any variant",
        "3c1a153d81002878b83df957ee534f47 (09:59): and high contrast elements",
        "3c1a153d81002878b83df957ee534f47 (09:59): thus for example, Cederholm created an orange variant of the microformats logo as well (you can find it on http://microformats.org/ if you find it)",
        "8720b1bb098a8f70d156b9fc2028d7db (10:00): Tantek edited hcard-input-examples &quot;links to broader hcard-input effort, hcard-input-formats documentation, hcard-brainstorming&quot; (+136) http://is.gd/ZxEG",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:01): Oh yeah totally. But I think the 3 parts cascading with the rounded edges and the white border keeps enough of the visual ties to the original logo even if it's in another color. It's a tough call but I honestly think so far that most people I've showed it to are like &quot;oh yeah, that's the mf logo as a #4&quot;",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:03): I'm kind of hoping to get a bunch of peoples' input to see if it's syntactically relevant and then if most people (even the ones I know who have no clue what mf is) get the logo variation, then it works. If not, I've got a bunch of tricks up my sleeve :)",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:06): We also really need to pick a venue w/in the next 2 days so we can start promoting (the sooner the better b/c we want to use this to raise $$$ for the devCamp). I was thinking that whatever logo/designs we go with should also have some code people can embed  that allows users to download the vCalendar when clicked (microformatted hCalendar)",
        "3c1a153d81002878b83df957ee534f47 (10:07): yeah - the morphed logo really felt odd",
        "3c1a153d81002878b83df957ee534f47 (10:08): we could perhaps do something with small multiples rather than the number 4",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:10): yeah, I emailed Dan to see what he thinks too, but I've got a few other ideas for the embeddable banners/images",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:10): do you know what the logo font is?",
        "3c1a153d81002878b83df957ee534f47 (10:10): I thought we had written it down on the wiki",
        "3c1a153d81002878b83df957ee534f47 (10:10): have you looked at the spread microformats page?",
        "3c1a153d81002878b83df957ee534f47 (10:11): http://microformats.org/wiki/spread-microformats",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:12): yeah, I have. I was just trying to do something &quot;new&quot; - maybe too divergent though",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:13): I'll have other comps by morning - Jeremy and I are on a caffine kick and are planning an all-nighter....",
        "8720b1bb098a8f70d156b9fc2028d7db (10:14): Tantek created hcard-input &quot;drafted&quot; http://is.gd/Zyfp",
        "3c1a153d81002878b83df957ee534f47 (10:15): I had a small cup of Ritual Coffee Roasters coffee myself so I'm cranking away on hCard copy+paste",
        "3c1a153d81002878b83df957ee534f47 (10:15): doing research, brainstorming, iterating",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:15): Oh so what if we did the 4's logo with the microformats embedded icon in the corner with text? sorry I'm not trying to push this too hard, I just really think it can work. I like this better than other ideas because it also brands the &quot;event&quot; which is important if you want ###'s to show up",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:15): I also emailed a few venues as well",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:16): since Varnish is $350/hr minimum",
        "3c1a153d81002878b83df957ee534f47 (10:16): yeah Varnish seems a bit steep",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:16): Although I also talked to Jeremy and Object Adjective could sponsor one of those hours (basically we could be good for about $350)",
        "3c1a153d81002878b83df957ee534f47 (10:17): that's very generous of you!",
        "3c1a153d81002878b83df957ee534f47 (10:17): let's make sure your donation would be maximally efficiently spent",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:17): Yeah totally",
        "3c1a153d81002878b83df957ee534f47 (10:17): I've requested reserving the upstairs at 21st Amendment as a possibility",
        "3c1a153d81002878b83df957ee534f47 (10:17): it would limit the size of the party - but it's a start",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:18): I don't want to just buy people drinks - I want to find the best venue where people can talk, eat and maybe have a few brief speakers (so not packed with other loud clientelle)",
        "3c1a153d81002878b83df957ee534f47 (10:18): yeah",
        "3c1a153d81002878b83df957ee534f47 (10:18): but right now, I want to lock down *something* that we know we can afford and then we can upgrade from there",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:18): Yeah I was worried about the 38 person for sit-down limit - if we do it early enough (before 7pm) many people will want food options",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:19): Although I know a party planner who is really awesome &amp; might have some catering options if we did it somewhere that didn't have food",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:19): Another possibility would be doing it at Root Division",
        "3c1a153d81002878b83df957ee534f47 (10:20): simplest is just appetizers and cash bar - no sit down",
        "3c1a153d81002878b83df957ee534f47 (10:20): and start the party later like 8pm",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:20): I'm a studio resident there - we would have to get the bevs and food, but we could work off of donations &amp; peoples' pot luck enthusiasm",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:20): yeah that totally makes sense",
        "3c1a153d81002878b83df957ee534f47 (10:20): go ahead an add additional venue suggestions to the wiki page with details off the top of your head",
        "3c1a153d81002878b83df957ee534f47 (10:21): helps to have them in one place to compare/contrast",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:21): There were a few other places I was considering listing but it depends what our party size is",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:21): How many peeps do you think will show up?",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:21): any clue?",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:22): b/c I have a sense of venues of all sizes I just need to know a rough min/max",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:24): it's tough b/c we're looking at either a friday or saturday night on short notice...",
        "3c1a153d81002878b83df957ee534f47 (10:26): right",
        "3c1a153d81002878b83df957ee534f47 (10:26): so pick a few you like and list rough capacities",
        "3c1a153d81002878b83df957ee534f47 (10:26): and cost info if you have them too",
        "8720b1bb098a8f70d156b9fc2028d7db (10:26): Tantek created hcard-input-formats &quot;drafted with only hCard input previous format example found so far, Microsoft VCARD_NAME schema&quot; http://is.gd/ZyPq",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:27): The other thing is we could do it at Jeremy and my apt. (it's 1600 sq feet) and just buy alcohol/kegs and I could cater the food myself (used to be a chef at a northern Italian cuisine restaurant)",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:27): Since it's our office we could say it's at Object Adjective hq",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:28): if we wanted to save $",
        "3c1a153d81002878b83df957ee534f47 (10:29): that's also a very generous offer!",
        "3c1a153d81002878b83df957ee534f47 (10:29): let's see if we can do it at a venue so that we don't have to compromise your personal space",
        "3c1a153d81002878b83df957ee534f47 (10:29): but that's a good backup to keep in mind - feel free to list that as a last ditch option",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:30): I don't mind (it's good motivation to clean) - and I love hosting parties - as long as 1-2 peeps sign up for clean up duty to help me the next day :P",
        "8720b1bb098a8f70d156b9fc2028d7db (10:30): Tantek created hcard-input-brainstorming &quot;drafted with rough outline of proposal thoughts, noted a couple of issues off the top of my head based on experience with real world examples so far&quot; http://is.gd/Zz3J",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:31): Even if they don't I love throwing parties. It's a good fun time to get people together talking about geeky things and having fun",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:31): and i like to cook",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:35): Another place that isn't too obnoxious about charging parties is Nihon Whiskey Lounge on Folsom St. Jeremy had my b-day there 2 years ago and they were very accommodating - could get the private room for purchasing 1 or 2 bottles of premier  alcohol (food was for order on demand but they might cater if we talk to them about a large group) - they;re only good for about maybe 30-35 tops but it's a really private comfy space so i",
        "3c1a153d81002878b83df957ee534f47 (10:36): go ahead and add all your suggestion to the wiki page",
        "3c1a153d81002878b83df957ee534f47 (10:36): like I said - hard to consider in a stream in IRC - better to compare/contrast",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:37): ugh I'm just afraid I'll overcrowd it &amp; drive everyone nuts - I was going to get quotes and then add the possibilities since I can think of about 20 places off-hand",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:39): Give me 1 day of phoning around (on no sleep, which oddly makes me more shrewd) and I'll post the realistic possibilities. It would help though if we had a rough count - or at least a minimum and absolute maximum (could be totally inflated) b/c I would love to find a place that could accommodate any # and not feel empty if only 20 - 30 show up",
        "3c1a153d81002878b83df957ee534f47 (10:40): don't worry about &quot;overcrowd&quot;",
        "3c1a153d81002878b83df957ee534f47 (10:40): and don't wait to get quotes",
        "3c1a153d81002878b83df957ee534f47 (10:40): that's the whole point of a wiki",
        "3c1a153d81002878b83df957ee534f47 (10:40): just add incremental bits of info when you have it",
        "3c1a153d81002878b83df957ee534f47 (10:40): rather than collecting it until some point of &quot;completeness&quot;",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:40): Okay. I'll end up posting about 10 places then",
        "3c1a153d81002878b83df957ee534f47 (10:41): we have no idea for count because we'll likely do explicit invites based on capacity",
        "3c1a153d81002878b83df957ee534f47 (10:41): so it's a bit of a circular problem",
        "3c1a153d81002878b83df957ee534f47 (10:41): hard to find spaces that scale like that",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:41): but I would like to thin it down to ones that cost less baseline than $350 / hr and can accommodate 30-50 people at least but probably not more than 100 at a time ... that's my guess",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:42): We shouldn't be explicit though - not if we're trying to raise $$ for the DevCamp",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:42): We want lots of people to show up, buy merch, etc",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:43): Sorry I'm being too business-like but it's the truth; we need a lot of people if we're only asking for X at the door",
        "3c1a153d81002878b83df957ee534f47 (10:43): explicit meaning directly contacting people in addition to organic",
        "3c1a153d81002878b83df957ee534f47 (10:43): explicit != exclusive",
        "3c1a153d81002878b83df957ee534f47 (10:43): hi rohit",
        "3c1a153d81002878b83df957ee534f47 (10:43): 0de0bf7c8cc4c5700f6370db825561a7 has been a lot of good work trying to figure things out for the party",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:45): probably too much - I am a bit of a neurotic (no kidding?)",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:46): but I think we all agree that we need the cheapest, most accommodating option that can book us for a week from Fri or Sat - yikes!",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:46): We can do this though",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:47): even if we need to do Varnish and get sponsors - or have it at Object Adjective hq",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:47): either one would have plenty of space",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:48): and our home/office is free - but not sure if it's too non-event-ish to do it at a dev. company's home/office?",
        "3c1a153d81002878b83df957ee534f47 (10:49): I think the 21st Amendment reservation may be free too",
        "3c1a153d81002878b83df957ee534f47 (10:49): and that way we don't have to worry as much about food + drink logistics",
        "3c1a153d81002878b83df957ee534f47 (10:49): we can still do some sponsorship",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:53): Yeah, that would totally be fine - as long as they've got the space and they won't be jerks. I know when J and I went to CromaticSF last week we went there afterward and they were total assholes to the crowd we came with b/c not everyone wanted to order dinner - I know we won't be in the dining room, but it just left a bad taste in my mouth....",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:53): I would hate to have them book us upstairs and then let other loud roudy patrons up there to drink beer and watch sports....",
        "e680c572adac296dee01a75878b1b7f3 (10:54): thanks for all your help, 0de0bf7c8cc4c5700f6370db825561a7",
        "e680c572adac296dee01a75878b1b7f3 (10:54): you're making me wish I could be there! :)",
        "e680c572adac296dee01a75878b1b7f3 (10:54): (i'll be in NYC unfortunately)",
        "e680c572adac296dee01a75878b1b7f3 (10:54): unless there's enough uf'ers in nyc!...",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:55): well we can always set up a live feed if you plan your own party on the east coast :)",
        "3c1a153d81002878b83df957ee534f47 (10:57): 0de0bf7c8cc4c5700f6370db825561a7 - when they book the upstairs - they put up a sign saying private party",
        "3c1a153d81002878b83df957ee534f47 (10:57): I know this because we've been there before when other groups have booked it",
        "3c1a153d81002878b83df957ee534f47 (10:57): (ref: 21A)",
        "0de0bf7c8cc4c5700f6370db825561a7 (10:59): Oh well then I'm going to chill out and not hate on 21st at least about private parties :P",
        "0de0bf7c8cc4c5700f6370db825561a7 (11:00): I am also taking this time to write to all of my friends at the various web firms, software companies, etc. and try to get sponsorship",
        "0de0bf7c8cc4c5700f6370db825561a7 (11:00): Have we gotten any others yet beside ObjAdj?",
        "8720b1bb098a8f70d156b9fc2028d7db (11:05): Pseudowish edited events/2009-06-microformats-4th-bday &quot;/* donations */ &quot; (+89) http://is.gd/ZAGc"
    ],
    "person_ids": [
        "3c1a153d81002878b83df957ee534f47",
        "8720b1bb098a8f70d156b9fc2028d7db",
        "0de0bf7c8cc4c5700f6370db825561a7",
        "e680c572adac296dee01a75878b1b7f3"
    ]
}