{
    "id": "a6fac151a04cb96d88f556b3f4a394cd",
    "messages": [
        "a9b326df4e6da61c5b6f5e1058be83a2 (07:23): reads",
        "a9b326df4e6da61c5b6f5e1058be83a2 (07:23): reads http://www.w3.org/2011/webtv/wiki/MPTF/Netflix_Content_Protection",
        "06cb330920ae58e1614c9145d983b3d6 (07:24): is anyone actually taking that seriously? heh",
        "06cb330920ae58e1614c9145d983b3d6 (07:26): drm being fundamentally and irreconcilably incompatible with open source browsers, apis specifically to support pieces of it seem completely useless (unless browsers become less open, and anything encouraging that is bad)",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:28): not to mention it being user-hostile",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:28): i don't understand how any engineer who works on drm tech can live with themselves",
        "06cb330920ae58e1614c9145d983b3d6 (07:29): i've worked on drm :( (but for turnkey arcade systems, not consumer stuff)",
        "06cb330920ae58e1614c9145d983b3d6 (07:31): (and given that the underlying game engine was, for the most part, released open source, I can live with that)",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:32): the vast majority of arcade machines i see these days are privately owned",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:32): so it's still &quot;consumer stuff&quot;",
        "06cb330920ae58e1614c9145d983b3d6 (07:33): $5000+ machines aren't consumer products, no matter who ends up buying them in the end",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:34): cars aren't consumer products? :-)",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:34): houses aren't consumer products? :-)",
        "06cb330920ae58e1614c9145d983b3d6 (07:34): different scale of product :)",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:34): i don't see how",
        "06cb330920ae58e1614c9145d983b3d6 (07:34): consumer games are $50, not $5000",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:35): my point is that if it's privately owned, the drm would stop someone from making private modifications to their property",
        "06cb330920ae58e1614c9145d983b3d6 (07:35): also vastly different scale (we'd have been happy to sell a thousand units)",
        "06cb330920ae58e1614c9145d983b3d6 (07:36): i know all the arguments; at least in that case (the one I happen to have direct experience with), the practicalities had to come before principle",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:36): (and if it's not a consumer product, why bother with drm? a commercial competitor who is so beyond the law that the legal system is not a sufficient recourse is certainly not gonna have any trouble reverse-engineering some obfuscation)",
        "06cb330920ae58e1614c9145d983b3d6 (07:37): because the variables don't work out that way",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:37): (in fact such a competitior is far more likely to just steal the code/assets/designs/whatever straight from the source repository than bother with buying an actual product)",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:37): (just look at how movies get redistributed before they're even commercially available)",
        "06cb330920ae58e1614c9145d983b3d6 (07:37): there are plenty of people who would pirate our game if it was easy to do (just a new HDD), but nobody with the expertese to break it was actually trying",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:38): and how many of those people actually bought copies instead?",
        "06cb330920ae58e1614c9145d983b3d6 (07:38): versions of our game where the encryption was broken sold significantly less than the ones where it wasn't (don't have exact numbers, probably couldn't say them if I did)",
        "06cb330920ae58e1614c9145d983b3d6 (07:39): also, enforcing copyright internationally takes a lot more resources than domestically",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:40): should've just paid for a security guard for each unit to stand there with a cane and beat anyone who tried to open the box, instead",
        "06cb330920ae58e1614c9145d983b3d6 (07:40): then we'd need our own legal defense team. heh",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:40): anyway",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:40): the ends don't justify the means",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:40): consumer or not",
        "06cb330920ae58e1614c9145d983b3d6 (07:41): when the lack of DRM means there will be no future product, they can",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:41): better to have no products than to have drm, imho",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:42): (luckily, that isn't even close to the actual result of not having drm)",
        "06cb330920ae58e1614c9145d983b3d6 (07:42): it definitely was in our case (i'm not saying it is in *all* cases)",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:43): i'm skeptical, but i don't have all the data so can't comment one way or the other on your specific case",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:43): generally when i've seen people make those claims though they tend to forget to account for all the factors, e.g. the opportunity cost of working on drm",
        "06cb330920ae58e1614c9145d983b3d6 (07:44): what?",
        "06cb330920ae58e1614c9145d983b3d6 (07:44): (i know the cost to us in implementing the drm, since i did it all myself--took 3-4 weeks)",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:45): 3-4 weeks total, or 3-4 weeks on the ones that got broken, or 3-4 weeks on one game that didn't get broken?L",
        "06cb330920ae58e1614c9145d983b3d6 (07:46): as far as I know it was never broken so long as I worked there, at least (at least based on the fact that bootlegs didn't show up in the wild)",
        "06cb330920ae58e1614c9145d983b3d6 (07:46): (forget how long; well over a year)",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:46): i thought you just said &quot;versions of our game where the encryption was broken sold significantly less than the ones where it wasn't&quot;",
        "06cb330920ae58e1614c9145d983b3d6 (07:47): that was a much older system (written maybe 6-7 years earlier)",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:47): so 3-4 weeks per game then",
        "06cb330920ae58e1614c9145d983b3d6 (07:47): it was much weaker and used on too many products without changing",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:47): how much more would you have made if you'd spent those 3-4 weeks e.g. working on a system where they could buy the disks to put new games in for very little instead of requiring that they buy an entirely new unit? (i'm guessing as to the mechanics here since i don't know what you did exactly)",
        "06cb330920ae58e1614c9145d983b3d6 (07:48): 3-4 weeks initially; that system was used on two products while I was there",
        "06cb330920ae58e1614c9145d983b3d6 (07:48): we actually did have a system for in-place upgrades; the market wasn't really set up to use it, so we didn't make much use of it",
        "06cb330920ae58e1614c9145d983b3d6 (07:48): (insert USB drive with upgrade, push button, wait a minute)",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:48): but the market was set up to do it without you if they broke the drm?",
        "06cb330920ae58e1614c9145d983b3d6 (07:49): the market is always set up to copy games for free if they can",
        "06cb330920ae58e1614c9145d983b3d6 (07:49): (at least in some countries)",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:50): not at all, e.g. valve has found that by making buying games actually easier than copying them, they sell more games than they would if they had drm",
        "06cb330920ae58e1614c9145d983b3d6 (07:50): that's for consumers buying games online; it doesn't translate to $500+ upgrade packs for arcade games",
        "06cb330920ae58e1614c9145d983b3d6 (07:51): (eg. many arcades can't get internet access to machines)",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:51): so maybe the problem isn't that your market isn't set up for it but that you were charging rates the market wasn't ready to support without using artifical tactics like drm",
        "06cb330920ae58e1614c9145d983b3d6 (07:52): the market isn't prepared to pay anything whatsoever, if it can get stuff for $0 (or $30 or whatever the cost of a tiny HDD is)",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:52): again, valve has shown that to not be true",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:52): iTunes has also shown that to not be true (for music)",
        "06cb330920ae58e1614c9145d983b3d6 (07:52): again, steam has no comparative value to arcade machines",
        "06cb330920ae58e1614c9145d983b3d6 (07:53): buying a song on iTunes is &quot;push button, spend $1, get a song&quot;; arcade owners don't spend hundreds of dollars on an upgrade on a one-click whim purchase",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:53): i see no reason to believe that any particular market would be any mare special than another here",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:53): again, maybe the problem is that you were charging too much to make it sustainable",
        "06cb330920ae58e1614c9145d983b3d6 (07:53): it's completely different, because upgrading an arcade machine is a financial investment, buying a game on steam is not",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:54): all purchases boil down to investments",
        "06cb330920ae58e1614c9145d983b3d6 (07:54): not in comparable notions of the word",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:54): when you buy a game on steam, you're return is going to be in entertainment per hour instead of dollars per hour",
        "06cb330920ae58e1614c9145d983b3d6 (07:54): i buy a $40 game if I think I'll have $40 of fun with it; an arcade owner buys a $500 upgrade if he thinks he'll make $500 more money from coin drops as a result",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:54): but at the end of the day, what are dollars if not a way to get entertainment?",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:55): sounds the same to me",
        "06cb330920ae58e1614c9145d983b3d6 (07:55): sounds unrelated to me",
        "69b0d3dfe919a6b860a9fac82de52a7e (07:55): whatever lets you sleep at night :-)",
        "b8810fee2f4a71f849f3f7409546d1d9 (07:56): RDFa continues to live in a time warp where HTML and XHTML are developed separately: http://www.w3.org/News/2011.html#entry-9301",
        "06cb330920ae58e1614c9145d983b3d6 (07:56): our engine was almost all released as open-source, so I have no trouble sleeping at night :)",
        "06cb330920ae58e1614c9145d983b3d6 (07:57): http://sourceforge.net/projects/stepmania/"
    ],
    "person_ids": [
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "06cb330920ae58e1614c9145d983b3d6",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "b8810fee2f4a71f849f3f7409546d1d9"
    ]
}