{
    "id": "a96acfe820a0daff82d9524445d4f725",
    "messages": [
        "edb259c0e0038f38bb200bc20c8cbf7e (00:41): http://www.0xdeadbeef.com/weblog/?p=977#comment-176228",
        "f139aba52f9fa1394b4034a7954b2220 (00:47): a9b326df4e6da61c5b6f5e1058be83a2, yt?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (00:48): yeah",
        "f139aba52f9fa1394b4034a7954b2220 (00:48): it looks like all you did to write the audience section was to move the vague, overly broad statement from the scope section to a new audience section. That doeesn't make it any less vague or overly broad",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:49): it's no broader than html5's, the problem now is just that the spec itself is far too narrow to match the given audience statement",
        "f139aba52f9fa1394b4034a7954b2220 (00:50): a9b326df4e6da61c5b6f5e1058be83a2, is there a public CVS repo for your spec",
        "a9b326df4e6da61c5b6f5e1058be83a2 (00:58): f139aba52f9fa1394b4034a7954b2220: No. That's an issue with hosting anything on www.w3.org. Which is why I think dev.w3.org is better",
        "a9b326df4e6da61c5b6f5e1058be83a2 (00:59): I guess I need to just move it over to dev.w3.org",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:00): and I need to push for getting some more horsepower behind dev.w3.org to address that problems that systeam has pointed out",
        "a3f19f90edf0a0893c7847d08016abe3 (01:00): wonders what specs dev.w3.org has",
        "f139aba52f9fa1394b4034a7954b2220 (01:01): a3f19f90edf0a0893c7847d08016abe3, lots from WebApps, HTML, and CSS WGs",
        "a3f19f90edf0a0893c7847d08016abe3 (01:01): as in speed/memory, not which web specifications :)",
        "f139aba52f9fa1394b4034a7954b2220 (01:01): oh",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:01): you gotta admit, that was an ambiguous query :-P",
        "a3f19f90edf0a0893c7847d08016abe3 (01:02): yeah =)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:02): I don't know what kind of machine it is, but I think it's extremely low-spec",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:03): I think it started out as just being a place to publicly manage the source for a couple of tools",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:04): But it then evolved to a lot more from there",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:04): As these kinds of things tend to do.",
        "f139aba52f9fa1394b4034a7954b2220 (01:06): a9b326df4e6da61c5b6f5e1058be83a2, can't they just move it to the same set of servers that they run w3.org from?",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:06): nn",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:07): nn",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:19): f139aba52f9fa1394b4034a7954b2220: Yeah, I would think the Web interface to the dev stuff could be hosted on the same machines as www.w3.org, just using virtual hosting",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:19): I would suspect that's already been considered and rejected for some reason, but maybe not",
        "a9b326df4e6da61c5b6f5e1058be83a2 (01:19): I'll ask.",
        "ab7faae5d7b250ea8606486575f8f79c (01:20): I know exactly nothing about any of this, but I don't see why a simple caching proxy wouldn't solve most of the load problems from people requesting the latest version of the spec",
        "f139aba52f9fa1394b4034a7954b2220 (01:35): yay, someone contacted me about taking over the about: URI spec.",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:38): wtf i broke the websocket spec script",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:38): without touching any relevant parts",
        "042dd99eb0ff8653814e445ca0093427 (01:48): Mmmm, RDF-Video. The video can just encode the semantics of what's happening, and the browser can construct a rendering from that. That would get really great compression too.",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:03): 042dd99eb0ff8653814e445ca0093427: it'd be interesting to ask pixar what the ratio is from assets to final rendered bitmap, and how many minutes it takes before you do in fact get compression",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:16): speaking of video, Sun seems to be pretty serious about their OMS Video project",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:16): at least it appears that they are investing serious money to do patent review (or whatever it's called) for everything in the spec",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:17): and their goal seems to be to make it at least as good as H.264",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:18): the money at stake around licensing costs is really significant",
        "f139aba52f9fa1394b4034a7954b2220 (02:18): a9b326df4e6da61c5b6f5e1058be83a2, that's the same goal of Theora and Dirac, isn't it?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:19): f139aba52f9fa1394b4034a7954b2220: I suppose so",
        "f139aba52f9fa1394b4034a7954b2220 (02:20): I guess it's good to see more free alternatives, along with Ogg, Matroska, Theora, Dirac and Vorbis. Though having too many competing technologies can be someone counter productive",
        "f139aba52f9fa1394b4034a7954b2220 (02:20): *somewhat",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:21): I think the cases where having competing technologies is productive far outnumber the cases where it's not.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:22): at least over the long term",
        "f139aba52f9fa1394b4034a7954b2220 (02:22): eek, they're also doing Project DReaM :-( http://www.openmediacommons.org/",
        "a9b326df4e6da61c5b6f5e1058be83a2 (02:23): one big goal of any serious codec effort should be to get widspread support for at the hardware level on devices, particularly mobile devices and other constrained devices",
        "f139aba52f9fa1394b4034a7954b2220 (02:23): I think in the video market, there have been far too many competing technologies, which probably had a lot to do with patents and each vendor wanting to control the market",
        "f139aba52f9fa1394b4034a7954b2220 (02:24): that's why we still today have few interoperable codecs and container formats supported between the major media players",
        "a480104b0e570389c6f4284a88c7cd9d (02:24): is the root problem vendors wanting control or competition?",
        "f139aba52f9fa1394b4034a7954b2220 (02:26): the root is probably vendors wanting control, since that creates a lot of competiton from other vendors wanting control",
        "a480104b0e570389c6f4284a88c7cd9d (02:26): +1",
        "a480104b0e570389c6f4284a88c7cd9d (02:26): ironically, the solution to such problems is often *more* competition instead of less.",
        "f139aba52f9fa1394b4034a7954b2220 (02:26): although, choice can be good. Different codecs are optimised for different situations",
        "f139aba52f9fa1394b4034a7954b2220 (02:27): just like we have PNG, GIF and JPG for different types of images, the video container formats and codecs are good for different uses",
        "a480104b0e570389c6f4284a88c7cd9d (02:28): PNG probably wouldn't exist if it weren't for (now expired) patent concerns",
        "f139aba52f9fa1394b4034a7954b2220 (02:28): like Ogg, I think, is good for streaming, whereas Matroska is good as a general purpose container format",
        "f139aba52f9fa1394b4034a7954b2220 (02:28): PNG is superior to GIF in many ways, including lossless compression and transparency, so it probably would",
        "a480104b0e570389c6f4284a88c7cd9d (02:29): I'm not so sure.  Supperior design is an outcome of what competition produces, but if GIF were &quot;good enough&quot;, there might not have been such an effort.",
        "f139aba52f9fa1394b4034a7954b2220 (02:30): in fact, the usefulness of GIF has shrunk significantly, especially in light if APNG being slowly adopted",
        "a480104b0e570389c6f4284a88c7cd9d (02:31): And yet, GIF will likely be around for as long as RSS 2.0 is.  &lt;ducks&gt; :-)",
        "f139aba52f9fa1394b4034a7954b2220 (02:31): sure, healthy competition is good. The problem is the unhealthy competition stifled by patents",
        "f139aba52f9fa1394b4034a7954b2220 (02:31): RSS 2.0? Is that crap still around?",
        "a480104b0e570389c6f4284a88c7cd9d (02:31): In abundant quantities.",
        "f139aba52f9fa1394b4034a7954b2220 (02:32): it's use should die out over the next decade or so as CMSs get upgraded",
        "f139aba52f9fa1394b4034a7954b2220 (02:32): does WordPress support Atom out of the box yet?",
        "a480104b0e570389c6f4284a88c7cd9d (02:33): yes, but it is hidden and isn't the default",
        "a480104b0e570389c6f4284a88c7cd9d (02:34): your feed is apparently atom produced by wordpress...",
        "a480104b0e570389c6f4284a88c7cd9d (02:34): http://feedvalidator.org/check.cgi?url=http%3A%2F%2Flachy.id.au%2Flog%2Ffeed",
        "f139aba52f9fa1394b4034a7954b2220 (02:35): yeah, cause I installed the Atom plugin a long time ago",
        "f139aba52f9fa1394b4034a7954b2220 (02:36): In fact, I only used RSS for a very brief period during my blog's lifetime. It was atom 0.3 originally before finally moving to 1.0"
    ],
    "person_ids": [
        "edb259c0e0038f38bb200bc20c8cbf7e",
        "f139aba52f9fa1394b4034a7954b2220",
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "a3f19f90edf0a0893c7847d08016abe3",
        "ab7faae5d7b250ea8606486575f8f79c",
        "042dd99eb0ff8653814e445ca0093427",
        "a480104b0e570389c6f4284a88c7cd9d"
    ]
}