{
    "id": "ae05b0729726d85574a671e889a06ee9",
    "messages": [
        "568b6530f074545a496332f6f0f59b8b (20:46): dd5fc28bb590bf269d2ee0ca4c18b036: I've worked with them a bit.  For a single page, you're looking at 5MB of manifest/appcache + 5MB of localStorage + 50MB of database, max",
        "568b6530f074545a496332f6f0f59b8b (20:46): you start off with 5+5+5 for &quot;free&quot;, if you want more database space the user is prompted",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (20:46): 568b6530f074545a496332f6f0f59b8b: ah ok thats good to hear",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (20:46): 568b6530f074545a496332f6f0f59b8b: thanks for the response! I just noticed on my iphone that when i tried to cache about 10mb it asked me if i wanted to increase the size",
        "568b6530f074545a496332f6f0f59b8b (20:47): localStorage is very fast on iOS - memory-fast - whereas database lookups are remarkably slow, so design your app appropriately",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (20:47): but im not sure how that will work on webkit android tablets..still testing",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (20:47): im basically making a menu and each item has photos",
        "568b6530f074545a496332f6f0f59b8b (20:47): appcache does seem to be able to stretch on recent iOS, up to 50MB - but that might be across multiple pages",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (20:48): so if im pulling in data via jquery/ json on a single page",
        "c3b9faf5c1027a2c5f57ff67a9828f25 (20:48): Hello might fine people",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (20:48): i will have issues?",
        "568b6530f074545a496332f6f0f59b8b (20:48): Hmm.  I'm not sure you can prompt the user for more space on Android without an app wrapper",
        "568b6530f074545a496332f6f0f59b8b (20:48): dd5fc28bb590bf269d2ee0ca4c18b036: not if you use the database, storing images as base64'd strings for later use with data: uris...",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (20:48): Interesting idea",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (20:49): thanks so much, just trying to wrap my head around this",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (20:49): and i know the app im working on currently has had cache limitation issues, so I was unsure if it was the device, the webkit build, or the way the implemented it",
        "c3b9faf5c1027a2c5f57ff67a9828f25 (20:49): anyone know where i can find an awesome list of regular expressions for  html5 pattern on input fields",
        "568b6530f074545a496332f6f0f59b8b (20:50): you'll need to base64-encode them on the server, as it's very slow in javascript, but base64+gzip is only a couple of percent bigger than the raw image size for transport; if you fetch several as part of the same request/JSON response, gzip compression puts you ahead",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (20:50): 568b6530f074545a496332f6f0f59b8b: ah cool. Speed shoudlnt be an issue since the client facing app will sync one time and then handed to the user. So the user should have everything preloaded",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (20:51): and currently they scaled down the images to be tiny to fit everything within the cache limit and it would be awesome to up the resolution to allow zooming if i can encode them..woo hooo",
        "568b6530f074545a496332f6f0f59b8b (20:52): dd5fc28bb590bf269d2ee0ca4c18b036: just be aware that database lookups seem to be ~250ms asynchronous, depending on device ;)",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (20:52): 568b6530f074545a496332f6f0f59b8b: thanks for the heads up! I'm just happy now that using the db will give us much more space to work with",
        "568b6530f074545a496332f6f0f59b8b (20:53): dd5fc28bb590bf269d2ee0ca4c18b036: no problem :)  After quite a bit of experimentation it really does seem to be the only option for a little extra storage space...",
        "568b6530f074545a496332f6f0f59b8b (20:54): dd5fc28bb590bf269d2ee0ca4c18b036: you may also be interested in http://stackoverflow.com/questions/6276282/how-can-i-request-an-increase-to-the-html5-localstorage-size-on-ipad-like-the-ft in terms of smooth workflow",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (20:54): 568b6530f074545a496332f6f0f59b8b: you are a life saver!",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (20:55): Now im just trying to wrap my head around all the debugging issues with the cache.manifest",
        "568b6530f074545a496332f6f0f59b8b (20:57): :)  For the manifest, there's a couple of good resources out there, including http://diveintohtml5.org/offline.html ; I would strongly recommend recording/logging as many of the events as possible, as we've had significant issues &quot;in the wild&quot; even just on iOS",
        "568b6530f074545a496332f6f0f59b8b (20:58): not sure if it's just us or a widespread problem, but without analytics you can't know :)",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (20:58): 568b6530f074545a496332f6f0f59b8b:  I read that entire article yesterday :D So i just started playing around",
        "bdedc97e25dde1328bae6e2d092691c8 (20:58): I still use cookies and really light data structures for my local persistence‚Ä¶ async data operations annoy me &gt;_&gt;",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (20:59): I'm just confused on the fallback section. and network * seems like it will auto cache everything",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (20:59): but you still need to explicitly set your pages and resources that are hosted on your server correct?",
        "bdedc97e25dde1328bae6e2d092691c8 (21:01): dd5fc28bb590bf269d2ee0ca4c18b036: Pretty sure that's the case",
        "568b6530f074545a496332f6f0f59b8b (21:02): I think the network * just allows it to go fetch (but not cache) any non-explicitly listed resources if the page is online",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (21:03): ah ok",
        "bdedc97e25dde1328bae6e2d092691c8 (21:05): I think creating a nice backend script that automatically creates a manifest based on certain parameters would be wise.  I suspect most individuals and small teams are hand-coding these (which is better than nothing!)",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (21:10): currently the app has a manifest that is generated by php, but the way the developer implemented it is running into the size constraints",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (21:11): so i just need to figure out how to pull in the encoded data from the db now :)",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (21:29): 568b6530f074545a496332f6f0f59b8b:  I just tried to load  http://app.ft.com on my galaxy tablet and got a dialog saying that my device does not support their new app..i wonder what the reasoning for that is.",
        "dd5fc28bb590bf269d2ee0ca4c18b036 (21:32): but on my iphone it allows me to up the limit to use the app...thats weird. both are webkit but something about the device and its limits must not allow the user to up the limit",
        "f62c0791899ce2c1cf2aacc7936fbfe6 (21:44): aww, :first-child doesn't work in ie9",
        "f62c0791899ce2c1cf2aacc7936fbfe6 (21:44): lamesauce",
        "3fa179c2d34f53c18e7551ac493014d9 (21:45): f62c0791899ce2c1cf2aacc7936fbfe6 i think that it does work in ie9..",
        "f62c0791899ce2c1cf2aacc7936fbfe6 (21:46): my bad, i had something ie9 specific",
        "f62c0791899ce2c1cf2aacc7936fbfe6 (21:47): that makes more sense.  i was surprised"
    ],
    "person_ids": [
        "568b6530f074545a496332f6f0f59b8b",
        "dd5fc28bb590bf269d2ee0ca4c18b036",
        "c3b9faf5c1027a2c5f57ff67a9828f25",
        "bdedc97e25dde1328bae6e2d092691c8",
        "f62c0791899ce2c1cf2aacc7936fbfe6",
        "3fa179c2d34f53c18e7551ac493014d9"
    ]
}