{
    "id": "b28e617eae949c6b1f29a12266c3b162",
    "messages": [
        "69b0d3dfe919a6b860a9fac82de52a7e (21:51): &quot;Adobe does not wish the specification to fork, since we believe that this would fragment the Web.&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:51): you really have to love the irony",
        "65325d50b2e25aca54bc871b89758c9c (21:56): I wonder if they have software that supports any of the existing HTML forks",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:56): i also like the implication that anyone actually wishes the specifications to fork",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:58): reminds me of the far more serious issue of abortion rights, where anti-reproductive-rights advocates argue that abortions should be illegal because &quot;we don't want abortions&quot;, as if the pro-reproductive-rights advocates actually want to have abortions recreationally or something",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:59): Well, in that case the anti-abortion people actually do tend to oppose abortions much more strongly than the pro-abortion rights people, in extreme cases considering abortion murder.  That's the official Catholic position, right?",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:59): I don't think it's tenable to support any abortion rights at all if you think abortion is wrong *enough*, e.g., on the level of murder.",
        "ab7faae5d7b250ea8606486575f8f79c (22:00): What if you support murder?",
        "65325d50b2e25aca54bc871b89758c9c (22:00): I wonder if this will end up the most-responded-to HTML WG survey ever",
        "65325d50b2e25aca54bc871b89758c9c (22:00): I can't remember the previous record",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:00): We can always rely on ab7faae5d7b250ea8606486575f8f79c to throw monkey wrenches from left field into seemingly sound logic.",
        "4abc27e8982c2025d1e277d18a309680 (22:00): Pro murder but anti-abortion?",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:00): 65325d50b2e25aca54bc871b89758c9c, well, the large majority of surveys explicitly say not to answer if you're just repeating others' objections, while in this one many people voted without saying anything.",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:01): 88d4d34a8064a4ff39fd5e144eea7762: yeah it's not a good analogy, it just reminded me of it",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:01): 4abc27e8982c2025d1e277d18a309680, maybe you only think murder is okay if the victim has the opportunity to fight back.",
        "4abc27e8982c2025d1e277d18a309680 (22:01): 88d4d34a8064a4ff39fd5e144eea7762: Ah, that's true.",
        "4abc27e8982c2025d1e277d18a309680 (22:01): Got to love the fight!",
        "65325d50b2e25aca54bc871b89758c9c (22:01): there are older surveys that were not objection polls in the style of the issue surveys",
        "ab7faae5d7b250ea8606486575f8f79c (22:01): What about the &quot;should we adopt the WHATWG's HTML5 spec or doom ourselves to irrelevance before even starting&quot; survey from years ago?",
        "65325d50b2e25aca54bc871b89758c9c (22:01): this may be the record for most answered: http://www.w3.org/2002/09/wbs/40318/htmlbg/results",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:01): Maybe I wasn't around for those.",
        "ab7faae5d7b250ea8606486575f8f79c (22:01): Yeah, that one",
        "65325d50b2e25aca54bc871b89758c9c (22:04): there were a bunch of others in that era that drew ~80-100 responses",
        "65325d50b2e25aca54bc871b89758c9c (22:05): for entertainment, check out these results too: http://www.w3.org/2002/09/wbs/40318/req-gapi-canvas/results",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:06): 88d4d34a8064a4ff39fd5e144eea7762: yt?",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:06): 69b0d3dfe919a6b860a9fac82de52a7e, yes.",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:06): 88d4d34a8064a4ff39fd5e144eea7762: for http://www.w3.org/Bugs/Public/show_bug.cgi?id=12213 you suggest adding a note for fakepath",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:06): Yes.",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:06): 88d4d34a8064a4ff39fd5e144eea7762: it turns out fakepath is mentioned in two places. one is where the bug reporter reported the bug from, which is in class=impl text",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:06): 88d4d34a8064a4ff39fd5e144eea7762: the other is in a place more relevant to authors, namely in the input type=file section",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:07): 88d4d34a8064a4ff39fd5e144eea7762: that section mentions fakepath as part of a big note on how to use it",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:07): 88d4d34a8064a4ff39fd5e144eea7762: does this affect your position?",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:09): 69b0d3dfe919a6b860a9fac82de52a7e, not really.  I certainly wouldn't assume either that authors don't read implementer stuff, or that implementers won't want to have a one-line explanation of WTF things like this so that they know they're not hallucinating.",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:09): should i just point to the other one, or have another similar explanation?",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:09): It's like one line either way, so I don't think it makes a difference.",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:10): the other one is far more than one line",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:10): there's sample code and everything",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:10): Well, so you can point to that, sure.",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:10): k",
        "ab7faae5d7b250ea8606486575f8f79c (22:12): Maybe you need a sic element to mark sections where the reader might think they're hallucinating, to indicate that it really is that crazy"
    ],
    "person_ids": [
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "65325d50b2e25aca54bc871b89758c9c",
        "88d4d34a8064a4ff39fd5e144eea7762",
        "ab7faae5d7b250ea8606486575f8f79c",
        "4abc27e8982c2025d1e277d18a309680"
    ]
}