{
    "id": "b2d65919906325343e69022e782d6356",
    "messages": [
        "d114be1698421a7cec050e2207d29631 (16:20): which vision document is this?",
        "73eaf221abca1b8244e34b0b9e76ac46 (16:23): hi 7e2617a66594d8932013a5022b280c45",
        "7e2617a66594d8932013a5022b280c45 (16:23): hi 73eaf221abca1b8244e34b0b9e76ac46",
        "73eaf221abca1b8244e34b0b9e76ac46 (16:23): 7e2617a66594d8932013a5022b280c45: have you had time to try to grasp al's emails? :)",
        "7e2617a66594d8932013a5022b280c45 (16:24): 73eaf221abca1b8244e34b0b9e76ac46: is it worth it?",
        "7e2617a66594d8932013a5022b280c45 (16:24): what's the core issue?",
        "73eaf221abca1b8244e34b0b9e76ac46 (16:24): 7e2617a66594d8932013a5022b280c45: only one thing: the proposal says to look at the first token (regardless of what it is), they want to look at the first aria token, if any",
        "73eaf221abca1b8244e34b0b9e76ac46 (16:25): 7e2617a66594d8932013a5022b280c45: consider role=&quot;blah checkbox&quot; vs role=&quot;checkbox blah&quot;",
        "73eaf221abca1b8244e34b0b9e76ac46 (16:26): 7e2617a66594d8932013a5022b280c45: in firefox, do you pick up &quot;checkbox&quot; in the former?",
        "7e2617a66594d8932013a5022b280c45 (16:26): no, we just look at the first",
        "7e2617a66594d8932013a5022b280c45 (16:26): but also, we expose an object attribute called xml-roles",
        "7e2617a66594d8932013a5022b280c45 (16:27): which is just the role attribute exactly reproduced char for char",
        "7e2617a66594d8932013a5022b280c45 (16:27): i realize that doesn't help much though",
        "7e2617a66594d8932013a5022b280c45 (16:27): i'm sure we could do better with multiple roles, but no one is doing that yet",
        "7e2617a66594d8932013a5022b280c45 (16:28): in fact no one is really using roles as landmarks at all, even the obvious ones like main and navigation",
        "7e2617a66594d8932013a5022b280c45 (16:29): i guess, we have worse issues that i see as more important -- like harmonizing tree grid across platforms, handling the owns property better, caching relations (which i guess opera already does), and a few other things",
        "7e2617a66594d8932013a5022b280c45 (16:31): 73eaf221abca1b8244e34b0b9e76ac46: but if you decide it's worth putting into the proposal, i should be able to do it for ff3",
        "73eaf221abca1b8244e34b0b9e76ac46 (16:32): 7e2617a66594d8932013a5022b280c45: ok. i don't really have an opinion. could you reply to http://www.w3.org/mid/p06110409c321afd45d23@%5B192.168.1.100%5D (where it says &quot;let's check with aaron&quot;)?",
        "73eaf221abca1b8244e34b0b9e76ac46 (16:33): 7e2617a66594d8932013a5022b280c45: on the one hand i'd like to address al's concern, but on the other hand it's a minor issue and i'd rather try to spec down the remaining big issues first",
        "73eaf221abca1b8244e34b0b9e76ac46 (16:34): it just requires authors who wish to use multiple roles to put the aria role first",
        "7e2617a66594d8932013a5022b280c45 (16:39): 73eaf221abca1b8244e34b0b9e76ac46: i'm wrong, we only allow one role in ff2",
        "7e2617a66594d8932013a5022b280c45 (16:39): i'll reply",
        "73eaf221abca1b8244e34b0b9e76ac46 (16:44): 7e2617a66594d8932013a5022b280c45: i changed the draft to expose the entire value in &quot;xml-roles&quot; (it said to only expose the role identifier it found for the mapping purposes)",
        "7e2617a66594d8932013a5022b280c45 (16:48): ah, so are you going to start putting a11y API details in there?",
        "7e2617a66594d8932013a5022b280c45 (16:48): i think it's a good idea to do that, but, not all a11y apis are the same",
        "73eaf221abca1b8244e34b0b9e76ac46 (16:48): yeah, probably",
        "7e2617a66594d8932013a5022b280c45 (16:48): there are tradeoffs",
        "7e2617a66594d8932013a5022b280c45 (16:48): in the past w3c splits that off into a techniques doc which just leads to a too-abstract spec imo",
        "7e2617a66594d8932013a5022b280c45 (16:48): on the other hand web authors might be confused",
        "7e2617a66594d8932013a5022b280c45 (16:49): and there are differences between atk/at-spi, Iaccessible2, Universal Access, UI Automation, etc.",
        "7e2617a66594d8932013a5022b280c45 (16:49): but i'm glad to help",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:49): 7e2617a66594d8932013a5022b280c45: what's the last API for?",
        "7e2617a66594d8932013a5022b280c45 (16:50): b8810fee2f4a71f849f3f7409546d1d9: it is microsoft's new API for vista",
        "7e2617a66594d8932013a5022b280c45 (16:50): what happened is they gave up on msaa",
        "7e2617a66594d8932013a5022b280c45 (16:50): which was a problem, because people had lots of msaa code in apps and assistive tech",
        "7e2617a66594d8932013a5022b280c45 (16:50): and UIA was just an API for  managed code",
        "73eaf221abca1b8244e34b0b9e76ac46 (16:50): yeah, i'm not sure how to spec it in a sane way. in order to test it you probably need an accessibility api debugger...",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:51): oh. I wasn't up to speed on MS doing something other than MSAA",
        "7e2617a66594d8932013a5022b280c45 (16:51): so IBM worked with the community to build IAccessible2, which are API extensions to MSAA and matches closely with ATK/AT-SPI on Linux",
        "7e2617a66594d8932013a5022b280c45 (16:51): I was part of that effort",
        "7e2617a66594d8932013a5022b280c45 (16:51): it's what we're using in FIrefox now",
        "7e2617a66594d8932013a5022b280c45 (16:51): because it can build on msaa support and yet is very similar to ATK, you can leverage a lot of existing code and get cross platform a11y",
        "7e2617a66594d8932013a5022b280c45 (16:52): the AT vendors had a lot less work to implement support for it, because they get to build on top of exisiting support for MSAA",
        "7e2617a66594d8932013a5022b280c45 (16:52): 73eaf221abca1b8244e34b0b9e76ac46: http://developer.mozilla.org/en/docs/ARIA_to_API_mapping",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:52): 7e2617a66594d8932013a5022b280c45: is Universal Access a good match?",
        "73eaf221abca1b8244e34b0b9e76ac46 (16:53): 7e2617a66594d8932013a5022b280c45: the proposal references that :)",
        "7e2617a66594d8932013a5022b280c45 (16:53): b8810fee2f4a71f849f3f7409546d1d9: universal access is cool because it just name value pairs. It's loosely spec'd which honestly is an advantage in this space, because you don't have to rev a whole lot of binary software in lock step to get new features in",
        "7e2617a66594d8932013a5022b280c45 (16:53): you can just expose some new a11y property",
        "7e2617a66594d8932013a5022b280c45 (16:53): and then ask ATs to support",
        "7e2617a66594d8932013a5022b280c45 (16:53): that",
        "7e2617a66594d8932013a5022b280c45 (16:54): But with binary APIs, adding new features is a total nightmare",
        "7e2617a66594d8932013a5022b280c45 (16:54): b8810fee2f4a71f849f3f7409546d1d9: and the values in the name value pairs don't have to be strings, it can be a hash table for example",
        "7e2617a66594d8932013a5022b280c45 (16:54): so you can send any event data you want, for example, it's great",
        "7e2617a66594d8932013a5022b280c45 (16:55): the big disadvantage is that there is really only one (closed) screen reader supporting it, which is owned by the platform vendors",
        "7e2617a66594d8932013a5022b280c45 (16:55): so it is harder to influence them if you need new features, like accessible live regions or drag and drop, or whatever",
        "7e2617a66594d8932013a5022b280c45 (16:55): but, to answer your question, the name/value pairs Apple is using most likely fit well enough, but we only have stub support for UA in Mozilla so I can't say what the major integration issues will be yet",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:55): 7e2617a66594d8932013a5022b280c45: OK, so one needs to know the magic keys supported by VoiceOver instead of merely writing to a particular set of function calls",
        "7e2617a66594d8932013a5022b280c45 (16:56): b8810fee2f4a71f849f3f7409546d1d9: right, and you can find out by looking at other apps",
        "7e2617a66594d8932013a5022b280c45 (16:56): that apple has written, or looking at their docs",
        "7e2617a66594d8932013a5022b280c45 (16:56): but docs are always wrong or out of date for anything like this",
        "7e2617a66594d8932013a5022b280c45 (16:56): never gets all the details",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:56): ok",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:57): bloated the http://validator.nu/ UI with a new checkbox",
        "7e2617a66594d8932013a5022b280c45 (16:57): my big concern with spending a lot of resources on UA support in Mozilla is, how will we get Apple to change Voice Over when we need it, when obviously Safari is more important to them. I see a conflict of interest, but they aren't interested in open sourcing it",
        "7e2617a66594d8932013a5022b280c45 (16:57): So we might let Opera take the lead on that one :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:58): 7e2617a66594d8932013a5022b280c45: is hwaara actively working on it, though?",
        "7e2617a66594d8932013a5022b280c45 (16:58): b8810fee2f4a71f849f3f7409546d1d9: hwaara needed a real job instead of grants",
        "7e2617a66594d8932013a5022b280c45 (16:59): so he has stopped working on it",
        "7e2617a66594d8932013a5022b280c45 (16:59): we have a good start, though",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:59): ok. :-(",
        "7e2617a66594d8932013a5022b280c45 (16:59): b8810fee2f4a71f849f3f7409546d1d9: i think it's ok, one step at a time",
        "7e2617a66594d8932013a5022b280c45 (16:59): we're doing a ton",
        "7e2617a66594d8932013a5022b280c45 (17:00): but to be honest, if i had resources i'd consider putting them into ARIA support in WebKit first, because then we can influence Voice Over first",
        "7e2617a66594d8932013a5022b280c45 (17:00): once everything works well there, we'll know exactly what support in Mozilla should look like",
        "7e2617a66594d8932013a5022b280c45 (17:00): since my goal is a11y for the whole web",
        "73eaf221abca1b8244e34b0b9e76ac46 (17:15): b8810fee2f4a71f849f3f7409546d1d9: with http://validator.nu/?doc=http%3A%2F%2Fwww.accessifyforum.com%2F&amp;showsource=yes nothing is highlighted for the checkbox error",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:16): 73eaf221abca1b8244e34b0b9e76ac46: hmm. I had forgotten about that case. thanks",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:16): 73eaf221abca1b8244e34b0b9e76ac46: that's because the error is associated with a line",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:16): (as opposed to a character or a character range)",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:17): looks at the title attribute issue now",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:17): title.attrs =",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:17): ( empty )",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:17): whoa",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:20): 73eaf221abca1b8244e34b0b9e76ac46: fix for the common attrs on &lt;title&gt; issue deployed. thanks.",
        "73eaf221abca1b8244e34b0b9e76ac46 (17:20): b8810fee2f4a71f849f3f7409546d1d9: welcome :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:21): 73eaf221abca1b8244e34b0b9e76ac46: the reasons for lacking text field and file upload are three-fold:",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:22): 1) lack of UI design that works nicely without JS, with AT and doesn't bloat the default view",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:23): 2) handling file uploads doesn't come for free with servlets. instead I have to do so disruptive integration of a third-party library",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:23): 3) Should I force the user to pick the parser manually, when Content-Type is unavailable (text field) or unreliable (upload)?",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:24): oh, and #1 should be theoretically relatively pure, too, since it is easy to ridicule a validator that isn't theoretically pure",
        "73eaf221abca1b8244e34b0b9e76ac46 (17:25): 3) yes, although you could perhaps make a guess for upload and issue a warning if the user didn't choose",
        "73eaf221abca1b8244e34b0b9e76ac46 (17:25): based on e.g. file extension",
        "73eaf221abca1b8244e34b0b9e76ac46 (17:26): 2) ok, personally i think textarea is more useful than upload, so i would be happy with textarea but no upload :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:27): 73eaf221abca1b8244e34b0b9e76ac46: ok, for now, you can work around the lack of textarea using f139aba52f9fa1394b4034a7954b2220's front-end",
        "73eaf221abca1b8244e34b0b9e76ac46 (17:27): b8810fee2f4a71f849f3f7409546d1d9: yep",
        "73eaf221abca1b8244e34b0b9e76ac46 (17:28): 1) i can perhaps come with some ideas or a mockup later",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:29): cool",
        "73eaf221abca1b8244e34b0b9e76ac46 (17:29): i guess the js would have to be cluttered with two additional checkboxes in the default view when js is enabled",
        "73eaf221abca1b8244e34b0b9e76ac46 (17:29): (or buttons or whatever)",
        "73eaf221abca1b8244e34b0b9e76ac46 (17:29): s/js/ui/",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:30): 73eaf221abca1b8244e34b0b9e76ac46: the W3C Validator uses a tabbed UI, but they got AT compat complaints lately about the particular impl",
        "73eaf221abca1b8244e34b0b9e76ac46 (17:30): b8810fee2f4a71f849f3f7409546d1d9: ok",
        "f139aba52f9fa1394b4034a7954b2220 (17:32): one day, I'll clean up those tools of mine to be more useful for testing b8810fee2f4a71f849f3f7409546d1d9's validator.",
        "f139aba52f9fa1394b4034a7954b2220 (17:32): 73eaf221abca1b8244e34b0b9e76ac46, let me know if there are any changes I could make to it to improve it for you",
        "73eaf221abca1b8244e34b0b9e76ac46 (17:34): f139aba52f9fa1394b4034a7954b2220: i've used your upload tool as input for validator.nu (not html5.validator.nu) when i wanted to change preset or something",
        "f139aba52f9fa1394b4034a7954b2220 (17:35): maybe I could add a function to do that in one step for you, so it generates the page and redirects you to the validator with it immediately",
        "73eaf221abca1b8244e34b0b9e76ac46 (17:36): yeah, that would be cool",
        "f139aba52f9fa1394b4034a7954b2220 (17:36): I'll see if I can do it tomorrow",
        "73eaf221abca1b8244e34b0b9e76ac46 (17:37): ok",
        "f139aba52f9fa1394b4034a7954b2220 (17:37): I'm too exhaused to think about it now, I just got back from web directions",
        "73eaf221abca1b8244e34b0b9e76ac46 (17:37): no worries :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:38): I wonder when I would have been better off writing my own XML parser",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:39): starts patching the XML parser to work together with Show Source",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:41): oh, I need to get column counting right with the BOM.",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:41): no fun",
        "73eaf221abca1b8244e34b0b9e76ac46 (18:04): 7e2617a66594d8932013a5022b280c45: i think i'm gonna go ahead and change the spec to use the first aria role",
        "73eaf221abca1b8244e34b0b9e76ac46 (18:04): 7e2617a66594d8932013a5022b280c45: unless it's a problem to change it in firefox",
        "7e2617a66594d8932013a5022b280c45 (18:07): 73eaf221abca1b8244e34b0b9e76ac46: not a problem do pick out the aria role either",
        "7e2617a66594d8932013a5022b280c45 (18:07): first aria role",
        "7e2617a66594d8932013a5022b280c45 (18:07): whatever you decide",
        "7e2617a66594d8932013a5022b280c45 (18:07): first role is obviously easiest",
        "73eaf221abca1b8244e34b0b9e76ac46 (18:10): yeah. first token that doesn't have a colon or has a colon but starts with &quot;wairole:&quot;",
        "73eaf221abca1b8244e34b0b9e76ac46 (18:10): i think",
        "7e2617a66594d8932013a5022b280c45 (18:16): 73eaf221abca1b8244e34b0b9e76ac46: don't forget the xhtml role module roles have no prefix",
        "7e2617a66594d8932013a5022b280c45 (18:16): so that rule wouldn't work for role=&quot;navigation menu&quot;",
        "73eaf221abca1b8244e34b0b9e76ac46 (18:20): yeah, true. perhaps i instead need a table of all aria roles",
        "7e2617a66594d8932013a5022b280c45 (18:21): 73eaf221abca1b8244e34b0b9e76ac46: i have an array of wai-aria roles in alphabetical order. i think the most performant rule to implement might actually be:    1) get the role attribute, 2) for each aria role in alphabetical order, check to see if it is in the the role attribute",
        "7e2617a66594d8932013a5022b280c45 (18:22): that way you only have to iterate once",
        "7e2617a66594d8932013a5022b280c45 (18:22): but it's kind of a lame rule",
        "73eaf221abca1b8244e34b0b9e76ac46 (18:23): ok, so then it will pick up the second token if in &quot;checkbox alert&quot;?",
        "73eaf221abca1b8244e34b0b9e76ac46 (18:23): since alert is before checkbox in your array",
        "73eaf221abca1b8244e34b0b9e76ac46 (18:24): i'm ok with speccing that, just want to be clear that i understand it :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (18:28): that isn't particularly intuitive",
        "b8810fee2f4a71f849f3f7409546d1d9 (18:29): splitting on space and comparing the tokens one-by-one against the array using binary search would give more intuitive results",
        "73eaf221abca1b8244e34b0b9e76ac46 (18:29): yeah, that's what i intended to spec first",
        "73eaf221abca1b8244e34b0b9e76ac46 (18:30): but i don't have an opinion about which way is used, so long as it's defined :)",
        "73eaf221abca1b8244e34b0b9e76ac46 (18:31): i think that in 99% cases there will only be one value anyway",
        "73eaf221abca1b8244e34b0b9e76ac46 (18:33): ok, i'll catch some friday beer instead and spec it when i know which way you want to implement in firefox :)",
        "7e2617a66594d8932013a5022b280c45 (18:35): that's fine",
        "7e2617a66594d8932013a5022b280c45 (18:35): what b8810fee2f4a71f849f3f7409546d1d9 said, but i don't think we need to spec the binary search of course",
        "7e2617a66594d8932013a5022b280c45 (18:35): just spec that we use the first aria role",
        "7e2617a66594d8932013a5022b280c45 (18:36): 73eaf221abca1b8244e34b0b9e76ac46: but, role=&quot;presentation&quot; must be alone or it is ignored",
        "7e2617a66594d8932013a5022b280c45 (18:37): because it's inconsistent to say it's presentation + something else",
        "7e2617a66594d8932013a5022b280c45 (18:37): we check that separately in an earlier stage it would be fastest just to look for that in the string",
        "b8810fee2f4a71f849f3f7409546d1d9 (18:41): finds &quot;FIXME missing two end-of-buffer cases&quot; in the XML parser source..."
    ],
    "person_ids": [
        "d114be1698421a7cec050e2207d29631",
        "73eaf221abca1b8244e34b0b9e76ac46",
        "7e2617a66594d8932013a5022b280c45",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "f139aba52f9fa1394b4034a7954b2220"
    ]
}