{
    "id": "b36d79aaaea310e9bca85e33f268f343",
    "messages": [
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:31): wonders what makes b8810fee2f4a71f849f3f7409546d1d9 conclude that Mercurial is going to win out over Git",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:48): a9b326df4e6da61c5b6f5e1058be83a2: Mozilla choosing it and OpenJDK leaning towards it. And that there seems to be an Eclipse plug-in coming up.",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:48): IIRC, Technorati uses Mercurial, too.",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:48): whereas Git seems to be a kernel developer thing",
        "b8810fee2f4a71f849f3f7409546d1d9 (11:49): (I haven't experience with either myself.)",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (11:52): http://lists.w3.org/Archives/Public/public-forms-tf/",
        "a9b326df4e6da61c5b6f5e1058be83a2 (11:59): b8810fee2f4a71f849f3f7409546d1d9 - I've used mercurial and like it. Also bzr/Bazaar. The main advantage that Git seems to have over everything else is significantly faster performance for certain use cases. But seems like for many projects, it might be overkill in that for the use cases in which the performance differences are significant are not relevant to those projects",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:00): from what I understand, mainly seems to be important for projects/developers that regularly do a lot of merging",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:00): a9b326df4e6da61c5b6f5e1058be83a2: the feeling I get about what system is going where isn't about what they *do*. It seems to me that bzr in an Ubuntu thing and git is a kernel thing but Mercurial shows up in many places",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:01): I see",
        "d114be1698421a7cec050e2207d29631 (12:19): that's twice now phillip taylor has said something like 'damn lazy web designers'",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:20): they'll be lazy even if the spec vehemently asserts that they shouldn't be :-(",
        "d114be1698421a7cec050e2207d29631 (12:20): s/phillip/philip",
        "d114be1698421a7cec050e2207d29631 (12:21): well i count myself in the 'damn lazy webdesigners' group",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (12:22): http://www.google.com/search?q=%22the+lazy+web%22",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:23): often I don't disagree about what the ideal world would be but I disagree about making designs that require an ideal world. designs that work in a world where people don't behave in ideal ways are more robust",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (12:24): well said",
        "d114be1698421a7cec050e2207d29631 (12:25): alt tags on img are a pain",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (12:25): I almost never know what to write",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (12:26): They are mostly just there to illustrate the rest of the content so I opt for the empty string",
        "d114be1698421a7cec050e2207d29631 (12:27): me too",
        "d114be1698421a7cec050e2207d29631 (12:27): in fact i'm starting to just not use the img tag",
        "d114be1698421a7cec050e2207d29631 (12:27): if it's an image that simply illustrates the rest of the text",
        "d114be1698421a7cec050e2207d29631 (12:28): &lt;div id=&quot;img01&quot;&gt;If i want some fallback text i'll throw it in here.&lt;/div.",
        "d114be1698421a7cec050e2207d29631 (12:29): and use css",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:30): I except most of my alt texts to suck, because I didn't know how to make them not suck in a reasonable amount of thinking time",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (12:31): d114be1698421a7cec050e2207d29631, that's not really useful though for blogs",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (12:31): blog posts*",
        "d114be1698421a7cec050e2207d29631 (12:32): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: sure, but so far it seems to be useful when i want the html to have no images in it, say for mobile devices with low bandwidth/memory",
        "d114be1698421a7cec050e2207d29631 (12:32): and i can always put a link to the img in another location in the fallback text if it's needed",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:35): notes writing except instead of expect the second time on IRC in a few days",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:39): b8810fee2f4a71f849f3f7409546d1d9 - very true about not designing for an ideal world. I can say in my professional experience it is plain folly to design systems with the &quot;But no real user is ever going to do X&quot;, where you X is something you would never do yourself and so assume no user would ever be likely to try.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:39): Because some user will eventually do it, of course.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:41): At that point you can blame the idiot user all you want, or, say, explain as much as you want to the client/customer for whom you built that system that you had no way of predicting that a user would ever try that...",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:42): I'd like to see some of the people advocating that approach try to explain it to real customers.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:42): &quot;Well, we designed it that way because we didn't want to encourage people to be lazy.&quot;",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:43): back when I was doing my military service, I was tasked with the maintenance and UI implementation of a metadata spec",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:43): I got involved in the project too late and didn't have enough rank to turn the spec around",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:44): the attitude was that the military can require any metadata they please because they can order people into compliance",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:44): heh",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:44): order the sun to stop shining",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:45): making people to provide additional data that they don't want to provide doesn't work even in the military",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:45): people will find ways to route around systems that ask for stuff they don't want to provide",
        "d114be1698421a7cec050e2207d29631 (12:46): the alt tag isn't only data people don't want to provide, 9/10 it's data you can't provide",
        "d114be1698421a7cec050e2207d29631 (12:46): the phrase &quot;a picture is worth a thousand words&quot; springs to mind",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:47): d114be1698421a7cec050e2207d29631: yeah, the military metadata spec also initially asked for things that were *impossible* to provide correctly",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:47): (I won't go into details)",
        "d114be1698421a7cec050e2207d29631 (12:47): :)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:47): b8810fee2f4a71f849f3f7409546d1d9 - yeah, when my dad first joined the Air Force during the 1960s, he was on one of the ICBM missile crews, stationed in bunkers in Nebraska, and said that part of their hourly duties were in providing information on forms/checklists about all the stuff they were supposed to check each hour",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:48): most of which if they actually did it would have taken 2 hours to do",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:48): some of which was not even possible to do at all under the conditions",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:49): he said they &quot;complied by sharpened pencil&quot;, or something in those terms",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:49): said they kept plenty of sharp pencils around",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:49): to fill out all the checklists",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:50): without ever completing half of the tasks they were supposedly checking off as having been performed",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:53): anyway, on this note, I see that Kurt Cagle mentions HTML5 in something he wrote for his XML.com blog recently",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:53): http://www.oreillynet.com/xml/blog/2007/07/wheres_xml_going.html",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:53): have others already seen that?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:53): was there some discussion about it already?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:53): not that it's particularly important",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:53): but he wrote:",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:53): [[",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (12:53): I saw it",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:53): HTML 5 and Bindings. Note to the HTML camp - HTML 5.0 will be XML based, it‚Äôs just a question of how much core technology will separate it from XHTML 2. There is no valid reason for HTML not to close its tags, quote its attributes, and respect namespaces.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:54): ]]",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (12:54): Didn't think it was really relevant what he wrote though",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:54): e3fb62ebfa4f36acf5cbff6a6ed0f2e0 - I don't know where he's coming from with that.",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (12:54): It's provably false per our charter...",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:54): yep",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (12:55): and a solved issue. I agree that a potential bigger debate is about XForms vs WF2 and such",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:55): wow -- just looking outside now ... absolutely beautiful sunset in Tokyo tonight",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:56): e3fb62ebfa4f36acf5cbff6a6ed0f2e0 - right",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:56): it seems to me that Kurt Cagle is missing the point on what were are doing and what we must do with text/html",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:56): that is, an XML parser isn't an option",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:57): b8810fee2f4a71f849f3f7409546d1d9 - It seems that way, but I should really think he ought to know better.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:57): but maybe he doesn't",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:58): I think we should marked HTML5 (in the text/html sense) as an alternative infoset serialization for an extended subset of infosets when we talk to people who are doing XML-oriented stuff",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:58): I still run into a lot of otherwise apparently quite smart people who don't really seem to understand much about how browsers really work.",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:58): s/marked/market/",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:58): heh",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:59): I guess that might help",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (12:59): hmm, Jason White missed my point it seems",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (12:59): (and I actually didn't make a point, I just &quot;quoted&quot; one",
        "d114be1698421a7cec050e2207d29631 (13:00): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: he missed the point you didn't make by quite some mark...",
        "d114be1698421a7cec050e2207d29631 (13:02): but i like that he mentioned mobile devices :)",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (13:04): I was thinking of citing several examples to back up the point I didn't make. Such as what tricks we have to perform to make content render properly on phones. Or what weird stuff some sites use that will only make them function in IE, etc.",
        "d114be1698421a7cec050e2207d29631 (13:16): i've been trying to get across in here that most web designers do not have the luxury of time needed to go through the hoops for mobile design"
    ],
    "person_ids": [
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0",
        "d114be1698421a7cec050e2207d29631"
    ]
}