{
    "id": "b385356fe8b0333a0302e0cfe3a83db7",
    "messages": [
        "e62bb6af9dbb2303eec071dea40226cd (23:06): I'm struggling a bit with the difference and implications of setting the maxThread param on the http connector and how it interacts with the acceptCount param",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:06): acceptCount is the server socket accept queue.",
        "e62bb6af9dbb2303eec071dea40226cd (23:06): maxThreads, as the docs say, &quot;determines the maximum number of simultaneous requests that can be handled&quot;",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:07): The threads are in a thread pool.",
        "e62bb6af9dbb2303eec071dea40226cd (23:07): is there a recommended ratio between the two",
        "e62bb6af9dbb2303eec071dea40226cd (23:07): say, if I have 200 maxThreads, should acceptCount be 200 / x ?",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:08): The pool is populated with minSpareThreads threads first.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:08): Then Tomcat starts serving requests.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:09): If it finds that all threads are being used, it starts to create more threads and add them to the pool (*while* trying to serve requests.. sometimes that's a bad idea).",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:10): It will create more threads for the thread pool up to the maxThreads limit.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:10): Once it reaches maxThreads, that's as many as it will create, regardless of the traffic load.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:10): Whenever the load decreases, Tomcat tries to determine if it still needs as many threads as it has instantiated and running.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:11): If it knows it doesn't need them all, it ends some threads to decrease the count in the pool.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:11): It will decrease them until it reaches the lower bound of minSpareThreads again.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:12): It can keep going up and down like that, creating and then ending threads while serving requests, as long as there is diff between minSpareThreads and maxThreads.",
        "e62bb6af9dbb2303eec071dea40226cd (23:12): when maxThreads is reached, will the client get a &quot;connection refused&quot;?",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:13): So, on busy servers where you already know that you'll usually want it to hang out at maxThreads, you should set minSpareThreads and maxThreads to the same value so that it never spends CPU time going up and down with the thread count.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:13): No, it will only give a client a connection refused message if the accept queue is smaller than the number of waiting incoming client socket connections that have not yet been assigned a thread from the thread pool.",
        "ad7e25107704cb85b75f6a1ecaeaede5 (23:14): hello",
        "ad7e25107704cb85b75f6a1ecaeaede5 (23:14): can tomcat do vhosting?",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:14): The client sockets sit in the accept queue waiting for a thread.  Once one is free in the thread pool, it is taken out of the accept queue and assigned the thread.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:14): caverdude: Yes.",
        "ad7e25107704cb85b75f6a1ecaeaede5 (23:14): how hard is it to setup tomcat with the regular apache web server?",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:15): But, if there are no threads available in the pool to assign to the client socket, the client sockets stack up in the accept queue, waiting.",
        "ad7e25107704cb85b75f6a1ecaeaede5 (23:15): hrm ok",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:15): If too many stack up in there, you'll exceed your acceptCount value, and the very next request socket will get a connection refused message.",
        "ad7e25107704cb85b75f6a1ecaeaede5 (23:15): what does that mean for the client trying to access one site or another?",
        "ad7e25107704cb85b75f6a1ecaeaede5 (23:15): from the clients point of view?",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:16): So, it's generally a good idea to set the queue size larger, and then make sure that they never stack up that high in the queue by making sure there are enough threads to handle the load.",
        "e62bb6af9dbb2303eec071dea40226cd (23:16): so setting the acceptCount fairly high, may cause the client to see &quot;slow response times&quot;, but would help ensure that they get their request fulfilled",
        "ad7e25107704cb85b75f6a1ecaeaede5 (23:16): ok",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:17): Actually, setting the accept queue high doesn't really impact how slow response times are.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:17): It's how available request processor threads are.",
        "ad7e25107704cb85b75f6a1ecaeaede5 (23:17): I'm thinking of running several domains on a single running instance of tomcat, they should not get heavy traffic",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:17): I don't actually know good reasons for setting the accept queue size low.  :)",
        "e62bb6af9dbb2303eec071dea40226cd (23:18): right. The requests take a *long* time with our app. Right now we have maxThreads at 150, acceptCount at 100",
        "ad7e25107704cb85b75f6a1ecaeaede5 (23:18): long meaning? seconds? minutes?",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:19): I guess setting accept count lower will have the effect of intentionally &quot;spilling&quot; some of the traffic off of your server so it won't be so crushed under the load.. but most people find it unacceptable for a web site to give a connection refused message.  :)",
        "e62bb6af9dbb2303eec071dea40226cd (23:19): it's sending about 15-20MB of data to the client. Appears to be taking about 40-200 seconds",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:19): jmonstad: I'd set the accept count higher.  IIRC the limit is 255?  Or something like that.  I'd set it to 200.  You have nothing to lose.",
        "e62bb6af9dbb2303eec071dea40226cd (23:20): will do. It also sounds like the minSpareThreads param could be close to the maxThreads",
        "e62bb6af9dbb2303eec071dea40226cd (23:21): at least 150 clients will hit the server at the exact same time, and there's no reason to waste resources creating new threads",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:21): Right.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:21): That just makes performance worse.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:22): Same with the JVM memory settings -Xmx and -Xms.. make the exactly the same number so that it never needs to change.",
        "e62bb6af9dbb2303eec071dea40226cd (23:26): jasonb: Thank you so much for helping me understand some of this stuff better...",
        "e62bb6af9dbb2303eec071dea40226cd (23:27): on a general note.. Any Tomcat guru's on this channel local to minneapolis?",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:30): jmonstad: You're welcome.  I think I documented some of this in the O'Reilly Tomcat book (first edition, so far).",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:31): jmonstad: Other than that, you're not likely to find much info about it anywhere except on the tomcat-dev mailing list, and even then it may not be easily readable.",
        "e62bb6af9dbb2303eec071dea40226cd (23:31): will definitively need to get that one. I'm not even the server admin.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:32): It's somewhat outdated now, but I'm updating it, and the second edition will be out early '07.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:32): Lots of the explanatory text in there still does apply though.",
        "e62bb6af9dbb2303eec071dea40226cd (23:33): Like I alluded to above, I'm also willing to get my company to spend some money on getting training and possible some consulting",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:33): If you hang out in this channel, and ask periodically, I'm sure there are people who could help with that.",
        "e62bb6af9dbb2303eec071dea40226cd (23:34): I'd think so.. :-)",
        "e62bb6af9dbb2303eec071dea40226cd (23:36): opensource &amp; free help is great, but I think companies need to contribute back. If not with code/bug fixes, etc, then at least they should try to spend some cash for consultinh/training/support, etc whenever they can.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:38): It does help.",
        "e62bb6af9dbb2303eec071dea40226cd (23:38): buying your book is the very least i can do right now (and we really should have it anyway :-) )",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:39): The book really isn't that expensive, and it's packed with zillions of answers that you'd otherwise have to spend your time ( = money!) searching for the answers.",
        "e62bb6af9dbb2303eec071dea40226cd (23:40): yep.",
        "e62bb6af9dbb2303eec071dea40226cd (23:40): gotta run... thanks again for your help jasonb...",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:40): The book has lots of plain english text about how things work.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:40): Okay, you're welcome.",
        "2a78e4ddb897d821d45a3ba9ce2078d5 (23:40): See ya."
    ],
    "person_ids": [
        "e62bb6af9dbb2303eec071dea40226cd",
        "2a78e4ddb897d821d45a3ba9ce2078d5",
        "ad7e25107704cb85b75f6a1ecaeaede5"
    ]
}