{
    "id": "b5c5a1dab780ba4c0c026dbf7222c1ef",
    "messages": [
        "60659cfda992013e610f285c46692d28 (14:26): 139513027e8e90b5582cbc68fc733884, trying to understand: *can* there be a FO before a WG decision is made? Did we have a WG decision so far?",
        "139513027e8e90b5582cbc68fc733884 (14:28): 60659cfda992013e610f285c46692d28: we have not had a Working Group decision to publish yet, and my understanding of the Process is that a Formal Objection can only be raised against a decision, not against a proposal",
        "139513027e8e90b5582cbc68fc733884 (14:28): though not everyone has had the same interpretation as me, for example I recall Dan Connoly generally chose to let people raise a Formal Objection as part of a poll or vote before a decision was made",
        "139513027e8e90b5582cbc68fc733884 (14:29): in fact, at one point I recall that he wanted to interpret every &quot;no&quot; vote as a Formal Objection, even if the person voting no did not use those words and did not state a rationale",
        "60659cfda992013e610f285c46692d28 (14:29): ok, thanks. that confirms what I thought. It appears we should stop then to argue about whether there was a FO, or an announcement there might be a FO",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (14:31): with &quot;we&quot; you mean &quot;you&quot;?",
        "3f2728ff0e4caa0793d43c6fb124e333 (14:31): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: I think 60659cfda992013e610f285c46692d28 meant something more like &quot;us&quot;",
        "60659cfda992013e610f285c46692d28 (14:32): by &quot;we&quot; I mean &quot;us, the WG members, the chairs, and the W3C team&quot;",
        "60659cfda992013e610f285c46692d28 (14:33): Anne, not sure what you're talking about.",
        "139513027e8e90b5582cbc68fc733884 (14:33): I think Larry pretty clearly stated that he did not raise a Formal Objection (via email on the 12th)",
        "139513027e8e90b5582cbc68fc733884 (14:33): I am happy to take him at his word",
        "60659cfda992013e610f285c46692d28 (14:34): ok, so that's settled then.",
        "139513027e8e90b5582cbc68fc733884 (14:34): however, he did make an objection which is being taken to the Director, and I would like to understand what kind of objection besides a Formal Objection goes to the Director and what the requirements, if any, are for raising such an objection",
        "139513027e8e90b5582cbc68fc733884 (14:35): independent of working out the remaining details of publication",
        "60659cfda992013e610f285c46692d28 (14:35): 139513027e8e90b5582cbc68fc733884, sure. why don't my objections go to the director as well? :-) I object!",
        "a924fb58d2c25874322f4e5126f608b9 (14:35): 60659cfda992013e610f285c46692d28: Apparently you have to tell 3f2728ff0e4caa0793d43c6fb124e333",
        "a924fb58d2c25874322f4e5126f608b9 (14:35): He is the gatekeeper",
        "3f2728ff0e4caa0793d43c6fb124e333 (14:36): yes, like in the John Carpenter movie",
        "a924fb58d2c25874322f4e5126f608b9 (14:36): What do you do if you want to complain that the team contact isn't giving you due process?",
        "139513027e8e90b5582cbc68fc733884 (14:36): 60659cfda992013e610f285c46692d28: I am in fact concerned that everyone will decide they should appeal everything they disagree with straight to the Director without raising a Formal Objection",
        "139513027e8e90b5582cbc68fc733884 (14:36): that would probably not be a good way to run the Working Group",
        "3f2728ff0e4caa0793d43c6fb124e333 (14:37): 139513027e8e90b5582cbc68fc733884: a number of us would agree with you there",
        "60659cfda992013e610f285c46692d28 (14:37): understood and agreed",
        "3f2728ff0e4caa0793d43c6fb124e333 (14:37): 139513027e8e90b5582cbc68fc733884:  minus the word &quot;probably&quot;, even",
        "139513027e8e90b5582cbc68fc733884 (14:39): on the topic of FOs in general though, Martin Kliehm did make an objection which he said was a Formal Objection, which I would probably interpret as giving us notice of his intent to formally object, should the WG decision go against him",
        "60659cfda992013e610f285c46692d28 (14:41): yep, but although I sympathize with his position the obejction itself seems to be on shaky grounds",
        "139513027e8e90b5582cbc68fc733884 (14:42): I have a dream that someday, we'll publish a set of Working Drafts and there will be no drama or controversy",
        "a924fb58d2c25874322f4e5126f608b9 (14:42): There doesn't seem to be any filtering of unviable formal objections, though.",
        "a924fb58d2c25874322f4e5126f608b9 (14:42): The only statement is that the director might not consider it seriously, but it still goes directly to the director",
        "139513027e8e90b5582cbc68fc733884 (14:43): a924fb58d2c25874322f4e5126f608b9: if the person doesn't self-filter, I think the Chairs are required to report it to the Director, at the latest by the next transition request",
        "139513027e8e90b5582cbc68fc733884 (14:44): the only requirements are should-level: &quot;An individual who registers a Formal Objection should cite technical arguments and propose changes that would remove the Formal Objection; these proposals may be vague or incomplete.&quot;",
        "a924fb58d2c25874322f4e5126f608b9 (14:44): Yup",
        "139513027e8e90b5582cbc68fc733884 (14:44): but I expect that at least in this WG, the Chairs would flag any Formal Objection that they did not think met the should-level requirement",
        "139513027e8e90b5582cbc68fc733884 (14:45): (we would probably also ask the objector to attempt to meet the requirements first)",
        "a924fb58d2c25874322f4e5126f608b9 (14:45): I don't think the end result of the objection is the problem. Rather that more weight is given to FOs than necessary",
        "a924fb58d2c25874322f4e5126f608b9 (14:46): E.g. letting them interfere with releasing new drafts that don't include a transition",
        "139513027e8e90b5582cbc68fc733884 (14:47): FPWD is a transition",
        "3f2728ff0e4caa0793d43c6fb124e333 (14:47): 139513027e8e90b5582cbc68fc733884: as far as the current particular case, I think one way of describing the status at this point is, we find ourselves in a position where we need to wait for some review of the current situation by the Director, and in hindsight we maybe could have prevented ourselves from getting here, but we didn't, and we now do really need to wait to get some council/guidance from the Director",
        "139513027e8e90b5582cbc68fc733884 (14:47): 3f2728ff0e4caa0793d43c6fb124e333: I agree that is the current status",
        "139513027e8e90b5582cbc68fc733884 (14:48): I believe all three of the chairs agree that is the current status",
        "3f2728ff0e4caa0793d43c6fb124e333 (14:48): but I do fully want to ensure we don't find ourselves in this situation again",
        "139513027e8e90b5582cbc68fc733884 (14:50): I am sorry if it sounded like I was complaining; my priorities at this point are just (a) get input from the Director so we can proceed with full clarity; and (b) see if we can improve how things work in the future",
        "139513027e8e90b5582cbc68fc733884 (14:50): (in that order)",
        "60659cfda992013e610f285c46692d28 (14:51): I think part of the problem is/was trying to do too much at the same time",
        "3f2728ff0e4caa0793d43c6fb124e333 (14:52): 139513027e8e90b5582cbc68fc733884: I didn't take it that you were complaining, and didn't mean to imply it, and fully agree that the goals should definitely be the (a) and (b) you list",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:54): 60659cfda992013e610f285c46692d28: I disagree and concur with http://lists.w3.org/Archives/Public/public-html/2010Feb/0383.html",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:55): 60659cfda992013e610f285c46692d28: I disagree with you and concur with sicking, that is",
        "60659cfda992013e610f285c46692d28 (14:55): Henri, you may have noticed that I agreed with Jonas as well",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:02): 60659cfda992013e610f285c46692d28: I meant I disagreed that the problem was trying to do too much at the same time.",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (15:06): did anyone look into the multipart/form-data thingy 60659cfda992013e610f285c46692d28 brought up?",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (15:07): i.e. sicking said he was re-implementing form submission...",
        "a924fb58d2c25874322f4e5126f608b9 (15:07): People who object to a certain activity would probably consider any work on that doing too much",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (15:07): it's somewhat important for the FormData object",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:07): I thought sicking was cleaning it up but not reimplementing",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (15:07): oh ok",
        "60659cfda992013e610f285c46692d28 (15:09): Anne, if there are problems with that RFC I recommend (a) reporting the errata, and (b) discussing this on IETF apps-discuss. It appears that a revision of the RFC might be needed (even if it's only details).",
        "60659cfda992013e610f285c46692d28 (15:11): right now it has only a single erratum, and that's an editorial nit reported by me :-)",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (15:13): to be honest I've plenty of other things to do",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (15:13): it's just that XHR depends on it now and you reported some interop issue on public-html a while back",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (15:13): since it was about encoding data it might affect stuff I guess",
        "60659cfda992013e610f285c46692d28 (15:15): understood.",
        "60659cfda992013e610f285c46692d28 (15:16): but if you are aware or become aware of more issues please raise them in some way so that I notice",
        "60659cfda992013e610f285c46692d28 (15:16): If Jonas is re-implementing this it would be cool if he can compare his impl with what the spec says"
    ],
    "person_ids": [
        "60659cfda992013e610f285c46692d28",
        "139513027e8e90b5582cbc68fc733884",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0",
        "3f2728ff0e4caa0793d43c6fb124e333",
        "a924fb58d2c25874322f4e5126f608b9",
        "b8810fee2f4a71f849f3f7409546d1d9"
    ]
}