{
    "id": "ba745be839eb9eaa03e8f78da246666f",
    "messages": [
        "738a97ad2084aecd3dbffe284d09c3b8 (22:27): help, how to fix this? <a href=\"http://tinyurl.com/cx7h8\">http://tinyurl.com/cx7h8</a>",
        "2a0be8d62ca9580cd38315202869a51a (22:29): on't follow that url, btw.  I don't know what it is thanks to my flashblock lpugin, but it appears to be some kind of &quot;shock&quot; site according to the text, so it's probably somethign disgusting",
        "1273bb29f2c396ce65fdb06f5280ac1c (22:32): hehe, something like &quot;Help, cant get this to work.. how to fix <a href=\"http://www.ran\">http://www.ran</a> dom gay pron web site.com&quot; (but then without spaces ;) )",
        "f7a2868bae984208d75b90d06e14f23d (22:35): hello, how can i open some ports only from some ips ? for example i have ips from 10.10.1.1 to 10.10.10.255 and i want to open port 137 only for ips betwen 10.10.1.131 and 10.10.1.239 ?",
        "2a0be8d62ca9580cd38315202869a51a (22:36): you can use the iprange module",
        "2a0be8d62ca9580cd38315202869a51a (22:37): I think, at least it is in my iptables man page",
        "7d470a1090d276ef41573c2a940df92a (22:38): hell",
        "7d470a1090d276ef41573c2a940df92a (22:38): o",
        "f7a2868bae984208d75b90d06e14f23d (22:39): good :) thanks :D i found on google iprange",
        "f2b1685abac4fd418ceeb7ce9670ff28 (22:57): if I have a server that has one external interface (to INTERNET) and one internal, is NATing done only at POSTROUTING chain and not done in the INcoming? ie PREROUTING?",
        "1273bb29f2c396ce65fdb06f5280ac1c (22:58): postrouting is for outgoing, prerouting is for incomming nat",
        "1273bb29f2c396ce65fdb06f5280ac1c (22:58): (at least, thats the way it works for me)",
        "f2b1685abac4fd418ceeb7ce9670ff28 (22:58): umm isnt NATing suppose to be done both ways? im confused on this",
        "1273bb29f2c396ce65fdb06f5280ac1c (22:59): dunno, i've got the entire inside range allowed to go outside",
        "1273bb29f2c396ce65fdb06f5280ac1c (22:59): but i'm not that much of an expert at all :P",
        "1273bb29f2c396ce65fdb06f5280ac1c (22:59): anyway, i've got to run",
        "1273bb29f2c396ce65fdb06f5280ac1c (22:59): bbl",
        "397d64e4568a6d590d8bbae2ab48d54c (23:03): I'm trying to understand why port forwarding is done a certain way.  The rules that I supposedly have to add are:",
        "397d64e4568a6d590d8bbae2ab48d54c (23:03): iptables -t nat -A PREROUTING -d &lt;external IP&gt; -p tcp --dport 80 -j DNAT --to-destination &lt;internal IP of HTTP server&gt;",
        "397d64e4568a6d590d8bbae2ab48d54c (23:03): iptables -t nat -A OUTPUT -d &lt;external IP&gt; -p tcp --dport 80 -j DNAT --to-destination &lt;internal IP of HTTP server&gt;",
        "397d64e4568a6d590d8bbae2ab48d54c (23:03): iptables -t nat -A POSTROUTING -s &lt;internal IP address range&gt; -d &lt;internal IP of HTTP server&gt; -p tcp --dport 80 -j SNAT --to-source &lt;internal IP of NAT box&gt;",
        "397d64e4568a6d590d8bbae2ab48d54c (23:03): The offered rationale is: rule 1 lets external IPs (from the Internet) reach the HTTP server, rule 2 lets the NAT box reach the HTTP server, and rule 3 lets internal IPs (from the home network) reach the HTTP server via its external address.",
        "de76c8e6cbbc3c1c44788a340cac141e (23:04): yes, that's correct",
        "397d64e4568a6d590d8bbae2ab48d54c (23:04): Rule 1 and 2 seem to be simple substitution.  Just replace the destination with the right internal IP before routing.",
        "397d64e4568a6d590d8bbae2ab48d54c (23:06): Rule 3 is giving me a headache.  It's not that it doesn't work (I don't have a HTTP server up yet to try it, I'm just trying to understand), I'm just having trouble understanding how it's supposed to work.  Why is it in rule 3 that the desination is the /internal/ IP of the HTTP server?  Shouldn't it be the external IP, like all the other rules?  That's what we'd be trying to contact right?",
        "de76c8e6cbbc3c1c44788a340cac141e (23:06): the DNAT translation happens before the packets gets to the POSTROUTING",
        "397d64e4568a6d590d8bbae2ab48d54c (23:07): Why do we point it at the internal IP of the NAT box?  I assume this is some why of returning packets where they wouldn't normally go, so it can send it back along some NAT chain?",
        "de76c8e6cbbc3c1c44788a340cac141e (23:07): yes, that's the reason",
        "397d64e4568a6d590d8bbae2ab48d54c (23:07): Yes I've looked at the diagram.",
        "7d470a1090d276ef41573c2a940df92a (23:07): hi",
        "d949efae795da71ef603b60b018d191c (23:07): hola, Taube.",
        "de76c8e6cbbc3c1c44788a340cac141e (23:08): otherwise, the webserver will reply directly to the client, which wasn't expecting a reply from the webserver's internal IP",
        "397d64e4568a6d590d8bbae2ab48d54c (23:09): I can see that stuff floats in from the internet interface.  Then goes to the mangle table prerouting chain, then the nat table prerouting chain.  It hits rule 1, then gets passed off to the HTTP server.  Due to DNAT &quot;remembering&quot; who started a stream, I assume that's all it needs to get back out to the internet (i.e. my masquerade/SNAT rule in the nat table postrouting chain is not applied?).",
        "de76c8e6cbbc3c1c44788a340cac141e (23:10): correct",
        "397d64e4568a6d590d8bbae2ab48d54c (23:10): blumber, if you'll wait a few minutes I think I can answer your question",
        "f2b1685abac4fd418ceeb7ce9670ff28 (23:10): okay",
        "de76c8e6cbbc3c1c44788a340cac141e (23:10): only the first packet of a connection goes through the NAT table",
        "397d64e4568a6d590d8bbae2ab48d54c (23:13): Hmm, let me look at the diagram again...",
        "397d64e4568a6d590d8bbae2ab48d54c (23:13): So this means that any given connection can only possibly hit /one/ NAT chain, right?",
        "de76c8e6cbbc3c1c44788a340cac141e (23:14): at most one DNAT and at most one SNAT",
        "de76c8e6cbbc3c1c44788a340cac141e (23:14): it's possible to hit one of each",
        "f2b1685abac4fd418ceeb7ce9670ff28 (23:14): dani4eldg: 1st packet only? 1500 bytes of it?",
        "de76c8e6cbbc3c1c44788a340cac141e (23:14): usually the first packet is like 60 bytes because it's a SYN",
        "397d64e4568a6d590d8bbae2ab48d54c (23:16): Hmm...  Well, I can see how hitting rule 1 (DNAT), and my masquerading/SNAT rule (not shown), wouldn't hurt anything, since it all ends up pretending to be from the NAT box address anyway.",
        "397d64e4568a6d590d8bbae2ab48d54c (23:18): Since you've been waiting around a bit blumber I'll take a shot at answering your question...  From what I can tell, netfilter remembers what packets go with what connection (hence the term connection tracking).  You've got many internal IPs, and only one external.  So all replies go to the external IP (there's no other possability), hence you don't need something in the prerouting chain.",
        "de76c8e6cbbc3c1c44788a340cac141e (23:18): it won't hurt anything except your webserver logs",
        "de76c8e6cbbc3c1c44788a340cac141e (23:19): yes, that's right; the actual &quot;remembering&quot; is recorded in /proc/net/ip_conntrack",
        "397d64e4568a6d590d8bbae2ab48d54c (23:19): But you need something in the postrouting chain, because you have lots of separate internal IPs trying to use the same external IPs, and you need something to keep straight who's connected to what, and that &quot;thing&quot; is either masquerade or source network address translation.",
        "397d64e4568a6d590d8bbae2ab48d54c (23:21): The diagram helps a lot, showing what goes through what chains when.  Outgoing packets never see the prerouting chain.  So again, you don't need anything special for them to share an IP.  They /do/ see the postrouting chain, so, again, you need masquerade or SNAT there.",
        "397d64e4568a6d590d8bbae2ab48d54c (23:21): Did that answer your question?",
        "397d64e4568a6d590d8bbae2ab48d54c (23:23): danielg: On this first packet thing...",
        "de76c8e6cbbc3c1c44788a340cac141e (23:24): yes?",
        "397d64e4568a6d590d8bbae2ab48d54c (23:24): If the NAT table only sees the first packet, how can it be both DNAT'ed and SNAT'ed?  Can you use DNAT or SNAT somewhere other than the NAT table?  There obviously can't be more than one &quot;first&quot; packet.",
        "f2b1685abac4fd418ceeb7ce9670ff28 (23:25): schlick: umm it just seems that am only NATing the internal and not the external incoming when I dont have anything on nat PREROUTING",
        "de76c8e6cbbc3c1c44788a340cac141e (23:25): the same first packet goes through PREROUTING and POSTROUTING",
        "397d64e4568a6d590d8bbae2ab48d54c (23:27): blumber: Well, here's what's happening.  Let's say you have external IP 111.111.111.111 (please just pretend).  Internally you have computers 192.168.0.2 and 192.168.0.3 behind your NAT box.  The NAT box is 192.168.0.1 as far as they're concerned.",
        "397d64e4568a6d590d8bbae2ab48d54c (23:28): So the computer with the network interface card with the IP 192.168.0.2 says, I wanna look at <a href=\"http://www.stuff.com/\">http://www.stuff.com/</a>",
        "f2b1685abac4fd418ceeb7ce9670ff28 (23:29): go on..",
        "397d64e4568a6d590d8bbae2ab48d54c (23:30): The packet slips into 192.168.0.1's mangle prerouting chain, nat prerouting chain, mangle forward chain, mangle filtering chain, and mangle postrouting chain.  And so far (since you have no fancy pants rules) nothing happens.  [Again, you may have fancy pants rules, please just play along.]",
        "397d64e4568a6d590d8bbae2ab48d54c (23:31): But the last thing it hits, is the nat postrouting chain, where it meets your masquerade or SNAT rule, that makes everything look like it's coming from 111.111.111.111 rather than 192.168.0.2 which is the computer that made the request!",
        "397d64e4568a6d590d8bbae2ab48d54c (23:32): So then it floats out onto the internet and ends up finding its way to www.stuff.com",
        "f2b1685abac4fd418ceeb7ce9670ff28 (23:32): but the response coming back has to hit nat prerouting first noh?",
        "397d64e4568a6d590d8bbae2ab48d54c (23:33): www.stuff.com packages its webpage up in packets and sends it  off to 111.111.111.111 since that's, as far as it can tell, where the connection came from (remember your masquerade/SNAT rule).",
        "397d64e4568a6d590d8bbae2ab48d54c (23:34): So the packets arrive at 111.111.111.111 and your NAT box says &quot;golly, I do believe someone was asking for packets from www.stuff.com&quot;.  It looks up in its data structures who that was, and finds 192.168.0.2.  Then passes them back to 192.168.0.2 on your internal network.",
        "397d64e4568a6d590d8bbae2ab48d54c (23:34): And we all lived happily ever after.",
        "397d64e4568a6d590d8bbae2ab48d54c (23:34): Did that help? :)",
        "f2b1685abac4fd418ceeb7ce9670ff28 (23:35): sort of..am I wrong to think that all packets coming in must go through nat prerouting?",
        "de76c8e6cbbc3c1c44788a340cac141e (23:36): maxine: packet flow",
        "d949efae795da71ef603b60b018d191c (23:36): packet flow is <a href=\"http://xkr47.outerspace.dyndns.org/netfilter/packet_flow/packet_flow9.png\">http://xkr47.outerspace.dyndns.org/netfilter/packet_flow/packet_flow9.png</a> or for the link layer, <a href=\"http://ebtables.sourceforge.net/br_fw_ia/PacketFlow.png\">http://ebtables.sourceforge.net/br_fw_ia/PacketFlow.png</a>",
        "397d64e4568a6d590d8bbae2ab48d54c (23:36): Well, I'm not real clear on that myself, but let's pretend they did.",
        "397d64e4568a6d590d8bbae2ab48d54c (23:36): Further, let's pretend you don't have any nat prerouting rules.",
        "397d64e4568a6d590d8bbae2ab48d54c (23:36): Because you don't need them.",
        "397d64e4568a6d590d8bbae2ab48d54c (23:37): You're not trying to split out incoming connections.  All you're trying to do is join outgoing ones.  You don't need any prerouting rules.",
        "397d64e4568a6d590d8bbae2ab48d54c (23:37): You /do/ need a nat postrouting rule to join those connections, so everything looks like it's coming from 111.111.111.111 no matter how many computers you have on your home network (or whatever).",
        "f2b1685abac4fd418ceeb7ce9670ff28 (23:38): i have to digest this further..thank you for the explanation and link to that packet flow..",
        "f2b1685abac4fd418ceeb7ce9670ff28 (23:38): ill capture this convo and re-read it...",
        "f2b1685abac4fd418ceeb7ce9670ff28 (23:38): thanks for now",
        "397d64e4568a6d590d8bbae2ab48d54c (23:39): Okay, danielg, I think I need to absorb this &quot;only the first packet&quot; thing.",
        "de76c8e6cbbc3c1c44788a340cac141e (23:40): use LOG rules - they help you figure out what packets are going by the rule at a given time",
        "397d64e4568a6d590d8bbae2ab48d54c (23:44): Well, to be honest, that's not my problem.",
        "397d64e4568a6d590d8bbae2ab48d54c (23:45): I need to play with Ethereal/Wireshark some more to familiarize myself with packet entrials.  I have no problem understanding the notion of &quot;a connection&quot;, and its direction in TCP terms, or the idea of DNAT or SNAT.",
        "397d64e4568a6d590d8bbae2ab48d54c (23:45): What's bugging me is in the 3 rules that I showed you, everything looks fine in rules 1 and 2.  It looks like simple substitution (along with connection tracking).",
        "397d64e4568a6d590d8bbae2ab48d54c (23:46): What's eating at me is the /IP's/ seem all wrong.",
        "397d64e4568a6d590d8bbae2ab48d54c (23:46): iptables -t nat -A POSTROUTING -s &lt;internal IP address range&gt; -d &lt;internal IP of HTTP server&gt; -p tcp --dport 80 -j SNAT --to-source &lt;internal IP of NAT box&gt;",
        "397d64e4568a6d590d8bbae2ab48d54c (23:46): Ok, the internal address range bit makes perfect sense, since that's the thing we're trying to make go.",
        "397d64e4568a6d590d8bbae2ab48d54c (23:47): But it seems to me like if I was trying to connect to my foobar.somewheres.com external address I'd be putting the external address /not/ the internal IP of the HTTP server there.  And then there's the bouncing it at the NAT box bit...  I don't see how that helps me get to the web server at all.",
        "397d64e4568a6d590d8bbae2ab48d54c (23:48): My guess is there's rule interaction.",
        "397d64e4568a6d590d8bbae2ab48d54c (23:48): I'm bouncing it at the NAT box so the rule that handles passing things from the nat box to the web server takes over.",
        "397d64e4568a6d590d8bbae2ab48d54c (23:49): But if that's so, it still doesn't explain why I'm writing a rule to match my internal addresses (that part seems okay) connecting to the internal IP of the HTTP server (which is not what it's supposed to fix, it's supposed to let me connect to the /external/ IP of the HTTP server)?",
        "397d64e4568a6d590d8bbae2ab48d54c (23:52): I don't doubt that it works (everyone seems to be saying that it does), and I can't test it since I currently only have one computer to work with.  I'm trying to understand because in the relatively short term future I will have more than one computer and need to know how to do this.  Like I said rules 1 and 2 make sense to me.  It's rule 3's IPs that are bothering me.",
        "397d64e4568a6d590d8bbae2ab48d54c (23:53): Can you enlighten me danielg?",
        "397d64e4568a6d590d8bbae2ab48d54c (23:58): danieldg: Still there?",
        "d949efae795da71ef603b60b018d191c (23:59): there is no way to do that.",
        "1273bb29f2c396ce65fdb06f5280ac1c (23:59): lol",
        "5e805b4fae3eea020c1ddf755fb7b365 (00:02): sup",
        "5e805b4fae3eea020c1ddf755fb7b365 (00:02): can i ask a Question?",
        "5e805b4fae3eea020c1ddf755fb7b365 (00:02): if i want to change my network settings",
        "5e805b4fae3eea020c1ddf755fb7b365 (00:02): i got 3 nic on my server.. 2 of them are in bridge mode (Br0). with a static ip 192.168.1.1",
        "5e805b4fae3eea020c1ddf755fb7b365 (00:02): the network looks like",
        "5e805b4fae3eea020c1ddf755fb7b365 (00:02): lan &lt;--&gt; Br0(eth0+eth1) &lt;--&gt; nat &lt;--&gt; eth2 &lt;--&gt; (Internet)",
        "5e805b4fae3eea020c1ddf755fb7b365 (00:02): and i want to set it up more like",
        "5e805b4fae3eea020c1ddf755fb7b365 (00:02): lan &lt;--&gt; eth0 &lt;--&gt;| &lt;--&gt; nat &lt;--&gt; eth2 &lt;--&gt; (Internet)",
        "5e805b4fae3eea020c1ddf755fb7b365 (00:02): lan &lt;--&gt; eth1 &lt;--&gt;|",
        "5e805b4fae3eea020c1ddf755fb7b365 (00:02): the gateway ip for the lan's are the bridge ip (Br0)",
        "5e805b4fae3eea020c1ddf755fb7b365 (00:02): if i set ip up like:",
        "5e805b4fae3eea020c1ddf755fb7b365 (00:02): lan:192.168.1.1 &lt;--&gt; eth0(ip:192.168.1.2)-| &lt;-- nat --&gt; eth2 &lt;--&gt; (Internet)",
        "5e805b4fae3eea020c1ddf755fb7b365 (00:02): lan:192.168.1.3 &lt;--&gt; eth1(ip:192.168.1.4)-|",
        "5e805b4fae3eea020c1ddf755fb7b365 (00:03): would lan:192.168.1.1 need to be set to use ip:192.168.1.2 as the gateway and lan:***3 to use ip***4?",
        "397d64e4568a6d590d8bbae2ab48d54c (00:04): Ok, if only the first packet touches the NAT table, and it can pass through both prerouting and postrouting, on the prerouting rule the request would get aimed at the local IP of the HTTP server, which explains why that's there rather than the extnernal IP.  So the only mystery that's left is why we SNAT it to the internal IP of the NAT box.  Is that so the replies get sent to the right place for un-NAT-ing?",
        "de76c8e6cbbc3c1c44788a340cac141e (00:05): schlick: just back... yes to your last question",
        "397d64e4568a6d590d8bbae2ab48d54c (00:07): danieldg: Is it safe to assume that the NAT box isn't confused by the IP being &quot;wrong&quot; when the packets arrive at it?  i.e. it came from, say, 192.168.0.3, but when the HTTP server sends its replies it's sending them to 192.168.0.1.  There's no indication of who it came from, or that it's part of an existing stream.  I'm guessing something about the packet headers other than the source/destination is used as a handle.",
        "de76c8e6cbbc3c1c44788a340cac141e (00:11): the NAT box is not confused because it has the connection recorded in conntrack",
        "397d64e4568a6d590d8bbae2ab48d54c (00:11): Since it did both the DNAT and SNAT...",
        "de76c8e6cbbc3c1c44788a340cac141e (00:11): yes",
        "397d64e4568a6d590d8bbae2ab48d54c (00:12): Should have reasoned that out...  Sorry.  The key was knowing that only the first packet touched the NAT table, but that it could hit more than one rule.",
        "397d64e4568a6d590d8bbae2ab48d54c (00:14): I had a easier question that I think I've reasoned out myself.  Looking at the DNAT options I noticed the load balancing.  I think this would have interaction with the stateful features and SNAT.  Specifically, if I use a IP range or port range in two separate rules, one of which checks for new state and TCP flags, and another which allows existing and related traffic.",
        "397d64e4568a6d590d8bbae2ab48d54c (00:15): Then the same IP is unlikely to be selected for both, thus the new traffic goes to one random IP, and the existing and related goes to another?  I haven't tried it but I can't see how they would &quot;know about eachother&quot; unless someone tried to make them handle that case.",
        "397d64e4568a6d590d8bbae2ab48d54c (00:21): The workaround I came up with was if I needed multiple rules to effect something that needed to be load balanced, I'd have the first NAT box apply multiple rules and always use one IP, which points to a second NAT box which does nothing but select a random IP/port to pass the connection off to."
    ],
    "person_ids": [
        "738a97ad2084aecd3dbffe284d09c3b8",
        "2a0be8d62ca9580cd38315202869a51a",
        "1273bb29f2c396ce65fdb06f5280ac1c",
        "f7a2868bae984208d75b90d06e14f23d",
        "7d470a1090d276ef41573c2a940df92a",
        "f2b1685abac4fd418ceeb7ce9670ff28",
        "397d64e4568a6d590d8bbae2ab48d54c",
        "de76c8e6cbbc3c1c44788a340cac141e",
        "d949efae795da71ef603b60b018d191c",
        "5e805b4fae3eea020c1ddf755fb7b365"
    ]
}