{
    "id": "bcc9b63e7331b5f8578571b05e45f7ea",
    "messages": [
        "1d3bfcfde5ac540a616a25dff751e36f (15:27): b8810fee2f4a71f849f3f7409546d1d9: talked to 4037e3b7c00a7b08907483cb9b8558e1 on moz #accessibility IRC, his anecdotal remarks on @summary: &quot; I use it regularly if I know a page has multiple tables with useful summaries. JAWS offers a &quot;list tables&quot; feature, and it shows the table summary as a list entrie's caption if available. Makes finding the right table extremely easy. In fact, we're currently revamping some of the Firefox download pages...",
        "1d3bfcfde5ac540a616a25dff751e36f (15:27): ...on mozilla.com, and I advertised for the different tables to get meaningful summaries (they had the same summary text for each table in the first draft). In short, if implemented properly, I, for one, make good use of it.&quot;",
        "b25b6b77a0087ff8385941e5545d32ea (15:29): 1d3bfcfde5ac540a616a25dff751e36f: Interesting. Any chance 4037e3b7c00a7b08907483cb9b8558e1 can join us?",
        "1d3bfcfde5ac540a616a25dff751e36f (15:30): don't know will ask if he is available",
        "3f2e2531201cfbf853f16f668132eaf2 (15:37): 1d3bfcfde5ac540a616a25dff751e36f: Indeed, it's just sampled from the pages linked from dmoz.org, i.e. chosen by human editors as adequately interesting pages, so it'll be biased towards entry pages to sites rather than deep content of more limited interest",
        "1d3bfcfde5ac540a616a25dff751e36f (15:37): b25b6b77a0087ff8385941e5545d32ea: marcoZ said he will drob by",
        "b25b6b77a0087ff8385941e5545d32ea (15:39): 1d3bfcfde5ac540a616a25dff751e36f: Cool",
        "4037e3b7c00a7b08907483cb9b8558e1 (15:44): Hi there!",
        "b25b6b77a0087ff8385941e5545d32ea (15:44): 4037e3b7c00a7b08907483cb9b8558e1: Hi!",
        "4037e3b7c00a7b08907483cb9b8558e1 (15:44): hi b25b6b77a0087ff8385941e5545d32ea! 1d3bfcfde5ac540a616a25dff751e36f tells me you have a few questions on the usefulness of table summaries?",
        "b25b6b77a0087ff8385941e5545d32ea (15:45): Yeah, so this is a big deal in the html-wg",
        "b25b6b77a0087ff8385941e5545d32ea (15:45): I will try to explain why",
        "b25b6b77a0087ff8385941e5545d32ea (15:46): Basically the @summary attribute is the canonical way to provide summaries in HTML 4. But it has not been included in HTML 5 so far because it looked like it was not used much, because it looked like it was often used in a bad way and because there are objections to its design",
        "b25b6b77a0087ff8385941e5545d32ea (15:47): (the last word there should be &quot;design&quot;)",
        "4037e3b7c00a7b08907483cb9b8558e1 (15:47): b25b6b77a0087ff8385941e5545d32ea: k...",
        "4037e3b7c00a7b08907483cb9b8558e1 (15:48): b25b6b77a0087ff8385941e5545d32ea: My personal experience as a user is that, if I encounter them, or a table caption, which is sort of in the similar direction of the matter, the author usually took care of giving this content useful info.",
        "b25b6b77a0087ff8385941e5545d32ea (15:48): The fundamental objection to the design is that it is hidden metadata which means that it seems likely to get out of date because e.g. someone changes the table but doesn't update the summary. And also, it is not avaliable to people not using screen readers, who might also find it useful in some cases",
        "b25b6b77a0087ff8385941e5545d32ea (15:48): And I guess it is hard to QA because many web designers don't have screenreaders",
        "4037e3b7c00a7b08907483cb9b8558e1 (15:49): b25b6b77a0087ff8385941e5545d32ea: And personally I find them very useful. JAWS and other screen readers provide means of navigating to data tables by means of a quick navigation keystroke. The table summary or caption, whichever is present, are then spoken automatically, giving immediate context to what the data table is about.",
        "b25b6b77a0087ff8385941e5545d32ea (15:49): 4037e3b7c00a7b08907483cb9b8558e1: OK. Do you encounter them often?",
        "b25b6b77a0087ff8385941e5545d32ea (15:50): Is there generally a difference between the type of content you encounter in &lt;caption&gt; / @summary?",
        "4037e3b7c00a7b08907483cb9b8558e1 (15:50): b25b6b77a0087ff8385941e5545d32ea: I encounter them mostly on pages which try to adhere to WCAG, which also have mostly navigation items in lists, proper heading markup etc.",
        "b25b6b77a0087ff8385941e5545d32ea (15:50): My understanding is that WCAG suggests that the summary should be longer than the caption",
        "b25b6b77a0087ff8385941e5545d32ea (15:51): (maybe JAWS doesn't expose where the data comes from?)",
        "1d3bfcfde5ac540a616a25dff751e36f (15:52): b25b6b77a0087ff8385941e5545d32ea: when navigating tables using the T key jaws reads the summary prefixed with &quot;summary&quot;",
        "b25b6b77a0087ff8385941e5545d32ea (15:52): 1d3bfcfde5ac540a616a25dff751e36f: OK, so it does expose the difference. Cool",
        "4037e3b7c00a7b08907483cb9b8558e1 (15:52): b25b6b77a0087ff8385941e5545d32ea: JAWS indicates if it's a summary, the caption is spoken without extra indication. Also, when looking at the flat virtual buffer representation, the summary always preceedes the table structure in JAWS, whereas the caption is part of the table structure.",
        "4037e3b7c00a7b08907483cb9b8558e1 (15:53): And +1 to what 1d3bfcfde5ac540a616a25dff751e36f said.",
        "b25b6b77a0087ff8385941e5545d32ea (15:53): So the caption could be before or after the table",
        "1d3bfcfde5ac540a616a25dff751e36f (15:54): if you call up a table list in JAWS, if the caption is present it will use that to identify the table, if not and a summary is present it will use the summary",
        "4037e3b7c00a7b08907483cb9b8558e1 (15:54): b25b6b77a0087ff8385941e5545d32ea: For example on this page taken from the Freedom Scientific Surf's Up training material, the table caption is the first item within each table:http://www.freedomscientific.com/Training/Surfs-Up/Tables.htm",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (15:54): Title: Tables with JAWS and MAGic (at www.freedomscientific.com)",
        "4037e3b7c00a7b08907483cb9b8558e1 (15:54): The summary always comes before the table structure in this example as well.",
        "b25b6b77a0087ff8385941e5545d32ea (15:54): 4037e3b7c00a7b08907483cb9b8558e1: OK, do you think there is a difference in the type of information that people put in &lt;caption&gt; and @summary?",
        "4037e3b7c00a7b08907483cb9b8558e1 (15:55): b25b6b77a0087ff8385941e5545d32ea: In this example there definitely is a difference, since FS chose to use both summary and caption.",
        "4037e3b7c00a7b08907483cb9b8558e1 (15:55): b25b6b77a0087ff8385941e5545d32ea: I don't see both used that often, I believe I see @summary more often than caption actually.",
        "b25b6b77a0087ff8385941e5545d32ea (15:55): 4037e3b7c00a7b08907483cb9b8558e1: Interesting.",
        "b25b6b77a0087ff8385941e5545d32ea (15:57): That seems to be compatible with what http://dev.opera.com/articles/view/mama-tables/#table is saying",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (15:57): Title: MAMA: Tables - Opera Developer Community (at dev.opera.com)",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:58): 4037e3b7c00a7b08907483cb9b8558e1: are bogus summaries a problem in practice?",
        "4037e3b7c00a7b08907483cb9b8558e1 (15:58): b8810fee2f4a71f849f3f7409546d1d9: No. They're either there and useful, or they're absent.",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:58): 4037e3b7c00a7b08907483cb9b8558e1: OK.",
        "4037e3b7c00a7b08907483cb9b8558e1 (15:59): b8810fee2f4a71f849f3f7409546d1d9: In fact, I just recently QA'd the two new download pages we're doing for Firefox 3.1 on mozilla.com, and suggested to make the summaries, which were already there, a little distinguishable to reflect the actual table contents better.",
        "1d3bfcfde5ac540a616a25dff751e36f (15:59): as I mentioned in JAWS if the bogus summarys are on layout tables they are ignored due to the JAWS table heuristics",
        "4037e3b7c00a7b08907483cb9b8558e1 (15:59): In this case, download of fully localized builds versus beta localizations, which the original summary didn't reflect properly.",
        "b25b6b77a0087ff8385941e5545d32ea (16:00): would like to try reverse engineering JAWS",
        "4037e3b7c00a7b08907483cb9b8558e1 (16:00): LOL",
        "b25b6b77a0087ff8385941e5545d32ea (16:00): (well that part of it anyway :) )",
        "4037e3b7c00a7b08907483cb9b8558e1 (16:00): Many people would love to do that I'm sure :-)",
        "b25b6b77a0087ff8385941e5545d32ea (16:02): 4037e3b7c00a7b08907483cb9b8558e1: I guess another issue is how @summary and &lt;caption&gt; fit in with aria-describedby and aria-labelled by. Maybe those are not used enough in the wild yet to ahve any real experience of how they are actually employed?",
        "1d3bfcfde5ac540a616a25dff751e36f (16:04): b25b6b77a0087ff8385941e5545d32ea: neither attributes work yet (with AT) on non form control elements AFAIK",
        "4037e3b7c00a7b08907483cb9b8558e1 (16:04): b25b6b77a0087ff8385941e5545d32ea: Well...The general rule of thumb is: If other means are available, don't use ARIA for the same purpose. So, if a caption or summary are available for describing a page, aria-describedby is not particularly recommended, and would have a different effect anyway I *think*.",
        "4037e3b7c00a7b08907483cb9b8558e1 (16:04): s/page/table/",
        "b25b6b77a0087ff8385941e5545d32ea (16:05): 4037e3b7c00a7b08907483cb9b8558e1: OK. I was just wondering if JAWS did anything special with them and whether web developers were using them in a way that was similar/different to &lt;caption&gt; or @summary",
        "b25b6b77a0087ff8385941e5545d32ea (16:06): But I guess it is too early to tell",
        "4037e3b7c00a7b08907483cb9b8558e1 (16:06): b25b6b77a0087ff8385941e5545d32ea: Definitely for data tables. So far, I've seen aria-describedby mostly to put additional information on focusable controls. JAWS exposes that as Insert+F1 help.",
        "4037e3b7c00a7b08907483cb9b8558e1 (16:07): A data table, in and out of itself, isn't focusable unless you make it so.",
        "b25b6b77a0087ff8385941e5545d32ea (16:10): 4037e3b7c00a7b08907483cb9b8558e1: Thanks for dropping in",
        "3f2e2531201cfbf853f16f668132eaf2 (16:11): (http://www.tee-rail-alliance.de/ uses &lt;div aria-labelledby&gt;; the only other site in my collection using aria-* is http://www.mooquack.com/odyssey/ with &lt;input aria-required&gt;)",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (16:11): Title: TEE Rail Alliance - Sparen in Deutschland, ÷sterreich und der Schweiz (at www.tee-rail-alliance.de)",
        "4037e3b7c00a7b08907483cb9b8558e1 (16:12): b25b6b77a0087ff8385941e5545d32ea: Thanks for inviting me! If you need help with usability questions in the future, feel free to ping again!",
        "1d3bfcfde5ac540a616a25dff751e36f (16:13): FWIW we are seeing (as well as promoting) the use of ARIA to many of our clients, who are inclduing it in the web based apps"
    ],
    "person_ids": [
        "1d3bfcfde5ac540a616a25dff751e36f",
        "b25b6b77a0087ff8385941e5545d32ea",
        "3f2e2531201cfbf853f16f668132eaf2",
        "4037e3b7c00a7b08907483cb9b8558e1",
        "0a39f78bcb297ab0ebe8a29c28bfed89",
        "b8810fee2f4a71f849f3f7409546d1d9"
    ]
}