{
    "id": "bf726aafcdbc99e991d734e640ce46f9",
    "messages": [
        "e825d828c717838f4dd86061106872fb (09:31): I don't suppose that there is a nice Qt way to find the amount of used and free disk space? I say &quot;Qt way&quot; because it would be nice to be platform-independent.",
        "d29d567972e1e13b8bd390e5395b685d (09:40): marcusU: not that I know of",
        "e825d828c717838f4dd86061106872fb (09:40): Yeah, I'm seeing that that's the case from my Googling.",
        "d29d567972e1e13b8bd390e5395b685d (09:41): for posix systems, maybe statvfs",
        "e825d828c717838f4dd86061106872fb (09:44): I was thinking of writing something like KDiskFree but using pie charts instead.",
        "d29d567972e1e13b8bd390e5395b685d (09:44): hm, sorta like win98 IIRC",
        "e825d828c717838f4dd86061106872fb (09:45): Yeah. I really think that a pie chart is more easier to see visually than a bar chart.",
        "d29d567972e1e13b8bd390e5395b685d (09:47): yep",
        "e825d828c717838f4dd86061106872fb (09:48): I'm just starting actually trying to write some stuff in C++ with Qt. So I was looking for something easier like that, but unfortunately, it looks like a hard project since I don't know Windows well enough.",
        "e825d828c717838f4dd86061106872fb (09:49): Plus I'm annoyed that KDiskFree has ugly colors that are not configurable.",
        "d29d567972e1e13b8bd390e5395b685d (09:54): or just make it non-windows for now and worry about that later",
        "d29d567972e1e13b8bd390e5395b685d (09:55): unless you'er using windows as we spea of course",
        "d29d567972e1e13b8bd390e5395b685d (09:55): *speak",
        "e825d828c717838f4dd86061106872fb (09:55): Yeah. I guess so. I was just trying to be a &quot;good boy&quot; and write platform-independent code.",
        "e825d828c717838f4dd86061106872fb (09:56): I only occasionally use Windows at home.",
        "d29d567972e1e13b8bd390e5395b685d (09:58): speaking of Windows, I still think they need to give Qt a face-lift for Vista.",
        "5022cf57fb9482c659ea223f7e36b50d (09:59): probably prudent to do that",
        "5022cf57fb9482c659ea223f7e36b50d (09:59): but how can you expect a 200 men team to accomodate all the innovations in three different platforms?",
        "5022cf57fb9482c659ea223f7e36b50d (09:59): you are asking 200 developers to chase all the innovations going on at Apple, Microsoft and GNOME/KDE",
        "d29d567972e1e13b8bd390e5395b685d (09:59): even just small things.. it's mostly OK on vista",
        "5022cf57fb9482c659ea223f7e36b50d (10:00): won't it be easier to take the conservative route with Qt? Just use it for backend business logic?",
        "d29d567972e1e13b8bd390e5395b685d (10:00): but it'd be interesting if they had aero wizards, command links, etc",
        "5022cf57fb9482c659ea223f7e36b50d (10:00): and use the native GUI for everything GUI?",
        "d29d567972e1e13b8bd390e5395b685d (10:00): the new UI stuff in vista..",
        "e825d828c717838f4dd86061106872fb (10:01): My graphics system can't run the aero stuff. :-(",
        "d29d567972e1e13b8bd390e5395b685d (10:01): hm, old graphics card?",
        "e825d828c717838f4dd86061106872fb (10:01): Yeah.",
        "e825d828c717838f4dd86061106872fb (10:02): But I don't need transparent windows or games. The only thing I do is use Linux/Qt/KDE and play DVDs.",
        "d29d567972e1e13b8bd390e5395b685d (10:03): redear: maybe.. but it isn't really designed for being a back-end, not that it can't be.",
        "5022cf57fb9482c659ea223f7e36b50d (10:03): ...",
        "5022cf57fb9482c659ea223f7e36b50d (10:03): it's a start",
        "5022cf57fb9482c659ea223f7e36b50d (10:03): most frameworks involves something like Qt, plus your own framework",
        "e825d828c717838f4dd86061106872fb (10:03): Does Qt use native Windows widgets on Windows?",
        "d29d567972e1e13b8bd390e5395b685d (10:03): no, they don't use native widgets",
        "5022cf57fb9482c659ea223f7e36b50d (10:03): after that i guess you can work in peace on your business logic",
        "e825d828c717838f4dd86061106872fb (10:04): blockd: I read something that they use some kind of HID renderer on OS X.",
        "5022cf57fb9482c659ea223f7e36b50d (10:04): what's a good c++ backend framework for serving the business logic then?",
        "5022cf57fb9482c659ea223f7e36b50d (10:04): something that provides you a platform agnostic DB/memory/file/etc/etc",
        "5022cf57fb9482c659ea223f7e36b50d (10:05): if not Qt",
        "d29d567972e1e13b8bd390e5395b685d (10:05): marcusU: on mac and windows they use native API's for rendering, but they're not the &quot;native&quot; widgets AFAIK",
        "d29d567972e1e13b8bd390e5395b685d (10:05): that's why the mac and winxp style are only available on the respective platofrms",
        "d29d567972e1e13b8bd390e5395b685d (10:05): *styles",
        "e825d828c717838f4dd86061106872fb (10:05): I just looked, they use HIThemes -- whatever that is.",
        "d29d567972e1e13b8bd390e5395b685d (10:06): just the main thing that sticks out on vista is the progress bar.. the vista UX guidelines are a little shady and contradictory, but progress bars seem to have been replaced with &quot;meters&quot; now",
        "d29d567972e1e13b8bd390e5395b685d (10:07): solid progress bars and they have an animation effect, sort of like a bubble of light.. er something",
        "e825d828c717838f4dd86061106872fb (10:07): Meters? I used to like the kind of dial-like widgets I got on lots of NeXTSTEP apps. Apple didn't keep those. :-(",
        "e825d828c717838f4dd86061106872fb (10:07): When I turn on progress bar animation in KDE, I get nauseated!",
        "d29d567972e1e13b8bd390e5395b685d (10:07): meters is their term.. think like a green thermometer instead of a winxp progress bar",
        "e825d828c717838f4dd86061106872fb (10:07): (Not cuz it looks bad -- because it makes me motion sick)",
        "d29d567972e1e13b8bd390e5395b685d (10:08): let me find a screen shot",
        "d29d567972e1e13b8bd390e5395b685d (10:08): while I'm complaining, a proper search field might be nice too :-)",
        "e825d828c717838f4dd86061106872fb (10:08): I'm not going to replace my Matrox G550 card untiil I absolutely have to.",
        "e825d828c717838f4dd86061106872fb (10:08): Proper search field?",
        "d29d567972e1e13b8bd390e5395b685d (10:09): on Mac, the rounded text field with the magnifying glass icon.. and on vista a line edit without a border and then a flat tooltip beside that with a magifying glass (looks better than it sounds)",
        "e825d828c717838f4dd86061106872fb (10:10): It looks fine in KDE.",
        "d29d567972e1e13b8bd390e5395b685d (10:11): <a href=\"http://msdn.microsoft.com/library/default.asp?url=/library/en-us/UxGuide/UXGuide/Controls/ProgressBars.asp\">http://msdn.microsoft.com/library/default.asp?url=/library/en-us/UxGuide/UXGuide/Controls/ProgressBars.asp</a>",
        "e825d828c717838f4dd86061106872fb (10:11): But I'm kind of confused.",
        "d29d567972e1e13b8bd390e5395b685d (10:11): scroll down to the part about &quot;meters&quot;, they seem to have replaced all progress bars with those :\\",
        "d29d567972e1e13b8bd390e5395b685d (10:11): I think the UXGuide is out of date, which isn't surprising",
        "d29d567972e1e13b8bd390e5395b685d (10:12): confused about what?",
        "e825d828c717838f4dd86061106872fb (10:13): blockd: From the page you showed me, I see several different widgets that show the concept of something being partly completely. They different in their appearance for no obvious reason. It's all a confusing mess.",
        "e825d828c717838f4dd86061106872fb (10:13): But Windows users are used to have every app have a different widget style.",
        "d29d567972e1e13b8bd390e5395b685d (10:14): yeah, just search to the second mention of &quot;meters&quot;, that's what all progress bars actually seem to be like",
        "d29d567972e1e13b8bd390e5395b685d (10:14): even for apps compiled for WinXP, so they wouldn't have had any way of adjusting for vista",
        "e825d828c717838f4dd86061106872fb (10:15): And I don't understand why they don't want the progress bar to show the percent complete.",
        "d29d567972e1e13b8bd390e5395b685d (10:15): better yet, search for &quot;Use progress bars only for progress. Use meters to indicate a percentage that is not related to progress.&quot;",
        "d29d567972e1e13b8bd390e5395b685d (10:15): well, it probably just wouldn't look good",
        "e825d828c717838f4dd86061106872fb (10:16): Windows has never good very good.",
        "e825d828c717838f4dd86061106872fb (10:16): I don't think that the distinction between meters and progress bars is a useful one.",
        "d29d567972e1e13b8bd390e5395b685d (10:16): Vista isn't so bad looking, despite its other numerous problems",
        "d29d567972e1e13b8bd390e5395b685d (10:17): nope, in fact as far as I can tell they've actually replaced progress bars with meters",
        "d29d567972e1e13b8bd390e5395b685d (10:17): despite what those docs say.. I haven't seen a &quot;progress bar&quot; in vista except in Qt now :\\",
        "d29d567972e1e13b8bd390e5395b685d (10:17): just meteres",
        "d29d567972e1e13b8bd390e5395b685d (10:17): *meters",
        "e825d828c717838f4dd86061106872fb (10:18): I think that percentage is a very useful item and should be shown.",
        "d29d567972e1e13b8bd390e5395b685d (10:19): it's useful, but just philosophizing, can't a person tell just as well from looking at it?",
        "e825d828c717838f4dd86061106872fb (10:19): Some people like the percentage. Some people like the absolute number. Why not give them both, such as &quot;500 out of 1000 files (50%) copied&quot;?",
        "e825d828c717838f4dd86061106872fb (10:20): And if it's really a slow operation, it's nice to watch the update 501 files copied, 502, 503, etc.",
        "d29d567972e1e13b8bd390e5395b685d (10:22): but that's not related to percentage at that point",
        "e825d828c717838f4dd86061106872fb (10:22): What?",
        "e825d828c717838f4dd86061106872fb (10:22): I don't understand.",
        "d29d567972e1e13b8bd390e5395b685d (10:25): AFAIK you're talking about a really large scale, so the progress bar won't update often..",
        "e825d828c717838f4dd86061106872fb (10:27): I'm usually copying little files. And my disks are fast.",
        "e825d828c717838f4dd86061106872fb (10:29): Okay. I'm getting late. I'm going to bed. It's nice to chat with you, blockd.",
        "d29d567972e1e13b8bd390e5395b685d (10:29): yeah, it's late here too. Anyway, I don't mean to make this into a huge issue.",
        "e825d828c717838f4dd86061106872fb (10:29): It's fine with me. See you.",
        "d29d567972e1e13b8bd390e5395b685d (10:31): pointlessly correcting my previous sentence many lines up, toolbutton, not tooltip"
    ],
    "person_ids": [
        "e825d828c717838f4dd86061106872fb",
        "d29d567972e1e13b8bd390e5395b685d",
        "5022cf57fb9482c659ea223f7e36b50d"
    ]
}