{
    "id": "c2855b1fdd6826f6d94880f4368ee576",
    "messages": [
        "a11aabeeceeae6b8cb5d12ea06b56554 (13:45): Anyone able to find the thread from a while ago about treatment of form in table?",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:51): a11aabeeceeae6b8cb5d12ea06b56554: it's in bugzilla",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:51): the W3C bugzilla",
        "f139aba52f9fa1394b4034a7954b2220 (14:00): b8810fee2f4a71f849f3f7409546d1d9, wouldn't you expect XML5 parsers to at least set the &quot;bozo bit&quot;, and at least let the application know about the error?",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:01): f139aba52f9fa1394b4034a7954b2220: In practice I would, but that's not part of the thought experiment here.",
        "f139aba52f9fa1394b4034a7954b2220 (14:01): ok",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:10): Does HTML5 say which script global object applies if a script has been moved to anther document before the parser runs it?",
        "ab7faae5d7b250ea8606486575f8f79c (14:10): On the subject of draconian parsing, a lot of RDFa implementations seem to try to parse their input with an XML parser (regardless of content-type etc) and if it fails then they re-parse with a tag-soup parser (html5lib etc)",
        "ab7faae5d7b250ea8606486575f8f79c (14:12): so they combine the features of: a single error can trigger huge changes in the parsing of the whole document; users are never aware of errors and can't report them to producers; they have all the implementation complexity of both XML and HTML; they conform to neither XML nor HTML; etc",
        "ab7faae5d7b250ea8606486575f8f79c (14:14): Also fun: Boost now ships with the http://rapidxml.sourceforge.net/ XML parser, which aims for &quot;reasonable W3C compatibility&quot;",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:16): am I just bad at reading the spec or is the spec vague on which script global object to use when the owner document of the script and the document of the creator parser of the script differ?",
        "ab7faae5d7b250ea8606486575f8f79c (14:21): (Hmm, it doesn't seem to say what &quot;reasonable&quot; exactly means, other than ignoring doctypes (and internal subsets) and &quot;a number of other, minor incompatibilities&quot;)",
        "ab7faae5d7b250ea8606486575f8f79c (14:21): (But it's fast, which is all that matters)",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:22): ignoring the internal subset sure seems reasonable :-)",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:22): ignoring the external subset especially :-)",
        "ab7faae5d7b250ea8606486575f8f79c (14:25): As far as I can see, it doesn't even check for invalid codepoints",
        "cc097e0d7183ae8436e7df709553c8c0 (14:46): b8810fee2f4a71f849f3f7409546d1d9: doesn't the spec have an example of that case in the parser error intro section?",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:47): cc097e0d7183ae8436e7df709553c8c0: about script global object? I can't locate the example.",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:48): It's unclear to me who Liam is (humorously) implying to be an asshole or a moron",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:49): XML advocates who try to read around the intent of the writers of the spec?",
        "f139aba52f9fa1394b4034a7954b2220 (14:50): my understanding was that your reading of the spec, or in this case, in what XML advocates have said, with a fine tooth comb, trying to find a loophole that supports XML5, makes you fit into the Asshole category",
        "cc097e0d7183ae8436e7df709553c8c0 (14:50): b8810fee2f4a71f849f3f7409546d1d9: &quot;Scripts that modify the page as it is being parsed&quot;",
        "f139aba52f9fa1394b4034a7954b2220 (14:51): but, regardless of what he meant, it wasn't a productive answer and not worth responding to",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:52): f139aba52f9fa1394b4034a7954b2220: well, I was trying to point out that *their* reading, if elaborated on, was of the kind of reading the spec in a way that subverts the intent of the spec",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:53): whoa. that was a bogus sentence",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:53): let's try that again",
        "f139aba52f9fa1394b4034a7954b2220 (14:53): I understand what you mean",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:53): f139aba52f9fa1394b4034a7954b2220: well, I was trying to point out that *their* reading twists the letter of the spec to subvert the intent of the spec",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:56): cc097e0d7183ae8436e7df709553c8c0: thanks.",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:56): cc097e0d7183ae8436e7df709553c8c0: that example defies my intuition of script global object",
        "ab7faae5d7b250ea8606486575f8f79c (14:58): &quot;This proposal would require an XML-conformant application, when confronted with a WF error, to refuse to proceed until a human user had been notified of the error and explicitly authorized error recovery. [...] this proposal did get serious consideration&quot;",
        "ab7faae5d7b250ea8606486575f8f79c (14:59): Usability engineers would have loved that",
        "ab7faae5d7b250ea8606486575f8f79c (15:00): I suppose you could make it more user-friendly by popping up a dialog box that just says: &quot;Do you want this web page to work? [Yes] [No]&quot;",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:04): Do you want this browser to work (Don't Work) ((Work)) [x] Remember my decision",
        "ab7faae5d7b250ea8606486575f8f79c (15:04): That'd be a terrible violation of the spec",
        "a924fb58d2c25874322f4e5126f608b9 (15:04): This page requires your permission to work. [Make it work] [Uninstall this impudent browser for daring to accomodate bad markup]",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:06): whee! down the multilingualism rathole we go",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:06): (or rather, the rathole is dealing with it automatically)",
        "a924fb58d2c25874322f4e5126f608b9 (15:07): Make sure the dialog box asking &quot;Do you want to display this in &lt;foreign language&gt;&quot; is in that same foreign language",
        "a9b326df4e6da61c5b6f5e1058be83a2 (15:07): krijnh: you around? wanted to ask about logging a new channel",
        "ab7faae5d7b250ea8606486575f8f79c (15:10): a924fb58d2c25874322f4e5126f608b9: Make the dialog box ask loudly and slowly, like &quot;Do. You. Want. To. ...&quot;, and then foreigners will understand it more easily",
        "69a015ebfe18fc6dfbd151c0b269ff26 (15:11): b8810fee2f4a71f849f3f7409546d1d9, would you know why the W3C HTML 5 validator checks differently between validation by uri and by direct input?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (15:14): 69a015ebfe18fc6dfbd151c0b269ff26: because there's a bug in it",
        "a9b326df4e6da61c5b6f5e1058be83a2 (15:14): it's a known issue",
        "69a015ebfe18fc6dfbd151c0b269ff26 (15:14): Ah, thanks.",
        "ab7faae5d7b250ea8606486575f8f79c (15:14): wonders what the difference is",
        "a9b326df4e6da61c5b6f5e1058be83a2 (15:15): the difference is that it runs the input through a perl script before actually passing it on to the v.nu instance",
        "69a015ebfe18fc6dfbd151c0b269ff26 (15:16): And validation by uri is the ?correct? variation?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (15:19): 69a015ebfe18fc6dfbd151c0b269ff26: dunno.. I guess the way to confirm is to check against the behavior you get with using validator.nu directly",
        "a9b326df4e6da61c5b6f5e1058be83a2 (15:20): or if against http://qa-dev.w3.org:8888 if you want",
        "a9b326df4e6da61c5b6f5e1058be83a2 (15:21): that's an unstable instance that gets updated whenever a change is checked in",
        "69a015ebfe18fc6dfbd151c0b269ff26 (15:21): Ok, thanks, I just won an argument. ;)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (15:21): excellent",
        "a9b326df4e6da61c5b6f5e1058be83a2 (15:21): I hope you got a beer or something out of it",
        "69a015ebfe18fc6dfbd151c0b269ff26 (15:22): Geographical distance is in the way as usual.",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:22): a9b326df4e6da61c5b6f5e1058be83a2: ah. you are back. I had a look at your commit diffs and they looked good.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (15:23): b8810fee2f4a71f849f3f7409546d1d9: OK, thanks",
        "a9b326df4e6da61c5b6f5e1058be83a2 (15:24): b8810fee2f4a71f849f3f7409546d1d9: someday I should actually learn how to program in Java",
        "a924fb58d2c25874322f4e5126f608b9 (15:25): I need to learn how to catch jvm crashes",
        "ab7faae5d7b250ea8606486575f8f79c (15:25): writes Java primarily using ctrl+space",
        "a924fb58d2c25874322f4e5126f608b9 (15:25): I can't seem to find any web tutorials on it",
        "ab7faae5d7b250ea8606486575f8f79c (15:25): a924fb58d2c25874322f4e5126f608b9: Build a debug version of the JVM then run it in gdb?",
        "a924fb58d2c25874322f4e5126f608b9 (15:26): Oh, I don't care about the crash itself",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:26): ab7faae5d7b250ea8606486575f8f79c: ctrl/command+space is awesome",
        "a924fb58d2c25874322f4e5126f608b9 (15:26): But I want to detect that a crash happened and relaunch the app with a compat setting",
        "ab7faae5d7b250ea8606486575f8f79c (15:28): Oh",
        "ab7faae5d7b250ea8606486575f8f79c (15:28): Check the exit code?",
        "a924fb58d2c25874322f4e5126f608b9 (15:29): That's the concept I'm working on. But then I have to launch a java program from inside another java program, and I don't know if the user running this has the java binary in path or anything...",
        "ab7faae5d7b250ea8606486575f8f79c (15:31): You could run it always with the compat setting",
        "ab7faae5d7b250ea8606486575f8f79c (15:31): Or fix the crash bug",
        "a924fb58d2c25874322f4e5126f608b9 (15:31): It's a driver bug, so I can't fix it",
        "ab7faae5d7b250ea8606486575f8f79c (15:31): Can't you work around it?",
        "a924fb58d2c25874322f4e5126f608b9 (15:32): That's the compat setting. Makes the app suck, but work at least",
        "a9b326df4e6da61c5b6f5e1058be83a2 (15:32): me wants to find time to try again to make a gcj build of jing plus whattf datatype lib plus whatever other needed v.nu dependencies",
        "ab7faae5d7b250ea8606486575f8f79c (15:32): wonders if Java supports fork()",
        "a924fb58d2c25874322f4e5126f608b9 (15:32): I don't want the majority of users with good drivers to get a sucky app",
        "a924fb58d2c25874322f4e5126f608b9 (15:32): And I can't reliably detect whether the driver is sucky or not",
        "ab7faae5d7b250ea8606486575f8f79c (15:33): You could get the user to manually restart the application, and if it sees a file indicating it didn't shut down successfully last time then it can give them choice of trying again or running in safe mode",
        "ab7faae5d7b250ea8606486575f8f79c (15:33): s//a /",
        "a924fb58d2c25874322f4e5126f608b9 (15:34): Yeah, that's the current mode of operation. &quot;If the program suddenly disappears, check if there's a HS_ERR_PID file and we'll tell you what to do&quot;",
        "a924fb58d2c25874322f4e5126f608b9 (15:34): But if it could be done automatically, I think we'd lose fewer users :)",
        "ab7faae5d7b250ea8606486575f8f79c (15:34): Do the checking automatically when they start it the next time",
        "a924fb58d2c25874322f4e5126f608b9 (15:35): It's actually more complicated, since there are several different driver bugs, each with their own compat setting",
        "ab7faae5d7b250ea8606486575f8f79c (15:35): Oh, fun",
        "a924fb58d2c25874322f4e5126f608b9 (15:35): But yes, I guess some of them could be done auto",
        "a924fb58d2c25874322f4e5126f608b9 (15:36): Like setting a flag on startup and clearing it on successful shutdown",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:36): ab7faae5d7b250ea8606486575f8f79c: as I understand it, pure Java doesn't support true fork on the JVM. You can run other programs, though, which I guess has to be implemented as fork on some level on Unix.",
        "ab7faae5d7b250ea8606486575f8f79c (15:36): a924fb58d2c25874322f4e5126f608b9: Do you need to be portable across OSes?",
        "a924fb58d2c25874322f4e5126f608b9 (15:37): Windows, mac and linux",
        "a924fb58d2c25874322f4e5126f608b9 (15:37): We ditched solaris &gt;_&gt;",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:37): yay for Run Anywhere .sh and .bat files for bootstrapping Java",
        "ab7faae5d7b250ea8606486575f8f79c (15:38): If it was just Windows I guess you could do something like set an unhandled exception filter inside JNI to detect the driver crash and log/report/etc the problem",
        "a924fb58d2c25874322f4e5126f608b9 (15:41): I don't suppose there's a simple way to launch apps that are already installed with javaws",
        "ab7faae5d7b250ea8606486575f8f79c (15:43): You could always rewrite your application in a proper language, like C++",
        "b25b6b77a0087ff8385941e5545d32ea (15:45): lisp!"
    ],
    "person_ids": [
        "a11aabeeceeae6b8cb5d12ea06b56554",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "f139aba52f9fa1394b4034a7954b2220",
        "ab7faae5d7b250ea8606486575f8f79c",
        "cc097e0d7183ae8436e7df709553c8c0",
        "a924fb58d2c25874322f4e5126f608b9",
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "69a015ebfe18fc6dfbd151c0b269ff26",
        "b25b6b77a0087ff8385941e5545d32ea"
    ]
}