{
    "id": "c71793918e3fbd5ee2b19b62c187c82b",
    "messages": [
        "066eb11bc3ef1cb521227b25b4eea230 (15:59): ab7faae5d7b250ea8606486575f8f79c, are you the one philip with the web font optimizer page?",
        "cd4b22ed5d04ebb783a3fd8ab0a39490 (16:01): Question r/e &lt;track&gt;. The spec currently says &quot;The src attribute gives the address of the time track data. The value must be a valid non-empty URL potentially surrounded by spaces. This attribute must be present.&quot; Can it not be optional if there is a descendent &lt;source&gt; element, so that different formats can be fed to different browsers (a la &lt;video&gt; itself)?",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:02): we don't want separate formats for &lt;track&gt;",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:02): we don't want them for video either, but it seems for track we can avoid it",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:04): cd4b22ed5d04ebb783a3fd8ab0a39490, &lt;track&gt; is currently like &lt;source&gt; or &lt;img&gt;, it has no end tag and such",
        "cd4b22ed5d04ebb783a3fd8ab0a39490 (16:06): True, we don't want separate formats for anything. But it doesn't look like there's much agreement on such things as formats? (And what happens when Hixie's children dream up WebSRT+ or something like that?)",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:07): seems browser vendors have agreement to some extent to do SRT + extras",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:07): if we ever need a new format later we can figure out a migration path then",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:08): designing for a theoretical future always goes wrong",
        "cd4b22ed5d04ebb783a3fd8ab0a39490 (16:08): isn't the obvious migration path t",
        "ab7faae5d7b250ea8606486575f8f79c (16:08): 066eb11bc3ef1cb521227b25b4eea230: Yes",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:09): cd4b22ed5d04ebb783a3fd8ab0a39490, see the topic; there's no obvious when it comes to the web",
        "066eb11bc3ef1cb521227b25b4eea230 (16:09): ab7faae5d7b250ea8606486575f8f79c, do you know the tex-gyre fonts?",
        "cd4b22ed5d04ebb783a3fd8ab0a39490 (16:09): .. to make it like video itself and allow descendent &lt;source&gt; elements? Speccing that now while there are no implementations would seem to be better",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:10): if we never end up using it that would be quite a waste",
        "ab7faae5d7b250ea8606486575f8f79c (16:10): 066eb11bc3ef1cb521227b25b4eea230: No",
        "066eb11bc3ef1cb521227b25b4eea230 (16:10): ab7faae5d7b250ea8606486575f8f79c, these are redistributable and modifyable free fonts which correspond to the standard postscript fonts. they are based on the urw-fonts used by ghostscript, extended with vietnamese and eastern european characters and are available as otf",
        "066eb11bc3ef1cb521227b25b4eea230 (16:16): ab7faae5d7b250ea8606486575f8f79c, they were initially rubbered up for use in TeX but provide them in multiple formats: http://www.gust.org.pl/projects/e-foundry/tex-gyre/",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:16): aah, so b25b6b77a0087ff8385941e5545d32ea is already reading the html5lib moderator emails",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:17): already wondering what was up",
        "066eb11bc3ef1cb521227b25b4eea230 (16:20): ab7faae5d7b250ea8606486575f8f79c, also with latin-modern http://www.gust.org.pl/projects/e-foundry/latin-modern there is an opentype variant of the computer-modern font, used in TeX, aaand finally there are &quot;libertine&quot; and &quot;biolinum&quot; from the http://linuxlibertine.sourceforge.net/ project",
        "066eb11bc3ef1cb521227b25b4eea230 (16:21): ab7faae5d7b250ea8606486575f8f79c, especially the latter has a keyboard-key-style variant which would be great for use in software documentation",
        "cd4b22ed5d04ebb783a3fd8ab0a39490 (16:22): edb259c0e0038f38bb200bc20c8cbf7e, is there an idea of what webSRT file suffix will be, eg is it &lt;track kind=captions src=blah.wsrt&gt; ?",
        "ab7faae5d7b250ea8606486575f8f79c (16:27): 066eb11bc3ef1cb521227b25b4eea230: Thanks, I don't think I'd seen those before",
        "ab7faae5d7b250ea8606486575f8f79c (16:28): 066eb11bc3ef1cb521227b25b4eea230: I haven't done any work on the font thing for quite a long time, but it's possible I'll update it eventually and those might be good ones to add to the list",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:28): cd4b22ed5d04ebb783a3fd8ab0a39490, .srt",
        "066eb11bc3ef1cb521227b25b4eea230 (16:29): ab7faae5d7b250ea8606486575f8f79c, glad to help :)",
        "cd4b22ed5d04ebb783a3fd8ab0a39490 (16:41): edb259c0e0038f38bb200bc20c8cbf7e, thanks. By the way, I'm planning to use your line &quot;designing for a theoretical future always goes wrong&quot; to explain to my wife why I'm buying a vintage Les Paul guitar instead of putting some money aside for my daughter's school fees.",
        "edb259c0e0038f38bb200bc20c8cbf7e (16:42): cd4b22ed5d04ebb783a3fd8ab0a39490, only if you show it to me one day :p",
        "cd4b22ed5d04ebb783a3fd8ab0a39490 (16:48): edb259c0e0038f38bb200bc20c8cbf7e you're on. We'll play it over a few pints of your Jenever beer.",
        "f139aba52f9fa1394b4034a7954b2220 (16:51): cd4b22ed5d04ebb783a3fd8ab0a39490, are you suggesting that your daughter going to school is only a theoretical future?",
        "f139aba52f9fa1394b4034a7954b2220 (16:51): I'm trying to understand how that quote can actually be used to explain why you need some fancy guitar",
        "a924fb58d2c25874322f4e5126f608b9 (16:53): Maybe he's predicting a financial crash, where only physical objects like guitars will retain their value",
        "cd4b22ed5d04ebb783a3fd8ab0a39490 (16:56): f139aba52f9fa1394b4034a7954b2220, she might turn out not to be bright enough for Uni; there might be some kind of apocalypse before that (I recently watched a documentary called 2012 about all the bad things that might happen).",
        "a924fb58d2c25874322f4e5126f608b9 (16:57): Might? Surely you mean &quot;will&quot;.",
        "f139aba52f9fa1394b4034a7954b2220 (16:57): oh, by &quot;school fees&quot;, did you mean university fees, rather than normal fees for primary school or high school, which I assume are significantly less",
        "cd4b22ed5d04ebb783a3fd8ab0a39490 (16:57): philosophically, all future is theoretical, I guess. Whereas vintage Les Pauls are tangible. In fact, they weigh a bloody tonne",
        "cd4b22ed5d04ebb783a3fd8ab0a39490 (16:59): f139aba52f9fa1394b4034a7954b2220, in the socialist utopia that is the UK, schools are free. Except for aristocrats who go to exclusive fee-paying schools called (counter-inuituively) &quot;public school&quot;. But I confused the issue of shamefully using the American way of referring to higher education as &quot;school&quot;. I'll be saying &quot;awesome&quot; next",
        "b25b6b77a0087ff8385941e5545d32ea (17:00): cd4b22ed5d04ebb783a3fd8ab0a39490: You can always sell the guitar when she has to go to university. Downside: you will fell like you are in Bon Jovi",
        "b25b6b77a0087ff8385941e5545d32ea (17:00): *feel",
        "f139aba52f9fa1394b4034a7954b2220 (17:02): cd4b22ed5d04ebb783a3fd8ab0a39490, in NSW in Australia, public schools have voluntary fees, which you are expected to pay if you can afford it, and which most people do, cause they're quite reasonable. I'm not sure about other states, but assume they're similar.",
        "f139aba52f9fa1394b4034a7954b2220 (17:03): oh, and by public schools, I mean what you call state schools, as opposed to private schools, that you call public schools.",
        "a924fb58d2c25874322f4e5126f608b9 (17:07): If all fails, you can just move to a country with free high education",
        "cd4b22ed5d04ebb783a3fd8ab0a39490 (17:07): we had it in the UK; finished just after I graduated. Hopefully no cause and effect there",
        "40cddb5ac261f4694179715cd8424278 (17:07): a924fb58d2c25874322f4e5126f608b9: Like Sweden? :)",
        "f139aba52f9fa1394b4034a7954b2220 (17:08): how does sweden afford to give free higher education?",
        "40cddb5ac261f4694179715cd8424278 (17:08): high taxes",
        "f139aba52f9fa1394b4034a7954b2220 (17:08): ah, right.",
        "40cddb5ac261f4694179715cd8424278 (17:08): I don't remember exactly where we are right now, but we have some of the highest taxes in the world iirc",
        "a924fb58d2c25874322f4e5126f608b9 (17:09): Yeah, it's funny to hear people from low tax countries complain about taxes",
        "b25b6b77a0087ff8385941e5545d32ea (17:18): No, funny is when they make it sound like news that they are going to be taught in school that low taxes and small goverment are good when it is pretty clear that they are already taught that",
        "a924fb58d2c25874322f4e5126f608b9 (17:18): Or polls showing people think 20% of the budget goes to foreign aid",
        "b25b6b77a0087ff8385941e5545d32ea (17:19): Or poor people protesting against state supported healthcare",
        "b25b6b77a0087ff8385941e5545d32ea (17:19): No wait, that's sad not funny",
        "40cddb5ac261f4694179715cd8424278 (17:22): http://en.wikipedia.org/wiki/File:Income_Taxes_By_Country.svg is pretty interesting.",
        "f139aba52f9fa1394b4034a7954b2220 (17:23): wow, Germany and Belgium have insanely high taxes",
        "a924fb58d2c25874322f4e5126f608b9 (17:30): One tax rate doesn't tell the full story, of course. They could have much less in other areas.",
        "b25b6b77a0087ff8385941e5545d32ea (17:31): It also doesn't tell you how they averaged",
        "f139aba52f9fa1394b4034a7954b2220 (17:32): b25b6b77a0087ff8385941e5545d32ea, I assume the average is calculated as the sum of all tax rates for tax payers, divided by the total number of tax payers. i.e. the normal way to calculate an average.",
        "b25b6b77a0087ff8385941e5545d32ea (17:36): f139aba52f9fa1394b4034a7954b2220: It's at least unclear that a simple mean is the most useful quantity since it is heavilly biased by outliers",
        "a924fb58d2c25874322f4e5126f608b9 (17:36): It says &quot;The 'Personal rate' is the average rate of income tax for a worker on the average income in that country.&quot;",
        "a924fb58d2c25874322f4e5126f608b9 (17:36): Doesn't say what average &quot;average income&quot; is",
        "40cddb5ac261f4694179715cd8424278 (17:39): The numbers are from OECD, I assume they've got information about that somewhere :p",
        "a924fb58d2c25874322f4e5126f608b9 (17:39): OECD sounds like some sort of organization with some sort of agenda, they obviously can't be trusted unless I can confirm they agree with me",
        "f139aba52f9fa1394b4034a7954b2220 (17:40): b25b6b77a0087ff8385941e5545d32ea, when you have such a large population, surely a relatively small number of outliers won't have a significant impact on the average.",
        "a924fb58d2c25874322f4e5126f608b9 (17:41): There's a probably a big difference between mean and median, though",
        "a924fb58d2c25874322f4e5126f608b9 (17:41): (which would skew based on income inequality in each country)",
        "b25b6b77a0087ff8385941e5545d32ea (17:48): f139aba52f9fa1394b4034a7954b2220: Really the size of the population is irrelevant. It's the income distribution that matters",
        "b8810fee2f4a71f849f3f7409546d1d9 (18:02): High taxes &amp; &quot;free&quot; university makes a lot of sense if too many people don't move between participating and non-participating countries between education and contributing in taxes",
        "b8810fee2f4a71f849f3f7409546d1d9 (18:03): wow. the U.S. has a surprisingly high corporate tax rate"
    ],
    "person_ids": [
        "066eb11bc3ef1cb521227b25b4eea230",
        "cd4b22ed5d04ebb783a3fd8ab0a39490",
        "edb259c0e0038f38bb200bc20c8cbf7e",
        "ab7faae5d7b250ea8606486575f8f79c",
        "f139aba52f9fa1394b4034a7954b2220",
        "a924fb58d2c25874322f4e5126f608b9",
        "b25b6b77a0087ff8385941e5545d32ea",
        "40cddb5ac261f4694179715cd8424278",
        "b8810fee2f4a71f849f3f7409546d1d9"
    ]
}