{
    "id": "c84aac29cd07568a1dc3e20ac1259740",
    "messages": [
        "edb259c0e0038f38bb200bc20c8cbf7e (13:29): what might be useful for the alt= debate is finding sites that validate as HTML 4 or XHTML 1 something and have &lt;img alt&gt; somewhere",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:30): then do a content study on the values",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:30): given that 95% is invalid per some measure this may be hard, but maybe the W3C validator should be used as baseline",
        "f139aba52f9fa1394b4034a7954b2220 (13:34): edb259c0e0038f38bb200bc20c8cbf7e, do you mean like finding poor quality values like these alt=&quot;Wheel Chair Icon: Universal Icon Symbol of Accessibility&quot; or alt=&quot;Magnifying Glass: Universal Icon Symbol for Search&quot; http://www.webnauts.net/",
        "f139aba52f9fa1394b4034a7954b2220 (13:35): or like these &quot;howlers&quot; http://web.archive.org/web/20060101014208/http://ppewww.ph.gla.ac.uk/~flavell/alt/alt-text.html#howlers",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:40): yes",
        "f139aba52f9fa1394b4034a7954b2220 (13:42): though, it is difficult to say whether any given poor quality alt text was supplied to address validity, SEO or just a poor, though honest attempt at addressing accessibility. Though it's clear that all of those reasons do occur",
        "f139aba52f9fa1394b4034a7954b2220 (13:43): I'm pretty sure that webanauts example was a misguided attempt to address accessibility",
        "f139aba52f9fa1394b4034a7954b2220 (13:43): but alt=&quot;spacer&quot; would clearly be for validity",
        "f139aba52f9fa1394b4034a7954b2220 (13:44): or perhaps not. I don't know.",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:52): edb259c0e0038f38bb200bc20c8cbf7e: are you referencing HTML5 in your XTech paper? if you are, which version are you referring to?",
        "edb259c0e0038f38bb200bc20c8cbf7e (13:59): i probably will, yes",
        "edb259c0e0038f38bb200bc20c8cbf7e (14:00): i guess the w3c editor's draft and the whatwg multipage or something, dunno really",
        "edb259c0e0038f38bb200bc20c8cbf7e (14:00): i'm writing my paper at the moment",
        "edb259c0e0038f38bb200bc20c8cbf7e (14:01): are you giving an update on the validator?",
        "edb259c0e0038f38bb200bc20c8cbf7e (14:03): the only problem is that nobody is giving an update on HTML5...",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:06): edb259c0e0038f38bb200bc20c8cbf7e: yes, I'll give an update on the validator",
        "edb259c0e0038f38bb200bc20c8cbf7e (14:07): maybe i should submit a lightning talk on html5",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:07): edb259c0e0038f38bb200bc20c8cbf7e: that would be a good idea",
        "edb259c0e0038f38bb200bc20c8cbf7e (14:07): 20 slides on 20 new features since last year :D",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:08): hmm. looks like my last year's paper never got to the XTech 2007 site.",
        "edb259c0e0038f38bb200bc20c8cbf7e (14:16): e-mailed a proposal for a lightning talk",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:23): doesn't like reference styles that obscure given names",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:23): is it E. R. Harold or E. Rusty Harold? that is, is Rusty a middle name or a part of the surname?",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:24): doesn't know what to do about Norwegian or Danish three-part names, either",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:25): hmm. he sometimes uses &quot;Elliotte Harold&quot;, so I'm guessing Rusty is not an essential part of surname",
        "ab7faae5d7b250ea8606486575f8f79c (14:27): b8810fee2f4a71f849f3f7409546d1d9: Rather than using text/html or XML for IPC, would it be reasonable to use some kind of serialised-SAX format (or make up one if it doesn't exist yet) to avoid all the limitations of HTML and XML parsers?",
        "edb259c0e0038f38bb200bc20c8cbf7e (14:27): b8810fee2f4a71f849f3f7409546d1d9, it could be part of the given name too",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:29): ab7faae5d7b250ea8606486575f8f79c: well, given that XML parsers exist and an XML5 parser might exist, inventing yet another infoset serialization seems silly",
        "ab7faae5d7b250ea8606486575f8f79c (14:33): b8810fee2f4a71f849f3f7409546d1d9: But XML parsers won't work, since they'll turn most pages into a single &quot;fatal error: XML is not well-formed because of this thing here&quot; message when the validator should instead try to identify as many errors as possible",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:34): ab7faae5d7b250ea8606486575f8f79c: wouldn't XML5 fix that?",
        "ab7faae5d7b250ea8606486575f8f79c (14:34): XML5 doesn't exist",
        "edb259c0e0038f38bb200bc20c8cbf7e (14:34): some kind of serialised-SAX format doesn't either",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:35): ab7faae5d7b250ea8606486575f8f79c: yeah but the options are making XML5 exist or making yet another SAX serialization exist",
        "edb259c0e0038f38bb200bc20c8cbf7e (14:35): XML5 is arguably more defined than the &quot;some kind of serialised-SAX format",
        "edb259c0e0038f38bb200bc20c8cbf7e (14:35): &quot;",
        "ab7faae5d7b250ea8606486575f8f79c (14:36): XML5 is harder to bring into existence than some other totally-new unconstrained format, because it has to work within the limitations of being compatible with XML 1.0",
        "ab7faae5d7b250ea8606486575f8f79c (14:38): and it's not that hard to define and parse some format like &lt;element loc=&quot;1:1-2:20&quot;&gt;&lt;name&gt;html&lt;/name&gt;&lt;attribute&gt;&lt;name&gt;oops&lt;char code=&quot;0c&quot;/&gt;&lt;/name&gt;&lt;value&gt;that wasn't XML&lt;/value&gt;&lt;/attribute&gt;&lt;/element&gt;",
        "4c202c4816405ce1463bf93605cba3f9 (14:43): Couldn't you use something like the sdl thing that zcorpan developed?",
        "ab7faae5d7b250ea8606486575f8f79c (14:45): (http://simon.html5.org/specs/sdf )",
        "ab7faae5d7b250ea8606486575f8f79c (14:48): That doesn't really exist either :-)",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:59): ab7faae5d7b250ea8606486575f8f79c: from a parsing point of view, the easiest format would be a binary format which had an opcode for each event followed by known fields",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:59): ab7faae5d7b250ea8606486575f8f79c: string would be 32-bit lenth followed by UTF-16BE data",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:07): It's more likely we see XML5 getting adoption than any of the named alternatives...",
        "edb259c0e0038f38bb200bc20c8cbf7e (15:07): (Though for testcase purposes SDF is obviously preferable.)",
        "ab7faae5d7b250ea8606486575f8f79c (15:08): Adoption doesn't matter, since this is private communication between two programs written by the same people",
        "ab7faae5d7b250ea8606486575f8f79c (15:09): (and since widespread adoption in the future is not helpful when you want an implementation now)",
        "ab7faae5d7b250ea8606486575f8f79c (15:17): SDF is unsuitable for serialising arbitrary DOMs, since worst-case behaviour is that the minimal SDF representation has size O(n^2) in the size of the DOM",
        "ab7faae5d7b250ea8606486575f8f79c (15:17): (for a document like &lt;x&gt;&lt;x&gt;&lt;x&gt;&lt;x&gt;&lt;x&gt;....&lt;/x&gt;...)"
    ],
    "person_ids": [
        "edb259c0e0038f38bb200bc20c8cbf7e",
        "f139aba52f9fa1394b4034a7954b2220",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "ab7faae5d7b250ea8606486575f8f79c",
        "4c202c4816405ce1463bf93605cba3f9"
    ]
}