{
    "id": "c867cb7056210e1e775cd120dc5c1cd6",
    "messages": [
        "69b0d3dfe919a6b860a9fac82de52a7e (13:53): could someone explain to me why the minutes aren't an acceptable transcript of the meetings anymore?",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:53): i'm somewhat shocked to discover that the information i've been relying on for the past god knows how many years has suddenly stopped being adequate",
        "ab7faae5d7b250ea8606486575f8f79c (13:54): Because it's generally impossible to work out what was said during the meeting based on the minutes",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:54): but this only becomes a problem if we also provide an audio transcript?",
        "a924fb58d2c25874322f4e5126f608b9 (13:55): See mark's talk from earlier",
        "a924fb58d2c25874322f4e5126f608b9 (13:55): http://krijnhoetmer.nl/irc-logs/whatwg/20090814#l-510",
        "f139aba52f9fa1394b4034a7954b2220 (13:55): 69b0d3dfe919a6b860a9fac82de52a7e, it's because providing the audio for those who can hear it is perceived as providing more information to such people, than is available to the deaf. Whereas with the minutes only, everyone is at an equal disadvantage",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:56): why is it acceptable that people can actually call in then?",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:56): surely currently people who can't call in are at a disadvantage too",
        "a924fb58d2c25874322f4e5126f608b9 (13:56): But calls aren't on the web, so it's okay",
        "f139aba52f9fa1394b4034a7954b2220 (13:57): yes, they are, but accessibility guidelines aren't so extreme as to restrict the use of technology that is inherently inaccessible.",
        "a924fb58d2c25874322f4e5126f608b9 (13:57): Also: http://twitter.com/diveintomark/status/3310162153",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:57): this is some sort of special mode of thinking that i can't wrap my head around",
        "f139aba52f9fa1394b4034a7954b2220 (13:58): although, there are relay services that deaf people can use to make phone calls, and could in theory use that for the telcon",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:58): there are other reasons to not be able to attend the calls",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:58): like not having a phone, or being asleep",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:58): (both of which affect me)",
        "f139aba52f9fa1394b4034a7954b2220 (14:00): yeah, that's why we still do the important stuff asynchronously",
        "f139aba52f9fa1394b4034a7954b2220 (14:01): I personally find the telcons to be of questionable value, and usually choose not to attend. But there are some people who do find them valuable for whatever reason, and there's no reason to restrict them from doing that",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:02): sure, just like there's no reason to restrict publication of audio recordings without transcripts",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:02): but apparently that's not allowed these days",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:03): someone should go tell the podcast industry, btw, that they're all displaying quite unacceptable behaviour",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:04): calls &quot;not it&quot;",
        "f139aba52f9fa1394b4034a7954b2220 (14:05): some podcasters do publish transcripts",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:06): i wonder if radio suddenly becomes unacceptable if they start broadcasting on the web, too",
        "ab7faae5d7b250ea8606486575f8f79c (14:07): Maybe it's like &quot;You're not having any dessert until you've eaten your greens&quot; where some authority is enforcing rules so that your incentives are aligned with wider benefits than the benefits you care about yourself",
        "f139aba52f9fa1394b4034a7954b2220 (14:07): wcag has guidelines about live broadcasts over the internet",
        "ab7faae5d7b250ea8606486575f8f79c (14:07): (where dessert is audio recordings, greens is transcripts, and your mother is the W3C)",
        "ab7faae5d7b250ea8606486575f8f79c (14:08): (I presume this is related to what Wikipedia says is the principal-agent problem)",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:10): i don't think anyone in their sane mind would consider comparing listening to audio recordings of htmlwg telecons to my mother's deserts.",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:10): but maybe my mother's deserts are just unusally good.",
        "f139aba52f9fa1394b4034a7954b2220 (14:13): the problem I see with the arugments about it on public-html is that the accessibility advocates are simply taking the moral high ground, rather than explaning what the actual value of a full text transcript will be in this case and evaluating the cost/benefit ratio",
        "f139aba52f9fa1394b4034a7954b2220 (14:15): and they're ignoring the issue that arguments from morality don't carry that much weight with pragmatists",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:15): i am shocked that they would proffer such unnuanced arguments.",
        "ab7faae5d7b250ea8606486575f8f79c (14:16): I thought the point of accessibility was that it fails when you evaluate the cost/benefit ratio - if it didn't, everyone would make things accessible because it's good business sense, but they don't, and legislation is often needed to skew the ratio",
        "ab7faae5d7b250ea8606486575f8f79c (14:17): (Cost/benefit ratios aren't sufficient because they ignore unmeasurable benefits like respecting human rights)",
        "f139aba52f9fa1394b4034a7954b2220 (14:17): often, the problem is just that people fail to perceive the benefits of making things more accessible",
        "ab7faae5d7b250ea8606486575f8f79c (14:18): s/sufficient/a sufficient measure/",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:19): the problem i have with the arguments is that we already have transcripts, and if the transcripts aren't good enough, then that should have been a problem already, and doesn't suddenly become a problem when someone volunteers to provide an additional format.",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:20): that and the fact that it's one hell of a horrible way to run a community if you tell someone who volunteers to do something &quot;sorry but that's not good enough&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:20): when someone volunteers to do something, the right response is &quot;thank you&quot; and &quot;how can i help you&quot;",
        "ab7faae5d7b250ea8606486575f8f79c (14:23): volunteers to rob a bank",
        "ab7faae5d7b250ea8606486575f8f79c (14:23): waits for someone to ask how they can help",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:24): well i was assuming i was talking about people volunteering to do things that actually benefit, or at least affect, the community :-P",
        "ab7faae5d7b250ea8606486575f8f79c (14:25): I'll donate half the money to the members of the WHATWG and HTML WG",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:25): sweet!",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:25): how can i help?",
        "3b14b636129945831fcfcc7294686653 (14:25): 69b0d3dfe919a6b860a9fac82de52a7e: my mother always preferred the mountains to the desert",
        "3b14b636129945831fcfcc7294686653 (14:26): maybe transcripts are like an oasis?",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:26): aw man, i hate that word. I always forget there's two &quot;s&quot;s because I pronounce it &quot;dizurts&quot;",
        "ab7faae5d7b250ea8606486575f8f79c (14:28): 69b0d3dfe919a6b860a9fac82de52a7e: I'd like a face mould so I can disguise myself as you with a latex mask",
        "ab7faae5d7b250ea8606486575f8f79c (14:28): (You shouldn't get in trouble because you'll have a great alibi, being in a different continent)",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:28): wouldn't that be illegal for me to do",
        "ab7faae5d7b250ea8606486575f8f79c (14:28): Why would it?",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:29): aiding and abetting, conspiracy to commit, you name it",
        "ab7faae5d7b250ea8606486575f8f79c (14:29): I can tell you it's for a fancy dress party, and you won't know any better",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:29): luckily for me, i'm not so good with the masks",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:29): now if you want some normative text...",
        "3b14b636129945831fcfcc7294686653 (14:29): wow, 69b0d3dfe919a6b860a9fac82de52a7e would be in great company if they start making latex masks of him. Nixon, Salinas, ...",
        "ab7faae5d7b250ea8606486575f8f79c (14:30): was thinking more of Tom Cruise",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:30): maybe i could send some people wearing masks of me to commitee meetings at TPAC",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:30): that would save me a lot of time",
        "3b14b636129945831fcfcc7294686653 (14:31): ab7faae5d7b250ea8606486575f8f79c: you should just wear one of these http://en.wikipedia.org/wiki/File:Richard_Nixon_mask.jpg",
        "ab7faae5d7b250ea8606486575f8f79c (14:32): http://en.wikipedia.org/wiki/Richard_Nixon_mask - &quot;A Richard Nixon mask is a mask with the features of Richard Nixon.&quot; - wow",
        "3b14b636129945831fcfcc7294686653 (14:32): no one ever said wikipedia wasn't pedantic",
        "f139aba52f9fa1394b4034a7954b2220 (14:40): 69b0d3dfe919a6b860a9fac82de52a7e, leaving pubdate in is silly because it's a bad solution to the problem, regardless of whether or not there's another existing way to solve the problem",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:40): it's not _that_ bad a solution",
        "f139aba52f9fa1394b4034a7954b2220 (14:40): we shoud remove pubdate and then focus on finding a better solution, rather than doing it the other way",
        "f139aba52f9fa1394b4034a7954b2220 (14:41): it has all the problems of duplicated, hidden metadata",
        "f139aba52f9fa1394b4034a7954b2220 (14:41): how is that good in any way?",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:41): the perfect is the enemy of the merely good enough. Or in this case, the good is the enemy of the barely ok, but still.",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:41): duplicated hidden metadata is to be discouraged where possible, but dates in general are always hidden data",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:41): even &lt;time&gt; hides the time",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:41): it's not a black-and-white world",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:42): and other assorted aphorisms",
        "a11aabeeceeae6b8cb5d12ea06b56554 (14:42): sees grey, too",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:42): (sorry, it's late and i've been watching too much west wing.)",
        "f139aba52f9fa1394b4034a7954b2220 (14:42): no, time annotates visible data with an unambiguous version",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:42): that's duplication of information with a hidden copy",
        "f139aba52f9fa1394b4034a7954b2220 (14:42): anyway, I must go. i will respond to your e-mail later with improved arguments",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:42): k :-)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (14:44): wonders what he was going to buy today‚Ä¶ something he needed to buy, but keeps forgetting‚Ä¶",
        "ab7faae5d7b250ea8606486575f8f79c (14:44): Paperclips?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (14:45): No.",
        "ab7faae5d7b250ea8606486575f8f79c (14:45): Salt?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (14:46): No, but maybe it was pepper‚Ä¶",
        "ab7faae5d7b250ea8606486575f8f79c (14:46): Hmm, I'm all out of ideas",
        "a11aabeeceeae6b8cb5d12ea06b56554 (14:47): needs to work out quite what he's doing this year",
        "a924fb58d2c25874322f4e5126f608b9 (14:57): 69b0d3dfe919a6b860a9fac82de52a7e: Wouldn't &lt;time rel=something&gt; unambiguously link it to the article?",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:57): &lt;time&gt; doesn't have a rel=&quot;&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:57): (rel=&quot;&quot; is for links)",
        "a924fb58d2c25874322f4e5126f608b9 (14:58): I know, but inventing an attribute that does the same (even or rel)",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:58): i thought the problem was that we were using an attribute",
        "a924fb58d2c25874322f4e5126f608b9 (14:59): That's part of it, another part is that it often duplicates the date",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:00): adding an attribute that basically duplicates class=&quot;&quot; but with special keywords seems a bit heavy-handed for this small use case",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:00): but it might be the only solution that makes sense",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:00): anyway, i really must sleep",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:00): nn",
        "a924fb58d2c25874322f4e5126f608b9 (15:00): Well, that's like pubdate duplicates time, isn't it?",
        "a924fb58d2c25874322f4e5126f608b9 (15:11): I'm surprised Sam says this working group [htmlwg] has a lot of communication problems, considering other WGs like PF are unable to communicate at all outside telcons",
        "a924fb58d2c25874322f4e5126f608b9 (15:11): How far does the scale go?",
        "ab7faae5d7b250ea8606486575f8f79c (15:11): Maybe you are mistaking quantity of communication for quality",
        "a924fb58d2c25874322f4e5126f608b9 (15:13): Communication that doesn't happen is the worst quality of all",
        "ab7faae5d7b250ea8606486575f8f79c (15:15): Worse than e.g. offensive communication that causes people to stay away and avoid communicating again in the future?",
        "a924fb58d2c25874322f4e5126f608b9 (15:17): Yes, better to try and fail than never to try at all.",
        "a924fb58d2c25874322f4e5126f608b9 (15:18): Besides, we know from experience that these people tell other people about staying away, so we'll find out about it."
    ],
    "person_ids": [
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "ab7faae5d7b250ea8606486575f8f79c",
        "a924fb58d2c25874322f4e5126f608b9",
        "f139aba52f9fa1394b4034a7954b2220",
        "3b14b636129945831fcfcc7294686653",
        "a11aabeeceeae6b8cb5d12ea06b56554"
    ]
}