{
    "id": "c9441a99a82a78b398fca5ee301834bf",
    "messages": [
        "88d4d34a8064a4ff39fd5e144eea7762 (19:20): So, suppose I'm a web developer and give users the ability to create images somehow.  Suppose the user provides no alt text, for whatever reason.  Should I put no alt attribute, or empty alt text, or something else?  Is there any guidance about this?",
        "a924fb58d2c25874322f4e5126f608b9 (19:21): That's one of the controversial areas",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:21): Yeah, I figured.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:22): It seems to me that logically, you'd want to either have no alt attribute or a magic value.  Having alt=&quot;&quot; or the filename or whatever strikes me as bad from everyone's perspective.",
        "a924fb58d2c25874322f4e5126f608b9 (19:22): Yes",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:23): But it also strikes me that if you allow this, then suddenly zillions of sites will have to switch from alt=&quot;&quot; to your magic value and everyone will be forced to admit that few sites have ever used decent alt text.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:23): As opposed to calling required alt text a success, as a Mozilla developer recently did on public-html.",
        "a924fb58d2c25874322f4e5126f608b9 (19:23): Heh",
        "b25b6b77a0087ff8385941e5545d32ea (19:23): You just use missing alt as your magic value",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:23): Yes, that seems to make the most sense.",
        "a924fb58d2c25874322f4e5126f608b9 (19:23): Well, the controversy isn't just the syntax, but also whether it should be conforming or not",
        "b25b6b77a0087ff8385941e5545d32ea (19:23): Not to the Experts",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:24): But then you get people complaining that your app isn't conforming, unless missing alt text is conforming.",
        "b25b6b77a0087ff8385941e5545d32ea (19:24): unless they changed their minds",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:24): So you're pressured into missing alt text.",
        "a924fb58d2c25874322f4e5126f608b9 (19:24): That's how it ends up, yes",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:24): I mean, you're pressured into adding empty or useless alt text.",
        "a924fb58d2c25874322f4e5126f608b9 (19:24): If missing alt is the solution, and missing alt is nonconforming, you get bogus alt",
        "a924fb58d2c25874322f4e5126f608b9 (19:25): If magic value is the solution, you get bogus magic value",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:25): What I'd like is some guidance that actually tells me what the best course of action is for screen readers.",
        "ab7faae5d7b250ea8606486575f8f79c (19:25): Current or future or science-fiction screen readers?",
        "a924fb58d2c25874322f4e5126f608b9 (19:25): If missing alt is the solution, and missing alt is conforming, you get &quot;but that's not machine checkable&quot;",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:25): Surely screen readers need to know the difference between &quot;don't know what the alt should be&quot; and &quot;alt should be empty, this is decorative&quot;.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:25): Current or near future.",
        "a924fb58d2c25874322f4e5126f608b9 (19:25): Screen readers want missing alt",
        "a924fb58d2c25874322f4e5126f608b9 (19:25): They have to handle those anyway",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:26): a924fb58d2c25874322f4e5126f608b9, do they want it more than filler like the filename?",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:26): I assume they could fill in the filename themselves.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:26): Or other useful info.",
        "ab7faae5d7b250ea8606486575f8f79c (19:26): Decorative is easy, that's just alt=&quot;&quot;",
        "a924fb58d2c25874322f4e5126f608b9 (19:26): I'm sure you can find enough screen readers to justify either case",
        "a924fb58d2c25874322f4e5126f608b9 (19:26): Because apparently we have to consider every version of every product ever released",
        "a924fb58d2c25874322f4e5126f608b9 (19:27): (JAWS is currently version 11, but version 4 is brought up in discussions...)",
        "ab7faae5d7b250ea8606486575f8f79c (19:27): And every user's configuration of said products",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:30): Maybe nobody upgrades JAWS because of how ludicrously expensive it is?",
        "ab7faae5d7b250ea8606486575f8f79c (19:31): That's the common argument",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:32): A blind person once told me Mac's built-in screen reader is the best.",
        "ab7faae5d7b250ea8606486575f8f79c (19:33): Other blind people may say very different things",
        "ab7faae5d7b250ea8606486575f8f79c (19:34): is unaware of objective comparisons between the various products",
        "ab7faae5d7b250ea8606486575f8f79c (19:34): guesses people learn to use one and then want to stick with it for a long time, because it's so hard to learn another even if it's supposedly better",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:34): What he said completely met my expectations of the different platforms, though, so I'm inclined to believe him.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:35): He said on Windows, the software is lousy, made by third parties, and unreasonably expensive.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:35): On Linux, it's still lousy, but at least it's free.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:35): On Mac, it comes with the OS and is excellent.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:35): I'd expect Apple to make a good screen reader.  It's the sort of thing they do well.  UI, basically.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:36): Whereas open-source stuff, and random special-purpose Windows apps, tend to have lousy UI.",
        "ab7faae5d7b250ea8606486575f8f79c (19:38): Looks like JAWS is about $900, but presumably you get significant discounts via employers or other groups",
        "ab7faae5d7b250ea8606486575f8f79c (19:38): so maybe JAWS + a cheap Windows PC/laptop is still cheaper than a Mac",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:39): You can surely get a Mac of some kind for $900.",
        "ab7faae5d7b250ea8606486575f8f79c (19:40): You can, but you can get a Windows one for much less, and the difference may be greater than a discounted JAWS",
        "ab7faae5d7b250ea8606486575f8f79c (19:41): Seems like it won't be a huge difference, though",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:41): Why do you assume that you can get a discounted JAWS so easily?",
        "a924fb58d2c25874322f4e5126f608b9 (19:46): Isn't that the norm?",
        "a924fb58d2c25874322f4e5126f608b9 (19:46): Bulk discounts for organizations",
        "ab7faae5d7b250ea8606486575f8f79c (19:46): 88d4d34a8064a4ff39fd5e144eea7762: Because they talk about multi-user pricing on their site, and because I vaguely remember some mentioning how people often get that kind of thing through an employer rather than buying it personally",
        "ab7faae5d7b250ea8606486575f8f79c (19:46): though I could be entirely misremembering and/or wrong",
        "ab7faae5d7b250ea8606486575f8f79c (19:46): s/some/someone/",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:46): a924fb58d2c25874322f4e5126f608b9, if you have an entire organization of blind people, yes.",
        "65325d50b2e25aca54bc871b89758c9c (19:47): I assume they can charge so much for JAWS because users can get some kind of subsidy",
        "ab7faae5d7b250ea8606486575f8f79c (19:47): 88d4d34a8064a4ff39fd5e144eea7762: Any reasonably large organisation will probably have enough to make it worthwhile",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:47): On the other hand, maybe blind people do tend to work for companies full of blind people.  I suppose they'd have some trouble at a random employer, even in a carefully-selected field.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:47): wonders about that.",
        "a924fb58d2c25874322f4e5126f608b9 (19:48): I would assume most blind people are members of an interest organization for blind (or somewhat more general)",
        "1f8387eb43f131d7c309a90a4e36b5cb (19:48): The first time I ever saw a blind person actually at work was here at Google.",
        "1f8387eb43f131d7c309a90a4e36b5cb (19:48): Dude works in one of the nearby buildings.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:48): a924fb58d2c25874322f4e5126f608b9, *most*?  Really?",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:49): I can't imagine it's most.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:49): 1f8387eb43f131d7c309a90a4e36b5cb, I'd be totally unsurprised if Google made a point of employing more blind and deaf people than normal.",
        "1f8387eb43f131d7c309a90a4e36b5cb (19:49): Indeed.",
        "a924fb58d2c25874322f4e5126f608b9 (19:49): 88d4d34a8064a4ff39fd5e144eea7762: Why not?",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:49): Do you know what he does?",
        "1f8387eb43f131d7c309a90a4e36b5cb (19:49): 88d4d34a8064a4ff39fd5e144eea7762: No clue.",
        "1f8387eb43f131d7c309a90a4e36b5cb (19:49): I just see him at lunch.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:50): a924fb58d2c25874322f4e5126f608b9, because . . . there are surely way more blind people than employees of blind-person advocacy groups?",
        "b25b6b77a0087ff8385941e5545d32ea (19:50): So if I have a document with some timeouts and document.write in it in such a way that the original document is blown away, should the timeouts still fire?",
        "1f8387eb43f131d7c309a90a4e36b5cb (19:51): b25b6b77a0087ff8385941e5545d32ea: first thought is no.  That is not based on any evidence or even knowledge, though.",
        "b25b6b77a0087ff8385941e5545d32ea (19:51): Yeah that is my first thought, based on the same",
        "ab7faae5d7b250ea8606486575f8f79c (19:51): 1f8387eb43f131d7c309a90a4e36b5cb: Are you attempting to apply logic to determine the expected outcome?",
        "65325d50b2e25aca54bc871b89758c9c (19:51): wikipedia says: http://en.wikipedia.org/wiki/Blindness#Epidemiology",
        "1f8387eb43f131d7c309a90a4e36b5cb (19:51): ab7faae5d7b250ea8606486575f8f79c: Yes.  In absence of reality, logic is all we have.",
        "ab7faae5d7b250ea8606486575f8f79c (19:52): 1f8387eb43f131d7c309a90a4e36b5cb: I'm afraid you are violating this channel's rules",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:53): 65325d50b2e25aca54bc871b89758c9c, I guess when it comes to blindness you have to remember that not everyone who's legally blind is really fully blind.",
        "65325d50b2e25aca54bc871b89758c9c (19:53): &quot;do the timeouts still fire&quot; is probably a more relevant question",
        "a924fb58d2c25874322f4e5126f608b9 (19:53): 88d4d34a8064a4ff39fd5e144eea7762: How does employees figure into it?",
        "1f8387eb43f131d7c309a90a4e36b5cb (19:53): ab7faae5d7b250ea8606486575f8f79c: Damn, you're right.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:53): My mother once taught an art course with a blind art major in it, who was an excellent student and got an A.",
        "a924fb58d2c25874322f4e5126f608b9 (19:53): I said member, not employee",
        "1f8387eb43f131d7c309a90a4e36b5cb (19:53): I need to base more opinions on knee-jerk opinions, then.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:53): She could still see a little.",
        "65325d50b2e25aca54bc871b89758c9c (19:53): 88d4d34a8064a4ff39fd5e144eea7762: that article distinguishes those of the legally blind who are not totally blind as &quot;low vision&quot;",
        "65325d50b2e25aca54bc871b89758c9c (19:54): although many low vision persons have low enough vision that they would in practice need a screen reader to use a compuer",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:54): a924fb58d2c25874322f4e5126f608b9, oh, I misread you.  Then you might be right.",
        "65325d50b2e25aca54bc871b89758c9c (19:54): &quot;Approximately ten percent of those deemed legally blind, by any measure, have no vision. The rest have some vision, from light perception alone to relatively good acuity. http://en.wikipedia.org/wiki/Low_vision is sometimes used to describe visual acuities from 20/70 to 20/200.&quot;",
        "1f8387eb43f131d7c309a90a4e36b5cb (19:55): Damn, really?  Without contacts I'm legally blind, then.",
        "ab7faae5d7b250ea8606486575f8f79c (19:55): 1f8387eb43f131d7c309a90a4e36b5cb: Opinions are fine because they're easy to detect and ignore; logic is dangerous because it tricks you into believing its conclusions are true",
        "1f8387eb43f131d7c309a90a4e36b5cb (19:55): Makes sense.  There's no way I can drive without contacts or glasses.  I'd kill myself and others.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:55): 1f8387eb43f131d7c309a90a4e36b5cb, it all says &quot;with best correction possible&quot;.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:56): So it's measuring how good your vision is *with* contacts or glasses or whatever.",
        "ab7faae5d7b250ea8606486575f8f79c (19:56): so we should stick to opinions and facts (and ignore the former)",
        "1f8387eb43f131d7c309a90a4e36b5cb (19:56): 88d4d34a8064a4ff39fd5e144eea7762: Ah, kk.  Well, still, my statement stands.  Without contacts I'm blind.  ^_^",
        "1f8387eb43f131d7c309a90a4e36b5cb (19:56): ab7faae5d7b250ea8606486575f8f79c: That's disturbingly convincing.",
        "ab7faae5d7b250ea8606486575f8f79c (19:56): 88d4d34a8064a4ff39fd5e144eea7762: Are cyborg eyes possible?",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:56): ab7faae5d7b250ea8606486575f8f79c, surely you mean we should ignore the latter.",
        "ab7faae5d7b250ea8606486575f8f79c (19:57): Oh, it says &quot;spectacle or contact lens correction&quot;, which excludes that",
        "1f8387eb43f131d7c309a90a4e36b5cb (19:57): 88d4d34a8064a4ff39fd5e144eea7762: You and I have nearly identical commenting patterns.  (Based on gavinsharp's room stats.)",
        "ab7faae5d7b250ea8606486575f8f79c (19:58): (Well, one of the pages says that)",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:59): 1f8387eb43f131d7c309a90a4e36b5cb, oh, you mean like time zones.  Odd.  You're on the West Coast, right?",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:59): *And* I tend to go to bed early, which should exacerbate the difference.",
        "1f8387eb43f131d7c309a90a4e36b5cb (19:59): 88d4d34a8064a4ff39fd5e144eea7762: Now I am, yeah.  But I was Central for most of my commenting history.",
        "88d4d34a8064a4ff39fd5e144eea7762 (19:59): Hmm, that makes more sense.",
        "1f8387eb43f131d7c309a90a4e36b5cb (20:00): 88d4d34a8064a4ff39fd5e144eea7762: Also, I'm rarely in the room in the evening, so you going to bed early actually helps align us.",
        "88d4d34a8064a4ff39fd5e144eea7762 (20:00): Blue isn't even visible for either of us.",
        "1f8387eb43f131d7c309a90a4e36b5cb (20:00): I'm pretty sure I've never commented in a blue time.",
        "88d4d34a8064a4ff39fd5e144eea7762 (20:01): I'm sure I have occasionally, although it doesn't say the time zone.",
        "b25b6b77a0087ff8385941e5545d32ea (20:03): Isn't gavin in Mountain View? Although his server might not be of course",
        "1f8387eb43f131d7c309a90a4e36b5cb (20:03): It has to be an american time zone, or else I'd be in blue at some point.",
        "88d4d34a8064a4ff39fd5e144eea7762 (20:04): What if it's a Canadian time zone?!",
        "1f8387eb43f131d7c309a90a4e36b5cb (20:04): We own those time zones too.",
        "1f8387eb43f131d7c309a90a4e36b5cb (20:04): alternately: I meant american supercontinent.",
        "88d4d34a8064a4ff39fd5e144eea7762 (20:04): No one in America follows Newfoundland time.",
        "88d4d34a8064a4ff39fd5e144eea7762 (20:04): It's not aligned on one-hour boundaries.",
        "1f8387eb43f131d7c309a90a4e36b5cb (20:04): Nobody cares about newfie time, though, so it's all right.",
        "88d4d34a8064a4ff39fd5e144eea7762 (20:04): Also too far east.",
        "88d4d34a8064a4ff39fd5e144eea7762 (20:04): Granted.",
        "88d4d34a8064a4ff39fd5e144eea7762 (20:05): Typical Wikipedia moment: &quot;Oh, so is that what it's called?  *reads*&quot;  http://en.wikipedia.org/wiki/Tactile_paving",
        "1f8387eb43f131d7c309a90a4e36b5cb (20:05): Huh.  I always thought that was just for grip or something.",
        "88d4d34a8064a4ff39fd5e144eea7762 (20:06): Yeah, I never realized it was for blind people, although it makes sense.",
        "1f8387eb43f131d7c309a90a4e36b5cb (20:08): boblet's in Japan, right?",
        "a924fb58d2c25874322f4e5126f608b9 (20:10): His 404 page is Japanese, at least",
        "ab7faae5d7b250ea8606486575f8f79c (20:10): always knew they were for blind people, but assumed they were to tell blind people where it was safe to cross the road, rather than to tell them where it's *not* safe to walk without care",
        "1f8387eb43f131d7c309a90a4e36b5cb (20:11): ab7faae5d7b250ea8606486575f8f79c: Good accessiblity is multi-purpose!",
        "88d4d34a8064a4ff39fd5e144eea7762 (20:17): ab7faae5d7b250ea8606486575f8f79c, that wouldn't explain why they're on the edges of train platforms.",
        "ab7faae5d7b250ea8606486575f8f79c (20:20): 88d4d34a8064a4ff39fd5e144eea7762: Indeed, my assumption of the explanation did not fit perfectly with reality"
    ],
    "person_ids": [
        "88d4d34a8064a4ff39fd5e144eea7762",
        "a924fb58d2c25874322f4e5126f608b9",
        "b25b6b77a0087ff8385941e5545d32ea",
        "ab7faae5d7b250ea8606486575f8f79c",
        "65325d50b2e25aca54bc871b89758c9c",
        "1f8387eb43f131d7c309a90a4e36b5cb"
    ]
}