{
    "id": "ca0721013c894bfbd6a6ea0660858ca0",
    "messages": [
        "cc097e0d7183ae8436e7df709553c8c0 (17:26): &quot;Other developers for various reasons will choose not to use HTML5 technologies and will need to use ARIA to make their resources more accessible.&quot; -- http://www.w3.org/mid/<email/>",
        "cc097e0d7183ae8436e7df709553c8c0 (17:26): what about developers who for various reasons will choose to not use ARIA?",
        "3e7516c950f70b65aeff2bf482483cdd (17:28): if they use HTML 5 in an HTML 5 capapble browser, well and good. If not, they are breaking accessibility.",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (17:28): I think there is some underlying assumption that HTML5 won't work for the foreseeable future and ARIA will, which may be correct if you take Internet Explorer into account, though for the really simple HTML5 elements, such as &lt;aside&gt;, there is no such issue.",
        "587bf8b858e15d03428e1415c33c38ef (17:38): yes, e3fb62ebfa4f36acf5cbff6a6ed0f2e0, the WG owes responses to public-html-comments. a best-effort up to last call, after which we must be exhaustive",
        "587bf8b858e15d03428e1415c33c38ef (17:39): I haven't looked for a while... let's see how many there are...",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (17:39): I guess it is still manageable...",
        "3e7516c950f70b65aeff2bf482483cdd (17:41): e3fb62ebfa4f36acf5cbff6a6ed0f2e0, I don't think the assumption is that HTML5 won't work for the forseeable future, just that in (for example) IE some useful stuff won't work *now* and people want to ship applications this month...",
        "587bf8b858e15d03428e1415c33c38ef (17:43): which assumption, 3e7516c950f70b65aeff2bf482483cdd ? HTML5 works better than HTML 4, currently, in my experience.",
        "3e7516c950f70b65aeff2bf482483cdd (17:45): 587bf8b858e15d03428e1415c33c38ef, the one that Anne postulated",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:46): http://ajaxian.com/archives/gears-and-web-standards",
        "3e7516c950f70b65aeff2bf482483cdd (17:46): e.g. &lt;input type=&quot;date&quot;&gt; is great where it works, but lots of people are requiring date pickers that also work in IE6 ...",
        "a9b326df4e6da61c5b6f5e1058be83a2 (17:46): http://gearsblog.blogspot.com/2008/04/gears-and-standards.html",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (17:49): 3e7516c950f70b65aeff2bf482483cdd, you could build those on top of &lt;input type=date&gt; as far as I can tell",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (17:49): (in fact, libraries have been written to do exactly that)",
        "3e7516c950f70b65aeff2bf482483cdd (18:01): sure, but those currently need ARIA to give the feedback to screenreaders.",
        "3e7516c950f70b65aeff2bf482483cdd (18:02): *currently*. And while HTML is in draft, as a developer you take a bet on what is stable and what is just a strawman for now",
        "587bf8b858e15d03428e1415c33c38ef (18:04): what works is the html5lib parser, I guess. I'm kinda frustrated that we don't ship the parsing rules as its own spec",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:04): If ARIA is still changing (and it was) and screen readers can still adapt they could support either syntax as far as I can tell",
        "587bf8b858e15d03428e1415c33c38ef (18:05): noodles on a note about the parsing rules and the available testing materials",
        "3f2e2531201cfbf853f16f668132eaf2 (18:22): 587bf8b858e15d03428e1415c33c38ef: But the parser has to do things like execute scripts, which can do document.write and affect the future execution of the parser, and document.write depends on the definition of HTMLDocument, which depends on everything else, so it seems unclear how the parser could be specified in isolation, which seems to be an effective excuse(/reason) for not doing any work to split it out",
        "3e7516c950f70b65aeff2bf482483cdd (18:23): e3fb62ebfa4f36acf5cbff6a6ed0f2e0, sure.",
        "587bf8b858e15d03428e1415c33c38ef (18:23): there are quite a few uses cases where the parser doesn't have to execute scripts",
        "587bf8b858e15d03428e1415c33c38ef (18:24): html5lib doesn't include a js interpreter, for example. somebody thought it was worth implementing. I use it now and again",
        "3f2e2531201cfbf853f16f668132eaf2 (18:24): There are some where the parser does have to, and we don't want to maintain two separate copies of the parser spec",
        "587bf8b858e15d03428e1415c33c38ef (18:24): I think it's straightforward to split out the parser spec without maintaining two copies. yes, there would be cross-references and dependencies, but they'd be manageable.",
        "587bf8b858e15d03428e1415c33c38ef (18:25): but anyway... I've said all this before; what I think doesn't matter that much unless I'm doing the editing.",
        "3f2e2531201cfbf853f16f668132eaf2 (18:25): (&lt;html manifest&gt; is the other main case I can remember where the parser depends on specification of other stuff)",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:25): If you have dependencies one of the two won't go faster to REC than the other...",
        "587bf8b858e15d03428e1415c33c38ef (18:26): it very well might, e3fb62ebfa4f36acf5cbff6a6ed0f2e0, as review of a more modular spec might be easier to manager",
        "587bf8b858e15d03428e1415c33c38ef (18:26): manage",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:26): 3f2e2531201cfbf853f16f668132eaf2, interfaces is another dependency",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:27): 587bf8b858e15d03428e1415c33c38ef: But if we have inter-dependancies, it doesn't reduce the amount to review upon completion, really, does it?",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:27): 587bf8b858e15d03428e1415c33c38ef, I thought that being in REC required the spec upon which you're dependent to be no more than one level behind, which means PR...",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:27): 587bf8b858e15d03428e1415c33c38ef: as neither could move to REC before the other",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:27): (from my memory at least)",
        "587bf8b858e15d03428e1415c33c38ef (18:27): but both might reach REC sooner",
        "587bf8b858e15d03428e1415c33c38ef (18:29): and CR is a quite useful milestone",
        "3f2e2531201cfbf853f16f668132eaf2 (18:30): a11aabeeceeae6b8cb5d12ea06b56554: If reviewing a spec that's half the size requires less than half the effort (because it's easier to manage, less intimidating to reviewers, etc), then one spec split into two would be reviewed quicker, if the added effort of handling the inter-dependencies is less than the effort saved by smallness",
        "3f2e2531201cfbf853f16f668132eaf2 (18:33): (I have no idea how to quantify that realistically, though)",
        "3f2e2531201cfbf853f16f668132eaf2 (18:35): is always slightly surprised at the ability to do evil things like http://software.hixie.ch/utilities/js/live-dom-viewer/?%3Cbody%3E%0A%3Cstyle%3Ediv%7Bbackground%3Agreen%7D%3C%2Fstyle%3E%0A%3Cscript%3Edocument.write('%3Cdi')%3C%2Fscript%3Ev%3EThis%20should%20be%20green",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:35): Anyway, we still haven't solved the editor problem...",
        "587bf8b858e15d03428e1415c33c38ef (18:40): e3fb62ebfa4f36acf5cbff6a6ed0f2e0, is anybody playing with the svg/mathml parsing stuff in html5lib? do you know?",
        "587bf8b858e15d03428e1415c33c38ef (18:40): still hasn't studied the bifurcated content model changes",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:41): I think the plan is to ship a interim release of html5lib and after that integrate MathML/SVG and create lots of tests for them.",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (18:41): jgraham_ is working on the interim release",
        "3f2e2531201cfbf853f16f668132eaf2 (18:41): As far as I'm aware, everyone is trying to match the spec just before the namespace changes, before adding all the new stuff",
        "3f2e2531201cfbf853f16f668132eaf2 (18:42): (where &quot;everyone&quot; means the html5lib people that I've heard, and (I think) hsivonen, and me (when I get around to working on my parser again))"
    ],
    "person_ids": [
        "cc097e0d7183ae8436e7df709553c8c0",
        "3e7516c950f70b65aeff2bf482483cdd",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0",
        "587bf8b858e15d03428e1415c33c38ef",
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "3f2e2531201cfbf853f16f668132eaf2",
        "a11aabeeceeae6b8cb5d12ea06b56554"
    ]
}