{
    "id": "ccac49fe36cd1aa3ec48837291f4207c",
    "messages": [
        "69b0d3dfe919a6b860a9fac82de52a7e (12:17): Each URI begins with a scheme name that refers to a specification for",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:17): assigning identifiers within that scheme.",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:17): The scheme registry maintains the mapping between scheme names and",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:17): their specifications.",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:17): -- http://www.ietf.org/rfc/rfc3986.txt (3.1:1 and 3.1:3)",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:27): a9b326df4e6da61c5b6f5e1058be83a2: IRI schemes must be registered or must start with &quot;x-&quot;, IIRC",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:27): a9b326df4e6da61c5b6f5e1058be83a2: or perhaps it was that the unregistered ones need to contain a '-'",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:28): a9b326df4e6da61c5b6f5e1058be83a2: anyway, if there's a list of Support Existing Content de facto IRI schemes that I should whitelist in defiance of the RFCs, I could do that",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:28): a9b326df4e6da61c5b6f5e1058be83a2: javascript: is already allowed",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:28): about the registration constraint, according to RFC 3986 and 3987, you mean?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:29): irc: should be whitelisted, if it comes to that",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:29): I think",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:30): but I can't find any assertion in RFC 3986 that schemes must be registered",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:30): that UNREGISTERED_IANA_SCHEME thing is a Java error, right?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:31): from a Java library of some kind, I mean?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:31): that is, not some constraint check that you have added to the code yourself?",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:32): a9b326df4e6da61c5b6f5e1058be83a2: http://tools.ietf.org/html/bcp35 says non-IETF schema names need to have a hyphen in them",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:32): a9b326df4e6da61c5b6f5e1058be83a2: the error comes from the Jena IRI lib",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:32): a9b326df4e6da61c5b6f5e1058be83a2: and in general, it appears that the Jena IRI guy read the RFCs very carefully",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:32): s/schema/scheme/",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:35): as far I can see, BCP 35 defines a process for registering scheme names",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:35): it does not define a what a conformant unregistered URI is",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:35): but I'm reading it right now anyway",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:36): &quot;Each URI begins with a scheme name that refers to a specification for assigning identifiers within that scheme.",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:36): &quot;",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:36): &quot;The scheme registry maintains the mapping between scheme names and their specifications.",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:36): &quot;",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:37): a9b326df4e6da61c5b6f5e1058be83a2: it's quite possible that an IRI5 spec is needed in due course. for example, the restrictions that IRI compliance places on javascript: are unhelpful",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:38): b8810fee2f4a71f849f3f7409546d1d9 - yeah",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:40): very much a case of the RFCs being broken if they do in fact make actual use of irc: and javascript: in existing content non-conformant",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:43): http://wiki.whatwg.org/wiki/De_facto_IRI_schemes",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:43): please fill in other cases you might find",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:43): b8810fee2f4a71f849f3f7409546d1d9 - OK, will do",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:45): I'll fix irc: after lunch",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:50): b8810fee2f4a71f849f3f7409546d1d9 - as I read it at least, BCP 35 is not asserting that any given unregistered scheme name that lacks a dash is non-conformant; it's instead saying (1) that IETF-registered scheme names must not contain a dash and (2) that scheme names for &quot;schemes registered in alternative trees&quot; must be identified by a unique prefix, followed by a dash, followed by some identifier unique within that alternative.",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:50): 69b0d3dfe919a6b860a9fac82de52a7e: have you analyzed Web content for IRI schemes by any chance?",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:50): a9b326df4e6da61c5b6f5e1058be83a2: yeah, I can't find a clear sentence requiring registration, either",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:51): a9b326df4e6da61c5b6f5e1058be83a2: in general, for HTML5 validation whether to require IANA registration is a practical judgment call",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:51): a9b326df4e6da61c5b6f5e1058be83a2: it is feasible to require language tags and charsets to be registered",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:52): a9b326df4e6da61c5b6f5e1058be83a2: it isn't feasible to require MIME types to be registered",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:52): a9b326df4e6da61c5b6f5e1058be83a2: apparently, it isn't feasible for IRI schemes, either",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:52): but I'm hoping I could get away  with a whitelist instead of opening it to everything",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:53): b8810fee2f4a71f849f3f7409546d1d9 - seems like maybe not, since neither BCP 35 or RFC 3986 seem to say that only registered names are conformant. BCP 35 does not seem to say anything at all about unregistered schemes. It seems to only be defining rules for registered names.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:54): b8810fee2f4a71f849f3f7409546d1d9 - whitelist + emitting a warning for others (rather than error) would seem appropriate",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:55): Is there a way you can emit a warning instead of an error for this particular check?",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:55): the bigger problem that registration as such is that the draft registrations for irc and javascript languish instead of making it through the system swiftly",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:55): a9b326df4e6da61c5b6f5e1058be83a2: the infrastructure does not support warnings for these checks",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:55): OK",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:55): a9b326df4e6da61c5b6f5e1058be83a2: changing that would not be pretty :-(",
        "a9b326df4e6da61c5b6f5e1058be83a2 (12:56): yeah, I figured that was probably so",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:00): b8810fee2f4a71f849f3f7409546d1d9 - Another thing I've been wanting to ask 69b0d3dfe919a6b860a9fac82de52a7e: If &lt;meta@http-equiv=Content-Type...&gt; is not conformant according to HTML5, then the mass of content out there that has instances of that in it are all going to fail conformance-checking, right?",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:00): a9b326df4e6da61c5b6f5e1058be83a2: yes, changing the doctype is not enough to become conferming ATM, you also need to change the meta charset thingy",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:01): conforming even",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:02): a9b326df4e6da61c5b6f5e1058be83a2: I've argued that for compat with legacy markup generation code we should make the old-style long form conforming",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:02): a9b326df4e6da61c5b6f5e1058be83a2: 69b0d3dfe919a6b860a9fac82de52a7e has disagreed so far",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:02): Yeah, I would argue for that too",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:03): Otherwise, what I fear conformance checkers will do is just add an option 'Ignore error messages about &lt;meta http-equiv=&quot;Content-Type&quot;&gt;'",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:04): rather than the maintainer getting 500 messages a week from users bitching about the checker",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:05): a9b326df4e6da61c5b6f5e1058be83a2: well, the #1 contender issue for that is the requirement to have wrapper &lt;p&gt;s in more places than in HTML 4.01 Transitional",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:05): I've not run into that problem so far with pages I've checked with validator.nu",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:06): So I guess in instances I author, it's something I'm already doing right :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:06): me too :-)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:07): so to hell with all the other people who mark stuff up in such a way that it causes them to run into that",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:07): sucks for them",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:07): too bad",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:07): is kidding of course",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:08): the best measure of some of those cases is going to be the maintainers of conformance checkers, really",
        "3f2e2531201cfbf853f16f668132eaf2 (13:10): Should the HTML4/XHTML1/etc doctypes be conforming HTML5 too? Then people wouldn't have any necessary changes to make before being conforming HTML5",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:12): 3f2e2531201cfbf853f16f668132eaf2: yeah, that's the obvious next question. and politically, it wouldn't fly. at least not easily",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:12): But there is a finite set of them",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:13): Though I guess it comes down to the supported vs. conformant distinction",
        "3f2e2531201cfbf853f16f668132eaf2 (13:14): An anonymous developer should set up a politically incorrect fork of the conformance checker, and see if authors like it more",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:14): true",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:17): but it does make sense to have automated checkers flagging instances of this stuff -- markup cluttered with unnecessary and arcane information that browsers just discard or ignore anyway",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:17): there should be some means to discourage use of that markup",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:17): and if conformance checkers don't flag it, there won't be",
        "3f2e2531201cfbf853f16f668132eaf2 (13:21): There are far more significant errors on most web pages, so perhaps more benefit would come from a conformance checker that people will use more often because it doesn't complain at them so much about minor things with little practical benefit, rather than a conformance checker which flags more issues and drives away more users",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:23): 3f2e2531201cfbf853f16f668132eaf2 - aye",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:29): http://en.wikipedia.org/wiki/URI_scheme#Unofficial_but_common_URI_schemes",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:34): well, it looks like trying to enforce the IANA registry is pointless",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:35): and using wikipedia as the registry would be arbitrary",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:35): sign",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:35): sigh even",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:37): a9b326df4e6da61c5b6f5e1058be83a2: what's your take on backslashes in file: URLs?",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:38): it seems to me I have to do IRI checking the other way round",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:40): I have seen enough questions on mailing lists about backslashes in file: URLs to make me think that it might be another case of be liberal rather that trying to educate",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:40): b8810fee2f4a71f849f3f7409546d1d9",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:41): a9b326df4e6da61c5b6f5e1058be83a2: I see",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:52): mjs: regarding WebKit video selection:",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:52): bug #1: video/mp4 is skipped if it declares codecs: http:/ b8810fee2f4a71f849f3f7409546d1d9.iki.fi/test/moz/video-selection/source-mp4-params.html",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:54): bug #2: Ogg in &lt;source&gt; never plays even with XiphQT",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:54): http:/ b8810fee2f4a71f849f3f7409546d1d9.iki.fi/test/moz/video-selection/source-ogv.html",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:54): http:/ b8810fee2f4a71f849f3f7409546d1d9.iki.fi/test/moz/video-selection/source-ogg.html",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:54): those two don't play when",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:54): http:/ b8810fee2f4a71f849f3f7409546d1d9.iki.fi/test/moz/video-selection/src-ogg.html",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:54): and",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:54): http:/ b8810fee2f4a71f849f3f7409546d1d9.iki.fi/test/moz/video-selection/src-ogv.html",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:54): do"
    ],
    "person_ids": [
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "3f2e2531201cfbf853f16f668132eaf2"
    ]
}