{
    "id": "ccfeb8fb39295020a40bba923e0bb392",
    "messages": [
        "f47636673b14c54021a69dc06f6a19fb (21:19): http://lucumr.pocoo.org/2009/3/2/std-stands-for-sleazy-tattered-and-dead",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (21:19): Title: ‚ÄúSTD‚Äù stands for Sleazy, Tattered and Dead ª Armin Ronacher (at lucumr.pocoo.org)",
        "f47636673b14c54021a69dc06f6a19fb (21:19): rants about the standard library in python but which has interesting parallels",
        "f47636673b14c54021a69dc06f6a19fb (21:20): the post has been triggered by the discussion here http://lucumr.pocoo.org/2009/3/1/the-1000-speedup-or-the-stdlib-sucks#comment-2410",
        "0a39f78bcb297ab0ebe8a29c28bfed89 (21:20): Title: The 1000% Speedup, or, the stdlib sucks ª Armin Ronacher (at lucumr.pocoo.org)",
        "f47636673b14c54021a69dc06f6a19fb (21:20): &gt;&quot;If something is deeply flawed / problematic I'll file a bug. Generally speaking I prefer to not use the standard library and build on third party libraries which adapt a lot quicker. &quot;",
        "f47636673b14c54021a69dc06f6a19fb (21:21): In in the std library article",
        "f47636673b14c54021a69dc06f6a19fb (21:21): &gt;&quot;A lot of stuff ended up in Python a long, long time ago. And that was fine for the time. I can't blame anyone for the state of the standard library. A lot of stuff was added to it long before I even knew what a computer was.&quot;",
        "f47636673b14c54021a69dc06f6a19fb (21:22): &gt;‚Ä¶",
        "f47636673b14c54021a69dc06f6a19fb (21:22): &gt;&quot;However the age of cgi shines through. I just recently discovered that the infamous cgi.FieldStorage provides multipart/mixed support. This is incredible. While it's specified as part of HTML4 it was never implemented in a browser people actually used on the world-wide web. &quot;",
        "f47636673b14c54021a69dc06f6a19fb (21:27): On the same train of thoughts I always wondered why httplib2 didn't make it to python. Joe Gregorio code is neat",
        "b25b6b77a0087ff8385941e5545d32ea (21:28): f47636673b14c54021a69dc06f6a19fb: Obviously he never had rubys working on a project with him :)",
        "b25b6b77a0087ff8385941e5545d32ea (21:29): (rubys has previously expressed an adversion to external dependencies)",
        "b25b6b77a0087ff8385941e5545d32ea (21:30): and it makes a bunch of sense. If I write some code and I say &quot;oh but to get this working you'll also need to download these other six modules&quot; it's pretty annoying",
        "b25b6b77a0087ff8385941e5545d32ea (21:30): So people either don't bother or if they have to bother for some reason, they hate you",
        "b25b6b77a0087ff8385941e5545d32ea (21:31): This is why html5lib still uses the slightly crappy unittest stdlib module rather than the rather superior nose",
        "3f2e2531201cfbf853f16f668132eaf2 (21:32): b25b6b77a0087ff8385941e5545d32ea: That issue should be solved by a decent dependency-checking package installation system",
        "b25b6b77a0087ff8385941e5545d32ea (21:33): (also: I can't really see the parallels to the web so much because on the web it's not like there's a strong alternative to builtin browser features. No one has a way to do Import CORS in a web browser to get that feature)",
        "b25b6b77a0087ff8385941e5545d32ea (21:33): 3f2e2531201cfbf853f16f668132eaf2: It's still annoying for people though. And you typically need network access",
        "f47636673b14c54021a69dc06f6a19fb (21:34): b25b6b77a0087ff8385941e5545d32ea: yes. I think the writer of the rant is a real programmer and doesn't understand that Web developers or sunday hackers (like me ;) ) are not necessary able to reimplement. Friends of mine coming from the PHP world are already horrified by the difficulties of python.",
        "f47636673b14c54021a69dc06f6a19fb (21:34): I imagine a barebone language, and they would scream ;)",
        "3f2e2531201cfbf853f16f668132eaf2 (21:34): b25b6b77a0087ff8385941e5545d32ea: You need network access to download html5lib, so there shouldn't be a problem downloading the dependencies at the same time",
        "b25b6b77a0087ff8385941e5545d32ea (21:35): 3f2e2531201cfbf853f16f668132eaf2: Yeah if you download and install and get all the deps in one shot. Not if you just download the source and later find that it needed something else",
        "f47636673b14c54021a69dc06f6a19fb (21:35): he says:",
        "f47636673b14c54021a69dc06f6a19fb (21:35): &gt;&quot;I just recently started diving into the gory details of HTTP, browser bugs and everything else. &quot;",
        "b25b6b77a0087ff8385941e5545d32ea (21:38): f47636673b14c54021a69dc06f6a19fb: are you saying the rest of that paragraph applies to browsers features? otherwise I still don't understand",
        "f47636673b14c54021a69dc06f6a19fb (21:38): nope.",
        "b25b6b77a0087ff8385941e5545d32ea (21:39): Ah, well I still don't understand then :)",
        "f47636673b14c54021a69dc06f6a19fb (21:39): basically he says that it is not worth to put everything in the standard library of python, because it is not published often enough to cope with bug fixing.",
        "f47636673b14c54021a69dc06f6a19fb (21:39): so that all the library should be external modules with their own roadmap",
        "b25b6b77a0087ff8385941e5545d32ea (21:39): f47636673b14c54021a69dc06f6a19fb: I got that",
        "b25b6b77a0087ff8385941e5545d32ea (21:40): But even if you believe that for python, there are significant differences between the web and python",
        "b25b6b77a0087ff8385941e5545d32ea (21:41): So either a) I don't see the parallel or b) I see the parallel but don't think it is useful",
        "f47636673b14c54021a69dc06f6a19fb (21:41): Some people sometimes complained that Working Groups publish specification with a too long cycle, and/or do not fix bugs (errata, republication) in them quick enough.",
        "f47636673b14c54021a69dc06f6a19fb (21:42): having modular specifications with their own roadmap (if good resources involved) may help to speed up.",
        "b25b6b77a0087ff8385941e5545d32ea (21:42): f47636673b14c54021a69dc06f6a19fb: But a specification isn't like running code",
        "f47636673b14c54021a69dc06f6a19fb (21:42): It creates coordination issues‚Ä¶ and interoperability issues between specs but at the same time force to have more standardized documents.",
        "f47636673b14c54021a69dc06f6a19fb (21:43): b25b6b77a0087ff8385941e5545d32ea: (I have a sarcastic comment here ;) but I will abstain. Cf our discussions on #whatwg earlier on.) ;)",
        "b25b6b77a0087ff8385941e5545d32ea (21:43): What do you mean @more standardised documents@?",
        "b25b6b77a0087ff8385941e5545d32ea (21:43): should change the keybaord map...",
        "b25b6b77a0087ff8385941e5545d32ea (21:45): Like is it more (standardised documents) or (more standardised) documents",
        "f47636673b14c54021a69dc06f6a19fb (21:45): the more entities in a group which requires to communicate, the more standardization is needed for interoperability.",
        "f47636673b14c54021a69dc06f6a19fb (21:47): let's say you split SVG in pieces with individual documents, then you need to ensure that the different parts use the same vocabulary, same conformance requirements, same descriptions, same principles, etc.",
        "b25b6b77a0087ff8385941e5545d32ea (21:48): f47636673b14c54021a69dc06f6a19fb: It seems more likely that wouldn't happen and you'd just get more divergent components",
        "f47636673b14c54021a69dc06f6a19fb (21:50): b25b6b77a0087ff8385941e5545d32ea: I think it would be possible to do it. But it takes more resources of coordination.",
        "b25b6b77a0087ff8385941e5545d32ea (21:50): f47636673b14c54021a69dc06f6a19fb: Resources are not something in great supply.",
        "f47636673b14c54021a69dc06f6a19fb (21:50): and?",
        "f47636673b14c54021a69dc06f6a19fb (21:51): si tryingto guess where b25b6b77a0087ff8385941e5545d32ea is going :)",
        "b25b6b77a0087ff8385941e5545d32ea (21:51): f47636673b14c54021a69dc06f6a19fb: Oh, I'm not as clever as all these people who say one thing and mean another. I just say one thing after another and see where I end up",
        "f47636673b14c54021a69dc06f6a19fb (21:52): because we are going pretty far from the initial part of the discussions.",
        "f47636673b14c54021a69dc06f6a19fb (21:52): You are already on the materialization track ;)",
        "b25b6b77a0087ff8385941e5545d32ea (21:53): f47636673b14c54021a69dc06f6a19fb: My point is that I don't really see the benefit of splitting things up in the way you describe. And I don't thinkit's very practical either. And I think there are significant differences from the situation with python",
        "f47636673b14c54021a69dc06f6a19fb (21:54): ok.  you expressed your opinion, I understood that.",
        "b25b6b77a0087ff8385941e5545d32ea (21:54): f47636673b14c54021a69dc06f6a19fb: Of course I am interested in you convincing me that I am wrong :)",
        "f47636673b14c54021a69dc06f6a19fb (21:55): Unfortunately, I'm not interested into that ;) I guess we discovered the issue. Digressing again, I'm not interested in convincing people. I love to share what I think, then people make their own mind.",
        "b25b6b77a0087ff8385941e5545d32ea (21:56): f47636673b14c54021a69dc06f6a19fb: Fair enough :)",
        "b25b6b77a0087ff8385941e5545d32ea (21:57): Sorry if I come across as hostile or aggressive or something",
        "3f2e2531201cfbf853f16f668132eaf2 (22:06): f47636673b14c54021a69dc06f6a19fb: I prefer it when someone else makes my mind for me",
        "3f2e2531201cfbf853f16f668132eaf2 (22:07): It avoids all the tedious business of thinking"
    ],
    "person_ids": [
        "f47636673b14c54021a69dc06f6a19fb",
        "0a39f78bcb297ab0ebe8a29c28bfed89",
        "b25b6b77a0087ff8385941e5545d32ea",
        "3f2e2531201cfbf853f16f668132eaf2"
    ]
}