{
    "id": "ce8ee370de4b5ea83f1da03189479071",
    "messages": [
        "ab7faae5d7b250ea8606486575f8f79c (17:46): Hmm, a surprising number of people have contacted me about my font tool, even though I intentionally didn't give a contact email address on the site",
        "f139aba52f9fa1394b4034a7954b2220 (17:54): Hixie, for input type=tel, the spec says &quot;User agents may change the punctuation of values that the user enters.&quot; - Does that affect the submitted value, or just the way in which the number is rendered?",
        "f139aba52f9fa1394b4034a7954b2220 (17:56): in my experience, many sites don't accept any punctuation in phone numbers.",
        "467f6d43402c6573237052cefcc252db (17:56): &quot;values&quot; points to the value concept which means afaict that it affects the submission",
        "f139aba52f9fa1394b4034a7954b2220 (17:57): I guess, if they use type=tel, then hopefully they will fix their back end too",
        "467f6d43402c6573237052cefcc252db (17:57): it would be nicer if type=tel specified some canonicalized value for submission",
        "f139aba52f9fa1394b4034a7954b2220 (17:58): I don't think that's really possible given the wide variety of formats used for phone numbers around the world",
        "f139aba52f9fa1394b4034a7954b2220 (17:58): and even formats for phone numbers in the same country, depending on whether they're land line, mobile, free call or premium rate numbers",
        "467f6d43402c6573237052cefcc252db (17:58): international dialing is possible",
        "467f6d43402c6573237052cefcc252db (17:59): surely canonicalizing phone numbers is possible too then",
        "ab7faae5d7b250ea8606486575f8f79c (17:59): The canonical format could be created with s/[^0-9]//g",
        "ab7faae5d7b250ea8606486575f8f79c (17:59): but that doesn't help when silly Americans use letters instead of numbers in their phone numbers",
        "ab7faae5d7b250ea8606486575f8f79c (17:59): wonders if other nationalities do that too",
        "467f6d43402c6573237052cefcc252db (18:00): though some phone numbers are bound by country",
        "ab7faae5d7b250ea8606486575f8f79c (18:00): Also that wouldn't work when people write &quot;+44 (0)1234 567890&quot;",
        "f139aba52f9fa1394b4034a7954b2220 (18:01): IIRC, the ITU defines official phone number standards, and says something about the format. But that requires the country code to be known, and users don't always enter that into forms",
        "f139aba52f9fa1394b4034a7954b2220 (18:02): ab7faae5d7b250ea8606486575f8f79c, is the (0) like the area code that's used when you don't explicitly dial the country code?",
        "b8810fee2f4a71f849f3f7409546d1d9 (18:04): Hixie: I'm told you can backslash-escape curly braces in .bib",
        "b25b6b77a0087ff8385941e5545d32ea (18:05): f139aba52f9fa1394b4034a7954b2220: Yes",
        "ab7faae5d7b250ea8606486575f8f79c (18:06): b8810fee2f4a71f849f3f7409546d1d9: Only works if they're matched pairs, according to the compiler's error output",
        "f139aba52f9fa1394b4034a7954b2220 (18:07): b25b6b77a0087ff8385941e5545d32ea, so to dial my UK mobile number from a UK phone, I dial 0 7798 526 965. Or from an international phone using: +44 7798 526 965 ?",
        "b25b6b77a0087ff8385941e5545d32ea (18:07): f139aba52f9fa1394b4034a7954b2220: Yes",
        "b25b6b77a0087ff8385941e5545d32ea (18:08): Assuming that is your real mobile number :)",
        "f139aba52f9fa1394b4034a7954b2220 (18:08): it is",
        "f139aba52f9fa1394b4034a7954b2220 (18:08): it's a prepaid SIM card I use whenever I visit London",
        "f139aba52f9fa1394b4034a7954b2220 (18:08): it's cheaper than paying international rates with my Norwegian or Australian SIMs",
        "b25b6b77a0087ff8385941e5545d32ea (18:09): wonders when f139aba52f9fa1394b4034a7954b2220 will start getting abusive calls from Mr Last Week :)",
        "a924fb58d2c25874322f4e5126f608b9 (18:09): Dramatic readings of select IRC quotes",
        "f139aba52f9fa1394b4034a7954b2220 (18:09): my phone number has been published on my website for years. Haven't received any abusive phone calls yet",
        "ab7faae5d7b250ea8606486575f8f79c (18:09): Maybe nobody abusive reads your website",
        "f139aba52f9fa1394b4034a7954b2220 (18:10): I'm expect MLW will go looking for it now that I've mentioned it's there :-)",
        "ab7faae5d7b250ea8606486575f8f79c (18:10): Not that I'm implying the people reading IRC logs (hello out there!) are abusive",
        "ab7faae5d7b250ea8606486575f8f79c (18:10): (Not that I'm implying they're not, either)",
        "a924fb58d2c25874322f4e5126f608b9 (18:10): You're implying you're not implying anything",
        "b25b6b77a0087ff8385941e5545d32ea (18:11): is confused by the implications of that",
        "f139aba52f9fa1394b4034a7954b2220 (18:11): ab7faae5d7b250ea8606486575f8f79c, some people consider the abusive ones to be those of us in this channel",
        "ab7faae5d7b250ea8606486575f8f79c (18:12): refrains from stating an abusive comment about such people",
        "b25b6b77a0087ff8385941e5545d32ea (18:12): Anyway, the point is that it is amusing to imagine MLW in a phone box somewhere in rural England, feeding his 10ps into the machine to make crank calls to f139aba52f9fa1394b4034a7954b2220, whilst using a vocoder to disguise his voice",
        "f139aba52f9fa1394b4034a7954b2220 (18:13): he would have to know when I'm going to be in the UK for that to be effective",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:13): I'm sure you'll give away that information in here",
        "f139aba52f9fa1394b4034a7954b2220 (18:13): I haven't yet",
        "b25b6b77a0087ff8385941e5545d32ea (18:14): f139aba52f9fa1394b4034a7954b2220: Not now that he knows that your phone number is on your website. Plus you often mention that here, I think",
        "f139aba52f9fa1394b4034a7954b2220 (18:14): (I gave it away elsewhere already though)",
        "ab7faae5d7b250ea8606486575f8f79c (18:14): He could try phoning you every day",
        "b25b6b77a0087ff8385941e5545d32ea (18:14): He could just leave voicemail",
        "f139aba52f9fa1394b4034a7954b2220 (18:14): I don't think I set up my voice mail on that SIM yet",
        "f139aba52f9fa1394b4034a7954b2220 (18:15): I haven't set up voice mail on my norwegian number yet either, but that's cause I don't know how and can't find out cause the instructions are all in norwegian",
        "ab7faae5d7b250ea8606486575f8f79c (18:16): I suppose the problem with all these ideas is that they would merely be abuse against f139aba52f9fa1394b4034a7954b2220, and couldn't be justified as &quot;GUERILLA JOURNALSIM&quot; regardless of whether he deserves the abuse",
        "f139aba52f9fa1394b4034a7954b2220 (18:16): I'll be in London this weekend, arriving Saturday and leaving Sunday, on my way to Australia.",
        "f139aba52f9fa1394b4034a7954b2220 (18:16): I'm looking forward to receiving abusive calls now :-)",
        "ab7faae5d7b250ea8606486575f8f79c (18:17): (and a respectable figure like MLW wouldn't stoop to unjustified abuse)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:17): has some f139aba52f9fa1394b4034a7954b2220 mobile number in his phone",
        "f139aba52f9fa1394b4034a7954b2220 (18:17): a11aabeeceeae6b8cb5d12ea06b56554, you probably have my Norwegian number",
        "b25b6b77a0087ff8385941e5545d32ea (18:17): ab7faae5d7b250ea8606486575f8f79c: No but they would be Crushing the Cabal!",
        "a924fb58d2c25874322f4e5126f608b9 (18:18): You can't crush the cabal",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:18): f139aba52f9fa1394b4034a7954b2220: Yeah, it's Norwegian",
        "a924fb58d2c25874322f4e5126f608b9 (18:18): At worst you get 52 pickup",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:18): resists temptation to call f139aba52f9fa1394b4034a7954b2220",
        "f139aba52f9fa1394b4034a7954b2220 (18:19): finds a11aabeeceeae6b8cb5d12ea06b56554' number in his address book",
        "b25b6b77a0087ff8385941e5545d32ea (18:19): a11aabeeceeae6b8cb5d12ea06b56554: That is probably good because the cost benefit of proving that you can use a phone vs international calling rates seems bad",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:19): has already found f139aba52f9fa1394b4034a7954b2220's",
        "a11aabeeceeae6b8cb5d12ea06b56554 (18:20): b25b6b77a0087ff8385941e5545d32ea: Exactly.",
        "f139aba52f9fa1394b4034a7954b2220 (18:25): http://en.wikipedia.org/wiki/E.164",
        "f139aba52f9fa1394b4034a7954b2220 (18:25): that defines the format for phone numbers",
        "f139aba52f9fa1394b4034a7954b2220 (18:28): The pattern attribute probably shouldn't be allowed to apply to type=tel given that browsers are allowed to automatically adjust the punctuation",
        "b25b6b77a0087ff8385941e5545d32ea (18:28): is quite concerned at the idea of browsers automatically adjusting punctuation",
        "f139aba52f9fa1394b4034a7954b2220 (18:29): I'm a little concerned about it. But it's what my phone does when I enter a number into the address book",
        "f139aba52f9fa1394b4034a7954b2220 (18:29): and, for the most part, it seems to apply country specific formatting conventions fairly reliably",
        "ab7faae5d7b250ea8606486575f8f79c (18:30): Is there some list of the use cases for entering phone numbers?",
        "a924fb58d2c25874322f4e5126f608b9 (18:30): Many registration forms, alas",
        "b25b6b77a0087ff8385941e5545d32ea (18:30): I'm not sure how browsers will be able to tell what punctuation is required. Browsers will need to be compatible but there is no spec",
        "f139aba52f9fa1394b4034a7954b2220 (18:30): Here's a use case: A site wishes to harvest phone numbers for use by telemarketers, and needs a convenient way for users to quickly and easily enter their phone number",
        "ab7faae5d7b250ea8606486575f8f79c (18:30): like, is it for e.g. address books where you want a nice human-readable (and not machine-readable) format, and it's basically plain text but you want to stop people typing in garbage?",
        "ab7faae5d7b250ea8606486575f8f79c (18:31): or is it for machine-readable numbers so a machine can automatically phone you, without any human involvement?",
        "b25b6b77a0087ff8385941e5545d32ea (18:32): ab7faae5d7b250ea8606486575f8f79c: Probably both",
        "ab7faae5d7b250ea8606486575f8f79c (18:32): In the former case I guess you'd want to allow numbers like &quot;01234 567890 (switchboard; ask for John Smith)&quot; too",
        "f139aba52f9fa1394b4034a7954b2220 (18:32): I think the use case is because it allows for integration with the user's address book, and in mobile browsers with touch screens, focussing the control gives a keypad designed for entering numbers, rather than a normal text entry keypad",
        "b25b6b77a0087ff8385941e5545d32ea (18:32): (and quick access to tehir contacts list)",
        "ab7faae5d7b250ea8606486575f8f79c (18:32): Ah, I guess the autofill case is independent of any validation or canonicalisation",
        "ab7faae5d7b250ea8606486575f8f79c (18:33): s/autofill/fancy input method/",
        "f139aba52f9fa1394b4034a7954b2220 (18:33): I don't think we can stop people typing in garbage, because the phone number conventions use a wide variety of strange punctuation characters, inluding + ( ) # , . (space) and many others",
        "b25b6b77a0087ff8385941e5545d32ea (18:33): It is just a hint to a UA; the server has to be able to deal with the possibility of a garbale value anyway",
        "b25b6b77a0087ff8385941e5545d32ea (18:33): *garbage",
        "b25b6b77a0087ff8385941e5545d32ea (18:34): So having UAs mung the actual value seems bad",
        "f139aba52f9fa1394b4034a7954b2220 (18:35): for a normal desktop browser, yes.",
        "f139aba52f9fa1394b4034a7954b2220 (18:35): but for a user with a browser on a mobile phone, it could be convenient",
        "b25b6b77a0087ff8385941e5545d32ea (18:35): f139aba52f9fa1394b4034a7954b2220: Howso?",
        "f139aba52f9fa1394b4034a7954b2220 (18:36): so that the number gets formatted nicely for easier reading, without the user having to manually enter characters that aren't so easy to type on a mobile keypad",
        "b25b6b77a0087ff8385941e5545d32ea (18:37): f139aba52f9fa1394b4034a7954b2220: That seems to be something that is between the UA and the user if they want to have a special UI for entering numbers that pretty prints the result before updating the control",
        "b25b6b77a0087ff8385941e5545d32ea (18:38): Not really something that should be in the spec",
        "f139aba52f9fa1394b4034a7954b2220 (18:38): the spec just says it's permitted, not that it's required",
        "b25b6b77a0087ff8385941e5545d32ea (18:39): f139aba52f9fa1394b4034a7954b2220: The spec doesn't say every time that a UA is permitted to innovate the UI",
        "ab7faae5d7b250ea8606486575f8f79c (18:39): The spec normatively states that it's permitted, which seems unusual for UI issues",
        "f139aba52f9fa1394b4034a7954b2220 (18:39): yeah, true"
    ],
    "person_ids": [
        "ab7faae5d7b250ea8606486575f8f79c",
        "f139aba52f9fa1394b4034a7954b2220",
        "467f6d43402c6573237052cefcc252db",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "b25b6b77a0087ff8385941e5545d32ea",
        "a924fb58d2c25874322f4e5126f608b9",
        "a11aabeeceeae6b8cb5d12ea06b56554"
    ]
}