{
    "id": "d2a8fe43f89fe982b826b249cc537af7",
    "messages": [
        "ab7faae5d7b250ea8606486575f8f79c (12:09): wonders why people and/or mail clients still send smileys using the Wingdings font",
        "ab7faae5d7b250ea8606486575f8f79c (12:09): Are they aware it gets rendered as &quot;J&quot; for many people?",
        "b25b6b77a0087ff8385941e5545d32ea (12:13): thinks ab7faae5d7b250ea8606486575f8f79c gets more &quot;exciting&quot; email than he does",
        "a924fb58d2c25874322f4e5126f608b9 (12:14): I can't say I've noticed any such mail",
        "ab7faae5d7b250ea8606486575f8f79c (12:14): See the latest one on public-html",
        "ab7faae5d7b250ea8606486575f8f79c (12:15): ...assuming you see the HTML version of it, not the plain text version",
        "ab7faae5d7b250ea8606486575f8f79c (12:16): (Also see http://blogs.msdn.com/oldnewthing/archive/2006/05/23/604741.aspx etc)",
        "a924fb58d2c25874322f4e5126f608b9 (12:20): This one? http://lists.w3.org/Archives/Public/public-html/2009Nov/0356.html",
        "ab7faae5d7b250ea8606486575f8f79c (12:20): Yes",
        "ab7faae5d7b250ea8606486575f8f79c (12:20): (but the HTML version of it)",
        "ab7faae5d7b250ea8606486575f8f79c (12:21): (e.g. as shown by Gmail)",
        "b25b6b77a0087ff8385941e5545d32ea (12:21): plain text email ++",
        "ab7faae5d7b250ea8606486575f8f79c (12:22): &lt;p class=MsoNormal&gt;&lt;font size=2 face=Arial&gt;&lt;span lang=EN-GB style='font-size: 10.0pt;font-family:Arial'&gt;Maybe something like this is already in progress&amp;nbsp;&lt;/span&gt;&lt;/font&gt;&lt;font size=2 face=Wingdings&gt;&lt;span lang=EN-GB style='font-size:10.0pt;font-family: Wingdings'&gt;J&lt;/span&gt;&lt;/font&gt;&lt;font size=2 face=Arial&gt;&lt;span lang=EN-GB style='font-size:10.0pt;font-family:Arial'&gt;&lt;o:p&gt;&lt;/o:p&gt;&lt;/span&gt;&lt;/font&gt;&lt;/p&gt;",
        "ab7faae5d7b250ea8606486575f8f79c (12:22): b25b6b77a0087ff8385941e5545d32ea: I've not been able to find a way to make Gmail always show the plain text variant :-(",
        "b25b6b77a0087ff8385941e5545d32ea (12:23): You could use a different mail client",
        "ab7faae5d7b250ea8606486575f8f79c (12:23): I do use a different mail client too",
        "ab7faae5d7b250ea8606486575f8f79c (12:24): but Gmail is a much more convenient interface",
        "a924fb58d2c25874322f4e5126f608b9 (12:24): That's a lot of bytes of markup",
        "ab7faae5d7b250ea8606486575f8f79c (12:24): a924fb58d2c25874322f4e5126f608b9: At least Word takes care to optimise it by omitting needless quotes",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:31): ab7faae5d7b250ea8606486575f8f79c: regarding the requirements of DE, I believe the requirements are that you need to use colons and URIs",
        "a924fb58d2c25874322f4e5126f608b9 (12:34): Are you sure XML isn't a requirement? Other alternatives seem to face the &quot;But we already have lots of stuff using XML and namespaces, why invent something new?&quot; argument.",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:39): a924fb58d2c25874322f4e5126f608b9: it seems to me that it's not a requirement to use an XML parser for text/html.",
        "ab7faae5d7b250ea8606486575f8f79c (12:40): I thought it was usually a requirement that you could process DEed text/html with an XML parser",
        "ab7faae5d7b250ea8606486575f8f79c (12:41): just like you can with XHTML today",
        "a924fb58d2c25874322f4e5126f608b9 (12:41): If not a requirement, at least a goal",
        "ab7faae5d7b250ea8606486575f8f79c (12:41): even if browsers do some weird crazy hacky thing instead of using an XML parser",
        "ab7faae5d7b250ea8606486575f8f79c (12:41): but never mind what they do, because you can just use XML",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:41): the recent wikipedia case shows how hard that is",
        "a924fb58d2c25874322f4e5126f608b9 (12:42): That's only because browsers sabotage it on purpose",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:42): but I concede that that's a goal. I meant it isn't a requirement to make browsers process text/html using an XML parser.",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:43): I think XML Core has sabotaged &amp;nbsp; in XML on its own",
        "b25b6b77a0087ff8385941e5545d32ea (12:52): The goal seems to be that everything is XML+colons+URIs and that tag soup is a dim and forgotten memory",
        "b25b6b77a0087ff8385941e5545d32ea (12:52): But the goal is not necessarily achievable :)",
        "a924fb58d2c25874322f4e5126f608b9 (12:55): b8810fee2f4a71f849f3f7409546d1d9: Unless you assume that external entities are just candy to silence objectors, and that the real expectation was that everyone would ignore them :)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (12:58): RDFa 1.1 is apparently going to support raw URIs as well as CURIEs",
        "b25b6b77a0087ff8385941e5545d32ea (12:59): backcompat++",
        "a924fb58d2c25874322f4e5126f608b9 (12:59): And the CURIEs will remain unsafe?",
        "b25b6b77a0087ff8385941e5545d32ea (12:59): wonders if you will have to put a version attribute somewhere to make them work",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:59): a924fb58d2c25874322f4e5126f608b9: I suspect that external entities were allowed as optinal to resolve an otherwise unresolved difference of opinion in the original XML WG, but I haven't read the archives to confirm or refute my guess",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:00): a924fb58d2c25874322f4e5126f608b9: and then it backfired due to MathML and &amp;nbsp;",
        "ab7faae5d7b250ea8606486575f8f79c (13:01): b25b6b77a0087ff8385941e5545d32ea: Sounds like they do want to add versioning",
        "a924fb58d2c25874322f4e5126f608b9 (13:02): It seems a bit silly to introduce incompatible versions before there's even a relevant deployed corpus",
        "b25b6b77a0087ff8385941e5545d32ea (13:02): a924fb58d2c25874322f4e5126f608b9: But millions of sites already use RDFa!",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:03): a924fb58d2c25874322f4e5126f608b9: RDFa is already deployed by the biggest players: U.S. and U.K. gov'ts, Google, Y! and Drupal!111!!11!!",
        "a924fb58d2c25874322f4e5126f608b9 (13:04): Indeed, but it's all generated, so they just have to change a script or two",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:04): wonders if the IBM and Boeing intranets already have millions of RDFa pages",
        "b25b6b77a0087ff8385941e5545d32ea (13:04): Well allegedly lots of people are using RDFa to make better search result listings on Yahoo or whatever",
        "b25b6b77a0087ff8385941e5545d32ea (13:05): And they might have tediously coded every instance by hand",
        "b25b6b77a0087ff8385941e5545d32ea (13:06): b8810fee2f4a71f849f3f7409546d1d9: Do you really think that streamability is essential in XML5 under error conditions?",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:07): b25b6b77a0087ff8385941e5545d32ea: yes",
        "b25b6b77a0087ff8385941e5545d32ea (13:07): So you couldn't go back and adjust, say, the attributes on a previous element",
        "ab7faae5d7b250ea8606486575f8f79c (13:07): If you can't support streamability under error conditions, you can't support it at all",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:08): I think the worst problem is that you close the root element and find start tags after",
        "ab7faae5d7b250ea8606486575f8f79c (13:08): since you'll have already streamed the output before you found the error condition",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:08): ab7faae5d7b250ea8606486575f8f79c: I meant supporting only the kind of error correction where the parser has a fixed finite amount of internal state",
        "b25b6b77a0087ff8385941e5545d32ea (13:08): ab7faae5d7b250ea8606486575f8f79c: You can require streaming parsers to stop, like HTML5 does",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:09): ab7faae5d7b250ea8606486575f8f79c: and anything the parser reports to the app has been committed to",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:09): I'm envisioning the HTML5 tokenizer",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:09): and a tree builder that commits to its actions on a per-token basis",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:10): even if the resulting fixups can't be as fancy as the AAA or foster-parenting",
        "ab7faae5d7b250ea8606486575f8f79c (13:10): b25b6b77a0087ff8385941e5545d32ea: It seems bad to design a language so that people have to choose between performance (streaming) and robustness (non-streaming, error-correcting) and non-conformance (streaming, error-correcting-in-a-different-way)",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:11): as far as I can tell, the main problem is that if you happen to close the root element, all the subsequent non-comment tokens have to be discarded",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:11): (of course, PIs should be tokenized as PIs)",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:11): but I'd be inclined to kill the internal subset",
        "ab7faae5d7b250ea8606486575f8f79c (13:12): (which are the three choices the validator.nu SAX parser offers)",
        "b25b6b77a0087ff8385941e5545d32ea (13:12): ab7faae5d7b250ea8606486575f8f79c: It depends how much worse the error correction has to be to support the SAX case",
        "b25b6b77a0087ff8385941e5545d32ea (13:12): For the web the sax case seems less important because typical UAs are required to build trees anyway",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:13): b25b6b77a0087ff8385941e5545d32ea: XML content doesn't have fancy legacy fixup requirements",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:13): b25b6b77a0087ff8385941e5545d32ea: I don't expect XML5 parsers to ever work as general-purpose text/html parser",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:13): s",
        "b25b6b77a0087ff8385941e5545d32ea (13:13): b8810fee2f4a71f849f3f7409546d1d9: Sure. I don't know in practice how big the tradeoffs are you would have to make to get streaming support",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:13): since you'd want an XML5 parser support non-html root elements",
        "ab7faae5d7b250ea8606486575f8f79c (13:14): Would offloading parsing into a separate thread become much easier if the parser was streaming?",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:14): basically the rule is this:",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:14): if you get a start tag, create and insert the element",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:14): if you get an end tag, and there's a matching start on the stack, pop up to and including the latest start",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:14): if not, ignore the end tag",
        "b25b6b77a0087ff8385941e5545d32ea (13:14): But given something that dealt gracefully with more errors vs something that supported streaming it is not obvious to me that streaming should always win for all values of &quot;more&quot; and &quot;gracefully&quot;",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:15): and once root is closed, throw away non-comment tokens",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:15): then there's the issue of needing a non-Draconian Namespace layer on top of this thing",
        "ab7faae5d7b250ea8606486575f8f79c (13:16): b8810fee2f4a71f849f3f7409546d1d9: It sounds like you can't do that with a fixed finite amount of internal state, since you have to maintain an unbounded stack of open elements",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:17): ab7faae5d7b250ea8606486575f8f79c: true. the stack is allowed to be infinite",
        "ab7faae5d7b250ea8606486575f8f79c (13:17): I suppose you could put it behind an XML firewall that prevents DOS attacks by limiting the nesting depth",
        "a924fb58d2c25874322f4e5126f608b9 (13:18): The stack size is limited to input size / 3 at least :)",
        "a924fb58d2c25874322f4e5126f608b9 (13:18): What do you do on EOF with non-empty stack?",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:19): a924fb58d2c25874322f4e5126f608b9: pop the whole stack",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:19): i.e. generate endElement callbacks for each stack item",
        "a924fb58d2c25874322f4e5126f608b9 (13:19): What about the last text node, is that emitted?",
        "a924fb58d2c25874322f4e5126f608b9 (13:20): Seems kind of brittle if the input can be truncated",
        "ab7faae5d7b250ea8606486575f8f79c (13:20): b25b6b77a0087ff8385941e5545d32ea: How would you define &quot;gracefully&quot;? Would it be something like: consider a list of errors people make when producing XML (weighted by likelihood), and work out what output they wanted, and the error correction is more graceful if it gives that output?",
        "b25b6b77a0087ff8385941e5545d32ea (13:20): ab7faae5d7b250ea8606486575f8f79c: Something like that",
        "ab7faae5d7b250ea8606486575f8f79c (13:20): rather than just being the simplest thing that doesn't abort and doesn't lose all subsequent data when there's any error",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:21): I was thinking of this from the POV of never throwing a fatal error and then just taking the simplest tree-builder-level recoveries",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:21): and using HTML5 tokenizer behaviors just in order to be able to copy and paste code",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:22): in fact, I once made a parser like this just in order to measure the cost of the HTML5 tree building part",
        "b25b6b77a0087ff8385941e5545d32ea (13:23): Priority of constituencies :)",
        "ab7faae5d7b250ea8606486575f8f79c (13:23): b8810fee2f4a71f849f3f7409546d1d9: A fatal error isn't any better for users than a stray &lt;/html&gt; near the top of the page causing the rest of the page to vanish",
        "a924fb58d2c25874322f4e5126f608b9 (13:25): Exception: Don't emit the root element close tag until EOF, even if you see it earlier",
        "ab7faae5d7b250ea8606486575f8f79c (13:25): It seems more non-draconian if you at least keep all the text content; e.g. ignore root element close tags entirely",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:26): I thought it was a requirement not to change the parser output for doctypeless XML 1.0 documents",
        "ab7faae5d7b250ea8606486575f8f79c (13:26): Nobody's going to notice if comments-after-root-element change :-)",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:27): ab7faae5d7b250ea8606486575f8f79c: people who write CSS whitespace handling test case notice changes in getting trailing ws getting hoisted into root element",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:27): *cases",
        "ab7faae5d7b250ea8606486575f8f79c (13:28): People who write test cases don't count :-p",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:29): the worst part of hoisting trailing WS is that you can't write round-trippable documents that don't cause diff to whine about lack of newline at the end of file",
        "a924fb58d2c25874322f4e5126f608b9 (13:29): ab7faae5d7b250ea8606486575f8f79c: I noticed that whitespace after &lt;/html&gt; changed :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:29): a924fb58d2c25874322f4e5126f608b9: are you a person who writes test cases? :-)",
        "a924fb58d2c25874322f4e5126f608b9 (13:30): No, I write scripts that depend on body.lastChild",
        "ab7faae5d7b250ea8606486575f8f79c (13:30): In XML documents?",
        "a924fb58d2c25874322f4e5126f608b9 (13:31): Sure, why not",
        "ab7faae5d7b250ea8606486575f8f79c (13:31): b8810fee2f4a71f849f3f7409546d1d9: Couldn't you just omit &lt;/html&gt;, and then diff and round-trippers will be happy?",
        "a924fb58d2c25874322f4e5126f608b9 (13:32): Sounds like you could just do away with an explicit root",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:32): ab7faae5d7b250ea8606486575f8f79c: good idea",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:33): ab7faae5d7b250ea8606486575f8f79c: anyway, you'd still get a newline at the end of body in your CSS ws test cases",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:33): (the alternative, of course, is not to set non-default ws handling on body)",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:34): however, there's existence proof for everything on the Web",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:34): I recall seeing a bug report about a Web page that changed ws handling on body in CSS",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:34): fortunately, that site wasn't sensitive to trailing ws",
        "ab7faae5d7b250ea8606486575f8f79c (13:35): a11aabeeceeae6b8cb5d12ea06b56554: Gmail thinks every one of your coalescing emails is spam :-(",
        "ab7faae5d7b250ea8606486575f8f79c (13:36): (and nobody else's)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (13:36): Great.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (13:36): a11aabeeceeae6b8cb5d12ea06b56554: the infamous spammer!",
        "a924fb58d2c25874322f4e5126f608b9 (13:36): It's your name",
        "a924fb58d2c25874322f4e5126f608b9 (13:36): It's obviously made-up",
        "a11aabeeceeae6b8cb5d12ea06b56554 (13:37): Much like a924fb58d2c25874322f4e5126f608b9.",
        "a924fb58d2c25874322f4e5126f608b9 (13:37): I don't use that in email",
        "a11aabeeceeae6b8cb5d12ea06b56554 (13:37): How am I to know? You don't post on real mailing lists.",
        "a924fb58d2c25874322f4e5126f608b9 (13:38): Oh, but I do",
        "a924fb58d2c25874322f4e5126f608b9 (13:38): You just don't notice. See previous statement.",
        "b25b6b77a0087ff8385941e5545d32ea (13:38): wonders if a11aabeeceeae6b8cb5d12ea06b56554 watches all mailing lists",
        "ab7faae5d7b250ea8606486575f8f79c (13:39): assumed it was German for The Hiva",
        "b25b6b77a0087ff8385941e5545d32ea (13:40): For example a924fb58d2c25874322f4e5126f608b9 might post in the My Little Pony lovers list list <email/> under his real name on a daily basis",
        "a924fb58d2c25874322f4e5126f608b9 (13:40): There is a German a924fb58d2c25874322f4e5126f608b9 out there. I think he plays counterstrike",
        "ab7faae5d7b250ea8606486575f8f79c (13:42): played CS once, but 10% of it involved running around not knowing where anyone was, and 90% of it involved waiting to respawn in the next round",
        "ab7faae5d7b250ea8606486575f8f79c (13:42): so I don't trust anybody who claims to like it",
        "8feeedbc2081235faec72badad6376ae (13:43): can anybody  b8810fee2f4a71f849f3f7409546d1d9 maybe?) enlighten me on Aria roles on the section element? validator.nu says it's not allowed, but http://www.whatwg.org/specs/web-apps/current-work/multipage/content-models.html#annotations-for-assistive-technology-products-%28aria%29 says it is :-)",
        "ef6f2287bae00ba79475fbf56c2b6fee (13:43): 8feeedbc2081235faec72badad6376ae: Draft spec trumps validator.",
        "a924fb58d2c25874322f4e5126f608b9 (13:43): ab7faae5d7b250ea8606486575f8f79c: You're supposed to cheat and look through walls",
        "8feeedbc2081235faec72badad6376ae (13:43): ef6f2287bae00ba79475fbf56c2b6fee that's what I thought :-)",
        "ab7faae5d7b250ea8606486575f8f79c (13:57): supposes someone ought to write evil parser test cases, to make sure parsers gracefully handle deep nesting and long names and text coalescence etc without crashing or taking forever"
    ],
    "person_ids": [
        "ab7faae5d7b250ea8606486575f8f79c",
        "b25b6b77a0087ff8385941e5545d32ea",
        "a924fb58d2c25874322f4e5126f608b9",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "a11aabeeceeae6b8cb5d12ea06b56554",
        "8feeedbc2081235faec72badad6376ae",
        "ef6f2287bae00ba79475fbf56c2b6fee"
    ]
}