{
    "id": "d4819b7b3a1fd44157cebf53ad17adb3",
    "messages": [
        "a11aabeeceeae6b8cb5d12ea06b56554 (19:30): w00t! English! Done!",
        "b8810fee2f4a71f849f3f7409546d1d9 (19:32): a11aabeeceeae6b8cb5d12ea06b56554: did it go well?",
        "ab7faae5d7b250ea8606486575f8f79c (19:33): a11aabeeceeae6b8cb5d12ea06b56554: Did you fail miserably?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (19:39): b8810fee2f4a71f849f3f7409546d1d9: The first part, definitely. The second part, not so well, but I think well enough.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (19:40): ab7faae5d7b250ea8606486575f8f79c: Hence no.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (19:40): ab7faae5d7b250ea8606486575f8f79c: Also, seeming I apparently had the best dissertation it'd be hard to fail badly, seeming I scarcely had to get any marks to pass",
        "b8810fee2f4a71f849f3f7409546d1d9 (19:40): a11aabeeceeae6b8cb5d12ea06b56554: btw, there's no &quot;XHTML WG&quot;",
        "b8810fee2f4a71f849f3f7409546d1d9 (19:40): (Re: twitter)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (19:41): Peh. XHTML2 WG. You know what I mean.",
        "ab7faae5d7b250ea8606486575f8f79c (19:44): a11aabeeceeae6b8cb5d12ea06b56554: Were the people marking your dissertation impressed by the markup?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (19:44): ab7faae5d7b250ea8606486575f8f79c: It wasn't markup :P",
        "ab7faae5d7b250ea8606486575f8f79c (19:45): a11aabeeceeae6b8cb5d12ea06b56554: I thought that's what you were spending all your time doing? :-)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (19:45): ab7faae5d7b250ea8606486575f8f79c: No. Markup for my notes for English in general",
        "a11aabeeceeae6b8cb5d12ea06b56554 (19:45): Also: my fingers hurt from writing for three hours so I don't want to type too much",
        "ab7faae5d7b250ea8606486575f8f79c (19:46): Type with other appendages",
        "ab7faae5d7b250ea8606486575f8f79c (19:49): gets an impression from the &quot;Link rot is not dangerous&quot; topic that namespace URIs are quite a fragile foundation",
        "ab7faae5d7b250ea8606486575f8f79c (19:50): so they suggest building other structures on top of that, like caching and redirecting and hardcoding override lists and reminding people not to accidentally let their domains expire and making local subclasses",
        "b8810fee2f4a71f849f3f7409546d1d9 (19:50): ab7faae5d7b250ea8606486575f8f79c: it seems to be that believing in Follow your Nose and believing in Link Rot not being dangerous are contradictory beliefs but you can pick either one and argue coherently",
        "ab7faae5d7b250ea8606486575f8f79c (19:51): and I suppose it makes me wonder instead whether it'd be a good reason to not use that foundation at all",
        "ab7faae5d7b250ea8606486575f8f79c (19:52): (though I don't know what other foundations would be better)",
        "b8810fee2f4a71f849f3f7409546d1d9 (19:53): ab7faae5d7b250ea8606486575f8f79c: Java-style FQNs avoid the temptation to succumb to Follow Your Nose",
        "ab7faae5d7b250ea8606486575f8f79c (19:54): b8810fee2f4a71f849f3f7409546d1d9: They still suffer from a mild form of Link Rot, because if I start using com.example.foo and then accidentally let com.example expire and someone else registers it and builds a new application based on that domain then they might conflict with my names and people will think my names belong to them",
        "ab7faae5d7b250ea8606486575f8f79c (19:55): The problem is that an object with a certain lifetime is depending on an object with a potentially shorter lifetime",
        "ab7faae5d7b250ea8606486575f8f79c (19:56): and C++ teaches us that such relationships will eventually cause horrible pain and memory corruption",
        "b8810fee2f4a71f849f3f7409546d1d9 (19:56): ab7faae5d7b250ea8606486575f8f79c: more likely, the owner of com.example is acquired by another company or the product is made open source under org.apache",
        "ab7faae5d7b250ea8606486575f8f79c (19:57): That too",
        "b8810fee2f4a71f849f3f7409546d1d9 (19:57): but yeah, Java FQNs suck because code outlasts organization structure",
        "ab7faae5d7b250ea8606486575f8f79c (19:57): I wonder if all the com.sun.* Java classes will be renamed to com.oracle.*",
        "ab7faae5d7b250ea8606486575f8f79c (20:01): Has anyone (in distributed systems in general, not just the web) solved the problem of having identifiers that are globally unique and eternally unique, and that don't depend on a centralised registry, and that are human-readable?",
        "ab7faae5d7b250ea8606486575f8f79c (20:02): (I suppose I consider mildly distributed registries, like the IP number assignment system, to be similar enough to a centralised registry that it's not acceptable either)",
        "ab7faae5d7b250ea8606486575f8f79c (20:03): If not, I guess the question is which of those requirements to sacrifice",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:03): ab7faae5d7b250ea8606486575f8f79c: depends on probablility of collision",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:03): ab7faae5d7b250ea8606486575f8f79c: openid.delegate seems to strike the right balance",
        "fd9ef1223e855714294498ebfde79f98 (20:13): Python package names seem to strike a good balance",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:17): fd9ef1223e855714294498ebfde79f98: yeah, they are basically the same as openid.* and openid2.* rel values",
        "ab7faae5d7b250ea8606486575f8f79c (20:18): But Python lets you manually override the mapping from identifier to implementation (e.g. by changing PYTHONPATH or moving libraries into the current directory) if you need to resolve conflicts in exceptional cases",
        "ab7faae5d7b250ea8606486575f8f79c (20:18): just like XML Namespace prefixes do",
        "ab7faae5d7b250ea8606486575f8f79c (20:19): Without some mechanism for conflict resolution, it's not a robust way to avoid problems caused by naming conflicts",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:20): ab7faae5d7b250ea8606486575f8f79c: how often do python names actually collide?",
        "ab7faae5d7b250ea8606486575f8f79c (20:23): It's not terribly unlikely that I would e.g. create a physics simulation program with a file called &quot;atom.py&quot; containing my Atom class, and say &quot;import atom&quot;",
        "ab7faae5d7b250ea8606486575f8f79c (20:23): and it would collide with the 'atom' package (for RFC 4287 style Atom)",
        "fd9ef1223e855714294498ebfde79f98 (20:24): I think python package names, or java FQNs, etc. provide enough disambiguation",
        "ab7faae5d7b250ea8606486575f8f79c (20:24): (The conflict there is easily resolved because Python will look for ./atom.py before it looks for /usr/lib/python2.5/site-packages/atom, if I remember correctly)",
        "fd9ef1223e855714294498ebfde79f98 (20:24): People seem to want more disambiguation than they really need, to get some kind of warm-fuzzy feeling of false security",
        "ab7faae5d7b250ea8606486575f8f79c (20:25): Why is it false security? (as opposed to unnecessary (but true) security)",
        "fd9ef1223e855714294498ebfde79f98 (20:25): But given author error, cut-and-paste, etc. the straightjacket solutions to disambiguation don't really get you any more disambiguation than the &quot;sufficiently-interesting prefix&quot; solution",
        "a11aabeeceeae6b8cb5d12ea06b56554 (20:35): Is there any way to have a form that can be submitted to multiple URLs depending on what button is pressed, without script?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (20:37): I guess @value of the submit button",
        "ab7faae5d7b250ea8606486575f8f79c (21:00): &quot;link rot within the RDF world is an extremely rare and unlikely occurrence&quot;",
        "ab7faae5d7b250ea8606486575f8f79c (21:00): That sounds like a testable observation",
        "ab7faae5d7b250ea8606486575f8f79c (21:00): and the test seems to refute that observation",
        "b25b6b77a0087ff8385941e5545d32ea (21:02): had python package name conflicts when he tried to build V8 so it does happen and can be confusing",
        "ab7faae5d7b250ea8606486575f8f79c (21:02): I see several 404s and several servers-not-responding, from the few dozen mosts common RDF namespace URIs",
        "ab7faae5d7b250ea8606486575f8f79c (21:02): s/mosts/most/",
        "ab7faae5d7b250ea8606486575f8f79c (21:04): (There are so many servers-not-responding that my download script is taking forever :-/ )",
        "ab7faae5d7b250ea8606486575f8f79c (21:14): I really should have reduced curl's timeout"
    ],
    "person_ids": [
        "a11aabeeceeae6b8cb5d12ea06b56554",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "ab7faae5d7b250ea8606486575f8f79c",
        "fd9ef1223e855714294498ebfde79f98",
        "b25b6b77a0087ff8385941e5545d32ea"
    ]
}