{
    "id": "d5c49066f64bcaab8fb4f16a9552f458",
    "messages": [
        "b25b6b77a0087ff8385941e5545d32ea (21:59): Being able to set HTTP headers used in hyperlinks from HTML seems to have a very poor backward compaibility story",
        "a924fb58d2c25874322f4e5126f608b9 (22:07): b25b6b77a0087ff8385941e5545d32ea: No, no. HTTP has supported headers for many years ;)",
        "b25b6b77a0087ff8385941e5545d32ea (22:13): :-p",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:22): It opens up all kinds of attack vectors",
        "57d876083caf517f49e8cf5e03307450 (22:26): is scheme:path?query;param#anchor the correct format, or is it scheme:path;param?query#anchor ?",
        "a924fb58d2c25874322f4e5126f608b9 (22:27): I believe it's the latter",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:45): a11aabeeceeae6b8cb5d12ea06b56554: I think Macrovision on VHS isn't *DRM*, because it lacks the D",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:45): b8810fee2f4a71f849f3f7409546d1d9: Pedant :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:46): a11aabeeceeae6b8cb5d12ea06b56554: it seems to me that the argument is:",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:47): 1) Font foundries want to make infringing people aware that they are infringing",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:48): 2) People grab a font using view source / Web Inspector / Firebug don't realize they are infringing",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:49): so the argument doesn't hinge on any technical prevention",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:49): but on what hoops make people aware that they are infringing when they infringe",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:49): Then any obstruction or DRM is overkill",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:50): s/grab/who grab/",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:51): Would it not be simpler for browsers to include a small note in all save boxes, along the lines of, &quot;This file may be subject to copyright/licence restrictions.&quot;",
        "b25b6b77a0087ff8385941e5545d32ea (22:52): I don't see why that is needed",
        "b25b6b77a0087ff8385941e5545d32ea (22:53): or how it would help, really",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:53): Nor do I really, but it seems to address the needs of the foundries",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:54): b25b6b77a0087ff8385941e5545d32ea: the whole discussion is basically about what rituals would make one group of believe that another group of people is lead to think in a certain way",
        "b25b6b77a0087ff8385941e5545d32ea (22:55): b8810fee2f4a71f849f3f7409546d1d9: Yeah, but putting randon pseudo-legalese in browsers is really not nice",
        "b25b6b77a0087ff8385941e5545d32ea (22:57): I still don't understand why fonts deserve more protection than photographs",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:57): b25b6b77a0087ff8385941e5545d32ea: I agree. Particularly when the pseudo-legalese is a truism that should be assumed to be known by default.",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:57): &quot;&lt a11aabeeceeae6b8cb5d12ea06b56554&gt; Nor do I really, but it seems to address the needs of the foundries&quot; assumes that we need to address those needs",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:57): which i'm pretty sure we don't",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:58): 69b0d3dfe919a6b860a9fac82de52a7e: Just ignore the font foundries?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:58): 69b0d3dfe919a6b860a9fac82de52a7e: Surely that's no different to ignoring implementers?",
        "b25b6b77a0087ff8385941e5545d32ea (22:58): a11aabeeceeae6b8cb5d12ea06b56554: That seems like an option.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:58): (in terms of getting stuff used)",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:00): implementors can veto stuff because if they don't implement, the spec is fiction",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:00): font foundries have no veto ability here, and their needs directly conflict with the users'",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:00): users win",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:00): 69b0d3dfe919a6b860a9fac82de52a7e: what happened with Google's EOT patch for WebKit?",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:01): we decided we couldn't justify introducing DRM given our &quot;do no evil&quot; principles",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:01): 69b0d3dfe919a6b860a9fac82de52a7e: No, users don't win. They can't use the majority of fonts.",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:01): sure they can",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:02): (and if you just send OTF/TTF anyway, who's betting the foundries will just change their licences to disallow that)",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:02): of the fonts available to a random author, the vast majority are free",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:02): 69b0d3dfe919a6b860a9fac82de52a7e: it seems to me that the &quot;need&quot; of foundries is to believe that users know what they are infringing. I'm not convinced that in would be against the users' needs to know what behaviors are infringing. However, I'd prefer a way to establish the belief and awareness without using technology as a intermediate.",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:03): users are fully aware that copying a font from another site is a violation of copyright",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:03): so that need is already met",
        "b25b6b77a0087ff8385941e5545d32ea (23:03): b8810fee2f4a71f849f3f7409546d1d9: That is hardly a unique need. Why do fonts get special consideration over all other media",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:06): 69b0d3dfe919a6b860a9fac82de52a7e: yeah, according to a recent study conducted in Finland, 95% of school kids believe that distributing movies and music without authorization is illegal.",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:07): people know it's illegal, they just don't care",
        "a924fb58d2c25874322f4e5126f608b9 (23:12): b8810fee2f4a71f849f3f7409546d1d9: You say &quot;believe&quot;, makes it sound like it isn't :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:14): a924fb58d2c25874322f4e5126f608b9: well, I'm pretty sure it's illegal here, but these studies also include BS about using the word that approximates &quot;felony&quot; for things that are illegal but not punishable",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:14): (compare with riding a bike without a helmet)",
        "a924fb58d2c25874322f4e5126f608b9 (23:15): The jail/no jail distinction?",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:16): a924fb58d2c25874322f4e5126f608b9: for example, I'm pretty sure that downloading movies / music without authorization is in the illegal but not punishable category here.",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:16): a924fb58d2c25874322f4e5126f608b9: but the people who get prosecuted also shared the content",
        "ab7faae5d7b250ea8606486575f8f79c (23:16): If it's not punishable, what would stop anyone from doing it?",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:17): ab7faae5d7b250ea8606486575f8f79c: knowing that it illegal. And for all things not copyright-related, Finns will generally obey the law on the law's sayso",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:18): Also, over here the police can do pretty much what it pleases and can use equipment confiscation as a de facto punishment on a presumed guilty-basis.",
        "ab7faae5d7b250ea8606486575f8f79c (23:21): Given how many people infringe copyright even when they know it's illegal, I can't imagine many are put off by it being considered legally naughty but not punishable",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:21): I would guess that for people who are very familiar with the law and practice, the risk of equipment confiscation without judicial oversight is a stronger deterrent than the law",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:27): (oh. there's another thing that's illegal but not punishable and that people do: lying about campaign finance to the ministry of justice)",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:28): (the politicians had the good sense to make their own illegalities non-punishable)",
        "a924fb58d2c25874322f4e5126f608b9 (23:30): I don't get that",
        "a924fb58d2c25874322f4e5126f608b9 (23:30): I learned in class that illegal was defined as there being a law against it",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:32): a924fb58d2c25874322f4e5126f608b9: right. But the law doesn't have to set punishments for all things that are illegal.",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:33): a924fb58d2c25874322f4e5126f608b9: and over here if an illegal thing doesn't have an entry in the Criminal Code, it's a different type of illegality than a &quot;crime&quot;",
        "a924fb58d2c25874322f4e5126f608b9 (23:35): So what happens if the police find you committing one of those crimes? They take your computer to gather evidence, and then throw the evidence away?",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:37): copyright violation is punishable",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:37): it's just a civil offense rather than a criminal one",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:37): which means financial damages and reparations, generally",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:38): 69b0d3dfe919a6b860a9fac82de52a7e: Finland doesn't have punitive damages, so in theory, if it's a civil case, it's not a punisment but just damages",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:38): *punishment",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:38): and what's the nominal &quot;damage&quot; of violating copyright?",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:40): a924fb58d2c25874322f4e5126f608b9: they can take the computers and all inessential related equipment away for investigation, be slow with the investigation, and turn over the evidence to support a trial brought by a RIAA/MPAA/IFPI-connected civil association",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:40): 69b0d3dfe919a6b860a9fac82de52a7e: the retail price of the same piece of content on CD/DVD",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:41): 69b0d3dfe919a6b860a9fac82de52a7e: assuming a theory that every copy is a lost sale, which is of course bogus",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:41): wow, that's low",
        "57d876083caf517f49e8cf5e03307450 (23:41): b8810fee2f4a71f849f3f7409546d1d9: better than the RIAA's theory",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:41): the us has insanely high numbers",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:41): like, ever violation is 5 digits usd",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:41): 69b0d3dfe919a6b860a9fac82de52a7e: plus legal fees!",
        "57d876083caf517f49e8cf5e03307450 (23:41): i.e., every copy represents thousands of lost sales",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:41): every, even",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:42): so if you lose a case to the enforcement association, the court orders you to pay their legal fees",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:42): so for the downloader case, the main risk is equipment confiscation and legal fees",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:43): for the uploader case, there's also a potentially high supposed damage",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:43): none of these are &quot;punishments&quot; in the legal sense although de facto, they are",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:46): not having punitive damages is good. If something requires more punishment, a fine to the state leads to much more healthy behavior than awarding more than the actual damages to the supposedly injured party",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:47): (the reason why we don't have punitive damages is a principle that the injured party shouldn't end up better off than where they started by suffering a damage)",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:49): you'll note i didn't mention punitive damages :-)",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:49): i don't think the us has them for copyright violations either",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:49): but what do i know",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:49): 69b0d3dfe919a6b860a9fac82de52a7e: well, the U.S. has crazy statutory damages",
        "a924fb58d2c25874322f4e5126f608b9 (23:49): It's not like the actual law matters to the RIAA :P",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:49): I'm not sure if those are considered &quot;punitive&quot; legally in this case",
        "a131216c7af242e66537a58b4ca7c9f9 (23:52): how about cruel and unusual?",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:52): anyway, damages in excess of the actual damages whether statutory or made up be a judge on the spot suck, and it's better to put the excess into the state treasure than to award it to another litigant, IMO",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:53): statutory damages kinda makes sense in that for non-financial stuff there has to be some sort of going rate for pain",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:53): i mean, it's not like you can easily measure the pain cause by slander in USD, for example",
        "a131216c7af242e66537a58b4ca7c9f9 (23:54): slanders 69b0d3dfe919a6b860a9fac82de52a7e's cat",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:54): poor mowmow",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:54): they were at the vet this morning",
        "57d876083caf517f49e8cf5e03307450 (23:54): has a cat who likes to sit and sleep",
        "57d876083caf517f49e8cf5e03307450 (23:54): very good paperweight",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:54): a131216c7af242e66537a58b4ca7c9f9: it seems to me that in RIAA cases damages are cruel but unfortunately not unusual",
        "b8810fee2f4a71f849f3f7409546d1d9 (23:56): s/treasure/treasury/"
    ],
    "person_ids": [
        "b25b6b77a0087ff8385941e5545d32ea",
        "a924fb58d2c25874322f4e5126f608b9",
        "a11aabeeceeae6b8cb5d12ea06b56554",
        "57d876083caf517f49e8cf5e03307450",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "ab7faae5d7b250ea8606486575f8f79c",
        "a131216c7af242e66537a58b4ca7c9f9"
    ]
}