{
    "id": "d913c724b82c86c91ee737956f970ed1",
    "messages": [
        "1f8387eb43f131d7c309a90a4e36b5cb (18:58): f9e12e0466f4d059b78bb3f863633092: I think I'll be at the campout as a counselor.",
        "f9e12e0466f4d059b78bb3f863633092 (18:59): sweet - I am going to be there also -",
        "f9e12e0466f4d059b78bb3f863633092 (18:59): how did your talk go the other day?",
        "f9e12e0466f4d059b78bb3f863633092 (19:02): 1f8387eb43f131d7c309a90a4e36b5cb: what are your thoughts on node.js?",
        "1f8387eb43f131d7c309a90a4e36b5cb (19:06): My talk went fine.  The two responses we got back, one very negative and one very positive, were both very accurate.  ^_^",
        "1f8387eb43f131d7c309a90a4e36b5cb (19:06): I think node.js is interesting.  I haven't touched it, but I've read up on it a little bit.",
        "f9e12e0466f4d059b78bb3f863633092 (19:12): any slides from the talk? I am doing front end work on a rails project and the team is interested in nodejs for an upcoming project so I am just now becoming aware of nodejs. It seems pretty cool. And there is definitely a buzz around it.",
        "1f8387eb43f131d7c309a90a4e36b5cb (19:13): Not from me - I basically just reused my demos from my last talk.  The other dudes had some slides, though I dunno where they are.",
        "7cbd522d7fcf593a1e60d52c789b6a7b (19:33): f9e12e0466f4d059b78bb3f863633092: if you're anywhere near NYC theres a node.js hackday/workshop this saturday",
        "f9e12e0466f4d059b78bb3f863633092 (19:33): 7cbd522d7fcf593a1e60d52c789b6a7b: I am in Cali - thanks for the heads up though :)",
        "1f8387eb43f131d7c309a90a4e36b5cb (19:35): Ooh, on that note, we've got an internal tech talk about node.js tomorrow!  Yay!",
        "7cbd522d7fcf593a1e60d52c789b6a7b (19:35): f9e12e0466f4d059b78bb3f863633092: its only like a 7 hour flight, cmon! ;)",
        "f9e12e0466f4d059b78bb3f863633092 (19:36): 1f8387eb43f131d7c309a90a4e36b5cb: was that your subtle way of inviting us? ;)",
        "f9e12e0466f4d059b78bb3f863633092 (19:36): 7cbd522d7fcf593a1e60d52c789b6a7b: if only it were that easy...",
        "7cbd522d7fcf593a1e60d52c789b6a7b (19:38): yeah, it's only a 30 minute train ride for me and it's not that easy",
        "1f8387eb43f131d7c309a90a4e36b5cb (19:38): f9e12e0466f4d059b78bb3f863633092: I dunno if outsiders can attend.  I'll ask, if you want.",
        "b25b6b77a0087ff8385941e5545d32ea (19:38): Dear &quot;I'm too lazy to read the spec right now and will instead go home&quot;web: is there a simple way to get the DOMContentLoaded event on the document on an iframe when you set the src of the iframe (so you don't have the right document object at the point where you can set an event listener)",
        "f9e12e0466f4d059b78bb3f863633092 (19:39): 1f8387eb43f131d7c309a90a4e36b5cb: please ask - that would be great",
        "f9e12e0466f4d059b78bb3f863633092 (19:52): 7cbd522d7fcf593a1e60d52c789b6a7b: will any of the talks be streamed this saturday?",
        "7cbd522d7fcf593a1e60d52c789b6a7b (19:52): f9e12e0466f4d059b78bb3f863633092: i doubt it. i think its more of a hands-on hack day",
        "f9e12e0466f4d059b78bb3f863633092 (19:52): cool",
        "a11aabeeceeae6b8cb5d12ea06b56554 (19:56): b25b6b77a0087ff8385941e5545d32ea: You were talking about ORMs coping cleanly with cases where some conditions were optional, got any code of one doing so?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (19:56): To ask again‚Ä¶",
        "a11aabeeceeae6b8cb5d12ea06b56554 (19:56): weeps at b25b6b77a0087ff8385941e5545d32ea's silence",
        "b25b6b77a0087ff8385941e5545d32ea (20:10): a11aabeeceeae6b8cb5d12ea06b56554: Either I am ignoring you or you missed &quot;and will now go home&quot;",
        "b25b6b77a0087ff8385941e5545d32ea (20:10): a11aabeeceeae6b8cb5d12ea06b56554: No examples, but it seems like it shouldn't be too hard",
        "b25b6b77a0087ff8385941e5545d32ea (20:11): reads some documentation",
        "b25b6b77a0087ff8385941e5545d32ea (20:12): a11aabeeceeae6b8cb5d12ea06b56554: Is what you want different from using sql alchemy and doing",
        "b25b6b77a0087ff8385941e5545d32ea (20:13): f = filter(foo.bar = &quot;baz&quot;)",
        "b25b6b77a0087ff8385941e5545d32ea (20:13): if condition1:",
        "b25b6b77a0087ff8385941e5545d32ea (20:13): f = f.filter(foo.foobar = &quot;something&quot;)",
        "b25b6b77a0087ff8385941e5545d32ea (20:13): and so on?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (20:13): no",
        "a11aabeeceeae6b8cb5d12ea06b56554 (20:14): But I thought you meant there was a way cleaner than that :)",
        "b25b6b77a0087ff8385941e5545d32ea (20:14): Oh",
        "b25b6b77a0087ff8385941e5545d32ea (20:14): Well that seems clean relative to gluing together bits of SQL by hand depending on the conditions :)",
        "b25b6b77a0087ff8385941e5545d32ea (20:15): (and you can probably make it look nicer if you have some good way of mapping conditions to filters)",
        "a11aabeeceeae6b8cb5d12ea06b56554 (20:15): Well, in the cases where you just create an array and concat them with OR it's not massively cleaner",
        "b25b6b77a0087ff8385941e5545d32ea (20:17): I tend to think that anything not involving gluing together strings is a win",
        "88d4d34a8064a4ff39fd5e144eea7762 (20:24): 1f8387eb43f131d7c309a90a4e36b5cb, in ISSUE-4/ISSUE-84, aren't you supposed to quote things rather than just linking to them?",
        "1f8387eb43f131d7c309a90a4e36b5cb (20:26): 88d4d34a8064a4ff39fd5e144eea7762: I linked, but then summarized the takeaway point from the link in my reply.",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:49): 1f8387eb43f131d7c309a90a4e36b5cb: I think your objecting could use some restatement of the argument for readers who don' already agree with robin's conclusion",
        "b8810fee2f4a71f849f3f7409546d1d9 (20:49): *objection",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:07): notices this while reading the HTTP 1.0 spec: &quot;Product tokens [like the User-Agent header] should be short and to the point -- use of them for advertizing or other non-essential information is explicitly forbidden. Although any token character may appear in a product-version, this token should only be used for a version identifier (i.e., successive versions of the same product should only differ in the product-version portion of the pro",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:07): Ha.  Ha.  Ha.",
        "1f8387eb43f131d7c309a90a4e36b5cb (21:08): I blame it all on early hackers.  Fuckers, the lot of 'em.",
        "b8810fee2f4a71f849f3f7409546d1d9 (21:09): yay for reality-based specs",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:13): Proxy Error",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:13): The proxy server received an invalid response from an upstream server.",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:13): The proxy server could not handle the request POST /2002/09/wbs/40318/issues-4-84-objection-poll/.",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:13): Reason: Error reading from remote server",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:13): I get that when trying to submit my objection at: http://www.w3.org/2002/09/wbs/40318/issues-4-84-objection-poll/",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:13): pokes MikeSmith?",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:14): (If that had caused me to lose my giant post that I spent like an hour writing, I'd have killed someone.)",
        "ab7faae5d7b250ea8606486575f8f79c (21:14): Maybe you wrote too much",
        "ab7faae5d7b250ea8606486575f8f79c (21:14): I think b8810fee2f4a71f849f3f7409546d1d9 had that problem",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:15): (Browsers need more bulletproof auto-form-saving.  It's reliable enough these days that I rely on it, but just unreliable enough that it doesn't work enough times to be kind of frustrating.)",
        "ab7faae5d7b250ea8606486575f8f79c (21:15): suggests killing the people who haven't added a 'recover recently submitted form values' feature to browsers",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:15): $ wc ~/issue4-objection",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:15): 32  929 5804 /home/aryeh/issue4-objection",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:15): Is that too much?",
        "ab7faae5d7b250ea8606486575f8f79c (21:16): 13:01 &lt; MikeSmith&gt; if a comment is 5629 characters or longer, submitting a response will fail",
        "ab7faae5d7b250ea8606486575f8f79c (21:18): (You could Twitterise your response so it fits in the limit, or post to www-archive and link to it)",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:18): Seriously?  5629 is the cutoff?",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:18): Why 5629?",
        "ab7faae5d7b250ea8606486575f8f79c (21:19): shrugs",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:19): Wikipedia used to have a problem where some browsers wouldn't handle text boxes properly if they had 32 KB or more of text, but that's at least a vaguely comprehensible number.",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:20): is used to Twitterizing git commit summaries so the first line is 50 characters or less, so that should be no big deal to do",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:22): Well, seems like it worked.",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:22): I wasn't too far over, so no big deal.",
        "b8810fee2f4a71f849f3f7409546d1d9 (21:26): 88d4d34a8064a4ff39fd5e144eea7762: I had the same problem. MikeSmith instructed me to post to www-archive and point from the survey to www-archive",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:26): b8810fee2f4a71f849f3f7409546d1d9, I was only a couple hundred bytes over, so I just shortened it a bit.",
        "b25b6b77a0087ff8385941e5545d32ea (21:40): 88d4d34a8064a4ff39fd5e144eea7762: Maybe the real limit is 8192 or something, but a whole load of extra bytes are added somewhere?",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:40): Would make sense.",
        "b25b6b77a0087ff8385941e5545d32ea (21:40): 8192 is still kinda radom though",
        "b25b6b77a0087ff8385941e5545d32ea (21:40): +n",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:41): I'm guessing the system wasn't really stress-tested so much prior to the HTMLWG &quot;everyone is a member&quot; philosophy.",
        "b25b6b77a0087ff8385941e5545d32ea (21:41): With this poll it's more like &quot;everyone is Alexander Pope&quot;",
        "65325d50b2e25aca54bc871b89758c9c (21:42): 88d4d34a8064a4ff39fd5e144eea7762: if you can't make your response short enough, I you can always mail it to www-archive and post a link",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:42): 65325d50b2e25aca54bc871b89758c9c, it's okay, I just shortened it a bit.",
        "b25b6b77a0087ff8385941e5545d32ea (21:43): decides that Pope was not quite who he had in mind",
        "b25b6b77a0087ff8385941e5545d32ea (21:43): Although if anyone does write their response in verse form, I shall be impressed",
        "b25b6b77a0087ff8385941e5545d32ea (21:44): Possibly the chairs less so :)"
    ],
    "person_ids": [
        "1f8387eb43f131d7c309a90a4e36b5cb",
        "f9e12e0466f4d059b78bb3f863633092",
        "7cbd522d7fcf593a1e60d52c789b6a7b",
        "b25b6b77a0087ff8385941e5545d32ea",
        "a11aabeeceeae6b8cb5d12ea06b56554",
        "88d4d34a8064a4ff39fd5e144eea7762",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "ab7faae5d7b250ea8606486575f8f79c",
        "65325d50b2e25aca54bc871b89758c9c"
    ]
}