{
    "id": "dd1bb045c268fe0d2ee2fb8c32a1cd26",
    "messages": [
        "42e76c77af424a4350ab0e3e3f6f2ce9 (21:35): hsivonen_, you e-mailed public-html with this: &quot;HTML 5 seeks to make layout tables non-conforming, which I think it is an exercise in futility.&quot; I've been thinking about defining what a layout table is in terms of which elements and attributes it does and does not use, so they could be told apart from data tables automatically",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (21:35): hsivonen_, something like &quot;If a table contains &lt;th&gt;, scope or headers it is a data table. Otherwise it is a layout table.&quot;",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (21:36): layout tables which match the description for layout tables would be conforming; layouts tables which include &lt;th&gt;, scope or headers would not be conforming",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:40): 42e76c77af424a4350ab0e3e3f6f2ce9: Looking for accessibility markup as a hint is nice in theory (it's the approach WCAG 1.0 was geared towards); I'm not sure it works that well in practice.",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:40): (That is, I'm not sure how consistently data tables use any of that markup.)",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:41): FWIW I think JAWS used to assume that outer tables were layout tables and inner tables were data tables.",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:41): (when all it had was td anyhow)",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:42): Given IE8's support for CSS table display properties, I'm not clear what the authoring advantages of layout tables would be anymore.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (21:43): support legacy content and authoring convenience spring to mind",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:44): so long as HTML5 defines how UAs treat layout tables, do you reckon people care about the conformance of legacy content?",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (21:45): I meant making legacy content work with ATs by having one interoperable method of detecting layout tables",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:45): But that's not a conformance issue for authors; that's a conformance issue for UAs.",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:45): Is that what we're talking about?",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:46): If so, I hadn't realized HTML5 was insisting UAs treat table as data; that indeed wouldn't be very wise.",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:47): If *not, I mean",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (21:47): http://sitesurgeon.co.uk/tables/ - 45% of the data tables I found don't use &lt;th&gt;; 35% use &lt;td&gt; for all their headers without scope or headers. telling authors their layout tables or data tables are broken seems useful for a checker",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:48): Yes.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (21:48): so there would be requirements for authors to follow the definitions and UAs to detect which tables fit which definition",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:49): I'm not sure I can see authors combing over old table layouts to turn them into conforming layout tables.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (21:49): &quot;Outer tables can never be data tables.&quot; could be part of the definition",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:49): I'd have thought it would be more useful to have a validator mode for checking all non-conforming markup is in a state that should &quot;work&quot;.",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:50): *more precise",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (21:50): the definition of layout tables would be informed by research into how they are currently authored; I'm just giving basic ideas for now :)",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:50): then the few authors interested in converting old table layouts into working table layouts could use the tool like that",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:51): likewise it could check over &lt;applet&gt; and any other things HTML5 considers beneath itself ;)",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (21:51): for authors, the idea would be to make working tables of either type conforming; broken tables of either type non-conforming",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:52): 42e76c77af424a4350ab0e3e3f6f2ce9: I think one thing you need to factor into this is that the JAWS thing was practical because it worked for a general case; but you can switch between interpreting a given table as layout or data.",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:53): That may be a more important facility for dealing with tables then the algorithm for guessing layout vs data.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (21:54): that switch could be retained but the heuristics improved in HTML5",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (21:54): so you wouldn't need to use the switch so much",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:55): Well, yes, but making users use a switch isn't ideal; and making layout tables non-conforming supports their conversion to something that doesn't require a switch.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (21:56): ef6f2287bae00ba79475fbf56c2b6fee, these are useful points :)",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (21:57): but as you said, &quot;few authors interested in converting old table layouts&quot; mean big changes aren't going to happen in the legacy",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (21:58): if the layout table description is good enough, you won't need to use the switch because the detection will be right most or all of the time",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:58): indeed. which is why I don't think authorial conformance requirements should be designed around people tweaking legacy markup.",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:58): if. yes.",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:58): guess you (or someone) needs to go give their best shot at an algorithm",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (21:59): yeah, I'm working on sponsorship to cover work like this",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:59): but that still seems more about how UAs handle existing content than author conformance requirements",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:59): (e.g. if you wanted to make it really easy for authors to indicate tables are for layout one could just have a layout attribute on table.)",
        "ef6f2287bae00ba79475fbf56c2b6fee (21:59): rather than requiring them to root through their th's",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (21:59): the idea is only a tiny number of layout tables would need changes",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (22:00): it will take research to figure out if legacy layout tables follow patterns consistently enough for this to be feasible :P",
        "ef6f2287bae00ba79475fbf56c2b6fee (22:00): I should imagine layout-table-forms vs. spreadsheet-table-forms would be a particularly painful area to try and spec out.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (22:03): that's something I've been discussing on Accessify Forum recently (as Cerbera): http://www.accessifyforum.com/viewtopic.php?t=9791",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (22:04): the UA part is at the end, summarised here: http://projectcerbera.com/blog/2008/04#day14",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (22:06): would be cool if we can find a sane way for these things to Just Work natively",
        "ef6f2287bae00ba79475fbf56c2b6fee (22:07): yes.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (22:16): 73eaf221abca1b8244e34b0b9e76ac46, hi",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:17): 42e76c77af424a4350ab0e3e3f6f2ce9: hi",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (22:18): 73eaf221abca1b8244e34b0b9e76ac46, we've been talking about data tables, layout tables and tabular forms: http://krijnhoetmer.nl/irc-logs/whatwg/20080414#l-346",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:18): 42e76c77af424a4350ab0e3e3f6f2ce9: thanks, reading",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:23): 42e76c77af424a4350ab0e3e3f6f2ce9: many layout tables use &lt;th&gt;",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:24): 42e76c77af424a4350ab0e3e3f6f2ce9: and there are legitimate data tables with no &lt;th&gt;",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (22:27): 73eaf221abca1b8244e34b0b9e76ac46, I'm not sure how many is many. &lt;th&gt; seems rare any place I've looked...",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (22:28): 73eaf221abca1b8244e34b0b9e76ac46, a table with no headers is using layout to indicate relationships rather than labelling...so I'm not sure if that's a &quot;legitimate&quot; data table.",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (22:28): I don't have a concrete proposal for this, it's just an idea for now :)",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:30): i don't have data about how many data tables use &lt;th&gt;, but i've seen several and &lt;th&gt; is a pretty common element in hixie's billion-document-study from 2005",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (22:31): this headerless data table http://sports.espn.go.com/nhl/news/story?page=statistics/glossary should probably use &lt;th&gt; in the 1st column",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:31): i don't consider a family tree &lt;table&gt; a layout table",
        "ab7faae5d7b250ea8606486575f8f79c (22:32): (I saw &lt;th&gt; on about 4% of pages)",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:32): ab7faae5d7b250ea8606486575f8f79c: and &lt;td&gt;?",
        "ab7faae5d7b250ea8606486575f8f79c (22:32): (and &lt;table&gt; on 74%)",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:32): (ok)",
        "ab7faae5d7b250ea8606486575f8f79c (22:32): (and &lt;td&gt; on 0.2% fewer than &lt;table&gt;)",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:35): ab7faae5d7b250ea8606486575f8f79c: do you have a list of pages that use &lt;th&gt;?",
        "ab7faae5d7b250ea8606486575f8f79c (22:35): (and &lt;tbody&gt; on 0.2% in total)",
        "ab7faae5d7b250ea8606486575f8f79c (22:35): 73eaf221abca1b8244e34b0b9e76ac46: http://canvex.lazyilluminati.com/survey/2007-07-17/analyse.cgi/pages/tag/th",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (22:38): 73eaf221abca1b8244e34b0b9e76ac46, just viewed some family trees and see what you mean",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:38): ab7faae5d7b250ea8606486575f8f79c: thanks",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (22:43): 73eaf221abca1b8244e34b0b9e76ac46, &lt;ul&gt; seems a better choice for the ancestor/sibling/descendant relationships in family trees, although I haven't check how that would look",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:44): 42e76c77af424a4350ab0e3e3f6f2ce9: maybe, but it would make styling extremely non-trivial as to make it unrealistic",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:45): in print, they are in a grid",
        "ab7faae5d7b250ea8606486575f8f79c (22:45): The strict tree model breaks down if your family has had some 'interesting' relationships",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (22:45): lol :D",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:45): ab7faae5d7b250ea8606486575f8f79c: that too, but that also makes it hard to do with &lt;table&gt; :P",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (22:46): display: table-* enjoying greater support might help?",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:47): so the 5 first pages i've looked at with &lt;th&gt;, none of them had data tables",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:48): 42e76c77af424a4350ab0e3e3f6f2ce9: can you make a demo page where nested &lt;ul&gt; displays like a proper grid with css?",
        "ab7faae5d7b250ea8606486575f8f79c (22:48): (My data is almost a year old so be careful that the pages haven't changed to be totally different nowadays)",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (22:48): 73eaf221abca1b8244e34b0b9e76ac46, I'd like to do that and work on this properly but can't afford the time yet",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (22:49): just wanted to mention it here to get the cogs turning in other peoples' heads",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:49): 42e76c77af424a4350ab0e3e3f6f2ce9: i've looked at making nested &lt;ul&gt;s show like a grid before but couldn't figure out a sane way to do it",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:50): ab7faae5d7b250ea8606486575f8f79c: i checked the source to confirm that they had &lt;th",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:50): (the first didn't)",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:50): (so skipped it)",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:51): the wikipedia page wasn't really a layout table, i guess, but it wasn't a data table either (it should have used &lt;h3/&gt;&lt;ul/&gt; instead)",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (22:52): 73eaf221abca1b8244e34b0b9e76ac46, if you can't do it then it must be impossible :)",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:52): lol",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:52): well it was quite a while ago",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:53): perhaps i gave up too quickly and thought that &lt;table&gt; was the right way to do it",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:53): (and i still think it is)",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (22:56): I remember your nested FIFA table was correctly laid out while my single &lt;table&gt; with several &lt;tbody&gt; was not",
        "73eaf221abca1b8244e34b0b9e76ac46 (22:59): (http://simon.html5.org/sandbox/html/fifa )",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (23:02): the team names should be &lt;th&gt;?",
        "42e76c77af424a4350ab0e3e3f6f2ce9 (23:03): (mine was http://sitesurgeon.co.uk/!dev/fifa2006/ben-millard.html)",
        "73eaf221abca1b8244e34b0b9e76ac46 (23:22): 69b0d3dfe919a6b860a9fac82de52a7e: should insertHTML use the html parser in xml documents too?",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:35): 73eaf221abca1b8244e34b0b9e76ac46: if you can find me a UA that uses an XML parser, I'm happy to switch it",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:35): 73eaf221abca1b8244e34b0b9e76ac46: my investigation suggested it was HTML all the way",
        "73eaf221abca1b8244e34b0b9e76ac46 (23:36): 69b0d3dfe919a6b860a9fac82de52a7e: last time i checked, opera always uses the html parser while firefox and webkit inserthtml only works in text/html",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:37): k",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:37): html it is then",
        "73eaf221abca1b8244e34b0b9e76ac46 (23:38): but it seems weird to have all the checks in the dom everywhere (like, say, setting dataset.foo) if inserthtml can insert anything in an xml document anyway",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:39): 73eaf221abca1b8244e34b0b9e76ac46: i put checks in dataset.foo?",
        "73eaf221abca1b8244e34b0b9e76ac46 (23:40): 69b0d3dfe919a6b860a9fac82de52a7e: &quot;If setAttribute() would have raised an exception when setting an attribute with the name name, then this must raise the same exception.&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:40): ah, ok, that's just setAttribute() then",
        "69b0d3dfe919a6b860a9fac82de52a7e (23:40): right, i basically set that up to be equivalent to setAttribute(), for ease of implementation",
        "73eaf221abca1b8244e34b0b9e76ac46 (23:40): that makes sense"
    ],
    "person_ids": [
        "42e76c77af424a4350ab0e3e3f6f2ce9",
        "ef6f2287bae00ba79475fbf56c2b6fee",
        "73eaf221abca1b8244e34b0b9e76ac46",
        "ab7faae5d7b250ea8606486575f8f79c",
        "69b0d3dfe919a6b860a9fac82de52a7e"
    ]
}