{
    "id": "df593ddfa0c277eb6097623926115877",
    "messages": [
        "8c8837db54a2907cacd8633547977e33 (05:47): would be fine with sql if there were general agreement upon some rigorous specification of exact syntax and behavior",
        "8c8837db54a2907cacd8633547977e33 (05:48): which doesn't seem likely to happen given the enormity of the prerequisite tasks, but is not entirely unlikely",
        "69b0d3dfe919a6b860a9fac82de52a7e (06:09): 042dd99eb0ff8653814e445ca0093427: well, a lot of the arguments sicking makes seem to apply equally to ignoring mozilla's preference and requiring support for the sql database api",
        "042dd99eb0ff8653814e445ca0093427 (06:12): The arguments seem completely different to me",
        "65325d50b2e25aca54bc871b89758c9c (06:13): in each case, the argument for inclusion would be to promote interoperability by exerting market pressure on holdouts",
        "042dd99eb0ff8653814e445ca0093427 (06:13): but the reasons for people holding out are completely different",
        "65325d50b2e25aca54bc871b89758c9c (06:14): so your Mozilla's reasons for holding out are valid but Apple's are not?",
        "042dd99eb0ff8653814e445ca0093427 (06:14): Modulo my limited understanding of Apple's reasons --- yes.",
        "042dd99eb0ff8653814e445ca0093427 (06:16): if Web SQL was the only plausible solution for structured client-side storage, I'm sure we'd just bite the bullet and do it.",
        "65325d50b2e25aca54bc871b89758c9c (06:20): so existence of plausible (though not yet materialized) alternatives justifies holding out, in a way that specs should accomodate?",
        "042dd99eb0ff8653814e445ca0093427 (06:21): depends on what you mean by &quot;materialized&quot;",
        "042dd99eb0ff8653814e445ca0093427 (06:21): http://hg.toolness.com/browser-couch/raw-file/blog-post/index.html",
        "042dd99eb0ff8653814e445ca0093427 (06:22): there are many other differences between the two situations",
        "69b0d3dfe919a6b860a9fac82de52a7e (06:22): fundamentally, i don't think i should be in the business of saying that apple's reasons are less good than mozilla's reasons",
        "69b0d3dfe919a6b860a9fac82de52a7e (06:22): in particular, not when it won't make any difference anyway",
        "69b0d3dfe919a6b860a9fac82de52a7e (06:22): as in this case",
        "042dd99eb0ff8653814e445ca0093427 (06:23): e.g., only one browser implements Web SQL currently, so there's no interop to speak of, whereas we have three browsers with demoed or shipping Theora implementations, one of which is actually different code",
        "042dd99eb0ff8653814e445ca0093427 (06:23): there's the issue of Web SQL not having a real spec",
        "65325d50b2e25aca54bc871b89758c9c (06:23): Right now we have 1 browser shipping it and 2 that have publicly committed to doing so",
        "042dd99eb0ff8653814e445ca0093427 (06:23): Has Opera committed to it?",
        "65325d50b2e25aca54bc871b89758c9c (06:23): vs for Theora, 2 browsers shipping and 1 publicly committed",
        "65325d50b2e25aca54bc871b89758c9c (06:24): Opera has said they will do it",
        "69b0d3dfe919a6b860a9fac82de52a7e (06:24): (websql will have a real spec after html5 is in last call, assuming no better alternatives surface -- i'll write it myself if i have to :-) )",
        "042dd99eb0ff8653814e445ca0093427 (06:24): 65325d50b2e25aca54bc871b89758c9c: OK, that strengthens the case for Web SQL a bit.",
        "65325d50b2e25aca54bc871b89758c9c (06:25): I think Mozilla is entitled to wait and see what happens, even if I would prefer you did implement Web SQL",
        "65325d50b2e25aca54bc871b89758c9c (06:25): that's why I proposed splitting it from the rest of the Web Storage spec",
        "042dd99eb0ff8653814e445ca0093427 (06:25): I doubt we'll see an independent implementation of SQLite's SQL dialect, though, which remains a worry",
        "69b0d3dfe919a6b860a9fac82de52a7e (06:25): i think mozilla's concerns with websql are perfectly valid",
        "69b0d3dfe919a6b860a9fac82de52a7e (06:25): i think apple's concerns with theora are valid too",
        "69b0d3dfe919a6b860a9fac82de52a7e (06:26): insofar as mozilla thinks their concerns are valid, and apple thinks their concerns are valid",
        "65325d50b2e25aca54bc871b89758c9c (06:26): fwiw Apple is doing a new round of research on the matter",
        "042dd99eb0ff8653814e445ca0093427 (06:26): I don't think we should shy away from making value judgements about peoples' concerns",
        "042dd99eb0ff8653814e445ca0093427 (06:26): people have unreasonable concerns sometimes",
        "042dd99eb0ff8653814e445ca0093427 (06:26): I know it can sound arrogant",
        "69b0d3dfe919a6b860a9fac82de52a7e (06:26): that's a very dangerous path to go down, imho",
        "69b0d3dfe919a6b860a9fac82de52a7e (06:27): and not one that leads to productive cooperation",
        "69b0d3dfe919a6b860a9fac82de52a7e (06:27): what would you do if i said that mozilla's concerns re websql weren't valid?",
        "69b0d3dfe919a6b860a9fac82de52a7e (06:27): i doubt you would really appreciate it",
        "042dd99eb0ff8653814e445ca0093427 (06:27): We'd argue about it",
        "042dd99eb0ff8653814e445ca0093427 (06:27): in the past I've had a lot of concerns that you have assuaged in one way or another",
        "042dd99eb0ff8653814e445ca0093427 (06:28): I don't think I personally, or Mozilla in general, am immune to unrealistic or overblown concerns",
        "042dd99eb0ff8653814e445ca0093427 (06:29): putting them on an untouchable pedestal is itself dangerous",
        "69b0d3dfe919a6b860a9fac82de52a7e (06:29): i'm talking specifically about &quot;we won't implement X&quot; feedback",
        "69b0d3dfe919a6b860a9fac82de52a7e (06:29): for more nuanced feedback, things are more complex",
        "65325d50b2e25aca54bc871b89758c9c (06:29): I think the only thing anyone has done to assuage Apple's concerns (or Google's) about Theora is to say they shouldn't count or imply that they are not on the level",
        "042dd99eb0ff8653814e445ca0093427 (06:29): Mozilla has not said &quot;we won't implement SQL&quot;",
        "042dd99eb0ff8653814e445ca0093427 (06:30): at least, I don't think we have",
        "69b0d3dfe919a6b860a9fac82de52a7e (06:30): not quite as explicitly as apple has said it about theora, i'll grant you",
        "69b0d3dfe919a6b860a9fac82de52a7e (06:31): anyway, my point was just that sicking's comments seemed to be dangerously close to saying &quot;ignore apple&quot;, which i don't think it would be appropriate for me to do, as i think it would set a precedent for ignoring any vendor whose feedback isn't convenient.",
        "69b0d3dfe919a6b860a9fac82de52a7e (06:31): which could be mozilla, e.g. as with websql",
        "69b0d3dfe919a6b860a9fac82de52a7e (06:32): i'm just trying to treat everyone fairly :-)",
        "042dd99eb0ff8653814e445ca0093427 (06:32): 65325d50b2e25aca54bc871b89758c9c: there's an interesting thing. Google's got concerns about Theora not being a great codec. Fine. But they're implementing it anyway. I don't understand why Apple can't do the same.",
        "042dd99eb0ff8653814e445ca0093427 (06:32): 65325d50b2e25aca54bc871b89758c9c: or at least, patents are the only reason I can understand.",
        "65325d50b2e25aca54bc871b89758c9c (06:32): our concerns are that we could get sued, and that it might not be viable on the phone",
        "65325d50b2e25aca54bc871b89758c9c (06:32): we're going to investigate both these issues much more in depth",
        "ac3ddd1ee072788599320d47ecd93672 (06:33): 042dd99eb0ff8653814e445ca0093427, btw, here's the message from MS on SQL dialects:",
        "ac3ddd1ee072788599320d47ecd93672 (06:33): http://groups.google.com/group/mozilla.community.web-standards/msg/d6a92db27bd52bcb",
        "042dd99eb0ff8653814e445ca0093427 (06:33): &quot;viable&quot; as in &quot;consumes more power than your H.264 hardware decoder&quot; or as in &quot;Will Not Work At All&quot;?",
        "042dd99eb0ff8653814e445ca0093427 (06:33): the former is a red herring, I think.",
        "65325d50b2e25aca54bc871b89758c9c (06:34): I wouldn't phrase it in as absolute a way as you just did",
        "042dd99eb0ff8653814e445ca0093427 (06:34): the latter would be a shock",
        "e2633ed61085592add6e058692dfff2f (06:35): vlc plays theora videos on jailbroken iphones so it's certainly possible",
        "042dd99eb0ff8653814e445ca0093427 (06:35): One question in the mega-thread that I asked that never got answered is &quot;how would supporting Theora make the iPhone *worse*&quot;?",
        "65325d50b2e25aca54bc871b89758c9c (06:35): &quot;viable&quot; as in &quot;consumes more power than seems reasonable&quot; and &quot;renders at adequate performance relative to the quality of experience we expect on iPhone OS&quot;",
        "65325d50b2e25aca54bc871b89758c9c (06:36): er",
        "65325d50b2e25aca54bc871b89758c9c (06:36): I phrased one of those backwards",
        "042dd99eb0ff8653814e445ca0093427 (06:36): does Apple reject applications from the iPhone store because they run the CPU at 100%?",
        "65325d50b2e25aca54bc871b89758c9c (06:36): &quot;doesn't consume more power than seems reasonable&quot;",
        "042dd99eb0ff8653814e445ca0093427 (06:36): does Safari refuse to render Web pages that run too much JS?",
        "65325d50b2e25aca54bc871b89758c9c (06:36): we do limit background apps in part to avoid killing the battery",
        "65325d50b2e25aca54bc871b89758c9c (06:36): and yes, MobileSafari has a JS execution limit",
        "042dd99eb0ff8653814e445ca0093427 (06:36): what sort of limit?",
        "65325d50b2e25aca54bc871b89758c9c (06:37): run JS for too long within a given time period and it gets shut off for that page",
        "042dd99eb0ff8653814e445ca0093427 (06:37): ok",
        "042dd99eb0ff8653814e445ca0093427 (06:38): I wonder what Opera thinks about this mobile power issue",
        "042dd99eb0ff8653814e445ca0093427 (06:38): since that's most of their business",
        "65325d50b2e25aca54bc871b89758c9c (06:38): anyway, to clarify the parameters, if it took 10x as much battery that would probably be unacceptable, if it took 1.5x, that probably wouldn't be",
        "e2633ed61085592add6e058692dfff2f (06:38): the camera app on the iphone consumes an enormous amount of power - so does skype. Ban them imho.",
        "65325d50b2e25aca54bc871b89758c9c (06:39): anyway I think it needs to be put to the test whether a software-only implementation could be acceptable",
        "65325d50b2e25aca54bc871b89758c9c (06:40): I suspect Opera cares less, because it's the device vendor, not the app vendor, who faces the users' ire over poor battery life",
        "042dd99eb0ff8653814e445ca0093427 (06:41): I suspect device vendors are able to forward that feedback",
        "ac3ddd1ee072788599320d47ecd93672 (06:42): 042dd99eb0ff8653814e445ca0093427, anyway, I think the SQL comparison is not such a good. I don't think the storage draft has a dangling dependency.",
        "042dd99eb0ff8653814e445ca0093427 (06:42): ac3ddd1ee072788599320d47ecd93672: it's worse, it has a dependency on something that doesn't exist, a spec for SQLite",
        "ac3ddd1ee072788599320d47ecd93672 (06:42): well, if the storage draft contains SQL",
        "ac3ddd1ee072788599320d47ecd93672 (06:43): if it's moved into a new Web SQL API draft, that document still has it",
        "042dd99eb0ff8653814e445ca0093427 (06:43): right, that could be fixed. I believe Ian when he says he'll fix it if necessary. But we can't be blamed for pushing back against the draft that exists today",
        "042dd99eb0ff8653814e445ca0093427 (06:44): no-one really knows how hard it will be to spec out the SQL bit. I have faith in Ian's supreme speccing skills, that's all",
        "ac3ddd1ee072788599320d47ecd93672 (06:44): 042dd99eb0ff8653814e445ca0093427, I read the response as saying the splitting of the storage spec was due to our lack of implementation",
        "ac3ddd1ee072788599320d47ecd93672 (06:44): but it seems to me that splitting the spec is not really the same as leaving something unspecified",
        "69b0d3dfe919a6b860a9fac82de52a7e (06:47): 042dd99eb0ff8653814e445ca0093427: :-)",
        "8c8837db54a2907cacd8633547977e33 (07:03): wishes hsivonen were not in a time zone that's still somewhat asleep right now",
        "8c8837db54a2907cacd8633547977e33 (07:04): reads the .web-standards newsgroup posts",
        "8c8837db54a2907cacd8633547977e33 (07:06): hates Hates HATES how threading is utterly destroyed by the unholy mailing list-newsgroup chimera the mirroring software creates"
    ],
    "person_ids": [
        "8c8837db54a2907cacd8633547977e33",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "042dd99eb0ff8653814e445ca0093427",
        "65325d50b2e25aca54bc871b89758c9c",
        "ac3ddd1ee072788599320d47ecd93672",
        "e2633ed61085592add6e058692dfff2f"
    ]
}