{
    "id": "df94735838fa33bd8c6e87eeb8fc50b3",
    "messages": [
        "2c39bccd623947fa6224ea57d2a727de (16:06): http://twitter.com/diveintomark/status/1336512675",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:12): the &lt;time&gt; email just keeps coming...",
        "f139aba52f9fa1394b4034a7954b2220 (16:13): yeah, it's becomming a permathread",
        "1f58faf0d058f303f30239a369808167 (16:14): yawns",
        "f139aba52f9fa1394b4034a7954b2220 (16:15): I wonder who that tweet from diveintomark is responding to",
        "f139aba52f9fa1394b4034a7954b2220 (16:15): LOL http://twitter.com/diveintomark/status/1329398270",
        "1f58faf0d058f303f30239a369808167 (16:17): yawns bis",
        "b25b6b77a0087ff8385941e5545d32ea (16:17): Is any of the time email intersting? I keep dipping in and out and there seems to be a lot of discussion about year 0 and alternate calendar systems",
        "b25b6b77a0087ff8385941e5545d32ea (16:18): wonders how one can yawn bis. Or hat bis means. I thought they were some sort of pop band...",
        "b25b6b77a0087ff8385941e5545d32ea (16:18): s/hat/what/",
        "2c39bccd623947fa6224ea57d2a727de (16:18): bis can also mean second or some such",
        "2c39bccd623947fa6224ea57d2a727de (16:18): e.g. house number 12 and 12bis",
        "2c39bccd623947fa6224ea57d2a727de (16:19): numbers* meh",
        "f139aba52f9fa1394b4034a7954b2220 (16:21): b25b6b77a0087ff8385941e5545d32ea, I don't think so. It's all repeating the same thing over and over again",
        "b25b6b77a0087ff8385941e5545d32ea (16:21): It also stands for Bandalag ??slenskra sk?°ta, the icelandic boy scouts. But I doubt 1f58faf0d058f303f30239a369808167 yawned so wide he swallowed a whole nation's scouts by mistake",
        "f139aba52f9fa1394b4034a7954b2220 (16:23): it gets a little weird when you start to realise the contradictory arguments that seem to be getting put forth, like wanting to allow negative years, a year 0000, and have the year -0001 mean 1BCE instead of 2BCE",
        "b25b6b77a0087ff8385941e5545d32ea (16:23): It's only confusing if the contradictory positions are all taken by a single person at a single time",
        "f139aba52f9fa1394b4034a7954b2220 (16:24): there was one email in which that seemed to be the case",
        "f139aba52f9fa1394b4034a7954b2220 (16:24): looks it up",
        "f139aba52f9fa1394b4034a7954b2220 (16:24): http://lists.w3.org/Archives/Public/public-html/2009Mar/0341.html",
        "ab7faae5d7b250ea8606486575f8f79c (16:25): What if I want to represent dates in Flatland's calendar system, where there is a year 0?",
        "f139aba52f9fa1394b4034a7954b2220 (16:26): &quot;I think [year 0000] should be allowed. Historians deny the existence of year 0, but astronomers use it... ISO 8601:2000 and above suggest that year 0000 be used and be considered year 1 BC, and then -0001 is 2 BC, etc. Most, I believe, will want year -0004 = 4BC (and this is what I'd suggest).&quot;",
        "b25b6b77a0087ff8385941e5545d32ea (16:27): Funness",
        "f139aba52f9fa1394b4034a7954b2220 (16:28): ab7faae5d7b250ea8606486575f8f79c, Flatland usually refers to an imaginary universe in which there are only 2 spatial dimensions. I'm not sure what that universe has to do with a year 0",
        "1f58faf0d058f303f30239a369808167 (16:28): yep bis aka a second time to which people could have replied &quot;Bis repetita non placent&quot;",
        "f139aba52f9fa1394b4034a7954b2220 (16:29): 1f58faf0d058f303f30239a369808167, google translate says that translates to &quot;Repeat not place&quot;. What on earth does that mean?",
        "b25b6b77a0087ff8385941e5545d32ea (16:30): f139aba52f9fa1394b4034a7954b2220: But imagine I am writing a book about flatland and I want to say it was &lt;time datetime=00-00-00&gt;the first day&lt;/time&gt;...&quot;",
        "1f58faf0d058f303f30239a369808167 (16:31): http://www.google.com/search?q=&quot;Bis+repetita+non+placent&quot;",
        "ab7faae5d7b250ea8606486575f8f79c (16:31): A Square says, &quot;It was the last day of the 1999th year of our era. The pattering of the rain had long ago announced nightfall; and I was sitting in the company of my wife, musing on the events of the past and the prospects of the coming year, the coming century, the coming Millennium.&quot;",
        "ab7faae5d7b250ea8606486575f8f79c (16:32): and since the new millennium starts on the year 2000, their calendar system must have started with the year 0",
        "b25b6b77a0087ff8385941e5545d32ea (16:33): 1f58faf0d058f303f30239a369808167: Limiting communications to latin should at least cut down on the noise in the channel",
        "1f58faf0d058f303f30239a369808167 (16:33): http://yauba.com/?q=%22Bis+repetita+non+placent%22 or by the new one ;)",
        "ab7faae5d7b250ea8606486575f8f79c (16:33): &quot;Acting, as was their wont, in strict accordance with precedent, the highest Circles of the realm were meeting in solemn conclave, as they had met on the first hour of the first day of the year 1000, and also on the first hour of the first day of the year 0.&quot;",
        "1f58faf0d058f303f30239a369808167 (16:33): b25b6b77a0087ff8385941e5545d32ea: indeed :)",
        "ab7faae5d7b250ea8606486575f8f79c (16:33): Ah, there's an explicit year 0",
        "f139aba52f9fa1394b4034a7954b2220 (16:34): ab7faae5d7b250ea8606486575f8f79c, what are you quoting from?",
        "ab7faae5d7b250ea8606486575f8f79c (16:34): f139aba52f9fa1394b4034a7954b2220: Flatland",
        "1f58faf0d058f303f30239a369808167 (16:35): # Bis repetita non placent -- &quot;Repetitions are not well-received.&quot; (Horace, Ars Poetica 365)",
        "ab7faae5d7b250ea8606486575f8f79c (16:35): (http://www.geom.uiuc.edu/~banchoff/Flatland/ etc, though that's not a nicely formatted version)",
        "f139aba52f9fa1394b4034a7954b2220 (16:35): I didn't know that was a book",
        "ab7faae5d7b250ea8606486575f8f79c (16:36): http://en.wikipedia.org/wiki/Flatland",
        "1f58faf0d058f303f30239a369808167 (16:36): f139aba52f9fa1394b4034a7954b2220: be happy, being young means that there is a lot of classics to discover.",
        "f139aba52f9fa1394b4034a7954b2220 (16:36): I'd only ever heard of the place being described in quantum physics documentaries as a way of explaining the concept of 11 demensions to average people.",
        "ab7faae5d7b250ea8606486575f8f79c (16:37): wonders how f139aba52f9fa1394b4034a7954b2220 could have gone through life without knowing of the Flatland book",
        "f139aba52f9fa1394b4034a7954b2220 (16:37): I don't read much",
        "f139aba52f9fa1394b4034a7954b2220 (16:39): anyway, I think marking up the calendar systems of fictional universes can be considered an edge case that we don't need to support in HTML5",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:40): f139aba52f9fa1394b4034a7954b2220: next you are going to say we don't need Klingon in Unicode!",
        "ab7faae5d7b250ea8606486575f8f79c (16:41): It's kind of a weird book, since it's half a discussion of dimensional geometry and half a social commentary on Victorian life",
        "ab7faae5d7b250ea8606486575f8f79c (16:41): b8810fee2f4a71f849f3f7409546d1d9: But Unicode is all about edge cases",
        "f139aba52f9fa1394b4034a7954b2220 (16:43): b8810fee2f4a71f849f3f7409546d1d9, no, that's a different issue, because writing about fictional universes with different calendar systems doesn't gain anything by having explicit &lt;time&gt; element support, nor lose anything by not having it.",
        "f139aba52f9fa1394b4034a7954b2220 (16:45): however, it is questionable whether Klingon should be added to Unicode or not. There are several fictional writing systems that I can think of which are not supported in Unicode, such as those from the Lord of the Rings, or the Ancients' alphabet from Stargate",
        "b25b6b77a0087ff8385941e5545d32ea (16:46): Kligon was rejected from unicode",
        "b25b6b77a0087ff8385941e5545d32ea (16:46): *Klingon",
        "ab7faae5d7b250ea8606486575f8f79c (16:48): There are practical reasons to include artificial languages in Unicode - people want to use normal software (text editors, copy-and-paste, TTF fonts, HTML, etc) to manipulate text in those languages, and that software is all designed around being able to represent any text using Unicode",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:49): proceeds to remove table tainting from the V.nu parser",
        "ab7faae5d7b250ea8606486575f8f79c (16:49): (though Private Use Areas are probably a sufficient level of inclusion)",
        "f139aba52f9fa1394b4034a7954b2220 (16:52): for such characters to be useful for such purposes, the code points used within the Private Use Areas would need to have some level of agreement between the applications involved",
        "f139aba52f9fa1394b4034a7954b2220 (16:53): at the very least, font vendors making different fonts for those characters would need to agree on the code points",
        "ab7faae5d7b250ea8606486575f8f79c (16:56): Indeed, so you have some simple low-cost external registry to assign character ranges to anyone who wants them",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:58): is it OK if I update html5lib tests to the new AAA tomorrow? what about getting rid of taint and doing foster-parenting the WebKit way?",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:01): I should also update the tests to deal with the new frameset-ok stuff",
        "b8810fee2f4a71f849f3f7409546d1d9 (17:02): good thing I didn't change the tests for spec rev 2730",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:11): 2c39bccd623947fa6224ea57d2a727de: ping",
        "2c39bccd623947fa6224ea57d2a727de (17:11): pang",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:11): 2c39bccd623947fa6224ea57d2a727de: What's the state of setting Authorization via XHR?",
        "2c39bccd623947fa6224ea57d2a727de (17:12): forbidden I think",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:12): 2c39bccd623947fa6224ea57d2a727de: I found an old email from 10 months ago saying you'd disallowed it, but it isn't in the latest TR",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:12): Actually, TR version is too old",
        "2c39bccd623947fa6224ea57d2a727de (17:12): maybe because TR is from more than 10 months ago?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (17:14): is speaking to people about the possibility of using it for OAuth, which needs Authorization",
        "2c39bccd623947fa6224ea57d2a727de (17:17): per XHR Authorization is UA controlled",
        "2c39bccd623947fa6224ea57d2a727de (17:18): even though we might be able to change that for same-origin requests it would not be possible for cross-origin so we might as well keep them in sync",
        "2c39bccd623947fa6224ea57d2a727de (17:39): does anyone know if SWSX or whatever it's called has live transcripts of sessions?",
        "2c39bccd623947fa6224ea57d2a727de (17:39): e.g. the Browser War Panel might be fun to follow",
        "d114be1698421a7cec050e2207d29631 (17:46): wonders if browsers will be put in harms way during this panel"
    ],
    "person_ids": [
        "2c39bccd623947fa6224ea57d2a727de",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "f139aba52f9fa1394b4034a7954b2220",
        "1f58faf0d058f303f30239a369808167",
        "b25b6b77a0087ff8385941e5545d32ea",
        "ab7faae5d7b250ea8606486575f8f79c",
        "a11aabeeceeae6b8cb5d12ea06b56554",
        "d114be1698421a7cec050e2207d29631"
    ]
}