{
    "id": "e16a3cf0a850341f1034feac9b26da06",
    "messages": [
        "b8810fee2f4a71f849f3f7409546d1d9 (18:25): http://twitter.com/michaelhkay/status/1541670540",
        "9ebe28a11536c4496e988ca10a4bebdc (18:42): Heya, everyone.  I think this topic has been raised before, but has anyone in-room heard of the proposal for the @fullsize attribute on img?",
        "9ebe28a11536c4496e988ca10a4bebdc (18:44): I *really* like the idea, and believe that it addresses an important use-case, but can see that it fails badly at graceful degradation.",
        "9ebe28a11536c4496e988ca10a4bebdc (18:45): As such, what would the room think of a &quot;_modal&quot; value for @target of &lt;a&gt; instead?  When clicked, it loads the resource indicated in the @href, but in a lightbox-style page-modal window.",
        "9ebe28a11536c4496e988ca10a4bebdc (18:46): If the resource has a title which can be auto-discovered (such as if it is an html document with a &lt;title&gt;), it would use that in a title bar; otherwise it would take the title from the @title attribute on &lt;a&gt;",
        "b25b6b77a0087ff8385941e5545d32ea (18:46): 9ebe28a11536c4496e988ca10a4bebdc: Why is it an important enough use-case that is deserves native support in html? Why are custom css/js solutions not better? Is a single attribute enough expressiveness to do what people actually want?",
        "9ebe28a11536c4496e988ca10a4bebdc (18:46): Modal windows in general, and modal image popups in specific, are used *everywhere*.  Pretty much *every* image gallery that's been produced in the last two years or so uses it.",
        "9ebe28a11536c4496e988ca10a4bebdc (18:47): This is because it's honestly a very useful thing to do.  It lets you display large numbers of low-bandwidth resources on a page, and then allow people to load large-size versions on command.",
        "b25b6b77a0087ff8385941e5545d32ea (18:47): Well e.g. flickr and facebook don't really do that",
        "b25b6b77a0087ff8385941e5545d32ea (18:48): (they just use normal links)",
        "9ebe28a11536c4496e988ca10a4bebdc (18:48): Indeed, because they are explicitly focused on the image itself, and so that gets loaded into the main frame.  Many many personal and small-business sites use it, though.",
        "9ebe28a11536c4496e988ca10a4bebdc (18:50): CSS solutions don't really exist right now.  With :target, they *could*, but you'd be explicitly loading all the large-size images immediately.",
        "b25b6b77a0087ff8385941e5545d32ea (18:50): It is really unapparent to me that there is any need to standardise what is quite a sophisticated way of displaying images.",
        "b25b6b77a0087ff8385941e5545d32ea (18:51): It is much more useful to standardise simple primitives in HTML and then let authors build more complex things on the platform using js + CSS",
        "b25b6b77a0087ff8385941e5545d32ea (18:52): Especially things that have such a limited scope for reuse",
        "b25b6b77a0087ff8385941e5545d32ea (18:53): (a lightbox-style image popup is really only useful if you want a lightbox style image popup; just because they are fashionable today doesn't mean that they won't be like a 2009-era mullet)",
        "348bd76aa308008b6c041da4522286de (18:53): Blar, sorry b25b6b77a0087ff8385941e5545d32ea.  My wireless is flaky.",
        "b25b6b77a0087ff8385941e5545d32ea (18:53): Join the club :)",
        "4d05dc3c4352ebe7593b536f2078cfe9 (18:54): and modal dialogs are not that cool",
        "348bd76aa308008b6c041da4522286de (18:54): I'm not quite sure what you mean by &quot;sophisticated&quot; in this context.  Lightbox implementations have some variance in exact display, but overall appearance and functionality is pretty standard across them.",
        "4d05dc3c4352ebe7593b536f2078cfe9 (18:54): you can't use the page while viewing images",
        "348bd76aa308008b6c041da4522286de (18:55): Point, 4d05dc3c4352ebe7593b536f2078cfe9, but lightbox is still extremely common on the web, whether used to display images, videos, or text blocks.",
        "4d05dc3c4352ebe7593b536f2078cfe9 (18:55): and functionnalities are not that standard",
        "348bd76aa308008b6c041da4522286de (18:56): Can you explain further on that?  In my experience, they are.",
        "4d05dc3c4352ebe7593b536f2078cfe9 (18:56): some lightboxes allow you to go to the next or previous image, some don't",
        "4d05dc3c4352ebe7593b536f2078cfe9 (18:56): some accept escape to close it, some don't",
        "348bd76aa308008b6c041da4522286de (18:57): next/previous image: indeed, but that's more of a gallery thing than a modal thing in and of itself.  Useful, yes, but only in limited contexts and requires more autodiscovery than would probably be possible.",
        "4d05dc3c4352ebe7593b536f2078cfe9 (18:57): I still prefer popups for that kind of content but that's my point of view",
        "b25b6b77a0087ff8385941e5545d32ea (18:57): Some allow text some don't. Some style the text differently to others",
        "348bd76aa308008b6c041da4522286de (18:57): Allowing escape: that's a minor issue, and should be addressed by the browser itself.",
        "348bd76aa308008b6c041da4522286de (18:58): Allowing text: indeed, but there's no reason *not* to allow it.  Styling should be the domain of CSS (and is, in any major lightbox implementation).",
        "b25b6b77a0087ff8385941e5545d32ea (18:59): So standardising this would need a way of specifying the image, a way of specifying the text (icluding maybe a title, maybe allowing rich markup for lists of e.g. photo settings), allowing a way to set the background colour and opacity, and probably more",
        "348bd76aa308008b6c041da4522286de (18:59): 4d05dc3c4352ebe7593b536f2078cfe9: It would be perfectly appropriate for the browser to open an &quot;_modal&quot; link in a popup or new tab or whatever.  It's a display suggestion, not a requirement.",
        "b25b6b77a0087ff8385941e5545d32ea (19:00): So you need to work out how all that stuff is going to work and, at the end of the day, you end up with something that is rather trivial to implement in javascript+CSS",
        "4d05dc3c4352ebe7593b536f2078cfe9 (19:00): 348bd76aa308008b6c041da4522286de: and :target doesn't loading all images",
        "4d05dc3c4352ebe7593b536f2078cfe9 (19:00): *mean",
        "b25b6b77a0087ff8385941e5545d32ea (19:00): Except in a form that doesn't work in any existing browser",
        "348bd76aa308008b6c041da4522286de (19:00): b25b6b77a0087ff8385941e5545d32ea: Yes.  My suggestion is @target=&quot;_modal&quot; to specify the resource.  Text is specified in the resource.  Setting CSS should be a CSS issue, likely via a pseudoelement.",
        "b25b6b77a0087ff8385941e5545d32ea (19:01): and is unlikely to work in future browsers because browser makers are unlikely to see implementing it as a huge deal",
        "348bd76aa308008b6c041da4522286de (19:01): 4d05dc3c4352ebe7593b536f2078cfe9: ?_?  It would.  To simulate lightboxes in pure CSS, you have to put them in the document from the beginning.  A browser *could* possibly optimize by not loading the display:none images immediately, I suppose.",
        "4d05dc3c4352ebe7593b536f2078cfe9 (19:01): I believe they already do that",
        "a11aabeeceeae6b8cb5d12ea06b56554 (19:02): They don't.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (19:02): Opera used to, but nothing else ever did, AFAIK.",
        "348bd76aa308008b6c041da4522286de (19:03): b25b6b77a0087ff8385941e5545d32ea:  I'll be writing it out explicitly.  These issues basically *are* already worked out, because most of them are trivial when you approach the problem from the right direction.",
        "348bd76aa308008b6c041da4522286de (19:04): The bonus is that it allows authors to do something they're already doing, but without a javascript library being required.",
        "348bd76aa308008b6c041da4522286de (19:04): Plus, it degrades to a perfectly useful new window in a non-supporting browser.",
        "348bd76aa308008b6c041da4522286de (19:04): (One named &quot;_modal&quot;.)",
        "348bd76aa308008b6c041da4522286de (19:06): In a good browser, you'll just get a fancier display and better user interaction, similar to how many of the new input types work.",
        "b25b6b77a0087ff8385941e5545d32ea (19:09): 348bd76aa308008b6c041da4522286de: I don't really understand how your suggestion would work. You are suggesting creating an auxillary browsing context that im supporting browsers would be overlaid on the existing browsing context but with different default style rules? How would you get back to the first browsing context?",
        "348bd76aa308008b6c041da4522286de (19:11): Yes, that is what I'm suggesting.  The browser, as part of its default UI, would provide a way to close the new context (most likely, a simple X button in the upper-right, with some keyboard ability as well.)",
        "b25b6b77a0087ff8385941e5545d32ea (19:12): Having browser-added chrome on the page seems odd",
        "9ebe28a11536c4496e988ca10a4bebdc (19:14): Really?  For accessibility and discovery purposes, I'd prefer it to be browser-added.",
        "b25b6b77a0087ff8385941e5545d32ea (19:16): 9ebe28a11536c4496e988ca10a4bebdc: Right but there are very feww examples of browser added chtrome on a page. Usually keeping a clean sepaeration between browser-added things and site-added things is good for aesthetics, security, etc.",
        "9ebe28a11536c4496e988ca10a4bebdc (19:18): Crap, I just threw together a mock page for exploring CSS-driven modal dialogs.  http://www.xanthir.com/css-modal.html",
        "9ebe28a11536c4496e988ca10a4bebdc (19:18): :target just keeps getting more useful.",
        "9ebe28a11536c4496e988ca10a4bebdc (19:19): There's still a handful of problems with it, but they might need to be solved anyway in the future.",
        "9ebe28a11536c4496e988ca10a4bebdc (19:20): (better centering ability in CSS, better sizing (min-intrinsic should help), ability to defeer loading of non-displayed resources)",
        "b25b6b77a0087ff8385941e5545d32ea (19:20): 9ebe28a11536c4496e988ca10a4bebdc: That is quite cool but using js has the advantage that it will work in the absence of stylesheets (and maybe in the absence of js too, if you code it well)",
        "348bd76aa308008b6c041da4522286de (19:23): Mine works in the absence of stylesheets. ^_^ You then just have the content on the page, and the link shoots you over to it.  That's the beauty of using :target.",
        "348bd76aa308008b6c041da4522286de (19:23): Then the Back button returns you to where you clicked.",
        "348bd76aa308008b6c041da4522286de (19:24): It just fails in the absence of :target, and you can deploy some feature-testing js to then pick up the slack.",
        "b25b6b77a0087ff8385941e5545d32ea (19:26): 9ebe28a11536c4496e988ca10a4bebdc: For the kind of use case I imagine, having the content on the page is not the right fallback behaviour",
        "348bd76aa308008b6c041da4522286de (19:27): Elaborate?",
        "b25b6b77a0087ff8385941e5545d32ea (19:28): E.g. a popup with a larger verion of a photo in",
        "348bd76aa308008b6c041da4522286de (19:28): Because you want to defer loading, right?",
        "348bd76aa308008b6c041da4522286de (19:35): Does anyone in the room have the release version of IE8 on hand?  If so, would you be so kind as to visit http://www.xanthir.com/css-modal.html and tell me if it works?",
        "3490f32b7235c3a5adcd95be03cbecb7 (19:48): 348bd76aa308008b6c041da4522286de: IE 8 doesn't like your modal pop-up",
        "348bd76aa308008b6c041da4522286de (19:48): Indeed.  T_T",
        "348bd76aa308008b6c041da4522286de (19:49): But now that I know that IE is the only browser that doesn't, I can just drop a conditional comment on it delivering the same functionality via jquery.",
        "3490f32b7235c3a5adcd95be03cbecb7 (19:49): I'm really glad there is just the one single browser that is consistently annoying in that regard",
        "3490f32b7235c3a5adcd95be03cbecb7 (19:50): Of course there is a meriad of different support for different things across browsers",
        "9ebe28a11536c4496e988ca10a4bebdc (19:50): Yeah, but as long as you're not on the *bleeding* edge, you're typically all right.",
        "3490f32b7235c3a5adcd95be03cbecb7 (19:50): But imagine if Firefox and Safari were as different as IE is to either of them",
        "3490f32b7235c3a5adcd95be03cbecb7 (19:51): different to each other*",
        "3490f32b7235c3a5adcd95be03cbecb7 (19:53): 9ebe28a11536c4496e988ca10a4bebdc: Yea, but it sucks when using HTML younger than 10 years old is considered bleeding edge :P",
        "348bd76aa308008b6c041da4522286de (19:55): 3490f32b7235c3a5adcd95be03cbecb7: Yeah, that would be horrifying.",
        "348bd76aa308008b6c041da4522286de (20:01): Woo, with the help of :target and the magic of hidden :checked elements, I have a strong tabbed interface mockup in pure CSS."
    ],
    "person_ids": [
        "b8810fee2f4a71f849f3f7409546d1d9",
        "9ebe28a11536c4496e988ca10a4bebdc",
        "b25b6b77a0087ff8385941e5545d32ea",
        "348bd76aa308008b6c041da4522286de",
        "4d05dc3c4352ebe7593b536f2078cfe9",
        "a11aabeeceeae6b8cb5d12ea06b56554",
        "3490f32b7235c3a5adcd95be03cbecb7"
    ]
}