{
    "id": "e2fbb256d2eeb7e06cf60db11045ed03",
    "messages": [
        "88d4d34a8064a4ff39fd5e144eea7762 (03:08): wonders why people misspell his name when it's five letters and easily copy-pastable",
        "88d4d34a8064a4ff39fd5e144eea7762 (03:08): I can understand mispronouncing it, but . . .",
        "88d4d34a8064a4ff39fd5e144eea7762 (03:15): doesn't care too much, once let a professor call him &quot;Awry&quot; for a semester without correcting him",
        "b1b5726c973cb9e906ce1b5bb246147f (03:17): that page also defines a function getByteAt that returns &quot;the Unicode value of the character at the given index&quot;",
        "b1b5726c973cb9e906ce1b5bb246147f (03:20): oh, the API does seem to work that way",
        "1f8387eb43f131d7c309a90a4e36b5cb (03:20): What a wonderfully named function.",
        "1f8387eb43f131d7c309a90a4e36b5cb (03:22): Ah, nice.  Turns out Manu has made his argument for removing Microdata much, much weaker.",
        "b1b5726c973cb9e906ce1b5bb246147f (03:23): hmm, so there's no way to get bytes directly from a Blob?",
        "a924fb58d2c25874322f4e5126f608b9 (03:24): 1f8387eb43f131d7c309a90a4e36b5cb: Doesn't that imply someone else (or he) could just restate the previous, stronger arguments?",
        "1f8387eb43f131d7c309a90a4e36b5cb (03:25): a924fb58d2c25874322f4e5126f608b9: The 'strong' arguments were based on fairness.  The remove-Microdata crowd has rebuked that very line of argument pretty thoroughly.",
        "a924fb58d2c25874322f4e5126f608b9 (03:26): Do they have actual authority to do that, though?",
        "1f8387eb43f131d7c309a90a4e36b5cb (03:26): Debunking themselves?  I don't see why not.",
        "1f8387eb43f131d7c309a90a4e36b5cb (03:26): It would look pretty silly to come back and say they really meant it was a good argument.",
        "1f8387eb43f131d7c309a90a4e36b5cb (03:27): (It wasn't, but it was better than what's there now.)",
        "a924fb58d2c25874322f4e5126f608b9 (03:27): No, someone else I mean. &quot;Those people hate microdata, but there are some of us who really believe in fairness and such...&quot;",
        "1f8387eb43f131d7c309a90a4e36b5cb (03:28): Sure.  It's still a crap argument.  Technologies don't succeed or fail based on fairness.",
        "a924fb58d2c25874322f4e5126f608b9 (03:28): Fair enough (pun noticed)",
        "1f8387eb43f131d7c309a90a4e36b5cb (03:30): didn't intend to be punny. ?_?",
        "a924fb58d2c25874322f4e5126f608b9 (03:30): Oh, the pun was that fairness being irrelevant was &quot;fair enough&quot;",
        "1f8387eb43f131d7c309a90a4e36b5cb (03:33): omg",
        "a9b326df4e6da61c5b6f5e1058be83a2 (03:34): 88d4d34a8064a4ff39fd5e144eea7762: I guess you probably saw bugmail a while back related to issues you raised regarding spurious errors for wikipedia.org validation",
        "a9b326df4e6da61c5b6f5e1058be83a2 (03:34): I think everything you reported is now fixed in the source",
        "a9b326df4e6da61c5b6f5e1058be83a2 (03:35): you will still get a bunch of errors reported, but they are real errors",
        "a9b326df4e6da61c5b6f5e1058be83a2 (03:37): like &quot;Bad value bat-smg for attribute lang&quot;",
        "a9b326df4e6da61c5b6f5e1058be83a2 (03:38): and about 5 other instances of language tags of the form &quot;foo-bar&quot;",
        "1f8387eb43f131d7c309a90a4e36b5cb (03:38): Microdata has an experimental FF impl, doesn't it?",
        "1f8387eb43f131d7c309a90a4e36b5cb (03:39): Of the DOM api, I mean.",
        "1f8387eb43f131d7c309a90a4e36b5cb (03:40): doesn't want to read back through the permathread to find out if he's remembering correctly.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (03:50): finds http://meta.wikimedia.org/wiki/Language_code#Subdomains_that_do_not_conform_valid_ISO_639_language_code",
        "a9b326df4e6da61c5b6f5e1058be83a2 (03:58): 1f8387eb43f131d7c309a90a4e36b5cb: what's the status on your CSS gradient syntax proposal?",
        "1f8387eb43f131d7c309a90a4e36b5cb (03:58): a9b326df4e6da61c5b6f5e1058be83a2: I've got a minor change I need to make so that it interacts sanely with background-size (right now you have to guess to come up with implementable behavior).",
        "1f8387eb43f131d7c309a90a4e36b5cb (03:59): And then 227a9a17d1db3f8e5c71a150345fb2a6 and I have been seriously discussing aligning CSS and SVG's notions of gradients, so it's possible that further changes may arrive in the near future.",
        "1f8387eb43f131d7c309a90a4e36b5cb (03:59): (We should see something about that on the www-style list soon.)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (03:59): cool",
        "a9b326df4e6da61c5b6f5e1058be83a2 (04:05): finds CSS WG issue 179 (Add SVG equivalents to gradients proposal.)",
        "65325d50b2e25aca54bc871b89758c9c (04:05): hi a9b326df4e6da61c5b6f5e1058be83a2!",
        "a9b326df4e6da61c5b6f5e1058be83a2 (04:05): 65325d50b2e25aca54bc871b89758c9c: hey man",
        "65325d50b2e25aca54bc871b89758c9c (04:06): how are things?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (04:06): good good",
        "a9b326df4e6da61c5b6f5e1058be83a2 (04:06): one thing I wanted to ask you about is if SVG filters have been flipped on in nightlies yet",
        "a9b326df4e6da61c5b6f5e1058be83a2 (04:08): plus I found a crasher - https://bugs.webkit.org/show_bug.cgi?id=32357",
        "65325d50b2e25aca54bc871b89758c9c (04:10): a9b326df4e6da61c5b6f5e1058be83a2: filters are on in trunk - I don't know if they have made it to a nightly yet",
        "65325d50b2e25aca54bc871b89758c9c (04:10): thanks for reporting the crasher",
        "1f8387eb43f131d7c309a90a4e36b5cb (04:18): a9b326df4e6da61c5b6f5e1058be83a2: Yeah, issue 179 is actually impossible!  Turns out that several of the radial gradients can't be reproduced in SVG.",
        "65325d50b2e25aca54bc871b89758c9c (04:18): interesting",
        "1f8387eb43f131d7c309a90a4e36b5cb (04:19): Yeah, which is why we're planning on aligning our abstractions so that we can express the same things using roughly the same concepts.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (04:19): 1f8387eb43f131d7c309a90a4e36b5cb: well, kind of a bummer to hear that",
        "a9b326df4e6da61c5b6f5e1058be83a2 (04:19): (I meant bummer to hear that they can't be reproduced)",
        "1f8387eb43f131d7c309a90a4e36b5cb (04:20): Eh, it just means that we need to lift SVG a bit, because I think the cases that it's not hitting are useful.",
        "227a9a17d1db3f8e5c71a150345fb2a6 (04:23): yeah, I think there is a pretty easy way to make SVG versions of most of the gradients, but some of them are not really possible in the general case... should be easy to add them to SVG... I am not sure I like some of the CSS syntax, but that's relatively unimportant",
        "227a9a17d1db3f8e5c71a150345fb2a6 (04:24): specifically, SVG doesn't allow the author to explicitly declare whether the radial gradient is elliptical or circular",
        "227a9a17d1db3f8e5c71a150345fb2a6 (04:25): (though it's possible to get both results)",
        "1f8387eb43f131d7c309a90a4e36b5cb (04:29): That latter part is due to SVG having a slightly crazy notion of image servers that isn't sufficiently developed and general, while CSS doesn't have such an idea at all and has so far relied on url() images all working basically the same.",
        "1f8387eb43f131d7c309a90a4e36b5cb (04:30): I want to both generalize SVG's image-server concept, and upgrade CSS to also use it.",
        "1f8387eb43f131d7c309a90a4e36b5cb (04:33): Also: omg I'm stopping reading all the issue-76 threads.  They are entirely uninteresting.  &gt;_&lt;",
        "1f8387eb43f131d7c309a90a4e36b5cb (04:33): Also: now I need to go write a change proposal for that one dt/dd issue.  Not a counter-proposal, at least.",
        "65325d50b2e25aca54bc871b89758c9c (04:39): 1f8387eb43f131d7c309a90a4e36b5cb: thanks for updating your Change Proposal",
        "1f8387eb43f131d7c309a90a4e36b5cb (04:40): np.  There are several points that Manu specifically rebutted in my change proposal, and while I'd like to re-rebut them, I don't believe they're actually relevant to the proposal, so I left the mout."
    ],
    "person_ids": [
        "88d4d34a8064a4ff39fd5e144eea7762",
        "b1b5726c973cb9e906ce1b5bb246147f",
        "1f8387eb43f131d7c309a90a4e36b5cb",
        "a924fb58d2c25874322f4e5126f608b9",
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "65325d50b2e25aca54bc871b89758c9c",
        "227a9a17d1db3f8e5c71a150345fb2a6"
    ]
}