{
    "id": "e5aa030c0f0d26b4bc139ef796a06d9d",
    "messages": [
        "5832a673ae3016d62e5f4af031067e74 (15:23): @ b8810fee2f4a71f849f3f7409546d1d9 - saw your question on the IRC log.",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:23): 5832a673ae3016d62e5f4af031067e74: which question?",
        "5832a673ae3016d62e5f4af031067e74 (15:23): Authorising rel=transformation is not all GRDDL uses head@profile for.",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:24): 5832a673ae3016d62e5f4af031067e74: ah. what else is it used for?",
        "5832a673ae3016d62e5f4af031067e74 (15:25): to link to a profile like http://www.w3.org/2006/03/hcard which in turn links to an XSLT transformation",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:26): 5832a673ae3016d62e5f4af031067e74: so you need to rewrite profile URLs if microformats.org refuses to play along?",
        "5832a673ae3016d62e5f4af031067e74 (15:27): not sure what you mean. there's nothing special about the profile URI - you could equally link to http://example.com/profiles/hcard and it would work just as well",
        "f139aba52f9fa1394b4034a7954b2220 (15:28): 5832a673ae3016d62e5f4af031067e74, do profile URIs need to be dereferenced to obtain the profile?",
        "f139aba52f9fa1394b4034a7954b2220 (15:29): I thought they were more of an opaque identifer that UAs could theoretically recognise",
        "60659cfda992013e610f285c46692d28 (15:29): f139aba52f9fa1394b4034a7954b2220: that is my understanding as well. Seems GRDDL *allows* resolving them to disocver more information",
        "5832a673ae3016d62e5f4af031067e74 (15:29): they can be treated either way. if you recognise it, perform your preprogrammed routines. otherwise, fetch the profile and use GRDDL.",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:30): 5832a673ae3016d62e5f4af031067e74: presumably if it were URI-based extensibility, microformats.org would be the one minting the microformat profile URIs",
        "60659cfda992013e610f285c46692d28 (15:30): 5832a673ae3016d62e5f4af031067e74: of course that may disrupt cases where people relied on clients *not* automatically resolving profile URIs",
        "5832a673ae3016d62e5f4af031067e74 (15:30): profile URIs for microformats are here &lt;http://microformats.org/wiki/profile-uris&gt;",
        "f139aba52f9fa1394b4034a7954b2220 (15:30): then how would changing the profile URL from microformats.org for hcard, to w3.org or even example.org, then the system would need to dereference the URL. But then, there's no unambiguous, machine processable way for the UA to determine the semantics",
        "60659cfda992013e610f285c46692d28 (15:31): The profile story in the mf community sucks -- their test cases don't use them.",
        "5832a673ae3016d62e5f4af031067e74 (15:32): @lachy - there is an unambiguous machine-processable way for the UA to determine the semantics - the machine retrieves the profile document and finds a link to an XSLT transformation. the XLST transofmration is applied to the original document and RDF triples result",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:32): 5832a673ae3016d62e5f4af031067e74: seems like dereferencing profile URIs is a sure way to break their use as mere globally unique an unambiguous identifiers",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:32): 5832a673ae3016d62e5f4af031067e74: and if the URI isn't dereferencable or doesn't point to XSLT? if it is a pure idenifier?",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:33): 60659cfda992013e610f285c46692d28: their story sucks, but if their test cases don't use them, the way they use profile, doesn't suck :-)",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:34): s/,//",
        "60659cfda992013e610f285c46692d28 (15:34): b8810fee2f4a71f849f3f7409546d1d9: at this point I'd be happy if they would be consistent in what they do.",
        "60659cfda992013e610f285c46692d28 (15:34): ...or recommend.",
        "5832a673ae3016d62e5f4af031067e74 (15:34): the HTML 4.01 definition of @profile : http://www.w3.org/TR/REC-html40/struct/global.html#profiles",
        "60659cfda992013e610f285c46692d28 (15:34): Thr problem seems to be that profiles are part of their &quot;we do the right thing&quot; story; but in practice mf clients do not ise them.",
        "5832a673ae3016d62e5f4af031067e74 (15:34): &quot;User agents may dereference the URI and perform some activity based on the actual definitions within the profile&quot;",
        "5832a673ae3016d62e5f4af031067e74 (15:35): most uF test cases do not use them - microformats do predate GRDDL.",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:35): 60659cfda992013e610f285c46692d28: changing the story seems like the sensible way to go",
        "5832a673ae3016d62e5f4af031067e74 (15:35): however, accepted best practice is for microformats to have profile URIs",
        "60659cfda992013e610f285c46692d28 (15:36): 5832a673ae3016d62e5f4af031067e74: yes, they predate GRDDL, but not the profile story. why do the test cases fail to use a profile?",
        "60659cfda992013e610f285c46692d28 (15:36): 5832a673ae3016d62e5f4af031067e74: when it is the accepted best practice, why don't their test cases use it?",
        "5832a673ae3016d62e5f4af031067e74 (15:36): the test cases may well be sub-optimal.",
        "f139aba52f9fa1394b4034a7954b2220 (15:37): 5832a673ae3016d62e5f4af031067e74, so basically, using an XSLT transformation, I could use whatever class names and data I wanted in my document, as long as the thing output some RDF? That seems like a lot of unnecessary indirection.",
        "60659cfda992013e610f285c46692d28 (15:37): 5832a673ae3016d62e5f4af031067e74: bad test cases can be worse than no test cases, because people steal code from them",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:37): if I had a system that accepted something RDF vCard and I was scraping the Web for hCards, I'd hardwire my scraper with an hCard to RDF vCard transformer no matter what profiles saidh",
        "5832a673ae3016d62e5f4af031067e74 (15:37): and most test cases are document fragments (no &lt;head&gt;)",
        "5832a673ae3016d62e5f4af031067e74 (15:37): f139aba52f9fa1394b4034a7954b2220, yes",
        "5832a673ae3016d62e5f4af031067e74 (15:38): b8810fee2f4a71f849f3f7409546d1d9, yes",
        "60659cfda992013e610f285c46692d28 (15:38): it would be good if microformats.org had a validator service, that warns when profiles are missing.",
        "5832a673ae3016d62e5f4af031067e74 (15:38): But it might be also useful to catch people who were using &lt;span class=&quot;person&quot;&gt;&lt;/span&gt; say (i.e. not hCard)",
        "f139aba52f9fa1394b4034a7954b2220 (15:38): ok. IMHO, it's better to just have authors markup their data in a standardised way, and have consumers with built in knowledge of how to exract that data, than to have the author also provide the instructions for how to extract it",
        "60659cfda992013e610f285c46692d28 (15:39): f139aba52f9fa1394b4034a7954b2220: yes, for well known and agreed upon formats.",
        "5832a673ae3016d62e5f4af031067e74 (15:39): http://hcard.geekhood.net/ is a fairly good validator - only for hCard so far",
        "f139aba52f9fa1394b4034a7954b2220 (15:39): so that's why I think GRDDL is overengineered and poorly desinged",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:39): 60659cfda992013e610f285c46692d28: so why is it OK to send over an XSLT program, but sending over a JavaScript program is &quot;bad&quot;?",
        "f139aba52f9fa1394b4034a7954b2220 (15:40): 60659cfda992013e610f285c46692d28, then why is such a transformation needed for hcard, when it is a well known and agreed upon format?",
        "60659cfda992013e610f285c46692d28 (15:40): 5832a673ae3016d62e5f4af031067e74: thanks for the pointer",
        "60659cfda992013e610f285c46692d28 (15:41): f139aba52f9fa1394b4034a7954b2220: did I say that that transformation is needed?",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:41): also, if I'm trying to fill a datastore with RDF vCard data, I wouldn't want random other triples in my triple store and probably couldn't do anything useful with them",
        "f139aba52f9fa1394b4034a7954b2220 (15:43): 60659cfda992013e610f285c46692d28, no, I'm just wondering why the GRDDL community created one for it",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:43): f139aba52f9fa1394b4034a7954b2220: seem like a good idea to share code for common stuff",
        "60659cfda992013e610f285c46692d28 (15:44): b8810fee2f4a71f849f3f7409546d1d9: I personally would prefer XSLT over JavaScript, but if both languages can do the same thing it shouldn't matter.",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:44): f139aba52f9fa1394b4034a7954b2220: but I think the client should have the code a priori",
        "60659cfda992013e610f285c46692d28 (15:44): f139aba52f9fa1394b4034a7954b2220: for testing? proof of concept? And, btw, and as far as I can tell, it was provided by the microformats community (it predates GRDDL)",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:45): 60659cfda992013e610f285c46692d28: what if I create FooML and point by URI to a JAR file that contains a browser for FooML. Is that cool?",
        "f139aba52f9fa1394b4034a7954b2220 (15:45): 60659cfda992013e610f285c46692d28, but I thought the &lt;link rel=&quot;transformation&quot;&gt; in the hcard profile was a GRDDL invention",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:46): 60659cfda992013e610f285c46692d28: or if I create a binary format and point by GUID to an ActiveX object implementing a viewer for it?",
        "60659cfda992013e610f285c46692d28 (15:47): f139aba52f9fa1394b4034a7954b2220: I was referring to Brian Suda's XSLT, which i think appears in the GRDDL primer and has been around for eternity.",
        "60659cfda992013e610f285c46692d28 (15:47): b8810fee2f4a71f849f3f7409546d1d9: are we still in GRDDL land?",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:47): 60659cfda992013e610f285c46692d28: no, in the Least Power land",
        "60659cfda992013e610f285c46692d28 (15:48): b8810fee2f4a71f849f3f7409546d1d9: not sure what you're talking about",
        "60659cfda992013e610f285c46692d28 (15:48): b8810fee2f4a71f849f3f7409546d1d9: I'm not sure what languages other than XSLT GRDDL supports",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:48): 60659cfda992013e610f285c46692d28: I'm talking about sending dumb data vs. programs over the Web to clients",
        "f139aba52f9fa1394b4034a7954b2220 (15:49): 60659cfda992013e610f285c46692d28, I thought the hcard XSLT was created explicitly for GRDDL, but if it predated it, did it merely inspire the GRDDL approach?",
        "5832a673ae3016d62e5f4af031067e74 (15:49): GRDDL only supports XSLT unfortunately",
        "60659cfda992013e610f285c46692d28 (15:49): b8810fee2f4a71f849f3f7409546d1d9: but when others are allowed, I would expect the transformations to return RDF, not to &quot;browse&quot;",
        "60659cfda992013e610f285c46692d28 (15:49): f139aba52f9fa1394b4034a7954b2220: potentially. DanC probably knows.",
        "60659cfda992013e610f285c46692d28 (15:50): b8810fee2f4a71f849f3f7409546d1d9: avoiding sending programs is good. is this what you want to hear?",
        "60659cfda992013e610f285c46692d28 (15:50): b8810fee2f4a71f849f3f7409546d1d9: so I prefer plain HTML over HTML + scripting",
        "60659cfda992013e610f285c46692d28 (15:51): b8810fee2f4a71f849f3f7409546d1d9: sometimes sending code can not be avoided"
    ],
    "person_ids": [
        "5832a673ae3016d62e5f4af031067e74",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "f139aba52f9fa1394b4034a7954b2220",
        "60659cfda992013e610f285c46692d28"
    ]
}