{
    "id": "e678c23cbfa7a8930b65789c40260733",
    "messages": [
        "c63a5cfce0a1819ebbe4a19e074356b6 (00:45): Hello",
        "c63a5cfce0a1819ebbe4a19e074356b6 (00:45): is there any performance difference between element.setAttribute('blah1', 'blah2') and element.dataset.blah1 = 'blah2'?",
        "c63a5cfce0a1819ebbe4a19e074356b6 (00:47): I'm currently using custom attributes all over the place and I'm wondering whether switching to HTML5 datasets would make sense",
        "ab7faae5d7b250ea8606486575f8f79c (00:47): Seems very unlikely that there would be any noticeable difference",
        "ab7faae5d7b250ea8606486575f8f79c (00:47): since dataset is just an API to get/set content attributes",
        "ab7faae5d7b250ea8606486575f8f79c (00:48): so it's doing the same amount of DOM manipulation either way",
        "c63a5cfce0a1819ebbe4a19e074356b6 (00:51): perhaps setting an attribute directly on node (e.g. element.blah1 = 'blah2')  could be any faster?",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:54): depends what you're trying to do",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (00:54): c63a5cfce0a1819ebbe4a19e074356b6, you shouldn't set custom attributes directly on dom nodes anyway. it's bad practice for various reasons.",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:54): are you doing this in a tight loop?",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:54): if you're not, the performance aspects of this are probably irrelevant anyway",
        "88d4d34a8064a4ff39fd5e144eea7762 (00:55): 5cfdf2d621b2a11df72a2e70bd2ff1a0, why not?  That's what data-* is meant for.",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (00:56): 88d4d34a8064a4ff39fd5e144eea7762, i mean this: &lt c63a5cfce0a1819ebbe4a19e074356b6&gt; perhaps setting an attribute directly on node (e.g. element.blah1 = 'blah2')",
        "c63a5cfce0a1819ebbe4a19e074356b6 (00:56): 5cfdf2d621b2a11df72a2e70bd2ff1a0: I'm using custom XML namespace inside XHTML5 document, so custom attributes should be fully valid in my case",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (00:56): attributes may have been the wrong word",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (00:56): object properties?",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:58): the spec uses the terms IDL attributes and content attributes",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:59): though in your case you're talking abotu object properties, since they're not IDL attributes either",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:59): they might conflict with IDL attributes in the future though, so it's not good practice :-)",
        "24ed9f1d5a3f2d416fa1f8843cf9fb2a (00:59): oops, I got disconnected",
        "24ed9f1d5a3f2d416fa1f8843cf9fb2a (01:00): yeah, I already learned that extending core objects is considered to be a bad practice: http://perfectionkills.com/whats-wrong-with-extending-the-dom/",
        "24ed9f1d5a3f2d416fa1f8843cf9fb2a (01:00): but I want to do this anyway :)",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (01:00): good good",
        "24ed9f1d5a3f2d416fa1f8843cf9fb2a (01:01): btw, why it's possible to use element.dataset on non-html elements?",
        "24ed9f1d5a3f2d416fa1f8843cf9fb2a (01:02): while it's not possible to use e.g. element.style",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:02): i thought it was the other way around",
        "24ed9f1d5a3f2d416fa1f8843cf9fb2a (01:03): let me double check...",
        "24ed9f1d5a3f2d416fa1f8843cf9fb2a (01:03): yum,",
        "24ed9f1d5a3f2d416fa1f8843cf9fb2a (01:03): element.style always returns null if element is from custom XML namespace",
        "24ed9f1d5a3f2d416fa1f8843cf9fb2a (01:04): s/yum/yup",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:04): c63a5cfce0a1819ebbe4a19e074356b6_: and dataset works?",
        "24ed9f1d5a3f2d416fa1f8843cf9fb2a (01:04): element.dataset works fine no matter whether element is from custom namespace or not",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:04): weird",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:05): sounds like a bug",
        "24ed9f1d5a3f2d416fa1f8843cf9fb2a (01:05): no, it's a feature",
        "24ed9f1d5a3f2d416fa1f8843cf9fb2a (01:05): please don't fix it",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (01:05): it's a bug",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:05): what if another namespace defines attributes that start with data-?",
        "a3f19f90edf0a0893c7847d08016abe3 (01:05): move it to Element and into DOM Core",
        "a3f19f90edf0a0893c7847d08016abe3 (01:06): if we're going to have global id and class attributes, we should do the same for data-",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:06): i still don't think we should have global id and class :-)",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (01:06): id is namespaced in xml documents, isn't it?",
        "a3f19f90edf0a0893c7847d08016abe3 (01:08): 69b0d3dfe919a6b860a9fac82de52a7e, if dataset doesn't move to Element, would you be able to stick it in a separate interface? beacuse I'm pretty sure it would be useful to use on SVG elements too, and in that case we'd want to have `SVGElement implements DataSetThingos`",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:08): i doubt i'll win the id/class battle",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:08): in which case i'll let anne take data-* to dom core",
        "a3f19f90edf0a0893c7847d08016abe3 (01:09): ok",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:09): i'm not sure how anne is planning on defining content attributes though",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:11): Man, Scalia writes awesome opinions.  http://www.supremecourt.gov/opinions/10pdf/08-1448.pdf",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:12): Cogent and extremely sarcastic.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:12): &quot;One study, for example, found that children who had just finished",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:12): playing violent video games were more likely to fill in the blank letter in ‚Äúexplo_e‚Äù with a ‚Äúd‚Äù (so that it  reads ‚Äúexplode‚Äù) than with an ‚Äúr‚Äù (‚Äúexplore‚Äù).  App. 496, 506  (internal quotation marks omitted). The prevention of this phenomenon,  which  might have been anticipated with common sense, is not a compelling state interest.&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:12): hah",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:15): i also like &quot;Since California has declined to restrict those",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:15): other media, e.g., Saturday morning cartoons, its video-game regulation is wildly  underinclusive, raising serious doubts about whether",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:15): the State is pursuing the interest it invokes or is instead disfavoring",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:15): a particular speaker or viewpoint&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:15): man this is full of win",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:16): Scalia's decisions are always like that.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:16): Roberts is good too.",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:18): &quot; There is no contention that any of the",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:18): virtual characters depicted in the imaginative videos at issue here are",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:18): criminally liabl&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:18): that's good to know",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:21): lol they cite grimm",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:22): by page number no less",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (01:23): writing their opinions probably provides them some fun after dealing with aneurysm-inducing lawyer reasoning.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:23): I think Alito's concurrence makes sense too.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:23): But then, I think court interpretations of the First Amendment can be kind of extreme sometimes.",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:25): page 11 has a sentence that just says &quot;Who knows?&quot;",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:25): Why shouldn't they have them?  They're basically just collections of people.  Your right to free speech shouldn't be affected by who you're being paid by.",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:26): 88d4d34a8064a4ff39fd5e144eea7762: if we could imprison the collection of people, that might have more weight",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:26): You can imprison individual people who individually did things wrong.  Corporations don't have volition, they only have assets.  They're controlled entirely by individual people.",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (01:26): http://www.nytimes.com/2010/01/22/us/politics/22scotus.html",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (01:26): therefore corporations shouldn't have the same rights as people.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:27): They don't.  The people they employ do.",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (01:27): see... that's how it should be, not how it is.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:27): Or rather, the rights that have are corollaries of the rights of their employees.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:28): People who run ads or lobby Congress on behalf of a corporation aren't any less entitled to do so than people who do so on behalf of individuals or themselves.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:28): Just because you were told to do it by a manager in exchange for a paycheck from a corporate bank account doesn't mean you have any less right to do it.",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:29): i don't mind them having rights if they have responsibilities to go with them",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (01:29): just because you work for a company does not mean they are entitled to represent your political opinion",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:30): Of course they aren't.  But they can pay you to exercise your right of political speech on their behalf.  That's all corporations can ever do -- they can't talk or write anything *themselves*.  They're legal fictions.  Any speech is necessarily speech by some person.",
        "da5121879fff54b08b69ec54d9ac2bf6 (01:30): 5cfdf2d621b2a11df72a2e70bd2ff1a0: They usually don't. They represent the political opinion of the owners, if any.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:31): 69b0d3dfe919a6b860a9fac82de52a7e, constitutional rights in America are generally viewed as unalienable, not as being granted in exchange for fulfilling responsibilities.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:31): Convicted murderers spending a life sentence in prison still have the same right to free speech as anyone.",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:32): 88d4d34a8064a4ff39fd5e144eea7762: i'm not saying they're directly linked, just that i would be happy with one if the other existed.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:33): 69b0d3dfe919a6b860a9fac82de52a7e, well, corporations basically only have assets.  When it comes to the disposition of those assets, they have similar responsibilities to individuals, often much greater responsibilities (depending on the type of corporation).  That is, they can be held fiscally liable for breaking the law.  But if it's anything non-monetary, you can't really take actions against a corporation, you have to take action against the individuals responsible.",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:33): 88d4d34a8064a4ff39fd5e144eea7762: e.g. if someone were to kill all the fish in a sea due to reckless negligence while doing something in that sea, they could be expected to suffer consequences, not be immediately invited to continue doing that thing in the same sea and others, as well as spending large sums of money influencing political decisions that control those consequences",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (01:34): they cause far more damage than your lowly criminals that may get many-year sentences...",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:34): 88d4d34a8064a4ff39fd5e144eea7762: i'd be fine with it if the individuals were held responsible too",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:35): 69b0d3dfe919a6b860a9fac82de52a7e, that's orthogonal to the question of corporations.  &quot;Corporation&quot; doesn't mean &quot;big business&quot;, it means an entity that can legally act as a person in some respects.  Small charities and whatever are also often incorporated.",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:35): 88d4d34a8064a4ff39fd5e144eea7762: unfortunately, in the US (and many other places), corporations act as responsibility shields",
        "da5121879fff54b08b69ec54d9ac2bf6 (01:35): Indeed. ‚Äúbecause the corporation is legally considered the &quot;person,&quot; individual shareholders are not legally responsible for the corporation's debts and damages beyond their investment in the corporation‚Äù",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:35): 88d4d34a8064a4ff39fd5e144eea7762: for both the matter of responsibility and the matter of free speech, the problem is proportionally bigger as the company gets bigger.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:36): It's not the corporation that's shielding anything, it's the money and influence.  Corporations are designed to be a good vehicle for concentrating arbitrarily large amounts of money, so it just so happens that any organization of note is going to be incorporated.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:36): That's not the fault of the incorporation.",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (01:36): 69b0d3dfe919a6b860a9fac82de52a7e, it's not just corporations. political parties or bureaucratic machineries are exactly the same. it's all about diffusing responsibility so much that in the end nobody is responsible at all. or that just some symbolic heads will roll even after biggest fuckups that you can imagine",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:36): If incorporation didn't exist, you'd see the same thing with large private businesses.",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:37): 5cfdf2d621b2a11df72a2e70bd2ff1a0: yeah, responsibility diffusion really is the problem. the rights get concentrated, but the responsibilities diffused.",
        "da5121879fff54b08b69ec54d9ac2bf6 (01:37): The shielding of individual shareholders is a wonderful tool to encourage the establishment of new businesses, and awfully scary when said businesses grow bigger and more powerful than small nation-states.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:37): It's simpler than that, it's just that large businesses are powerful enough to have bargaining power with the government.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:38): In many cases they can credibly threaten the government.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:38): For instance, a big business could threaten to leave a particular state if it's taxed too heavily.",
        "da5121879fff54b08b69ec54d9ac2bf6 (01:38): Or threaten its employees, customers or the general populace.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:38): That could cause thousands of people to lose their jobs, which would create a big backlash by the general public against the politicians in power.",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (01:39): shareholders are another issue when they get dividents. they're syphoning off money from other people's work, even when the company has reached the point of being self-sustaining. so instead of accumulating money within the company to reinvest it gets drained, thus potentially slowing innovation just to fill a few private people's pockets.",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (01:39): i know that shares are an important tool to get investments... but in some cases it's just counterproductive",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (01:39): the value of the shares themselves should be sufficient",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:39): 5cfdf2d621b2a11df72a2e70bd2ff1a0, well, yes, that's how capitalism works.  In a capitalist society, it's very easy to start businesses, because investors have the promise of exorbitant returns.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:40): Most large companies don't pay dividends, though.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:40): And if they do, it's only a very small fraction of profit, like one or two percent.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:40): So it's not a big deal in the scheme of things.",
        "da5121879fff54b08b69ec54d9ac2bf6 (01:40): The growth of the value of the company is usually sufficient.",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (01:40): unless someone buys them up, changes the rules and syphons off money, seen that all too often",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:41): Right, and dividends slow down the company's growth sometimes.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:41): 5cfdf2d621b2a11df72a2e70bd2ff1a0, hostile takeovers of that sort are very rare.  A publicly-traded company almost always has far higher market capitalization than assets.  Usually when you have that sort of systematic buy-out, it's an attempt to merge one company into a larger one or such.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:42): But it's hard to pull off, because trying it causes the stock price to shoot up.",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (01:42): &lt 88d4d34a8064a4ff39fd5e144eea7762&gt; It's simpler than that, it's just that large businesses are powerful enough to have bargaining power with the government. &lt;- that's one aspect, but not the only one. just look at all the externalties that companies cause and that the taxpayer has to wipe up after them",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:42): Anyway, if you do buy a lot of stock in the company, it's rarely in your interest to try grabbing the assets and running.  You want to hold onto the stock and let it go up in price, then sell it.  That almost always provides better returns.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:43): Except if the company's stock price has really crashed, then it's sometimes worthwhile to buy it just for the sake of liquidating it.",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (01:43): oh, you don't grab the assets. you slowly bleed money from them, then sell it again while it's still somewhat performing",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:43): 5cfdf2d621b2a11df72a2e70bd2ff1a0, practically any economic activity causes externalities, both positive and negative.  Big businesses can bring a lot of positive economic effects, like greatly reduced costs through economy of scale.",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (01:44): i'm talking about negative externalties, obviously.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:44): They can devote a much larger amount of their budget to R&amp;D and innovation, etc.",
        "88d4d34a8064a4ff39fd5e144eea7762 (01:44): Well, yes, but you can't fairly complain about the negative externalities unless you have evidence that they outweigh the positive externalities.",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (01:44): which sometimes exceed even the profit that the companies themselves make (look at nuclear fuel processing and waste storage cycles)",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (01:45): it's basically cheap power for the economy in exchange for the govt funding the whole infrastructure and waste management for millions of years to come.",
        "da5121879fff54b08b69ec54d9ac2bf6 (01:47): 88d4d34a8064a4ff39fd5e144eea7762: Sure you can. I spend all day searching for an complaining about the few negative issues in otherweise good software. I don't see why the management of this planet's productive resources should be exempt from any criticism. Quite the contrary.",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (01:51): you could go even further... we're putting some of those negative externalties on those who don't see anything of the positive ones (i.e. everything that isn't human)",
        "06cb330920ae58e1614c9145d983b3d6 (02:09): can browsers implement rel=noreferrer already so &quot;anonymous link&quot; sites can die horribly",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (02:10): uhm... you know... you could just block cross domain referrers",
        "06cb330920ae58e1614c9145d983b3d6 (02:11): uhm, that wouldn't magically make sites using anonymous link proxies stop doing so",
        "06cb330920ae58e1614c9145d983b3d6 (02:11): i have GM scripts to undo some of them, but i shouldn't have to, and it doesn't work for all of them (not all of them encode the real URL as a query parameter)",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (02:11): if that's your issue... there are addons that clean up the urls as long as the actual target is embedded in the link",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (02:12): anyway, noreferrer only solves half of the problem. just look at google. they're linkjacking their own links to track what you've clicked on.",
        "06cb330920ae58e1614c9145d983b3d6 (02:13): that's a separate (and roughly equally disgusting) problem",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0 (02:13): it's not just the target sites that harvest data. it's the source sites too"
    ],
    "person_ids": [
        "c63a5cfce0a1819ebbe4a19e074356b6",
        "ab7faae5d7b250ea8606486575f8f79c",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "5cfdf2d621b2a11df72a2e70bd2ff1a0",
        "88d4d34a8064a4ff39fd5e144eea7762",
        "24ed9f1d5a3f2d416fa1f8843cf9fb2a",
        "a3f19f90edf0a0893c7847d08016abe3",
        "da5121879fff54b08b69ec54d9ac2bf6",
        "06cb330920ae58e1614c9145d983b3d6"
    ]
}