{
    "id": "eaecdd474d1ffa798d82af656106c3a5",
    "messages": [
        "a924fb58d2c25874322f4e5126f608b9 (12:38): Has the &lt;q&gt; thread managed to come up with a solution that allows using &lt;q&gt; in languages that puts the following punctuation within the quote marks?",
        "a924fb58d2c25874322f4e5126f608b9 (12:39): I must admit to skimming the most outrageous quote trains :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:43): I wonder if I'd only contribute to the damage done by the denial of productivity effect of &lt;q&gt; if I pointed out some of its history in order to make a point that the semantic need is questionable...",
        "f139aba52f9fa1394b4034a7954b2220 (12:55): b8810fee2f4a71f849f3f7409546d1d9, please do",
        "f139aba52f9fa1394b4034a7954b2220 (12:58): a924fb58d2c25874322f4e5126f608b9, although I really hate that convention, the solution is to put the punctuation within the &lt;q&gt; element if that's what you need.",
        "f139aba52f9fa1394b4034a7954b2220 (12:58): IMHO, punctuation should only be within the quote marks if it is part of the quote itself, otherwise it should go after.",
        "5e3a8698bf6602e718ae1e2be4d3afeb (13:03): f139aba52f9fa1394b4034a7954b2220, but there are plenty of people who disagree with you :)",
        "5e3a8698bf6602e718ae1e2be4d3afeb (13:03): (myself not included, though)",
        "a924fb58d2c25874322f4e5126f608b9 (13:03): f139aba52f9fa1394b4034a7954b2220: But that's just plain _wrong_ when the punctuation isn't part of the quote",
        "ab7faae5d7b250ea8606486575f8f79c (13:08): The correct method of quoting is obvious in the computerised world: you copy-and-paste what someone else wrote, put quotation marks around it, and then put all your extra words and punctuation outside the quotes",
        "ab7faae5d7b250ea8606486575f8f79c (13:09): The old world didn't have copy-and-paste, so they could be excused for doing silly things like adding punctuation inside quotes instead :-)",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:10): f139aba52f9fa1394b4034a7954b2220: I disagree with you in the case of en-US. :-)",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:11): one of the many problems with &lt;q&gt; is that languages high up in the pecking order (en-US and fr-FR) are illogical in the sense that quotation marks do not strictly delimit the quoted string",
        "a924fb58d2c25874322f4e5126f608b9 (13:12): Eggsac-tly",
        "f139aba52f9fa1394b4034a7954b2220 (13:13): a924fb58d2c25874322f4e5126f608b9, what exactly is wrong with what I said?",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:14): f139aba52f9fa1394b4034a7954b2220: what's wrong is that implementing what you said for en-US is economically a bad idea",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:14): f139aba52f9fa1394b4034a7954b2220: which inline box model bugs would you forgo the fixes for while top hackers implement punctuation flipping?",
        "f139aba52f9fa1394b4034a7954b2220 (13:14): b8810fee2f4a71f849f3f7409546d1d9, I think you misunderstood what I said",
        "a924fb58d2c25874322f4e5126f608b9 (13:15): f139aba52f9fa1394b4034a7954b2220: HTML does not have a mandate to change national languages",
        "f139aba52f9fa1394b4034a7954b2220 (13:16): if the punctuation should be within the quote marks, then the author should put it within the &lt;q&gt; element. e.g. &lt;q&gt;Some quote.&lt;/q&gt; --&gt; &quot;Some quote.&quot; Otherwise, the author should put it outside. e.g. &lt;q&gt;Some quote&lt;/q&gt;. --&gt; &quot;Some quote&quot;.",
        "f139aba52f9fa1394b4034a7954b2220 (13:16): a924fb58d2c25874322f4e5126f608b9, I never said it did",
        "ab7faae5d7b250ea8606486575f8f79c (13:17): notes that IE8b2 (at least on an en-GB system) seems to use single quotes for &lt;q&gt; by default, and double quotes once you add lang=en",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:17): whoa. gsnedders isn't here today.",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:17): he has a copy of The Handbook, right?",
        "a924fb58d2c25874322f4e5126f608b9 (13:18): f139aba52f9fa1394b4034a7954b2220: No, it seems you're suggesting mangling the quote instead",
        "f139aba52f9fa1394b4034a7954b2220 (13:18): what?",
        "a924fb58d2c25874322f4e5126f608b9 (13:19): The trailing punctuation is not necessarily part of the quote",
        "f139aba52f9fa1394b4034a7954b2220 (13:19): It's not me mangling the quotes, it's the illogical languages that incorrectly stick punctuation within quotation marks where it doesn't belong.",
        "f139aba52f9fa1394b4034a7954b2220 (13:20): that's why I said &quot;IMHO, punctuation should only be within the quote marks if it is part of the quote itself, otherwise it should go after.&quot;",
        "a924fb58d2c25874322f4e5126f608b9 (13:20): Yes, but as I said, we don't go around changing languages",
        "ab7faae5d7b250ea8606486575f8f79c (13:21): sees that IE8b2 does 'x&quot;y&quot;z' for default &lt;q&gt; (on an en-GB system), &quot;x'y'z&quot; if lang=en or lang=en-xx where xx is not gb, and those double/single chevron things if lang=fr",
        "f139aba52f9fa1394b4034a7954b2220 (13:22): ab7faae5d7b250ea8606486575f8f79c, so does it do &quot;x'y'z&quot; for en-AU?",
        "ab7faae5d7b250ea8606486575f8f79c (13:22): (When I say &quot;&quot;&quot; and &quot;'&quot;, I mean the curly equivalents)",
        "f139aba52f9fa1394b4034a7954b2220 (13:23): (I'm not sure what the correct way is supposed to be, but I always do it that way)",
        "ab7faae5d7b250ea8606486575f8f79c (13:23): f139aba52f9fa1394b4034a7954b2220: Yes",
        "f139aba52f9fa1394b4034a7954b2220 (13:24): so is it doing that based on the system's own language settings when it isn't explicitly declared in the page?",
        "ab7faae5d7b250ea8606486575f8f79c (13:24): lang=no has funny quotes",
        "ab7faae5d7b250ea8606486575f8f79c (13:24): (Double-chevron, then comma/apostrophe or something)",
        "ab7faae5d7b250ea8606486575f8f79c (13:25): f139aba52f9fa1394b4034a7954b2220: I don't know - I'd need to change my system's language settings to test that, but I'm not sure how (and don't have time now)",
        "f139aba52f9fa1394b4034a7954b2220 (13:25): wonders what a Double-chevron is",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:26): ab7faae5d7b250ea8606486575f8f79c: do you mean right-pointing double guillemet?",
        "ab7faae5d7b250ea8606486575f8f79c (13:26): might be using the wrong term",
        "ab7faae5d7b250ea8606486575f8f79c (13:26): I mean something that looks like „Ää",
        "ab7faae5d7b250ea8606486575f8f79c (13:27): which my font doesn't really like, so it's the character that's like &lt;&lt;"
    ],
    "person_ids": [
        "a924fb58d2c25874322f4e5126f608b9",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "f139aba52f9fa1394b4034a7954b2220",
        "5e3a8698bf6602e718ae1e2be4d3afeb",
        "ab7faae5d7b250ea8606486575f8f79c"
    ]
}