{
    "id": "eb868b898d1cfbb1e7dc868faafe31f0",
    "messages": [
        "69b0d3dfe919a6b860a9fac82de52a7e (13:39): how about this",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:40): we just say that if an image has no alt text, then it must have at least one of the following, and the first of the following that it has must have enough information about hte image to help orient the user if he is navigating by image (and have the ATs read out the relevant information):",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:40): - title=&quot;&quot; attribute on the &lt;img&gt; itself",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:40): - &lt;legend&gt; of the &lt;figure&gt; that contains the &lt;img&gt;",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:40): - heading of the section that contains the &lt;img&gt;",
        "f139aba52f9fa1394b4034a7954b2220 (13:54): notes that he suggested something like that a long time ago",
        "ef6f2287bae00ba79475fbf56c2b6fee (13:55): 69b0d3dfe919a6b860a9fac82de52a7e: Existing software isn't going to make any use of legend or heading, but requiring title where alt is absent _might_ be a viable approach (in backwards compatibility terms). One would need to check exactly what existing software does.",
        "f139aba52f9fa1394b4034a7954b2220 (13:55): except for the heading of the section one",
        "ef6f2287bae00ba79475fbf56c2b6fee (13:55): e.g. I think some screen readers will read title where there is no alt.",
        "ef6f2287bae00ba79475fbf56c2b6fee (13:55): I don't know if, when you disable images in your browser, you see title if there is no alt though.",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:56): just saying &quot;image&quot; is good enough for legacy handling",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:56): i mean it's not what we want long term",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:56): but we shouldn't constrain ourselves to only what today's ATs do",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:56): especially given how horrifically bad today's ATs are",
        "ef6f2287bae00ba79475fbf56c2b6fee (13:56): Is saying &quot;image&quot; what they all do.",
        "ef6f2287bae00ba79475fbf56c2b6fee (13:57): again maintains today's AT is little worse than today's other UAs, but they're both what the spec needs to work iwth.",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:57): in the case of JAWS, there's about 212 configuration options that control what it does",
        "f139aba52f9fa1394b4034a7954b2220 (13:57): I don't like allowing alt to be omitted just when the section has a heading because there's no way to distinguish between when the image is the primary content of the section, or if it's just a minor part of a larger section",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:57): ATs today are far, far worse usability wise than today's browsers",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:57): i mean there's not even a comparison",
        "ef6f2287bae00ba79475fbf56c2b6fee (13:57): I know that's your opinion. I just don't think the differences are as radical as you do.",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:57): it's like comparing the usability of CP/M with the usability of Mac OS X",
        "ef6f2287bae00ba79475fbf56c2b6fee (13:58): I also don't think it matters, just like it doesn't really matter how bad I think IE is.",
        "ef6f2287bae00ba79475fbf56c2b6fee (13:58): it still needs to be taken into account",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:58): f139aba52f9fa1394b4034a7954b2220: if it's a minor part, then it can't have alt omitted anyway. you can only omit it for key content.",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:58): ef6f2287bae00ba79475fbf56c2b6fee: like i said, i think saying &quot;image&quot; is good enough",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:59): ef6f2287bae00ba79475fbf56c2b6fee: saying the title is even better",
        "f139aba52f9fa1394b4034a7954b2220 (13:59): 69b0d3dfe919a6b860a9fac82de52a7e, no, that's not what I meant.",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:59): f139aba52f9fa1394b4034a7954b2220: do you have a page that shows an example of an img where alt=&quot;&quot; could legitimately be omitted without the section header being useful?",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:59): and where it would have neither title=&quot;&quot; nor &lt;figure&gt;?",
        "f139aba52f9fa1394b4034a7954b2220 (14:00): 69b0d3dfe919a6b860a9fac82de52a7e, no. You seem to have misunderstood me.",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:00): possibly :-)",
        "f139aba52f9fa1394b4034a7954b2220 (14:01): there are 2 cases that I think need to be distinguished:",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:01): 69b0d3dfe919a6b860a9fac82de52a7e: Could one require describedby attributes explicitly linking the image to the heading?",
        "f139aba52f9fa1394b4034a7954b2220 (14:01): 1. The flickr case where there's an image and the section heading relates directly to that image, much like a caption.",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:02): ef6f2287bae00ba79475fbf56c2b6fee: wouldn't that be redundant?",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:02): 69b0d3dfe919a6b860a9fac82de52a7e: You mean if the image was the sole content of the section?",
        "f139aba52f9fa1394b4034a7954b2220 (14:02): In that case, alt could be omitted according to the rule &quot;heading of the section that contains the &lt;img&gt;&quot;",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:02): 69b0d3dfe919a6b860a9fac82de52a7e: Probably not, given the variety of existing web content.",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:02): ef6f2287bae00ba79475fbf56c2b6fee: well there's only one section that could possibly be the most relevant one to the image, and that's the header of hte section the image is in",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:02): 69b0d3dfe919a6b860a9fac82de52a7e: Which won't be using HTML5 header semantics.",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:03): ef6f2287bae00ba79475fbf56c2b6fee: ?",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:03): 69b0d3dfe919a6b860a9fac82de52a7e: With real-world content that's dubious. But in any case being relevant to the header is not the same thing as the header titling the image.",
        "f139aba52f9fa1394b4034a7954b2220 (14:03): 2. The case where the image isn't the primary content of the section, but just a small part of it. e.g. &lt;section&gt;&lt;h1&gt;Foo&lt;/h1&gt;&lt;p&gt;some paragraphs...&lt;p&gt;something about this image &lt;img ...&gt;&lt;p&gt;more paragraphs&lt;/section&gt;",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:03): 69b0d3dfe919a6b860a9fac82de52a7e: Existing content won't be using HTML5 header semantics.",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:04): f139aba52f9fa1394b4034a7954b2220: when would that image ever legitimately not have alt text?",
        "f139aba52f9fa1394b4034a7954b2220 (14:04): in that case, the image should have an alt=&quot;whatever&quot; because it's a key part of the content. But there's no way to distinguish that from case #1",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:04): ef6f2287bae00ba79475fbf56c2b6fee: why not?",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:04): f139aba52f9fa1394b4034a7954b2220: oh well sure, we can't distinguish bogus alt=&quot;&quot; text from correct alt=&quot;&quot; text either",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:04): f139aba52f9fa1394b4034a7954b2220: we're talking about what's conforming here",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:04): 69b0d3dfe919a6b860a9fac82de52a7e: Because HTML5 clarifies and reinvents HTML4's ambiguous header semantics, which were close to dead-letter in the real world.",
        "f139aba52f9fa1394b4034a7954b2220 (14:05): yeah, but the conformance rules you gave above are ambiguous about it",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:05): f139aba52f9fa1394b4034a7954b2220: do you mean doc conformance or ua confomance?",
        "f139aba52f9fa1394b4034a7954b2220 (14:05): doc conformance",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:05): ef6f2287bae00ba79475fbf56c2b6fee: so? the html5 rules are based on what pages do",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:05): f139aba52f9fa1394b4034a7954b2220: i don't understand what's ambiguous",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:05): 69b0d3dfe919a6b860a9fac82de52a7e: yes but the conformance rules need to encourage content that AT can actually use, which means helping it distinguish between different scenarios.",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:06): ef6f2287bae00ba79475fbf56c2b6fee: we can never help ATs distinguish between correct and incorrect cases",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:06): of course you can.",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:06): ef6f2287bae00ba79475fbf56c2b6fee: there are plenty of images with wrong alt=&quot;&quot; text",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:06): yes, that's a particular case you'd struggle to help with",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:06): in this case, one clearly could help",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:07): ef6f2287bae00ba79475fbf56c2b6fee: there are no cases where authors wouldn't mis-use whatever indicator of conformance we came up with",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:07): er ... obviously.",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:07): well then",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:07): authors will make mistakes. with everything. and the spec can't help.",
        "f139aba52f9fa1394b4034a7954b2220 (14:07): 69b0d3dfe919a6b860a9fac82de52a7e, because your proposed conformance rules stated: &quot;we just say that if an image has no alt text, then it must have [a] heading of the section that contains the &lt;img&gt;&quot;. Both cases #1 and #2 I gave fit that condition, even though #2 isn't supposed to be a legitimate case.",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:08): guess we don't need a spec?",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:08): ef6f2287bae00ba79475fbf56c2b6fee: ??",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:08): 69b0d3dfe919a6b860a9fac82de52a7e: Saying including a feature because some authors will misuse it doesn't make any sense to me.",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:08): f139aba52f9fa1394b4034a7954b2220: the actual rule would say that the heading has to be the caption of the image or some such",
        "f139aba52f9fa1394b4034a7954b2220 (14:09): ok, that makes it less ambiguous",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:09): 69b0d3dfe919a6b860a9fac82de52a7e: You'd need to make a case that it would be misused in enough high-profile cases that a UA would be forced to ignore the feature.",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:09): ef6f2287bae00ba79475fbf56c2b6fee: you are saying that we shouldn't do what i proposed because pages that aren't conforming would fail on this case, right? but isn't that always goign to be the case?",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:09): 69b0d3dfe919a6b860a9fac82de52a7e: Not sure that is what I'm saying.",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:10): ef6f2287bae00ba79475fbf56c2b6fee: what are you saying then?",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:10): 69b0d3dfe919a6b860a9fac82de52a7e: I'm saying that additional markup would help UAs differentiate between a (assumed) common class of non-conformance and a (my guess) rarer class of non-conformance.",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:11): hmm or rather class of conformance",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:11): that is distinguish between image amongst other content which is not labelled by the heading but is missing alt (common failure)",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:12): and image amongst other content which is labelled by the heading and is missing alt (this would be easy for Flickr to implement, for example)",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:12): of course, authors might misuse _all_ the features involved.",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:13): seems to me that you would be be obtaining this distinction only by increasing the number of cases that were non-conforming in other ways",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:13): e.g. &lt;img&gt; with alt and said to be described by somehting else, or &lt;img&gt; said to be described by something that isn't there, etc",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:14): &lt;img&gt; said to be described by something that it isn't described by",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:14): I think only the last one is a substantial problem.",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:15): the middle case can be trivially caught in validation",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:15): and in practice I think the last one isn't going to have a big impact",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:15): again, this is markup that's trivial for Flickr to implement",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:15): i also don't want to introduce an attribute for this one case, and i don't want to rely on aria at this point",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:15): and that's the big use case here.",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:16): 69b0d3dfe919a6b860a9fac82de52a7e: I think trying to solve these problems without features is ambitious.",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:16): i'd rather not solve the problem at all than introduce a new attribute",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:16): attributes are expensive and this is not a case important enough to warrant that level of investment",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:17): Yes, that's not a position that makes sense to me.",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:18): In practice, UAs/AT have to try and solve these problems whether there are features for them or not.",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:18): anyway, even in the case of incorrectly-non-alt'ed images that have no title=, reading the local section title when the user navigates by image to that image isn't a big deal, it still orients the user",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:18): and that leads to non-interoperability",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:18): and we can say that there must only be one such img in that section, to catch errors of that nature",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:19): 69b0d3dfe919a6b860a9fac82de52a7e: it only orients the user if you say something like &quot;in section {Section title}&quot;",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:19): otherwise it misleads the user",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:19): right",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:20): it also sucks for extraction, since you can't easily map the section title into metadata about the image.",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:20): whereas if you knew that something was intended as a title field, you could dump it into a title field",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:21): that's not a use case i've previously been worrying about",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:21): doesn't seem like something users are going to need particularly",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:21): i mean, when i see someone save an image, they don't save any metadata with it today",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:21): why would they start?",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:21): 69b0d3dfe919a6b860a9fac82de52a7e: I give what I save titles.",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:22): it would be a nice-to-have if it were prepopulated with a sane title.",
        "f139aba52f9fa1394b4034a7954b2220 (14:22): 69b0d3dfe919a6b860a9fac82de52a7e, given this markup: &lt;section&gt;&lt;h1&gt;My Cat&lt;/h1&gt;&lt;img src=&quot;cat.jpg&quot;&gt;&lt;/section&gt;, what should a screen reader say?",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:22): whether in the filename or other metadata that could be found by beagle/spotlight etc.",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:22): 69b0d3dfe919a6b860a9fac82de52a7e: how would you get a reasonable section heading when the user supplies only bitmap data?",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:23): (Flickr Uploadr defaults to junk titles by default)",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:24): (one of the reasons why I don't use Flickr Uploadr)",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:24): ef6f2287bae00ba79475fbf56c2b6fee: we are far, far beyond &quot;nice to have&quot;s here. &quot;nice to have&quot; would be alternative text and non-blind users.",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:24): f139aba52f9fa1394b4034a7954b2220: in response to what user command?",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:24): 69b0d3dfe919a6b860a9fac82de52a7e: alternative text and non-blind users involves substantial human effort.",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:24): b8810fee2f4a71f849f3f7409546d1d9: if there is no useful data to give, there is no useful data to give.",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:24): All I'm suggesting is Flickr add an attribute.",
        "f139aba52f9fa1394b4034a7954b2220 (14:24): 69b0d3dfe919a6b860a9fac82de52a7e, I don't know the commands. I assumed in just reading the page linearly",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:25): ef6f2287bae00ba79475fbf56c2b6fee: apparently finding a solution that makes even a small number of people happy here also requires a lot of effort.",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:25): hmm. unless I'm mistaken, fixing the memory leaks in Jing and in my parser made the batch validator go *a lot* faster",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:26): f139aba52f9fa1394b4034a7954b2220: reading linearly you would get something like. &quot;Untitled page. One heading. My cat. Image.&quot; or some such.",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:26): Oh well, at least with the implementation of aria attributes, they'll be some way to explicitly associate images and titles, regardless of the conformance criteria.",
        "f139aba52f9fa1394b4034a7954b2220 (14:26): ok. So it wouldn't say the heading twice? Once when it saw the heading, and then again when it saw the image related to that heading?",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:26): I guess that's both the effect of less GC and the effect of a smaller pattern cache in Jing",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:26): f139aba52f9fa1394b4034a7954b2220: the proposal i mentioned only has relevance for when the user navigates on a per-image basis.",
        "f139aba52f9fa1394b4034a7954b2220 (14:27): ok",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:28): It might be worth taking someone taking something like WebAnywhere or Fire Vox or NVDA or Orca and hacking it  to see if making the spec's assumptions about how UAs should derive text alternatives actually work for real users. Might be useful for jgraham 's table markup variations too.",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:29): dunno if there's an easily hackable text browser.",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:30): emacs/w3 perhaps, if you like lisp.",
        "edb259c0e0038f38bb200bc20c8cbf7e (14:38): More namespace confusion: http://lists.w3.org/Archives/Public/public-html/2008Aug/0675.html",
        "edb259c0e0038f38bb200bc20c8cbf7e (14:39): Martin made really weird assumptions there...",
        "edb259c0e0038f38bb200bc20c8cbf7e (14:40): Though since he assumed I didn't get namespaces maybe they did make sense...",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:57): so my tokenizer code had a bug with document.write('&lt;/SCRIPT\\&gt; \\n');",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:58): yay  for crazy real-world test data",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:58): what was the bug?",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:59): 69b0d3dfe919a6b860a9fac82de52a7e: it returned to data state upon \\ instead of returning to whatever flattened content model flag state it came from",
        "ef6f2287bae00ba79475fbf56c2b6fee (14:59): 69b0d3dfe919a6b860a9fac82de52a7e: If an img without alt is under a heading but also has labelledby, would labelledby take priority over the heading as a label for img during non-linear navigation?",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:00): b8810fee2f4a71f849f3f7409546d1d9: fun",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:00): b8810fee2f4a71f849f3f7409546d1d9: that's a pretty funny case, i'd never thought of escaping the &gt; as a way to make the tag not an end tag :-)",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:00): ef6f2287bae00ba79475fbf56c2b6fee: i have no idea, depends on how aria is defined",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:01): ef6f2287bae00ba79475fbf56c2b6fee: right now aria is a big mess, so it's probably not defined in enough detail to determine an answer",
        "b8810fee2f4a71f849f3f7409546d1d9 (15:02): suspects that Jing still has some cache hashtable somewhere that just keeps filling up...",
        "69b0d3dfe919a6b860a9fac82de52a7e (15:17): nn",
        "ef6f2287bae00ba79475fbf56c2b6fee (15:22): night 69b0d3dfe919a6b860a9fac82de52a7e :)"
    ],
    "person_ids": [
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "f139aba52f9fa1394b4034a7954b2220",
        "ef6f2287bae00ba79475fbf56c2b6fee",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "edb259c0e0038f38bb200bc20c8cbf7e"
    ]
}