{
    "id": "ed31f2ce331ddbb515450c2e6183046e",
    "messages": [
        "88d4d34a8064a4ff39fd5e144eea7762 (20:48): Why did I think extractContents() and cloneContents() would be easy to spec after deleteContents()?  They're way more complicated.",
        "88d4d34a8064a4ff39fd5e144eea7762 (20:48): On the bright side, it's improving my understanding of ranges a lot.",
        "88d4d34a8064a4ff39fd5e144eea7762 (20:49): (Although it's sad that ranges are that hard to understand.)",
        "fd9ef1223e855714294498ebfde79f98 (20:54): just a reminder that http://www.w3.org/2002/09/wbs/40318/issue-56-objection-poll closes tomorrow",
        "171db427cee236fc04af9e5de94e7c39 (20:54): I have no idea which one I should care about.",
        "06cb330920ae58e1614c9145d983b3d6 (20:55): secret issues? heh",
        "69b0d3dfe919a6b860a9fac82de52a7e (20:55): wow, the chairs finally made a completely wrong decision",
        "69b0d3dfe919a6b860a9fac82de52a7e (20:55): wonder what i'm supposed to do now",
        "171db427cee236fc04af9e5de94e7c39 (20:55): Fork the spec, finally?",
        "fd9ef1223e855714294498ebfde79f98 (20:56): 69b0d3dfe919a6b860a9fac82de52a7e: which one? &lt;table role=presentation&gt;?",
        "69b0d3dfe919a6b860a9fac82de52a7e (20:57): the change from &quot;Tables must not be used as layout aids&quot; to &quot;Tables should not be used as layout aids&quot;",
        "06cb330920ae58e1614c9145d983b3d6 (20:58): i've never really understood that--it doesn't make sense to me for specs to say what I can use something for, only what the feature does",
        "171db427cee236fc04af9e5de94e7c39 (20:59): Sure it does.  If a feature can be fundamentally misused by an author unaware of the issues that make the misuse bad, the most useful path is to just disallow that use.",
        "171db427cee236fc04af9e5de94e7c39 (21:01): It's like disallowing people from putting important information in the content of a ::before element, except I think that CSS doesn't explicitly say MUST NOT (because we're somewhat allergic to using the word &quot;must&quot;).",
        "06cb330920ae58e1614c9145d983b3d6 (21:01): but what does it even mean, if it's not even objectively testable?",
        "06cb330920ae58e1614c9145d983b3d6 (21:02): it's fine to say &quot;if you do this, some UAs may do something you don't expect and leave you with something you didn't want&quot;, but that should be implied from the requirements placed on the UA",
        "171db427cee236fc04af9e5de94e7c39 (21:02): Authors dont' read UA requirements.  ^_^",
        "06cb330920ae58e1614c9145d983b3d6 (21:03): that's sort of the point, it's going to work, so people are going to do it",
        "06cb330920ae58e1614c9145d983b3d6 (21:04): eg. it's not something that a validator can flag for people",
        "171db427cee236fc04af9e5de94e7c39 (21:04): Not an automatic validator, no.",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:04): 69b0d3dfe919a6b860a9fac82de52a7e, if this encourages authors to put role=presentational on their presentational tables, I think it will be an excellent change.",
        "171db427cee236fc04af9e5de94e7c39 (21:04): That doesn't mean it can't be flagged manually, though.",
        "171db427cee236fc04af9e5de94e7c39 (21:05): 88d4d34a8064a4ff39fd5e144eea7762: If this encourages authors to write more pages with presentational tables rather than using current and upcoming CSS layout techniques, it will be a horrible change.",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:05): Also true.",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:05): Hard to say which is going to be the bigger effect in practice.",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:05): hasn't read the decision yet, though",
        "171db427cee236fc04af9e5de94e7c39 (21:09): One outcome only affects legacy pages (which aren't, in general, very likely to change), while the other affects pages that have not yet been created.  We usually optimize for the latter, precisely because the former are unlikely to change en masse.",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:10): I've seen a lot of templates on Wikipedia that use presentational tables.",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:10): It'd be a bloody lot easier to add role=presentational than to rewrite them to not use tables.",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:10): Particularly if they're protected, so only admins can edit them.",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:11): More generally, if some site uses presentational tables, you're a lot more likely to get it fixed to use role=presentational than to get it fixed to not use tables.",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:11): How about we say nested tables aren't conforming unless they all have role=presentational?",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:11): Or all but the innermost, say.",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:12): That would be a nice and concrete improvement, right?  You could also just say they're not conforming period, but that would get fewer sites to change.",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:14): (does saying role=presentational on a table even work, per ARIA? don't you have to set it on all the cells and rows and everything?)",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:14): If it doesn't, wouldn't that be new information?",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:15): one would assume the chairs actually checked that kind of thing before making this kind of decision",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:15): so presumably not",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:15): They only read what's submitted to them, right?",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:16): if they only read what's sumitted, then them making decisions on the spec is irresponsible",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:16): I think you're a couple years late in that judgment.",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:16): but i doubt that they limit themselves",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:16): that would be crazy",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:17): Well, you could ask.",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:19): i'm deep in video-conferencing edits right now",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:19): but when i get to applying their decision, i'm sure i will be talking to them :-)",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:19): i can't believe they just reverted 15 years of advocacy so casually",
        "06cb330920ae58e1614c9145d983b3d6 (21:21): if they're making decisions without talking to the spec editor about them first, it's a pretty hopelessly broken system, heh",
        "88d4d34a8064a4ff39fd5e144eea7762 (21:22): The spec editor has a chance to comment.",
        "06cb330920ae58e1614c9145d983b3d6 (21:23): &quot;commenting&quot; isn't the same as discussion, and from the fact that he seems borderline blindsided by this it doesn't seem like there was actual discussion, heh",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:24): i'm not blindsided, they've been due to give a decision on this for months",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:24): i'm just shocked at what they decided",
        "05403831f2661084981b8a1edbc0c736 (21:24): Does that mean that any element with role=presentational can be used for layout purposes? :)",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:24): i'm about to move the forums over from my account to a dedicated role account so zcorpan can manage them, so if they go down it's not hugely unexpected",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:24): if all goes well though it should just transition smoothly",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:26): presses the button",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:33): holy cow",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:33): i moved the forums to another user and NOTHING BROKE as far as i can tell",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:33): sweet!",
        "06cb330920ae58e1614c9145d983b3d6 (21:34): when nothing seems to break, that's when you start to get worried",
        "06cb330920ae58e1614c9145d983b3d6 (21:34): the big, obvious breaks--those are the easy ones",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:34): well i'm going offline for a few hours now, so expect the forums to catch fire momentarily! :-)",
        "69b0d3dfe919a6b860a9fac82de52a7e (21:34): bbl"
    ],
    "person_ids": [
        "88d4d34a8064a4ff39fd5e144eea7762",
        "fd9ef1223e855714294498ebfde79f98",
        "171db427cee236fc04af9e5de94e7c39",
        "06cb330920ae58e1614c9145d983b3d6",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "05403831f2661084981b8a1edbc0c736"
    ]
}