{
    "id": "ef962ad79ba438c81dcf6d0036a31b70",
    "messages": [
        "b8810fee2f4a71f849f3f7409546d1d9 (12:04): hmm. AOL not on the list at http://www.w3.org/Consortium/Member/List",
        "ab7faae5d7b250ea8606486575f8f79c (12:09): jgraham: Oh, okay",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:20): i hope the vcard output algorithm makes sense",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:20): it's not quite what i implemented in JS",
        "b8810fee2f4a71f849f3f7409546d1d9 (12:21): http://lists.w3.org/Archives/Public/www-archive/2009May/0038.html (last paragraph)",
        "ab7faae5d7b250ea8606486575f8f79c (12:24): 69b0d3dfe919a6b860a9fac82de52a7e: It seems to be defined at a very inconvenient level of abstraction - someone implementing the vCard output would have to have access to the DOM and the item-extraction algorithm, rather than it being layered on top of a generic microdata extraction algorithm",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:25): how so?",
        "ab7faae5d7b250ea8606486575f8f79c (12:29): Someone who's writing a generic microdata parsing library doesn't want to have to implement the vCard output (and iCal and BibTeX and ...) themselves, because the point is to be generic and not hard-code lots of vocabularies",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:30): sure but what's dom-dependent about it?",
        "ab7faae5d7b250ea8606486575f8f79c (12:30): and someone who's working with vCard data will want to use the generic microdata parsing library rather than rewriting everything themselves, and doesn't want to have to hook into internal details of the library (like whether the &lt;title&gt; element is going to be exposed via DOM or SAX or something else)",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:32): does the same not apply to the RDF output?",
        "ab7faae5d7b250ea8606486575f8f79c (12:32): so there should be some clearly specified API between them, e.g. using JSON as an intermediate format (and giving a single JSON-to-vCard or RDF-to-vCard or something-else-to-vCard conversion algorithm, depending on what API is chosen)",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:33): that seems excessively round-about",
        "ab7faae5d7b250ea8606486575f8f79c (12:33): 69b0d3dfe919a6b860a9fac82de52a7e: The RDF output is not vocabulary-specific, so that should go in the generic library (which can happily deal with all the issues like extracting &lt;title&gt; elements)",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:34): i guess i could just define things that such an API is required to expose",
        "ab7faae5d7b250ea8606486575f8f79c (12:35): I don't think it has to be a serialised API like JSON, but it seems useful to have some clearly specified API that can be easily implemented by the generic library and is powerful enough to let vocabulary designers do whatever they want without having to modify the generic library",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:36): which would be the list of top-level items, for each item: types, properties; for each property: names, the value, and if value is an item, or else if tag is time, or else if tag is a url element; the document's title;",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:36): (that's it so far i think)",
        "ab7faae5d7b250ea8606486575f8f79c (12:37): And the document's current address",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:37): and the json and rdf outputs would need slightly more (e.g. json output needs to be able to walk the dom to find the applicable citation)",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:37): well presumably the document's current address is input to the microdata api",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:37): not output",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:37): assuming this isn't a scripted environment",
        "ab7faae5d7b250ea8606486575f8f79c (12:38): thinks the JSON and RDF outputs are fine where they are, because they're not vocabulary-specific and so we don't have to worry about the scalability of implementing a thousand of them in the library",
        "69b0d3dfe919a6b860a9fac82de52a7e (12:53): i wonder why iCalendar isn't an official RFC2425 profile",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:01): 69b0d3dfe919a6b860a9fac82de52a7e: I also think that microdata-to-Foo conversion algorithms should operate on a microdata data model instead of escaping into the DOM on an ad hoc basis",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:05): it's not really ad hoc",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:06): assuming you're not talking about json or rdf outputs",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:06): which kinda are",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:06): what do you think of the new list at http://www.whatwg.org/specs/web-apps/current-work/#converting-html-to-other-formats",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:24): 69b0d3dfe919a6b860a9fac82de52a7e: the bulleted list lacks the node language of nodes that are itemprops",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:25): 69b0d3dfe919a6b860a9fac82de52a7e: btw, my on-list comment about 'about' and &lt;figure&gt; is likely misguided",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:26): do i ever export the node language?",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:26): you did the day before yesterday",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:26): re-reads",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:26): that's only in the RDF or JSON serialisations",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:26): which aren't covered by this",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:26): and need far more than the list says",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:26): RDF only i think, in fact",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:27): &quot;Otherwise, if element is not one of the URL property elements, let value be a plain literal, with the language information set from the language  of the element, if it is not unknown.&quot;",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:27): yes, RDF only",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:28): (i've added it to the list but commented out)",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:30): special-casing &quot;about&quot; makes me wonder if there should be a dedicated boolean attribute itemabout for flagging the aboutness node instead of having a reserved word",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:31): aside: why oh why didn't microformats.org write algorithms like this down in 2006 or so?",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:32): all of the one-word keywords are &quot;reserved words&quot;",
        "399786e331e1073cc9743bc8f906e848 (13:33): I would love microformats so much more if they'd defined parsing rules and clear data extraction algorithms",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:33): i guess &quot;about&quot; is still magical even for item=&quot;&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:33): though only for RDF",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:33): i don't want to add an attribute just to make it possible to name bnodes in the rdf serialisation, that's excessive",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:34): (it's not like most people are going to be exporting to rdf, imho)",
        "65325d50b2e25aca54bc871b89758c9c (13:34): do generic RDF tools do anything useful?",
        "65325d50b2e25aca54bc871b89758c9c (13:34): (I honestly don't know)",
        "65325d50b2e25aca54bc871b89758c9c (13:35): It does seem that in some cases people use generic RDF tools to extract information which they then process in a vocabulary-specific way",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:35): 69b0d3dfe919a6b860a9fac82de52a7e: the use case I'm thinking of is not naming bnodes (not a use case) but associating key-value pairs with an external resource to give metadata about it",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:36): &lt;img itemprop=about src=... alt=&quot;&quot;&gt; seems better than having a magical boolean attribute",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:36): the boolean attribute doesn't reduce the magic required, either",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:36): sicne you still have to do error handling for dupes, not urls, etc",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:37): 69b0d3dfe919a6b860a9fac82de52a7e: ok. I withdraw my feedback about 'about'",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:37): and if you exclude the RDF case, &quot;about&quot; isn't magic, it's just a property name common to many vocabularies",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:37): 65325d50b2e25aca54bc871b89758c9c: no idea, i've been looking for end-user RDF-consuming software without any luck for the past few days",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:38): 69b0d3dfe919a6b860a9fac82de52a7e: you should make property names that start with http://www.w3.org/1999/xhtml/custom# non-conforming",
        "65325d50b2e25aca54bc871b89758c9c (13:38): I think the kind of tool I described couldn't possibly be an end-user tool, or at least not a good one",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:38): 69b0d3dfe919a6b860a9fac82de52a7e: otherwise, there can be conforming property names that are distinct in JSON but not in RDF",
        "65325d50b2e25aca54bc871b89758c9c (13:39): because you can't make a good UI for displaying &quot;generic&quot; data",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:39): wonders what level of arcane magic he's going to have to do to output &quot;rdate&quot; properly in the iCalendar output and ponders just not supporting it in a clever way, requiring that people who use its longer forms use the iCalendar syntax directly instead of using &lt;time&gt;",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:39): b8810fee2f4a71f849f3f7409546d1d9: is that a &quot;real problem&quot; as they say?",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:39): 69b0d3dfe919a6b860a9fac82de52a7e: as real as many other conformance reqs",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:40): b8810fee2f4a71f849f3f7409546d1d9: fair enough.",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:40): 65325d50b2e25aca54bc871b89758c9c: at least not with current technology",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:40): b8810fee2f4a71f849f3f7409546d1d9: i hate having rdf-specific rules in the non-rdf part of this",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:40): b8810fee2f4a71f849f3f7409546d1d9: isn't there a better solution?",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:40): 69b0d3dfe919a6b860a9fac82de52a7e: also, an easy error to make if one tries to put a once extracted RDF graph back into HTML",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:41): 69b0d3dfe919a6b860a9fac82de52a7e: can't think of one right now",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:42): http://twitter.com/JeniT/status/1806014001",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:43): i wish we had a way for people to test how google interpreted rdfa, so that any bugs (if any) could be shaken out",
        "ab7faae5d7b250ea8606486575f8f79c (13:45): I also wish we had a specification that said what was a bug and what was correct",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:46): i'm sure shane and the rdfa community will address your comments and fix the problems you pointed out",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:46): b8810fee2f4a71f849f3f7409546d1d9: ok, banned those prefixes",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:46): 69b0d3dfe919a6b860a9fac82de52a7e: thanks",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:47): ok since i'm not doing magic for rdate, icalendar output is going to be easy",
        "ab7faae5d7b250ea8606486575f8f79c (13:52): 69b0d3dfe919a6b860a9fac82de52a7e: The comments seem unresolvable in an HTML4+RDFa specification, and nobody has shown great interest in writing an HTML5+RDFa specification, so I don't know where the comments would get addressed",
        "ab7faae5d7b250ea8606486575f8f79c (13:54): At least Shane's statement that &quot;The goal here is that all implementations extract the same collection of triples from a given document.&quot; sounds exactly like the goal of an HTML5+RDFa specification (as long as it's not restricted to valid documents, or to static documents)",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:54): well i presume he'd have to define HTML4 parsing and DOM representations",
        "ab7faae5d7b250ea8606486575f8f79c (13:55): I think that counts as &quot;unresolvable&quot; :-p",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:56): it's obviously not unresolvable since we did it for html5",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:56): and it's defined for microdata",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:56): so it seems reasonable to expect the same of other proposals",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:56): i don't see how you could achieve his stated goals, either",
        "ab7faae5d7b250ea8606486575f8f79c (13:56): s/unresolvable/practically unresolvable/",
        "69b0d3dfe919a6b860a9fac82de52a7e (13:57): it's impractical not to resolve it",
        "ab7faae5d7b250ea8606486575f8f79c (13:57): Sure",
        "ab7faae5d7b250ea8606486575f8f79c (13:58): so HTML4+RDFa is impractical",
        "ab7faae5d7b250ea8606486575f8f79c (13:58): and seems quite pointless, because all it really provides is a DTD, and you could use an XHTML DTD instead if you just want validation",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:59): ab7faae5d7b250ea8606486575f8f79c: it provides a DTD and it tells you to ignore certain output of the DTD-based validator",
        "ab7faae5d7b250ea8606486575f8f79c (14:00): But his stated goal suggests that he might be receptive to an HTML5+RDFa specification, since it's the only way to achieve his stated goals, so that suggests it could be possible to move in the right direction in the future",
        "ab7faae5d7b250ea8606486575f8f79c (14:01): s/repetition//",
        "ab7faae5d7b250ea8606486575f8f79c (14:04): (But that seems unlikely to happen unless someone familiar with HTML5 writes it, because anyone else would find it very hard to understand the HTML5 processing model in enough detail without spending ages learning it)",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:05): it would not be inappropriate for people working on core w3c technologies to learn how the web's most core language works",
        "65325d50b2e25aca54bc871b89758c9c (14:08): I'm not sure everyone agrees that HTML is the Web's most core language",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:08): most deployed language?",
        "65325d50b2e25aca54bc871b89758c9c (14:09): that seems harder to dispute :-)",
        "ab7faae5d7b250ea8606486575f8f79c (14:09): Defining an HTML processing model for RDFa is kind of diving in the deep end - it's not a nice gradual learning curve, and so people are more likely to ignore it and stick with what they're familiar with",
        "65325d50b2e25aca54bc871b89758c9c (14:09): (though people have certainly tried to claim that public deployment numbers are not representative of what you'd find if you could survey intranets)",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:14): 65325d50b2e25aca54bc871b89758c9c: imho &quot;the web&quot; doesn't include intranets.",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:15): http://www.guha.com/mcf/vocab.html",
        "65325d50b2e25aca54bc871b89758c9c (14:15): I would generally agree with that sentiment, if only for methodological reasons",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:15): 69b0d3dfe919a6b860a9fac82de52a7e: but it does include your local hard drive?",
        "65325d50b2e25aca54bc871b89758c9c (14:15): it is very easy to make unverifiable claims about the contents of intranets",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:15): no, why would it?",
        "65325d50b2e25aca54bc871b89758c9c (14:16): I do think specific claims about intranet content that are supported by evidence may be worth considering",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:16): 69b0d3dfe919a6b860a9fac82de52a7e: my memory may be failing me",
        "65325d50b2e25aca54bc871b89758c9c (14:17): even if not at the same weight as the public Web",
        "65325d50b2e25aca54bc871b89758c9c (14:17): since a controlled environment has less need for open-ended interoperability",
        "ab7faae5d7b250ea8606486575f8f79c (14:17): b8810fee2f4a71f849f3f7409546d1d9: You should use ECC memory",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:17): ab7faae5d7b250ea8606486575f8f79c: or krijnh's logs",
        "65325d50b2e25aca54bc871b89758c9c (14:17): so maybe it's just me, but Sam often seems to have more interesting things to say about what's going on in the HTML WG on his blog than in public-html",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:22): ok, icalendar output support is done",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:22): i'll do bibtex probably sunday",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:23): http://www.whatwg.org/specs/web-apps/current-work/#icalendar",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:31): nn",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:31): 69b0d3dfe919a6b860a9fac82de52a7e: my menory was failing, sorry: http://krijnhoetmer.nl/irc-logs/whatwg/20081201#l-255",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:45): http://benlog.com/articles/2009/05/14/incremental-benefit-and-bursts-of-innovation/"
    ],
    "person_ids": [
        "b8810fee2f4a71f849f3f7409546d1d9",
        "ab7faae5d7b250ea8606486575f8f79c",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "399786e331e1073cc9743bc8f906e848",
        "65325d50b2e25aca54bc871b89758c9c"
    ]
}