{
    "id": "efde66ef25f0d2ef1ca898bb0b838791",
    "messages": [
        "88d4d34a8064a4ff39fd5e144eea7762 (22:03): nodeList[nodeList.length - 1].parentNode.insertBefore(document.createElement(&quot;br&quot;), nodeList[nodeList.length - 1].nextSibling);",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:03): I hate JavaScript.  And DOM in particular.",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:04): That is a 127-character line just to insert a br after the last element of a list.",
        "8b3687499080633e1898fa1dd209ef81 (22:04): Who does that? :)",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:04): People writing JavaScript implementations for specs that have to do WYSIWYG DOM manipulations.",
        "8b3687499080633e1898fa1dd209ef81 (22:04): Pushed a couple of changed to DOM Range, btw",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:05): Like move some inline elements out of a block parent without putting them on the same line as their parents' siblings.",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:05): looks",
        "ab7faae5d7b250ea8606486575f8f79c (22:05): Write yourself some helper functions, then you won't have to worry about the verbosity any more",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:05): WebIDL stuff?",
        "8b3687499080633e1898fa1dd209ef81 (22:06): Yeah",
        "8b3687499080633e1898fa1dd209ef81 (22:06): Boring stuff",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:06): It would reduce spec verbosity too, if I defined some terms like &quot;add X as the next sibling of Y&quot;.",
        "ab7faae5d7b250ea8606486575f8f79c (22:07): Subroutines were a great invention",
        "d9550ca5a8f224a2ffa39271586dfb76 (22:09): RETURN WITHOUT GOSUB",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:10): Is anyone else deeply suspicious when they rewrite something nontrivial and it causes nothing to break and no regression test failures?",
        "8b3687499080633e1898fa1dd209ef81 (22:11): Yes",
        "d9550ca5a8f224a2ffa39271586dfb76 (22:11): everyone, I think, heh",
        "d9550ca5a8f224a2ffa39271586dfb76 (22:35): crippling history.pushState bug still happens in FF5, apparently :| time to update my workarounds...",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:45): d9550ca5a8f224a2ffa39271586dfb76: have you reported the bug?",
        "d9550ca5a8f224a2ffa39271586dfb76 (22:46): reported it in FF4, was fixed two months ago, but i guess the fix didn't make it into FF5 for some reason",
        "8b3687499080633e1898fa1dd209ef81 (22:46): The target milestone field should tell you",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:47): d9550ca5a8f224a2ffa39271586dfb76: bug #?",
        "d9550ca5a8f224a2ffa39271586dfb76 (22:47): https://bugzilla.mozilla.org/show_bug.cgi?id=640387",
        "d9550ca5a8f224a2ffa39271586dfb76 (22:48): just frustrating that a crippling bug that was fixed something like two months earlier didn't make it into the release, particularly because it's a bug I need to use browser version sniffing to work around",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:48): d9550ca5a8f224a2ffa39271586dfb76: ah. it will be in Firefox 6",
        "d9550ca5a8f224a2ffa39271586dfb76 (22:48): okay, i'll stop ranting :P",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:48): 6 weeks from now",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:50): Full releases are every six weeks now, like Chrome stable?",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:51): I thought it was going to be more like once every three months.",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:51): 88d4d34a8064a4ff39fd5e144eea7762: 4 to 5 took 3 months",
        "b8810fee2f4a71f849f3f7409546d1d9 (22:51): from now on every 6 weeks",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:51): Nice.",
        "d9550ca5a8f224a2ffa39271586dfb76 (22:51): sure feels like massive overcompensation (for the prior slow release cycle)--that seems much *too* frequent",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:51): It matches Chrome stable.",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:51): Which IMO is a good pace.",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:52): You've got to have lots and lots of testing, but if you can deploy that frequently, it's awesome.",
        "d9550ca5a8f224a2ffa39271586dfb76 (22:52): we'll see what happens, I guess",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:52): MediaWiki development was the best when we were deploying to Wikipedia every week.",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:52): It means you only have to do out-of-band updates for really really critical stuff; and when you get a bug report you can say &quot;oh, I remember what change must have caused that&quot;.",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:53): The latter is especially great, everything is still fresh in your mind when the bug reports come in.",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:53): I remember at least once when a user complained about something in #wikimedia-tech and I had a merge conflict when committing like two minutes later because another developer also immediately remembered the commit and pushed the same one-line fix right before I did.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:53): 88d4d34a8064a4ff39fd5e144eea7762: Well, unless bugs don't get found for ages.",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:54): Plus, it's much more rewarding for volunteers.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:54): 88d4d34a8064a4ff39fd5e144eea7762: Which compiler bugs, for example, tend to be like.",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:54): a11aabeeceeae6b8cb5d12ea06b56554, then you're in the same boat regardless, but you're not worse off with fast release cycles than slow ones.",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:55): strongly holds the opinion that long release cycles are a relic of pre-Internet eras when pushing out patches was impractically expensive, and that everyone in a position to autoupdate should be pushing out updates very regularly instead of big huge irregular updates",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:55): 88d4d34a8064a4ff39fd5e144eea7762: Indeed. But yeah, it does mean that you tend to find issues quicker",
        "d9550ca5a8f224a2ffa39271586dfb76 (22:55): seems like thinks would feel a little less silly if they used year-month for version numbers instead of numbers--it's going to look pretty goofy when we're on Chrome 63 and Firefox 52",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:55): Another big advantage is you keep a regular development cadence.  You don't have to go through months of feature development, then months of testing, months of bug-fixing, etc.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:55): wonders how much Fx stuff will break with sniffing at 10",
        "8b3687499080633e1898fa1dd209ef81 (22:55): Not really, because you won't see the version number",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:56): 88d4d34a8064a4ff39fd5e144eea7762: Does anyone do that? Even those who have long-cycles?",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:56): You also don't have to maintain multiple versions for long.",
        "8b3687499080633e1898fa1dd209ef81 (22:56): a11aabeeceeae6b8cb5d12ea06b56554, IE, maybe? :)",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:56): a11aabeeceeae6b8cb5d12ea06b56554, I have no idea.  I'm sure it's not that extreme in most cases, but you tend to have code freezes, at least.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:57): 8b3687499080633e1898fa1dd209ef81: As far as I can tell they do testing and bug-fixing all at once.",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:57): You must get bug reports on an irregular cadence if you wait a long time before releasing betas, no?",
        "d9550ca5a8f224a2ffa39271586dfb76 (22:57): a11aabeeceeae6b8cb5d12ea06b56554: are we going to end up with yet another wart in our U-A's: &quot;Firefox/9.0 Firefoxier/10&quot;, heh",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:57): 88d4d34a8064a4ff39fd5e144eea7762: I dunno.",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:58): Browsers other than IE and Safari have always had a release schedule of multiple non-bugfix releases per year, though.  Lots of major software packages are only updated once every few years.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (22:59): Well, if you ignore Opera 10, for example",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:59): But this push for more rapid development is totally awesome, by the way.  It's symptomatic of the pace at which browser development is going right now: if you don't release often, you'll be significantly worse on average than your frequently-releasing competitors.",
        "88d4d34a8064a4ff39fd5e144eea7762 (22:59): It's a sign of intense competition.  Yay standards!",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:01): Gah, I really ought to write a blog post on Presto version numbering nowadays.",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:01): tl;dr version: everything but the third number in it is effectively meaningless to web developers",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:01): (except really really really really occasionally when the second number has meaning)",
        "88d4d34a8064a4ff39fd5e144eea7762 (23:01): Did Gecko's version number jump to match Firefox's, by the way?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:02): (And the Wikipedia article makes claims about what the stable/preview releases of Presto are, which seems hard to do given Presto is a purely internal project.)",
        "8b3687499080633e1898fa1dd209ef81 (23:04): Yes",
        "a11aabeeceeae6b8cb5d12ea06b56554 (23:04): (It basically goes by what the stable/preview versions of one product use)",
        "8b3687499080633e1898fa1dd209ef81 (23:04): And Thunderbird is jumping as well"
    ],
    "person_ids": [
        "88d4d34a8064a4ff39fd5e144eea7762",
        "8b3687499080633e1898fa1dd209ef81",
        "ab7faae5d7b250ea8606486575f8f79c",
        "d9550ca5a8f224a2ffa39271586dfb76",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "a11aabeeceeae6b8cb5d12ea06b56554"
    ]
}