{
    "id": "f0966eb5099360d64674457472d14863",
    "messages": [
        "f1259a9f9150e84e5c67c9e8f44cc1d2 (03:42): I have not been able to follow the html-wg for some time. I have been reviewing the Maciej 'Proposal for Keyboard Shortcuts' and the Aaron 'ARIA in HTML threads.' Please comment on my take - &lt;command&gt; shortcuts would be used on 'plain' HTML pages, ie. the author does not use Javascript and ARIA would require the use of Javascript. Does ARIA provide any more functionality?",
        "139513027e8e90b5582cbc68fc733884 (03:43): ARIA is not a mechanism for keyboard shortcuts",
        "139513027e8e90b5582cbc68fc733884 (03:43): the two are orthogonal",
        "139513027e8e90b5582cbc68fc733884 (03:43): some people think certain roles should be assigned a default keyboard shortcut",
        "139513027e8e90b5582cbc68fc733884 (03:44): but I don't think there are any existing ARIA roles that would correspond to the semantics of a specific command",
        "7e2617a66594d8932013a5022b280c45 (03:44): yeah you have to implement key nav with script",
        "7e2617a66594d8932013a5022b280c45 (03:45): that makes it possible to have it be key navigable with IE as well anyway, which doesn't have ARIA support",
        "7e2617a66594d8932013a5022b280c45 (03:45): and on Opera which is just starting to have ARIA support",
        "7e2617a66594d8932013a5022b280c45 (03:45): hi 139513027e8e90b5582cbc68fc733884",
        "7e2617a66594d8932013a5022b280c45 (03:46): i guess the 2 are complimentary, for good web 2.0 accesssibility you need both key nav and  aria",
        "139513027e8e90b5582cbc68fc733884 (03:46): I'm not sure what you mean by &quot;implement key nav with script&quot;",
        "139513027e8e90b5582cbc68fc733884 (03:47): my proposal is for keyboard shortcuts for commands (like things you would find in the menu bar for a native app), not for keyboard navigation of controls (like with tab / shift-tab)",
        "139513027e8e90b5582cbc68fc733884 (03:48): I don't see how ARIA is at all related to this",
        "7e2617a66594d8932013a5022b280c45 (03:48): right, sorry, i'm talking about complex container controls",
        "139513027e8e90b5582cbc68fc733884 (03:48): there are no ARIA roles for &quot;Bold&quot; or &quot;Reply&quot; or &quot;New Document&quot;",
        "7e2617a66594d8932013a5022b280c45 (03:48): ARIA talks about using tabindex to enable complex navigation as found in tree controls and grids etc.",
        "7e2617a66594d8932013a5022b280c45 (03:48): you might want to be able to arrow through those menus as well",
        "f1259a9f9150e84e5c67c9e8f44cc1d2 (03:48): http://developer.mozilla.org/en/docs/ARIA:_Accessible_Rich_Internet_Applications/Relationship_to_HTML_FAQ#What_is_ARIA_and_how_does_it_allow_for_accessible_JavaScript_widgets.3F section What is ARIA and how does it allow for accessible JavaScript widgets? speaks of keyboard navigation. But this is different, evidently, than the extent Maciej envisions shortcuts to reach.",
        "7e2617a66594d8932013a5022b280c45 (03:49): f1259a9f9150e84e5c67c9e8f44cc1d2: if you want to know what aria is read http://developer.mozilla.org/en/docs/ARIA:_Accessible_Rich_Internet_Applications/Relationship_to_HTML_FAQ",
        "139513027e8e90b5582cbc68fc733884 (03:49): I'm talking about special key combinations for specific commands",
        "139513027e8e90b5582cbc68fc733884 (03:49): like when you hit Control-S in Microsoft Word on Windows and it saves the document",
        "139513027e8e90b5582cbc68fc733884 (03:49): that's a keyboard shortcut",
        "139513027e8e90b5582cbc68fc733884 (03:49): hitting tab to go to the next field is keyboard navigation",
        "7e2617a66594d8932013a5022b280c45 (03:49): you're right",
        "7e2617a66594d8932013a5022b280c45 (03:50): jus tired,",
        "7e2617a66594d8932013a5022b280c45 (03:50): i saw the word keyboard",
        "f1259a9f9150e84e5c67c9e8f44cc1d2 (03:50): I quoted from the FAQ.",
        "7e2617a66594d8932013a5022b280c45 (03:50): f1259a9f9150e84e5c67c9e8f44cc1d2:  i see",
        "139513027e8e90b5582cbc68fc733884 (03:50): 7e2617a66594d8932013a5022b280c45: I'm not trying to pick on you, I just want to clarify for f1259a9f9150e84e5c67c9e8f44cc1d2",
        "7e2617a66594d8932013a5022b280c45 (03:50): np",
        "f1259a9f9150e84e5c67c9e8f44cc1d2 (03:51): Thanks for the clarification - I was tending toward that.",
        "7e2617a66594d8932013a5022b280c45 (03:51): yes right now if you want keyboard shortcuts you have to hack it with an onkeydown listener on &lt;body&gt; or something",
        "7e2617a66594d8932013a5022b280c45 (03:51): onkeypress doesn't work the same in IE as others, so onkeydown works better i've found",
        "7e2617a66594d8932013a5022b280c45 (03:52): IE doesn't fire onkeypress for everything you'd think it should",
        "139513027e8e90b5582cbc68fc733884 (03:52): key events are an area where interoperability is lacking",
        "139513027e8e90b5582cbc68fc733884 (03:52): and sadly the relevant DOM specs do not cover them at all",
        "139513027e8e90b5582cbc68fc733884 (03:53): browsers also differ on whether you are allowed to see the key events for key combinations that are built-in browser shortcuts, and whether you can prevent the default action on them",
        "7e2617a66594d8932013a5022b280c45 (03:54): i had to do a ton of work on all aspects of keyboard stuff in mozilla",
        "7e2617a66594d8932013a5022b280c45 (03:54): it was a real pain",
        "7e2617a66594d8932013a5022b280c45 (03:54): i inherited a mess and tried to clean it up some, but it's still nasty",
        "7e2617a66594d8932013a5022b280c45 (03:55): there are so many details to it",
        "139513027e8e90b5582cbc68fc733884 (03:55): indeed",
        "7e2617a66594d8932013a5022b280c45 (03:55): and no one ever wants to work on it",
        "139513027e8e90b5582cbc68fc733884 (03:57): we have someone who likes fixing keyboard stuff",
        "139513027e8e90b5582cbc68fc733884 (03:58): but the lack of consistency between browsers and lack of formal spec make it painful",
        "7e2617a66594d8932013a5022b280c45 (03:58): yes",
        "f1259a9f9150e84e5c67c9e8f44cc1d2 (04:00): Observing the HTML5 communications at least showed me that my troubles in understanding some HTML4 weren't just me. And I appreciate more the UA developer's. And I also wonder how some of this 'basic' stuff was left alone in specifications? Oh, well, water over the ..."
    ],
    "person_ids": [
        "f1259a9f9150e84e5c67c9e8f44cc1d2",
        "139513027e8e90b5582cbc68fc733884",
        "7e2617a66594d8932013a5022b280c45"
    ]
}