{
    "id": "f14a9360bc0d95eb00343e3718cd4dd9",
    "messages": [
        "69b0d3dfe919a6b860a9fac82de52a7e (00:26): btw Lachy if you can suggest some page-only heuristics (i.e. not involving the network) for detecting bogus longdesc=&quot;&quot;s that would have caught them in the URLs i mentioned, it would be useful",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:26): i'd be able to rerun the study excluding those",
        "65325d50b2e25aca54bc871b89758c9c (00:41): I looked at a few of those and they generally didn't look detectable from the page context alone",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:44): yeah that was my conclusion too",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:45): so i haven't yet looked at the headers=&quot;&quot; stuff in detail",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:45): but i wonder",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:46): if i look at it, and find that imho we shouldn't include headers=&quot;&quot; (which could be the case, just like it could be the case that we _should_ include it)",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:46): will the situation become worse or better?",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:46): in other words, is it better for the working group for me to address the issue at its proper time, or should i prioritise it given that the risk of that is that the attribute does in fact not get kept?",
        "65325d50b2e25aca54bc871b89758c9c (00:50): whether it has a positive effect on attitudes depends on the outcome",
        "b25b6b77a0087ff8385941e5545d32ea (00:50): 69b0d3dfe919a6b860a9fac82de52a7e: The problem is that we are unlikely to ever reach consensus on a spec that does not include headers irrespective of its technical merit",
        "65325d50b2e25aca54bc871b89758c9c (00:50): doing enough work to predict the outcome but not actually make any changes would not really be acting in good faith though, I think",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:51): b25b6b77a0087ff8385941e5545d32ea: we'll never reach consensus on the spec anyway",
        "b25b6b77a0087ff8385941e5545d32ea (00:51): 69b0d3dfe919a6b860a9fac82de52a7e: Fair point.",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:51): 65325d50b2e25aca54bc871b89758c9c: yeah i wouldn't do that",
        "65325d50b2e25aca54bc871b89758c9c (00:51): I think there is a sense from some quarters that any feature that is nominally &quot;for accessibility&quot; is absolutely needed, regardless of whether it does anything to help accessibility in practice",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:51): right",
        "65325d50b2e25aca54bc871b89758c9c (00:52): and that even trying to study the question of whether it helps accessibility in practice is somehow illegitimate",
        "65325d50b2e25aca54bc871b89758c9c (00:53): notwithstanding what I think of specific features, it is hard to make a good spec when there are sacred cows that may not be examined critically, so I don't know how much we can accomodate that point of view",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:53): i'm not considering any cows sacred",
        "1e4ee64444841994c72c2d5293d9734b (00:53): I would suggest that if headers got some kind of priority and a determination made, even if the determination was &quot;keep it&quot;, there would just be a move to argue the next accessibilty issue in dispute immediately.  I would not make it a special priority just to give those evangelizing for it a more immediate answer.",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:54): i'm not really concerned about appeasing people, i want to make the spec the best html spec possible, including addressing the goal of making documents that use the language universally accessible.",
        "65325d50b2e25aca54bc871b89758c9c (00:54): I know you don't - I'm just saying it's hard to collaborate with someone who does have sacred cows, even if you happen to agree with them on one point",
        "b25b6b77a0087ff8385941e5545d32ea (00:54): But it makes everyone's life miserable when some people consider cows to be sacred and they are taken to slaughter (so to speak)",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:54): 65325d50b2e25aca54bc871b89758c9c: yeah",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:55): 1e4ee64444841994c72c2d5293d9734b: yeah. so that argues for just treating it like any other issue, and going with the FIFO principle, right?",
        "1e4ee64444841994c72c2d5293d9734b (00:55): That would be my take on it, yes.",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:55): i think that's probably the best course of action",
        "1e4ee64444841994c72c2d5293d9734b (00:55): And for parsing logs later to write emails, I say that as a person with a general accessibility interest/focus/etc.",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:55): i expect Dan to start telling me to prioritise public-html wg feedback over existing whatwg feedback though.",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:56): he seems to have interpreted my &quot;a few months&quot; as &quot;3 or so months&quot; not &quot;20 or so months&quot; which is probably closer to realistic.",
        "65325d50b2e25aca54bc871b89758c9c (00:56): I do think Chaals made a good point that accessibility features might deserve special status even if only a subset of especially accessible sites use them (properly), since those might be the only sites that someone with a given disability can use at all",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:56): not sure what to do about that if he does ask me to do so",
        "65325d50b2e25aca54bc871b89758c9c (00:56): but I don't know if the evidence bears that out as a justification for headers=&quot;&quot; or the like",
        "b25b6b77a0087ff8385941e5545d32ea (00:57): 69b0d3dfe919a6b860a9fac82de52a7e: Two stacks, one issue from the top of each in turn?",
        "65325d50b2e25aca54bc871b89758c9c (00:57): it would require examples of actual particularly accessible sites that consistently use it in a way that is beneficial",
        "65325d50b2e25aca54bc871b89758c9c (00:57): not just a theory that there might be some",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:57): 65325d50b2e25aca54bc871b89758c9c: well, there are two things, right, there's the features that are rarely used but when used make the page better, and there are the features that are very widely misused to the point where they actively hurt the user's experience on most sites",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:58): longdesc clearly falls into the latter category according to all the studies i've done or seen",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:58): as in, exposing longdesc will mostly expose the user to spam or useless content, even on supposedly accessibility-aware pages",
        "cc097e0d7183ae8436e7df709553c8c0 (00:59): would think that the way tabindex is implemented, it actively hurts the user experience too. treating all positive numbers as 0 for tabindex would, i think, have better user experience",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:00): that's possible too, i haven't even looked at tabindex yet other than adding the negative thing",
        "cc097e0d7183ae8436e7df709553c8c0 (01:01): yep. :) i just suddenly came to think of tabindex when reading the above",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:01): one thing i really don't know how to fix is accesskey=&quot;&quot;",
        "cc097e0d7183ae8436e7df709553c8c0 (01:02): dunno either",
        "b25b6b77a0087ff8385941e5545d32ea (01:02): That isn't going to be fun.",
        "cc097e0d7183ae8436e7df709553c8c0 (01:02): although opera's implementation is somewhat useful, or at least not harming the user experience",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:03): opera's implementation is unintuitive",
        "b25b6b77a0087ff8385941e5545d32ea (01:03): From what I remember Mike Smith saying it sounds like different solutions are appropriate on different devices",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:03): and doesn't actually solve the problem of how  to make it device independent",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:03): yeah",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:03): maybe it really is a stylistic thing",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:03): we do have key-equivalent in CSS iirc",
        "ab7faae5d7b250ea8606486575f8f79c (01:04): 69b0d3dfe919a6b860a9fac82de52a7e: I would assume users wouldn't see the spam or useless content since they wouldn't be explicitly asking their tool to give them the longdesc, except in the cases where they have a good expectation that it's going to be useful, so misuse wouldn't hurt the user much",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:04): ab7faae5d7b250ea8606486575f8f79c: really? how would they know to ask?",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:05): for longdesc it really seems to me that the only cases i've seen where the longdesc was actually useful and wasn't something you could have just stuffed into alt=&quot;&quot;, it was actually useful to sighted users too",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:05): and could have just been included on the page or in a link from the page",
        "ab7faae5d7b250ea8606486575f8f79c (01:05): I'd assume the tool would indicate in some quick way that there is a longdesc attached to the image, similarly to how it must quickly indicate wherever there is a link",
        "ab7faae5d7b250ea8606486575f8f79c (01:06): but I have precisely no experience of how relevant tools work in practice",
        "cc097e0d7183ae8436e7df709553c8c0 (01:06): jaws says &quot;press enter for long description&quot; after reading the image alt, and if you press enter it will open the url in a new window",
        "cc097e0d7183ae8436e7df709553c8c0 (01:06): iirc",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:06): right but how do you know it's appropriate?",
        "ab7faae5d7b250ea8606486575f8f79c (01:07): (At least from what I've heard about table headers, they're not read out by default - you press some key when you've got the right cell selected, and if you see one cell has rubbish headers then you won't bother checking every single other cell - so the harm caused by misuse is similarly minimised)",
        "ab7faae5d7b250ea8606486575f8f79c (01:09): 69b0d3dfe919a6b860a9fac82de52a7e: By considering the context, like whether other images on the page have useful longdescs - e.g. you'd know it's worthwhile reading all the longdescs in the CSS spec after you've seen the first few",
        "ab7faae5d7b250ea8606486575f8f79c (01:10): (and on sites which misuse it, you'd quickly realise you should just ignore all the rest)",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:10): that doesn't seem like the optimal user experience",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:10): it's like reminding the user continually that the page wasn't designed for them but there's this secondary set of content they can access",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:11): seems like it would make one bitter",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:12): tries to build up a list of requirements for offline web apps",
        "ab7faae5d7b250ea8606486575f8f79c (01:14): It seems a less significant negative point than with e.g. &lt;input usemap&gt; (where if your browser supports it, there are features of some sites that just don't work at all) - it might waste a bit of time to read out useless longdescs, but it's not preventing the user from using the site",
        "ab7faae5d7b250ea8606486575f8f79c (01:16): A closer-to-optimal user experience would be good, though I don't have any ideas for that :-)",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:16): yeah the main argument for me against longdesc is that it's not useful at all, except in rare cases where frankly sighted users would benefit too, and therefore you're better off putting the content on the page itself",
        "65325d50b2e25aca54bc871b89758c9c (01:16): 69b0d3dfe919a6b860a9fac82de52a7e: one thing that might work is to limit the number of access keys and make it a set that UAs can map in a natural way on each platform to something w/ no conflicts",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:16): it's hard to say since i've seen so few useful uses of it",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:16): 65325d50b2e25aca54bc871b89758c9c: yeah that's been suggested",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:16): 65325d50b2e25aca54bc871b89758c9c: but then the UI becomes unclear",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:17): 65325d50b2e25aca54bc871b89758c9c: i.e. discoverability drops through the floor",
        "6905646aa63b96d6bdfbd256603fa58e (01:20): 69b0d3dfe919a6b860a9fac82de52a7e: having CSS-useable hooks could help with styleability",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:20): yeah",
        "6905646aa63b96d6bdfbd256603fa58e (01:20): s/styleability/discoverability/",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:21): like  ...:after { content: ' (' copy-key ')'; }",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:21): ... { key-equivalent: copy-key; }",
        "6905646aa63b96d6bdfbd256603fa58e (01:21): yeah",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:21): or    ... { key-equivalent: copy-key; } ...::after { content: ' (' key-equivalent ')'; }",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:21): ...to have resilience against the cascade",
        "6905646aa63b96d6bdfbd256603fa58e (01:21): ....:access-key('n'):after { content: 'meta-key N'}",
        "6905646aa63b96d6bdfbd256603fa58e (01:22): yeah",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:22): i was thinking of also having 65325d50b2e25aca54bc871b89758c9c's idea since that solves the device problem too",
        "ab7faae5d7b250ea8606486575f8f79c (01:22): Subtitles on TV shows would benefit sighted users too (e.g. when they get distracted and miss a couple of words, or can't understand someone's accent), but usually they aren't displayed along with the content since they're ugly and distracting and not sufficiently useful to be shown to all users; people may have similar reasons for not wanting to put image descriptions in the normal page content, and hiding it being [D] links or londesc",
        "6905646aa63b96d6bdfbd256603fa58e (01:23): 69b0d3dfe919a6b860a9fac82de52a7e: is om's idea of having a limited set?",
        "ab7faae5d7b250ea8606486575f8f79c (01:23): s/being/behind/",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:23): yeah but subtitles aren't only accessible to blind users or hidden behind long properties pages, they're one-button accessible",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:23): like an &lt;a&gt; link would be",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:23): 6905646aa63b96d6bdfbd256603fa58e: yeah see above",
        "ab7faae5d7b250ea8606486575f8f79c (01:24): That just seems like a browser UI issue",
        "6905646aa63b96d6bdfbd256603fa58e (01:24): yeah, me wishes browsers couldn't remap stuff that the browser already handles",
        "6905646aa63b96d6bdfbd256603fa58e (01:24): or allow me to re-remap it",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:24): ab7faae5d7b250ea8606486575f8f79c: i don't think we should hide longdesc behind a context menu or something. i'm saying the link should be right there in the content just like for everything else.",
        "ab7faae5d7b250ea8606486575f8f79c (01:27): That sounds like D-links - I think the only argument I've heard against them is they don't look very nice (but there are quite possibly other arguments I haven't heard)",
        "65325d50b2e25aca54bc871b89758c9c (01:27): 69b0d3dfe919a6b860a9fac82de52a7e: if the set was 0-9 for instance, it could be unmodified 0-9 on phones with a keypad, Cmd-0 - Cmd-9 on Macs, Ctrl-0 - Ctrl-9 on windows, etc",
        "65325d50b2e25aca54bc871b89758c9c (01:27): (assuming those are actually free)",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:28): ab7faae5d7b250ea8606486575f8f79c: yeah, though i wouldn't use [D].",
        "65325d50b2e25aca54bc871b89758c9c (01:28): but I'm not sure how you address discoverability",
        "ab7faae5d7b250ea8606486575f8f79c (01:28): (http://www.w3.org/TR/WCAG10-HTML-TECHS/#long-descriptions says &quot;Invisible d-links thus provide a (temporary) solution for designers who wish to avoid visible d-links for stylistic reasons.&quot;)",
        "65325d50b2e25aca54bc871b89758c9c (01:28): I think the page has to provide info about shortcuts",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:28): 65325d50b2e25aca54bc871b89758c9c: i think 6905646aa63b96d6bdfbd256603fa58e's idea helps with that",
        "1e4ee64444841994c72c2d5293d9734b (01:28): I think there's some kind of study that says numeric shortcuts aren't really free, though.",
        "65325d50b2e25aca54bc871b89758c9c (01:28): that's how keyboard shortcuts work in native apps",
        "65325d50b2e25aca54bc871b89758c9c (01:28): they are listed in the menu bar",
        "65325d50b2e25aca54bc871b89758c9c (01:29): having a shortcut list with labels somewhere in the page or accessible from the chrome would be the natural analogy",
        "65325d50b2e25aca54bc871b89758c9c (01:29): I'm not sure if styling them to mention they key helps",
        "6905646aa63b96d6bdfbd256603fa58e (01:29): yeah, having it in the chrome seems reasonable",
        "65325d50b2e25aca54bc871b89758c9c (01:29): thee UA could do a better job if it is the only thing that knows the concrete key mapping, but you need a label to go next to the shortcut",
        "65325d50b2e25aca54bc871b89758c9c (01:30): *the UA",
        "65325d50b2e25aca54bc871b89758c9c (01:30): it could even be a menu or submenu in the menu bar",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:30): hm yeah, for &lt;command&gt;s and other Command elements you could just have the UA create a menu somewhere with the key equivs",
        "65325d50b2e25aca54bc871b89758c9c (01:30): &quot;Page Shorcuts&quot;",
        "6905646aa63b96d6bdfbd256603fa58e (01:30): it'd be nice in interactive browsers if you could could style the access-key elements with the modifier key is pressed",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:30): they could do that now with :active",
        "65325d50b2e25aca54bc871b89758c9c (01:31): 6905646aa63b96d6bdfbd256603fa58e: if the modifier is a commonly used one on the OS, that could be distracting",
        "6905646aa63b96d6bdfbd256603fa58e (01:31): 65325d50b2e25aca54bc871b89758c9c: indeed it could",
        "65325d50b2e25aca54bc871b89758c9c (01:31): something based on &lt;command&gt; seems like a good basic approach",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:31): oh i misread what 6905646aa63b96d6bdfbd256603fa58e said",
        "65325d50b2e25aca54bc871b89758c9c (01:31): the idea is that a shorcut key actually activates a command, for which there might also be one or more UI elements",
        "6905646aa63b96d6bdfbd256603fa58e (01:31): there are some places, like dialogue windows in os x, where this is done already",
        "65325d50b2e25aca54bc871b89758c9c (01:32): it makes more sense to associate it with a command, which can then have an appropriate label",
        "65325d50b2e25aca54bc871b89758c9c (01:32): 6905646aa63b96d6bdfbd256603fa58e: example?",
        "65325d50b2e25aca54bc871b89758c9c (01:32): (I don't know of dialog windows that have keyboard shortcuts beyond the standard tab/enter/esc and such)",
        "6905646aa63b96d6bdfbd256603fa58e (01:33): I remember something adding &quot;cmd-foo&quot; in a button when cmd is pressed down",
        "6905646aa63b96d6bdfbd256603fa58e (01:33): I'm not sure where that is",
        "65325d50b2e25aca54bc871b89758c9c (01:33): I don't think that is standard",
        "6905646aa63b96d6bdfbd256603fa58e (01:33): it's not",
        "6905646aa63b96d6bdfbd256603fa58e (01:33): I'm just seeing that I've seen it done before and I helped with discoverability",
        "65325d50b2e25aca54bc871b89758c9c (01:36): usually in OS X all the keyboard shorcuts also have a menu item, so you can look in the menu system to see the shortcuts",
        "6905646aa63b96d6bdfbd256603fa58e (01:39): 65325d50b2e25aca54bc871b89758c9c: true",
        "65325d50b2e25aca54bc871b89758c9c (01:41): Windows is different since it uses the underline system sometimes, and that may apply both to menus and items in a dialog"
    ],
    "person_ids": [
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "65325d50b2e25aca54bc871b89758c9c",
        "b25b6b77a0087ff8385941e5545d32ea",
        "1e4ee64444841994c72c2d5293d9734b",
        "cc097e0d7183ae8436e7df709553c8c0",
        "ab7faae5d7b250ea8606486575f8f79c",
        "6905646aa63b96d6bdfbd256603fa58e"
    ]
}