{
    "id": "f75ce9ba961ef6b1cda383921d1f29da",
    "messages": [
        "69b0d3dfe919a6b860a9fac82de52a7e (09:40): http://lists.w3.org/Archives/Public/public-html/2010May/0095.html",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:41): &quot;Once you've done all that, you are going to be looking at something very similar to TTML&quot; seems to not have turned out to be true",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:41): (websrt does all but 1 of his bullet points, if i'm not mistaken)",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:42): (actually 2, but the second is something we could add pretty easily)",
        "1e10d84b3917ae58049be95b0071cf7f (09:51): a9b326df4e6da61c5b6f5e1058be83a2, 69b0d3dfe919a6b860a9fac82de52a7e: re: mark element, is my use of it to wrap section permalinks when the user hovers over section titles in http://oli.jp/2009/html5-faq/ incorrect? Lachy thought I was stretching the meaning too much, I‚Äôm on the fence. 2nd opinion?",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:52): i don't understand why &lt;mark&gt; would even remotely be appropriate there, but maybe i'm lacking imagination... what argument would you use to defend it? :-)",
        "8b7a8196348038c107614af0b08f2d21 (09:53): 69b0d3dfe919a6b860a9fac82de52a7e: do you have a couple minutes to talk about URL parsing?",
        "1e10d84b3917ae58049be95b0071cf7f (09:53): har! it‚Äôs text that isn‚Äôt important, is highlighted for reference purposes, and is only relevant when you want a chapter permalink to copy",
        "816e4ece7c83a8a77ea9d52f8156a5ce (09:53): 1e10d84b3917ae58049be95b0071cf7f: Nice page, but using mark is like use styled paragraphs instead of headlines :)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (09:54): 1e10d84b3917ae58049be95b0071cf7f: I'm not much help here -- I don't know what the use cases are for mark other than the one of highlighting words in a page that are search terms you used when looking for that page",
        "1e10d84b3917ae58049be95b0071cf7f (09:54): Lachy suggested it should be informationally relevant, not relevant to current action",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:54): 8b7a8196348038c107614af0b08f2d21: sure",
        "8b7a8196348038c107614af0b08f2d21 (09:54): i was thinking about getting started on it",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:55): 1e10d84b3917ae58049be95b0071cf7f: &quot;highlighted for reference purposes&quot; seems a bit of a stretch since your default style is to hide it :-)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (09:55): 1e10d84b3917ae58049be95b0071cf7f: so I guess I thought the general purpose of mark is to bring the user's attention to some particularly relevant text that they would otherwise have to look for manually",
        "8b7a8196348038c107614af0b08f2d21 (09:55): now that the parser work is winding down, i should get back to URL stuff",
        "8b7a8196348038c107614af0b08f2d21 (09:55): 69b0d3dfe919a6b860a9fac82de52a7e: you mentioned you had strong feelings about how the spec should be structured",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:55): 8b7a8196348038c107614af0b08f2d21: yeah",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:56): we have several options here",
        "a9b326df4e6da61c5b6f5e1058be83a2 (09:56): 1e10d84b3917ae58049be95b0071cf7f: so I guess using it to highlight permalink markers kinda seems like overkill to me",
        "1e10d84b3917ae58049be95b0071cf7f (09:56): 69b0d3dfe919a6b860a9fac82de52a7e: well, it‚Äôs highlighted for reference when the action of getting the permalink is relevant :)",
        "1e10d84b3917ae58049be95b0071cf7f (09:56): ok, seems I was a little too creative in reading the spec. thanks :)",
        "ad7340c0d2664b131f969961d78c86b2 (09:56): that reminds me.. I need to setup that daily cron job on my server to push the latest spec revisions to that github mirror",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:57): 8b7a8196348038c107614af0b08f2d21: that is, several somewhat orthogonal axes. Rely on or be completely independent from the IRI/URI specs; and define things declaratively or imperatively, being two main ones.",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:57): 8b7a8196348038c107614af0b08f2d21: i think we're best off doing an independent imperative-style spec for this.",
        "8b7a8196348038c107614af0b08f2d21 (09:57): you don't think we'll run into less trouble later if we output something that the URI spec can parse?",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:57): 8b7a8196348038c107614af0b08f2d21: maybe with a (normative) appendix that defines the semantics in terms of an IRI",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:57): 8b7a8196348038c107614af0b08f2d21: the uri spec doesn't define parsing",
        "8b7a8196348038c107614af0b08f2d21 (09:58): oh, i thought there was a regular expression in the appendix that did the parsing",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:58): 8b7a8196348038c107614af0b08f2d21: but assuming you mean something the uri spec thinks is valid, then no, because the whole problem is that there are invalid uris we need to handle that have no valid mapping.",
        "8b7a8196348038c107614af0b08f2d21 (09:58): i see",
        "1e10d84b3917ae58049be95b0071cf7f (09:58): 816e4ece7c83a8a77ea9d52f8156a5ce: btw I‚Äôm not sure I understand your metaphor ‚Äî do you mean this usage (in which case what is the equivalent of headlines) or any use of mark?",
        "8b7a8196348038c107614af0b08f2d21 (09:58): one annoying thing is that the parsing depends on whether the UA understands a given scheme",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:59): 8b7a8196348038c107614af0b08f2d21: i basically see no value in defining things the way the spec used to have it, or the way [webaddresses] had it, where the implementor has to do some work to pass the string to some other function to do more work",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:59): 8b7a8196348038c107614af0b08f2d21: i think we're better off just defining the parsing once and being done with it",
        "8b7a8196348038c107614af0b08f2d21 (09:59): ok",
        "69b0d3dfe919a6b860a9fac82de52a7e (09:59): 8b7a8196348038c107614af0b08f2d21: (we can mostly defer to iri/uri for validity definitions, though)",
        "8b7a8196348038c107614af0b08f2d21 (09:59): we're going to run into trouble later on, but we can deal with that then",
        "1e10d84b3917ae58049be95b0071cf7f (09:59): a9b326df4e6da61c5b6f5e1058be83a2: btw, sorry not to catch up this week ‚Äî it became 3 days of meetings. also can you put a flowchart aside for Daniel? Also Kyle has a little something for you to read too",
        "8b7a8196348038c107614af0b08f2d21 (10:00): there are two mostly independent algorithms:",
        "8b7a8196348038c107614af0b08f2d21 (10:00): parsing",
        "8b7a8196348038c107614af0b08f2d21 (10:00): cannonicalization",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:00): 8b7a8196348038c107614af0b08f2d21: re the annoying thing, i think our best bet is to have hard-coded definitions of the special behaviour for the important schemes, and require generic handling of all the remaining schemes",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:00): 8b7a8196348038c107614af0b08f2d21: there are three, i think - parsing, resolving, and canonicalisation/serialisation",
        "8b7a8196348038c107614af0b08f2d21 (10:00): ok, that includes default ports and whether the scheme uses the authority-style",
        "8b7a8196348038c107614af0b08f2d21 (10:00): oh, yeah resolving",
        "8b7a8196348038c107614af0b08f2d21 (10:01): i haven't gotten to that one",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:01): the &quot;authority-style&quot; thing is mostly gone in the more recent specs, iirc",
        "b25b6b77a0087ff8385941e5545d32ea (10:01): forms the URL-spec cheerleaders club to motivate our heroic editor and entertain the crowds",
        "8b7a8196348038c107614af0b08f2d21 (10:01): well, foo:bar",
        "8b7a8196348038c107614af0b08f2d21 (10:01): becomes foo://bar",
        "8b7a8196348038c107614af0b08f2d21 (10:01): if foo is a &quot;standard URL scheme&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:01): yeah iirc the new uri specs have something generic to say about that, i forget what exactly",
        "8b7a8196348038c107614af0b08f2d21 (10:01): in GURL parlance",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:01): anyway",
        "8b7a8196348038c107614af0b08f2d21 (10:01): but yeah",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:02): my point is i think we can draw a line in the sand and make it Just Work in the future for future schemes, at least for unknown ones",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:02): and define what's known",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:02): not sure what to do about ports",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:02): we should check what the official specs say",
        "8b7a8196348038c107614af0b08f2d21 (10:02): default ports can cannonicalized away",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:02): since they claim to be knowledge-agnostic nowadays iirc",
        "8b7a8196348038c107614af0b08f2d21 (10:02): for known schemes",
        "8b7a8196348038c107614af0b08f2d21 (10:02): s/can/get/",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:03): 8b7a8196348038c107614af0b08f2d21: personally all i need is something to reference for the two red boxes in http://www.whatwg.org/specs/web-apps/current-work/complete.html#urls",
        "1e10d84b3917ae58049be95b0071cf7f (10:04): Also what‚Äôs the situation with no year-only @datetime? I guess it‚Äôs on purpose, but I wonder why given year-month and year-week pattern",
        "8b7a8196348038c107614af0b08f2d21 (10:04): you need to understand default ports to do security origin comparisons correctly",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:04): 8b7a8196348038c107614af0b08f2d21: ideally also we'd get a slightly less mathematical definition of &quot;absolute url&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:05): 8b7a8196348038c107614af0b08f2d21: yeah, we might just be stuck with the knowledge thing",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:05): 1e10d84b3917ae58049be95b0071cf7f: @datetime?",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:05): 1e10d84b3917ae58049be95b0071cf7f: you mean &lt;ins datetime=&quot;&quot;&gt;?",
        "1e10d84b3917ae58049be95b0071cf7f (10:05): 69b0d3dfe919a6b860a9fac82de52a7e: sorry, &lt;time datetime=&quot;&quot;&gt;",
        "8b7a8196348038c107614af0b08f2d21 (10:05): 69b0d3dfe919a6b860a9fac82de52a7e: in webkit the security origin class has its own table of default ports that separate from the one in the URL library",
        "8b7a8196348038c107614af0b08f2d21 (10:05): which is kind of goofy",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:05): 8b7a8196348038c107614af0b08f2d21: yeah that's pretty special",
        "8b7a8196348038c107614af0b08f2d21 (10:06): ok, i think i understand your requirements",
        "8b7a8196348038c107614af0b08f2d21 (10:06): i'll probably start a github project and start writing something next week",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:07): 1e10d84b3917ae58049be95b0071cf7f: the point of &lt;time&gt; is two-fold, (1) to make it easier to import times into a calendar, e.g. via microdata, and (2) make styling locale-specific",
        "816e4ece7c83a8a77ea9d52f8156a5ce (10:07): 1e10d84b3917ae58049be95b0071cf7f: When I think about it, using &lt;mark&gt; isn't so bad in this context... really, there is no equivalent for headlines (via my metaphor). My apologize :)",
        "69b0d3dfe919a6b860a9fac82de52a7e (10:07): 1e10d84b3917ae58049be95b0071cf7f: neither of these makes much sense for years",
        "1e10d84b3917ae58049be95b0071cf7f (10:08): hixie: cool, thanks for explaining",
        "1e10d84b3917ae58049be95b0071cf7f (10:09): 816e4ece7c83a8a77ea9d52f8156a5ce: I thought it was a nice creative use too, but it seems I should just be using the &lt;a&gt; that‚Äôs there, and wrapping it in &lt;mark&gt; is stretching &lt;mark&gt;‚Äôs meaning a little far :) it‚Äôs fun to think about how new elements can be used though huh"
    ],
    "person_ids": [
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "1e10d84b3917ae58049be95b0071cf7f",
        "8b7a8196348038c107614af0b08f2d21",
        "816e4ece7c83a8a77ea9d52f8156a5ce",
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "ad7340c0d2664b131f969961d78c86b2",
        "b25b6b77a0087ff8385941e5545d32ea"
    ]
}