{
    "id": "f80b975a230dfa4fa40c200a25e432e5",
    "messages": [
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:18): b8810fee2f4a71f849f3f7409546d1d9: plh points out to me that the message &quot;The document validates according to the specified schema(s).&quot; may lead people to assume that validator.nu is only doing schema validation",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:22): not sure what better wording could be put in there",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:23): maybe make it a hyperlink to the description on about.validator.nu of the types of checks it is doing?",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:24): &quot;The document validates according to the specified schema(s) and to additional constraints checked by the validator.&quot;",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:24): maybe",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:30): a9b326df4e6da61c5b6f5e1058be83a2: good point",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:31): b8810fee2f4a71f849f3f7409546d1d9: any thoughts about better wording?",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:31): a9b326df4e6da61c5b6f5e1058be83a2: your wording seems OK",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:32): ok",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:32): b25b6b77a0087ff8385941e5545d32ea: it seems that the WebM download prompt is what confuses @font-face in Opera Mobile 11 on Symbian",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:32): b25b6b77a0087ff8385941e5545d32ea: If I don't call .play(), the fonts apply",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:34): b25b6b77a0087ff8385941e5545d32ea: I updated webm.html5.org with a special case for Opera Mobile 11.x for Symbian, but now the page never finishes loading and I don't know why",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:35): anyone: Please let me know if webm.html5.org also needs special casing for Opera Mobile 11 for Android",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:36): Opera Mobile 11 on Windows 7 seems OK",
        "b25b6b77a0087ff8385941e5545d32ea (13:36): b8810fee2f4a71f849f3f7409546d1d9: Right. I think the bug is some bad interaction between the video download stuff and resource loading",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:37): b25b6b77a0087ff8385941e5545d32ea: I suspect having ever had a &lt;video&gt; element in the DOM confuses the browser to think the page hasn't finished loading even if I remove the &lt;video&gt; from the DOM",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:38): curiously, the browser say &quot;probably&quot; to the canPlayType query",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:38): which seems wrong, since it, in fact, cannot play the type",
        "b25b6b77a0087ff8385941e5545d32ea (13:39): Interesting",
        "a11aabeeceeae6b8cb5d12ea06b56554 (13:39): blames 66b0d785bfa15d051888c24dabba7342",
        "b25b6b77a0087ff8385941e5545d32ea (13:39): a11aabeeceeae6b8cb5d12ea06b56554: I think this is platform specific",
        "a11aabeeceeae6b8cb5d12ea06b56554 (13:40): b25b6b77a0087ff8385941e5545d32ea: If the canPlayType thing is what I think ‚Äî I doubt it is.",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:40): It's sad that canPlayType sucks the most in various mobile browsers where it is needed the most, since site authors can't test in every flavor of mobile browser",
        "b25b6b77a0087ff8385941e5545d32ea (13:40): My understanding (without trying it) is that it uses the platform media player to do the actual playing",
        "a11aabeeceeae6b8cb5d12ea06b56554 (13:40): That is correct.",
        "66b0d785bfa15d051888c24dabba7342 (13:40): I didn't know we had any support for &lt;video&gt; on Symbian at all",
        "66b0d785bfa15d051888c24dabba7342 (13:40): in fact I'm pretty sure we don't",
        "b25b6b77a0087ff8385941e5545d32ea (13:41): 66b0d785bfa15d051888c24dabba7342: We invoke the platform media player on seeing a &lt;video&gt; element",
        "b25b6b77a0087ff8385941e5545d32ea (13:41): Or something",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:41): 66b0d785bfa15d051888c24dabba7342: you most certainly show a black rectangle with a play button and prompt to download the file when calling .play() or pressing the button",
        "b25b6b77a0087ff8385941e5545d32ea (13:41): I'm not quite sure how it works",
        "66b0d785bfa15d051888c24dabba7342 (13:41): b25b6b77a0087ff8385941e5545d32ea, I've never heard from a platform team implementing &lt;video&gt; on Symbian",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:41): 66b0d785bfa15d051888c24dabba7342: and it never seems to fire any of the events one might expect after calling .play()",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:41): like Konqueror...",
        "235c2fe83792725019073bee65a41729 (13:42): f139aba52f9fa1394b4034a7954b2220: No and that's my fault, I'm sorry about that. It's just that I don't want to seem like someone who hasn't done research (when answers might be SO simple even though they aren't for me) since I have done a lot of research",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:43): anyway, Opera Mobile 11 now has the questionable honor shared with Konqueror to be a browser that can't be subjected to a WebM .play() attempt",
        "66b0d785bfa15d051888c24dabba7342 (13:43): b8810fee2f4a71f849f3f7409546d1d9, that all sounds very strange, probably the feature has been enabled without actually implementing the platform bits",
        "235c2fe83792725019073bee65a41729 (13:44): f139aba52f9fa1394b4034a7954b2220: I'm creating a 'game' sort of where a lot of sprites overlap each other and I need a click detection which detects which sprite is clicked on even though they overlap eachother and got transparent pixels within the sprite image",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:44): 66b0d785bfa15d051888c24dabba7342: I think I even saw a marketing video that showed the download prompt as a feature",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:44): 66b0d785bfa15d051888c24dabba7342: but the video may have demoed Android",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:45): so I'd like to know if I should blacklist Opera Mobile 11 on Android, too",
        "b25b6b77a0087ff8385941e5545d32ea (13:46): b8810fee2f4a71f849f3f7409546d1d9: Maybe you could try the android emulator",
        "66b0d785bfa15d051888c24dabba7342 (13:46): b8810fee2f4a71f849f3f7409546d1d9, it looks like we have implemented some support for it",
        "b25b6b77a0087ff8385941e5545d32ea (13:46): Maybe I should get a phone that actually lets me use a web browser :)",
        "66b0d785bfa15d051888c24dabba7342 (13:46): b8810fee2f4a71f849f3f7409546d1d9, not very well though, this is the first time I've heard about it",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:47): b25b6b77a0087ff8385941e5545d32ea: I didn't know there was any useful kind of emulator",
        "b25b6b77a0087ff8385941e5545d32ea (13:47): I have no idea if it is useful",
        "b25b6b77a0087ff8385941e5545d32ea (13:47): http://developer.android.com/guide/developing/devices/emulator.html",
        "f139aba52f9fa1394b4034a7954b2220 (13:47): 235c2fe83792725019073bee65a41729, ok, then in that case, you will need to check each image sequentially, acording to their z-index from front to back, until you find a non-transparent pixel at the clicked coordinates",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:47): b25b6b77a0087ff8385941e5545d32ea: do you mean what's in the SDK? I have only read bad things about it.",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:47): b25b6b77a0087ff8385941e5545d32ea: yeah, that one",
        "66b0d785bfa15d051888c24dabba7342 (13:47): b8810fee2f4a71f849f3f7409546d1d9, it looks like it will reply &quot;probably&quot; to absolutely anything and try to download it",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:47): 66b0d785bfa15d051888c24dabba7342: hey, I got your reply. I had been pinging you at the time because I was talking with Silvia and Eric Carlson and Frank Olivier about media stuff and wanted to ask you about‚Ä¶ something",
        "b25b6b77a0087ff8385941e5545d32ea (13:47): b8810fee2f4a71f849f3f7409546d1d9: Oh, OK",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:47): b25b6b77a0087ff8385941e5545d32ea: I didn't get it to boot when I last tried",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:48): 66b0d785bfa15d051888c24dabba7342: can't remember now what it was",
        "66b0d785bfa15d051888c24dabba7342 (13:48): a9b326df4e6da61c5b6f5e1058be83a2, ok",
        "a9b326df4e6da61c5b6f5e1058be83a2 (13:48): anyway, thanks for having followed up about it",
        "b25b6b77a0087ff8385941e5545d32ea (13:48): b8810fee2f4a71f849f3f7409546d1d9: I can probably find someone with an android phone and ask them to try",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:48): b25b6b77a0087ff8385941e5545d32ea: yeah",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:48): anyone on this channel with an Android phone and Opera Mobile 11 on it?",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:49): I guess I should get an Android phone at some point",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:50): but I have been dragging my feet waiting for the dust to settle around Firefox for Android requirements and for a WebM hardware decoder to appear in Android devices",
        "66b0d785bfa15d051888c24dabba7342 (13:50): b8810fee2f4a71f849f3f7409546d1d9, I borrowed one from a colleague, what do you want me to test?",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:50): 66b0d785bfa15d051888c24dabba7342: if loading http://webm.html5.org/ prompts to download or completes with useful information or something else",
        "b25b6b77a0087ff8385941e5545d32ea (13:51): b8810fee2f4a71f849f3f7409546d1d9: Oh, WebM for android. I think you just put me off buying an android device for another round :)",
        "66b0d785bfa15d051888c24dabba7342 (13:52): b8810fee2f4a71f849f3f7409546d1d9, it plays a 1 second video in fullscreen of &quot;WebM&quot; with a green tick next to it, then I see &quot;Congratulations!&quot;",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:52): b25b6b77a0087ff8385941e5545d32ea: I don't actually know anything, but since the hardware design was announced on the WebM blog, I have been assuming that it's expected to find its way to Google's OEMs some day",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:52): 66b0d785bfa15d051888c24dabba7342: great",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:53): 66b0d785bfa15d051888c24dabba7342: and congrats for shipping WebM support for Android!",
        "b25b6b77a0087ff8385941e5545d32ea (13:53): b8810fee2f4a71f849f3f7409546d1d9: Yes, I know about the same as you, I just hadn't considered it :)",
        "66b0d785bfa15d051888c24dabba7342 (13:53): b8810fee2f4a71f849f3f7409546d1d9, I actually had no idea that WebM worked yet :)",
        "66b0d785bfa15d051888c24dabba7342 (13:53): we're just using the platform player on android I think",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:54): I guess now I have to edit the android advice to say that Opera Mobile 11 works in addition to Firefox",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:54): 66b0d785bfa15d051888c24dabba7342: what version of Android did you test on?",
        "66b0d785bfa15d051888c24dabba7342 (13:55): b8810fee2f4a71f849f3f7409546d1d9, I don't know, how do I check?",
        "66b0d785bfa15d051888c24dabba7342 (13:55): I can ask",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:55): 66b0d785bfa15d051888c24dabba7342: I don't know",
        "66b0d785bfa15d051888c24dabba7342 (13:55): b8810fee2f4a71f849f3f7409546d1d9, 2.3.3 says the owner",
        "66b0d785bfa15d051888c24dabba7342 (13:55): let's assume that's true",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:56): 66b0d785bfa15d051888c24dabba7342: ok. that one is supposed to ship with a WebM decoder in the system",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:56): so now we don't know what happens in Opera on downlevel Android",
        "b8810fee2f4a71f849f3f7409546d1d9 (13:56): assuming that you indeed are using the system bits",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:00): I wonder if there's a market: URL for Opera",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:01): guesses market://details?id=com.opera.browser",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:06): OK. I think I'm now done with webm.html5.org updates for today.",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:06): 66b0d785bfa15d051888c24dabba7342: thanks",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:06): anyone: If you find that Opera Mobile 11 does not play WebM on downlevel Android, please let me know",
        "7cbd522d7fcf593a1e60d52c789b6a7b (14:19): b8810fee2f4a71f849f3f7409546d1d9: &quot;For Android versions earlier than 2.3 only H.264 is supported, while from version 2.3 onward WebM is also supported.&quot;",
        "7cbd522d7fcf593a1e60d52c789b6a7b (14:19): from http://www.opera.com/docs/specs/productspecs/",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:25): 7cbd522d7fcf593a1e60d52c789b6a7b: is that *really* 2.3 or 2.3.3?",
        "7cbd522d7fcf593a1e60d52c789b6a7b (14:25): i'm not certain... i'm stuck on 2.2 :/",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:25): 7cbd522d7fcf593a1e60d52c789b6a7b: IIRC, 2.3.0 didn't have WebM even though it was originally announced",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:26): goes edit webm.html5.org again",
        "7cbd522d7fcf593a1e60d52c789b6a7b (14:26): i'll ask around and have that updated if it's incorrect",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:26): 7cbd522d7fcf593a1e60d52c789b6a7b: thanks",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:27): Hmm. Opera Mobile itself doesn't report the Android version, so it's not possible to give targeted upgrade advice",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:36): In general, giving browser advice to Android users sucks. Firefox wants an ARM v7 CPU, and you don't know if the visitor has one.",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:37): Opera Mobile 11 needs Android 2.3, but you don't know what version of Android the user has if the user is already running Opera Mobile or Opera Mini",
        "a11aabeeceeae6b8cb5d12ea06b56554 (14:37): b8810fee2f4a71f849f3f7409546d1d9: You have no way on ARM to tell what sort of CPU you have apart from blindingly trusting the OS",
        "a11aabeeceeae6b8cb5d12ea06b56554 (14:37): (or trying and seeing if you crash)",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:38): a11aabeeceeae6b8cb5d12ea06b56554: as I understand it, Firefox reads stuff under /proc to figure out if the CPU supports neon",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:38): also to blacklist the JIT on certain Samsung devices",
        "a11aabeeceeae6b8cb5d12ea06b56554 (14:42): b8810fee2f4a71f849f3f7409546d1d9: AFAIK short of reading /proc there's nothing you can do, as I understand it",
        "a11aabeeceeae6b8cb5d12ea06b56554 (14:43): Like, there's nothing analogous to CPUID.",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:43): a11aabeeceeae6b8cb5d12ea06b56554: how does Linux itself find out what sort of ARM CPU it has?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (14:47): b8810fee2f4a71f849f3f7409546d1d9: This I don't entirely understand, and looking at this again I'm confused‚Ä¶ I *believe* it is set at compile-time.",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:47): wonders how Verizon Opera Mini differs from Opera Mini except by being a version behind and having an ugly icon",
        "a11aabeeceeae6b8cb5d12ea06b56554 (14:47): b8810fee2f4a71f849f3f7409546d1d9: looking at it on a BeagleBoard, &quot;Features&quot; is incomplete, for example.",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:48): a11aabeeceeae6b8cb5d12ea06b56554: so if the kernel isn't device-specific (e.g. Debian) one can't tell?",
        "a11aabeeceeae6b8cb5d12ea06b56554 (14:49): b8810fee2f4a71f849f3f7409546d1d9: I believe this to be the case. I'm just looking on Ubuntu on ARM, FWIW.",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:51): didn't know Ubuntu shipped on ARM",
        "a11aabeeceeae6b8cb5d12ea06b56554 (14:53): b8810fee2f4a71f849f3f7409546d1d9: Only an unofficial port",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:54): http://en.wikipedia.org/wiki/Linux_distribution_comparison#Architecture_support seems to list a distro as &quot;Yes&quot; if it has ever supported a given architecture",
        "b8810fee2f4a71f849f3f7409546d1d9 (14:54): which misrepresents e.g. PPC support today"
    ],
    "person_ids": [
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "b25b6b77a0087ff8385941e5545d32ea",
        "a11aabeeceeae6b8cb5d12ea06b56554",
        "66b0d785bfa15d051888c24dabba7342",
        "235c2fe83792725019073bee65a41729",
        "f139aba52f9fa1394b4034a7954b2220",
        "7cbd522d7fcf593a1e60d52c789b6a7b"
    ]
}