{
    "id": "fa4a3abc48e478f2683e072cc9523e85",
    "messages": [
        "69b0d3dfe919a6b860a9fac82de52a7e (00:30): oh hey, all the votes are closed",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:30): let's see",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:31): wow, i'm glad we got such overwhelming support for not changing the charter",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:31): guess that means the charter change proposal doesn't carry",
        "3f2e2531201cfbf853f16f668132eaf2 (00:32): Overwhelming support is seemingly not consensus",
        "69b0d3dfe919a6b860a9fac82de52a7e (00:33): indeed, but 2 votes in favour is even less consensus :-)",
        "3f2e2531201cfbf853f16f668132eaf2 (00:34): But one person with a valid point can refute the conclusions of everyone else who didn't notice that point",
        "b9acb5df457f56156060d93d0827b8ac (00:39): Or, apparently, one large enough company can override everyone else :(",
        "587bf8b858e15d03428e1415c33c38ef (00:47): the question about whether to change the charter was not a formal proposal; it was gathering advice. As chair, if I think the charter should be changed, I have to change it, no matter how unpopular that is.",
        "587bf8b858e15d03428e1415c33c38ef (00:48): the WG doesn't own its charter; the charter is an interface between the WG and the rest of W3C",
        "b9acb5df457f56156060d93d0827b8ac (00:50): 587bf8b858e15d03428e1415c33c38ef: So the fact that Chris thinks it should be changed holds considerable weight compared to other WG members as he is a chair?",
        "587bf8b858e15d03428e1415c33c38ef (00:51): yes, though note Chris wasn't acting as chair when he answered the survey; he was representing microsoft",
        "587bf8b858e15d03428e1415c33c38ef (00:51): it sure would be nice to have somebody besides Chris W. representing microsoft",
        "b9acb5df457f56156060d93d0827b8ac (00:53): Would that make much difference?",
        "b9acb5df457f56156060d93d0827b8ac (00:53): (to the way Microsoft vote / Chris chairs)?",
        "587bf8b858e15d03428e1415c33c38ef (00:55): maybe not. maybe I just wish life were simpler than it is",
        "587bf8b858e15d03428e1415c33c38ef (00:56): hmm... the subtitle idea is interesting. (<email/> )",
        "b9acb5df457f56156060d93d0827b8ac (00:56): Oh well I can agree to that :)",
        "587bf8b858e15d03428e1415c33c38ef (00:57): re &quot;there is little (read: zero) point in discussing",
        "587bf8b858e15d03428e1415c33c38ef (00:57): exactly how an element should be processed until such",
        "587bf8b858e15d03428e1415c33c38ef (00:57): time as the group are agreed that such an element",
        "587bf8b858e15d03428e1415c33c38ef (00:57): should exist at all&quot; I don't think things are quite that orthogonal.",
        "587bf8b858e15d03428e1415c33c38ef (00:58): doesn't suppose that's worth mail to the whole group at this point",
        "b9acb5df457f56156060d93d0827b8ac (00:58): thinks the chance of the group unanimously agreeing to anything is slim to none",
        "587bf8b858e15d03428e1415c33c38ef (01:00): while I think it's challenging, I maintain hope; I'm not giving up on the goal of consensus",
        "587bf8b858e15d03428e1415c33c38ef (01:00): hmm... ISSUE-24 didn't we already have a codec issue? what's the new issue, I wonder...",
        "3f2e2531201cfbf853f16f668132eaf2 (01:01): Is that goal more likely to be achieved by people having their minds changed, or by them getting fed up and leaving until there aren't any objectors left?",
        "587bf8b858e15d03428e1415c33c38ef (01:03): wanders off to family time...",
        "139513027e8e90b5582cbc68fc733884 (01:18): 587bf8b858e15d03428e1415c33c38ef: why should I bother voting in surveys?",
        "139513027e8e90b5582cbc68fc733884 (01:18): 587bf8b858e15d03428e1415c33c38ef: it seems like as long as there isn't 100% agreement, only Microsoft's vote counts",
        "69b0d3dfe919a6b860a9fac82de52a7e (01:34): what 139513027e8e90b5582cbc68fc733884 just said certainly seems to be the way things are going",
        "eb8a98129bf103327310edbb5652fcee (01:56): Sigh.  Glad I left IRC on.",
        "eb8a98129bf103327310edbb5652fcee (01:57): I find statements like &quot;as long as there isn't 100% agreement, only Microsoft's vote counts&quot; somewhat amusing, in light of the competing claims that Opera, Mozilla and Apple simply have their way with the WG.",
        "139513027e8e90b5582cbc68fc733884 (01:58): hi eb8a98129bf103327310edbb5652fcee",
        "eb8a98129bf103327310edbb5652fcee (01:58): hi Maciej",
        "139513027e8e90b5582cbc68fc733884 (01:58): having our way with the WG seems to be backed by majority votes of participants",
        "139513027e8e90b5582cbc68fc733884 (01:59): we also don't have a Chair publicly arguing that giving us special treatment is necessary and allegedly allowed by W3C Process",
        "139513027e8e90b5582cbc68fc733884 (01:59): because &quot;preferential treatment&quot; for market share is not &quot;unfair&quot;",
        "139513027e8e90b5582cbc68fc733884 (02:00): whereas it seems that both Chairs are not Microsoft represenatives, and majority vote of the chairs overrides majority vote of the group",
        "139513027e8e90b5582cbc68fc733884 (02:00): *are now",
        "eb8a98129bf103327310edbb5652fcee (02:00): To follow that line of reasoning - then why don't you just ignore Microsoft and the W3C, and continue (collectively) your work in the WHATWG?",
        "139513027e8e90b5582cbc68fc733884 (02:01): eb8a98129bf103327310edbb5652fcee: that's exactly what I'm trying to figure out",
        "eb8a98129bf103327310edbb5652fcee (02:01): (not sure what you mean about both chairs not Microsoft reps)",
        "139513027e8e90b5582cbc68fc733884 (02:01): 587bf8b858e15d03428e1415c33c38ef seems to think it is his job to disproportionately favor Microsoft's point of view",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:02): eb8a98129bf103327310edbb5652fcee: the reason we're in the w3c is that we were trying to get your feedback (microsoft's feedback)",
        "eb8a98129bf103327310edbb5652fcee (02:02): I would presume, from the email you sent a few days ago (sorry, been out of the office again), that you care what happens with Microsoft and IE.  Maybe not in a &quot;so we'll do whatever they want&quot; way (hah), but you recognize the effect on that many browser users.",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:02): eb8a98129bf103327310edbb5652fcee: without getting your feedback (which we still haven't received), the other reasons to be here are looking less and less convincing",
        "eb8a98129bf103327310edbb5652fcee (02:03): I should clearly delineate - for the purposes of this conversation, I am not the WG chair.  For that matter, I'm not really representing Microsoft right now either.",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:03): eb8a98129bf103327310edbb5652fcee: (the only major other reason was to get patent policy coverage, but we can't get that without publishing a FPWD)",
        "139513027e8e90b5582cbc68fc733884 (02:04): eb8a98129bf103327310edbb5652fcee: I care, but not enough to give Microsoft veto power over group decisions (especially when, as 69b0d3dfe919a6b860a9fac82de52a7e says, we're not getting any actual technical feedback)",
        "eb8a98129bf103327310edbb5652fcee (02:04): 69b0d3dfe919a6b860a9fac82de52a7e - though I'm sure you're being honest when you say &quot;trying to get (microsoft's) feedback&quot;, I'd point out that from my point of view, you've disregarded any of the feedback I've given so far - e.g., on the whole versioning debate - and accused me of trying to be anti-competitive rather than recognizing just how different the world is from this point of view.",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:05): eb8a98129bf103327310edbb5652fcee: actually the last time we debated versioning, you specifically said you didn't want to request anything.",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:05): eb8a98129bf103327310edbb5652fcee: so it's not clear that i'm ignoring anything",
        "eb8a98129bf103327310edbb5652fcee (02:06): By the end of that conversation, it was clear it was going nowhere, yes; you and others are dead set against having any HTML version in the identifier.",
        "eb8a98129bf103327310edbb5652fcee (02:07): 139513027e8e90b5582cbc68fc733884 - I would not expect Microsoft to have veto power over group decisions; I WOULD expect to be following the model of &quot;like | dislike but can live with | can't live with&quot;, as the DOM group did in the past e.g.",
        "139513027e8e90b5582cbc68fc733884 (02:08): If we did that, should we expect the same level of success in Microsoft implementing the spec as the DOM group saw?",
        "eb8a98129bf103327310edbb5652fcee (02:08): I can't live with us abusing scope in our charter.  I understand that possibly you, 69b0d3dfe919a6b860a9fac82de52a7e and others thought &quot;HTML WG charter == whatever's in or going to be in the HTML5 spec&quot;; I don't think that's very compatible with being able to work in an open way under a RF patent policy.",
        "139513027e8e90b5582cbc68fc733884 (02:08): the charter has no relevance to the patent policy",
        "139513027e8e90b5582cbc68fc733884 (02:09): the patent policy is based solely on what is in FPWD and LC",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:09): (and even if it did, the charter clearly does include the things you're saying are out of scope)",
        "eb8a98129bf103327310edbb5652fcee (02:09): 139513027e8e90b5582cbc68fc733884: up through IE6, discounting the apparent vacation taken by IE?  yes, I would.  We did, in fact, implement more of the DOM than anyone else in that time frame.",
        "139513027e8e90b5582cbc68fc733884 (02:10): basic DOM1 things like getAttribute still don't work right",
        "139513027e8e90b5582cbc68fc733884 (02:10): and it's not clear if they ever will",
        "139513027e8e90b5582cbc68fc733884 (02:10): (or equally basic things like getElementById)",
        "eb8a98129bf103327310edbb5652fcee (02:11): in reverse order: 69b0d3dfe919a6b860a9fac82de52a7e - yes, I mistakenly stated one thing that was in there once; I don't think the WebAPI group has failed, and I disagree quite strongly that 2D immediate-mode graphics API is just a widget.  That seems like open season to add anything to the HTML5 spec, and for the HTML5 spec to be &quot;the book of all things&quot;.",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:11): i understand that you believe that",
        "eb8a98129bf103327310edbb5652fcee (02:11): 139513027e8e90b5582cbc68fc733884: not sure why you would make that presumption.  Unless you mean in the context of HTML4 doctype, not opted in to an IE.Next &quot;follow the standards&quot; mode?",
        "139513027e8e90b5582cbc68fc733884 (02:12): eb8a98129bf103327310edbb5652fcee: nothing I stated is based on presumption",
        "139513027e8e90b5582cbc68fc733884 (02:12): it may be that basic DOM things will work some day, in IE Quirks Mode 5 or whatever",
        "eb8a98129bf103327310edbb5652fcee (02:13): 69b0d3dfe919a6b860a9fac82de52a7e: I see what you did there.  :)  Do you disagree that with the current set of things in it, that the HTML5 spec is, in fact, intending to be the &quot;Web Application Platform end-to-end specification&quot;?",
        "139513027e8e90b5582cbc68fc733884 (02:13): but they clearly don't today",
        "eb8a98129bf103327310edbb5652fcee (02:13): Why is XMLHTTPRequest not part of it?",
        "139513027e8e90b5582cbc68fc733884 (02:14): and there's no statement from Microsoft that they ever will, and thus, it's unclear if they ever will",
        "139513027e8e90b5582cbc68fc733884 (02:14): XMLHttpRequest is not part of it because the Web API WG successfully made progress on that spec",
        "eb8a98129bf103327310edbb5652fcee (02:14): 139513027e8e90b5582cbc68fc733884: I'm not understanding.  basic DOM1 things like getAttribute() have bugs and errors in our current IE7 implementation.  They will get fixed in a future version; that fix will not take effect without some level of opt-in from the web developer.",
        "139513027e8e90b5582cbc68fc733884 (02:14): whereas for other data and networking APIs, they have not even started",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:14): eb8a98129bf103327310edbb5652fcee: i disagree that the html5 spec oversteps our charter, but i'm not interested in spending time discussing this again, i'm busy working on the spec.",
        "eb8a98129bf103327310edbb5652fcee (02:15): 69b0d3dfe919a6b860a9fac82de52a7e: sorry to waste your time.  You didn't need to step in to the discussion if you were busy.",
        "eb8a98129bf103327310edbb5652fcee (02:16): 139513027e8e90b5582cbc68fc733884: but that's a goofy distinction.  I understand having WGs work on charted areas; I don't understand the single kitchen sink WG, and other groups can do stuff as long as they make enough progress.",
        "eb8a98129bf103327310edbb5652fcee (02:16): My wife is about to pick me up anyway, so I'll have to go.",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:16): eb8a98129bf103327310edbb5652fcee: i was just trying to explain why we had joined the w3c in the first place, and why we were considering leaving.",
        "139513027e8e90b5582cbc68fc733884 (02:16): anyway, regardless of the scope, I can't agree with a decision process that's &quot;in 43-2 votes, the 2 side wins if it includes Microsoft&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:17): indeed",
        "fd9ef1223e855714294498ebfde79f98 (02:17): I don't understand what &quot;some level of opt-in from the web developer&quot; has to do with HTML language versioning.",
        "8b7a61a6e9bd5b8977b7b3f02a425adc (02:18): Wasn't the original tack on solution that HTML5 should have no version and then HTML6 should add it back again? heh.",
        "139513027e8e90b5582cbc68fc733884 (02:19): I think arguments were made both ways, regarding the scope issue, and the arguments for broad interpretation of the scope were ultimately more persuasive, as seen in the vote",
        "eb8a98129bf103327310edbb5652fcee (02:19): 69b0d3dfe919a6b860a9fac82de52a7e: this has clearly been a learning process all around.",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:19): certainly, but i didn't learn the subject i was expecting to learn",
        "139513027e8e90b5582cbc68fc733884 (02:20): I was hoping to hear Microsoft",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:20): (i was expecting to learn technical subjects. i learnt how to subvert an industry consortium.)",
        "139513027e8e90b5582cbc68fc733884 (02:20): 's actual technical input on things like canvas",
        "eb8a98129bf103327310edbb5652fcee (02:20): You didn't learn the subject I was expecting you to learn, either.  :)",
        "eb8a98129bf103327310edbb5652fcee (02:20): hmm.",
        "139513027e8e90b5582cbc68fc733884 (02:20): since it's been suggested they might be unimplementable in IE",
        "139513027e8e90b5582cbc68fc733884 (02:20): (which I found a surprising claim)",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:21): i can tell you that google was especially surprised to hear that canvas couldn't be implemented in IE, since we implemented it in IE.",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:21): (as a JS shim)",
        "3f2e2531201cfbf853f16f668132eaf2 (02:21): (with lots of bugs :-p )",
        "139513027e8e90b5582cbc68fc733884 (02:21): but all I'm seeing is process games to try to take things like that off the table",
        "eb8a98129bf103327310edbb5652fcee (02:21): who do you think has subverted this industry consortium?  I'd like you to think about that from Dan's perspective, and from mine, before you just answer with the first thing that comes to mind.",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:22): i have no intention of putting blame anywhere",
        "eb8a98129bf103327310edbb5652fcee (02:22): 139513027e8e90b5582cbc68fc733884 - I don't think I ever said the canvas api was unimplementable in IE?  I might have said graphics experts might find it less than ideal, but certainly not unimplementable.",
        "69b0d3dfe919a6b860a9fac82de52a7e (02:22): since i think it's pretty clear",
        "eb8a98129bf103327310edbb5652fcee (02:22): well, I expect you do.  I don't think it's very clear at all.",
        "eb8a98129bf103327310edbb5652fcee (02:23): Anyway.  I have to run.  talk to you all later.",
        "eb8a98129bf103327310edbb5652fcee (02:23): afk",
        "139513027e8e90b5582cbc68fc733884 (02:24): here's a ChrisWislon email quote on canvas: &quot;I explicitly cannot comment on features that will go in to the next version of IE, as a matter of policy.  I think Apple needs to agree that canvas should be pursued in the HTML WG, and then we can have the discussion as a WG.  I'm not against canvas as a matter of policy or anything.&quot;",
        "139513027e8e90b5582cbc68fc733884 (02:24): &quot;I'm not sure graphics rendering falls in the category of &quot;semantics of documents and applications&quot; - it would seem more like presentation.  I'm not making a strong point here, just saying that it's on the bubble at best.  I do think the &lt;canvas&gt; pattern needs to be addressed under the W3C, so I'm not necessarily against it.  Regardless, I would hope we can provide some bridge between us and the other presentation efforts in the W3C.&quot;",
        "139513027e8e90b5582cbc68fc733884 (02:30): &quot;Indeed, and I spent tons of time reverse-engineering Netscape behavior back in the day.  And I expect I'll be traipsing my way through your &lt;canvas&gt; bugs at some point in the future (or something; that's illustrative, not normative).&quot;",
        "139513027e8e90b5582cbc68fc733884 (02:32): URLs for some of those: http://lists.w3.org/Archives/Public/public-html/2007Apr/0268.html",
        "139513027e8e90b5582cbc68fc733884 (02:32): http://lists.w3.org/Archives/Public/public-html/2007Apr/0304.html",
        "139513027e8e90b5582cbc68fc733884 (02:33): &quot;&lt;canvas&gt;.  You've specified an entire immediate-mode graphics api, more extensive in some ways than GDI, without describing the parameters or giving rendering rules to get interoperable pixel-perfect rendering.&quot;"
    ],
    "person_ids": [
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "3f2e2531201cfbf853f16f668132eaf2",
        "b9acb5df457f56156060d93d0827b8ac",
        "587bf8b858e15d03428e1415c33c38ef",
        "139513027e8e90b5582cbc68fc733884",
        "eb8a98129bf103327310edbb5652fcee",
        "fd9ef1223e855714294498ebfde79f98",
        "8b7a61a6e9bd5b8977b7b3f02a425adc"
    ]
}