{
    "id": "fb2237f07bc5ab14530deb15f43b728f",
    "messages": [
        "69b0d3dfe919a6b860a9fac82de52a7e (14:12): http://lists.w3.org/Archives/Member/w3c-html-cg/2008JulSep/0073.html sugests that the HCG call two weeks ago consisted almost entirely about talking about me",
        "a924fb58d2c25874322f4e5126f608b9 (14:13): Too bad it's a treehouse-archive",
        "ab7faae5d7b250ea8606486575f8f79c (14:15): I think the described &quot;gain for one segment of the population (those needing alt text)&quot; comes from having any mechanism that gives a textual description of an image when no equivalent is available (and that requires authors to always write something, and hence to think about alt and (with non-zero probability) write something that's better than nothing);",
        "ab7faae5d7b250ea8606486575f8f79c (14:15): and this particular &quot;small pain for another (tool writers)&quot; is specific to the curly-brace syntax and doesn't seem to be a problem in any other proposed mechanism, because the other mechanisms don't add any complexity to the otherwise-pleasant situations where you really do have equivalent text",
        "ab7faae5d7b250ea8606486575f8f79c (14:15): I think the gain is worthwhile, so I wouldn't want to go back to alt being optional; but I think the pain is real, so I'd prefer some other solution that has the same gain without the pain",
        "ab7faae5d7b250ea8606486575f8f79c (14:15): but that involves tradeoffs against the pains (of varying levels of theoreticality) of other solutions, which is not trivial (if it's even possible) :-(",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:17): k",
        "ab7faae5d7b250ea8606486575f8f79c (14:19): (I guess the desire to be able to distinguish equivalent text from descriptive text, so that &lt;img alt=&quot;equivalent&quot;&gt; can be rendered the same as &lt;span&gt;equivalent&lt;/span&gt;, seems like a mostly theoretical concern to me, since in reality nobody distinguishes alt that way, so a UA will have to cope with the indistinguishability anyway)",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:20): that's basically the argument which is leading me back to alt=&quot;&quot; being optional -- whatever we do the data won't be reliable, so UAs are going to have to do heuristics in all cases anyway, so why not just have the simplest syntax",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:20): it's not like categories/roles like the spec suggests using now are actually going to be useful",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:21): ok bed time",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:21): nn",
        "ab7faae5d7b250ea8606486575f8f79c (14:21): That's far more of a change than just a simpler syntax, since it deprives the UA/user of even descriptive text about the image",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:21): in practice i doubt that we'd be able to get descriptive text about the image",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:22): it's not like flickr knows what the images are",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:22): and in the case of a computer-generated fractal view, it's not like saying &quot;it's a fractal&quot; is gonna help anyone",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:22): same with a webcam",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:23): or a blind user's photos",
        "ab7faae5d7b250ea8606486575f8f79c (14:34): Even if Flickr just said something like &lt;img alt=&quot;Main photo&quot;&gt;, that would help users tell apart the main photo from e.g. the &quot;next in photostream&quot; button where Flickr forgot to put any alt attribute, so it's better than nothing",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:35): so you want to require that flickr be conforming for one &lt;img&gt; so that the usability of their site is improved because you think they won't be conforming for another one?",
        "a924fb58d2c25874322f4e5126f608b9 (14:36): So once again, we're back at something like notalt=&quot;text that isn't alternate&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:36): if we are assuming we can get them conforming for any images, why would we assume the main image (which is the hardest to get right) would be where they would start in becoming conforming?",
        "ab7faae5d7b250ea8606486575f8f79c (14:38): 69b0d3dfe919a6b860a9fac82de52a7e: The evidence seems to back up that assumption, because Flickr does have alt on its main image whereas it doesn't on some of its other images",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:39): the alt on the main image is pretty bogus right now in most cases",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:40): i would argue that the flickr site right now shows that which images get alt=&quot;&quot; attribute is more likely to be near-random than anything else",
        "ab7faae5d7b250ea8606486575f8f79c (14:40): Presumably the main image has been there since Flickr first existed, so there's plenty of time for someone who knows 'HTML4 says I need an alt attribute' to have edited the code to generate an alt attribute, while the other images are more recent and nobody has cared to 'fix' them yet",
        "ab7faae5d7b250ea8606486575f8f79c (14:40): &quot;pretty bogus&quot; is still better than nothing :-)",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:40): maybe",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:40): and maybe",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:40): or maybe not",
        "ab7faae5d7b250ea8606486575f8f79c (14:41): and when our choices seem to be between &quot;nothing&quot; and &quot;better than nothing&quot;, the latter seems a better choice",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:41): if it was clearly better i'd agree",
        "ab7faae5d7b250ea8606486575f8f79c (14:42): a924fb58d2c25874322f4e5126f608b9: Or just alt=&quot;text that isn't alternate&quot; :-)",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:43): we could also require that all such images be in a link pointing at the image itself",
        "a924fb58d2c25874322f4e5126f608b9 (14:44): ab7faae5d7b250ea8606486575f8f79c: I'm cool with it. You just have to convince public-html",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:44): actually he just has to convince me, and, if it is controversial, the chairs :-)",
        "a924fb58d2c25874322f4e5126f608b9 (14:45): No, he has to convince public-html so my inbox can get peace and quiet at last ;)",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:45): i think it's pretty obvious that there are a number of people who are unwilling to move from their positions and who have positions that are unlikely to ever gain wide acceptance",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:46): e.g. the people who think that even decorative images should have non-empty alt",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:48): ab7faae5d7b250ea8606486575f8f79c: so what text would you suggest for the following cases? a generated image for a fractal explorer; the images in google maps in map view and satellite view; the street view images in google maps; an image uploaded as part of a batch upload with no information; a webcam",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:50): ok going to bed for real now. will read responses tomorrow.",
        "69b0d3dfe919a6b860a9fac82de52a7e (14:50): nn",
        "ab7faae5d7b250ea8606486575f8f79c (14:51): a924fb58d2c25874322f4e5126f608b9: There's an easier solution to the inbox problem: create a new mailing list for alt discussion",
        "ab7faae5d7b250ea8606486575f8f79c (14:51): Even better, create a Task Force for it",
        "a924fb58d2c25874322f4e5126f608b9 (14:51): ab7faae5d7b250ea8606486575f8f79c: Oh boy",
        "a924fb58d2c25874322f4e5126f608b9 (14:51): 69b0d3dfe919a6b860a9fac82de52a7e: 04:45 on a sunday? That's dedication :)",
        "5b67d980ae4c3c82251106e26913ce67 (15:10): http://fronteers.nl/congres/2008/speakers#anne-van-kesteren"
    ],
    "person_ids": [
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "a924fb58d2c25874322f4e5126f608b9",
        "ab7faae5d7b250ea8606486575f8f79c",
        "5b67d980ae4c3c82251106e26913ce67"
    ]
}