{
    "id": "fcf9cb2fb992ae82fec4160483805ef7",
    "messages": [
        "1f8387eb43f131d7c309a90a4e36b5cb (21:56): Yay, IE9 pp3 *almost* correctly displays my SVG-and-javascript emulator for a flash game.",
        "1f8387eb43f131d7c309a90a4e36b5cb (21:56): It just messes up one of the SVGs for some reason, and won't animate them yet.",
        "1f8387eb43f131d7c309a90a4e36b5cb (21:57): Those are possibly related - the messed up one is the animated one.",
        "f9e12e0466f4d059b78bb3f863633092 (22:04): good ole IE9",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:28): for those interested in e-books, and/or specifically in the ePub format -",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:28): http://www.idpf.org/idpf_groups/IDPF-EPUB-WG-Charter-4-27-2010.html",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:28): see the Preliminary Solutions section",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:29): where it lists &quot;Adopt HTML5 Features&quot;",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:30): also see &quot;Current Industry Problems&quot; the list of problems that they are trying to address with this 2.1 update to ePub",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:30): e.g., &quot;Need for enhanced global language support&quot;",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:31): and specific mention of &quot;including but not limited to special line-breaking rules and vertical writing direction&quot;",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:31): &quot;it is acknowledged that a number of significant issues would need to be resolved&quot; i wonder what those are",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:32): dunno",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:32): but we can try to find out",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:33): they seem to be taking a fairly pragmatic approach to this update",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:33): so far",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:33): e.g., see the statement, &quot;Since most distributed Reading Systems utilize Web browsers to present content to end users, and many standalone Reading Systems utilize Web browser rendering technologies in their implementations, it is desirable to improve alignment with Web standards as implemented by modern browsers.&quot;",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:34): &quot;as implemented&quot;",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:34): as opposed to, say, &quot;as we would have preferred them to have been implemented&quot;",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:35): or &quot;as not implemented yet but we will spec things out on the basis of blind faith&quot;",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:36): keep in mind that ePub 2.0 is normatively based on XHTML 1.1",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:36): they seem to have done a reasonable job overall of being pragmatic within the constraints of not being experts in web tech",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:36): yeah",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:37): and switching away from XHTML 1.1 to &quot;as implemented in modern browsers&quot; is a great move to start with, at least",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:38): anyway, vertical text support is extremely important for e-book-reading use cases in Japan",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:38): I am told it is for Taiwan also",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:38): though less so for mainland China",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:39): yup",
        "65325d50b2e25aca54bc871b89758c9c (22:39): Apple's version of ePub will (as I'm sure has been previously mentioned) allow arbitrary HTML5 constructs",
        "65325d50b2e25aca54bc871b89758c9c (22:39): and people have in fact used it to embed video and audio and such in books",
        "65325d50b2e25aca54bc871b89758c9c (22:39): which is neat",
        "65325d50b2e25aca54bc871b89758c9c (22:40): from what I hear, there are a number of language features important for books in east asian locales",
        "65325d50b2e25aca54bc871b89758c9c (22:40): and people are pickier about some of them for books than for web sites",
        "65325d50b2e25aca54bc871b89758c9c (22:40): if Apple ends up doing any of them of course we'll feed the work into WebKit so it will be there for websites too",
        "65325d50b2e25aca54bc871b89758c9c (22:41): but I think most of the east asian language issues are mostly CSS level questions",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:42): the only two vertical text things i'm aware of for html5 are to do with canvas drawText and captions",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:42): 65325d50b2e25aca54bc871b89758c9c: yeah, I think for east-asian language/layout issues, it is mostly about CSS-level questions",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:42): in canvas' case it's actually already specced, i just commented it out since it depends on CSS spec text that isn't yet written",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:42): 65325d50b2e25aca54bc871b89758c9c: and I will say that from what I see, people in Japan are definitely much pickier about language features for books than they are for websites",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:43): We're arguing about vertical-text stuff in the CSSWG right now anyway, spurred mostly by epub.",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:43): in the case of subtitles it'll be similarly commented out once i'm done unless css has caught up, but it's already designed in",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:43): e.g., almost all books -- paperback books, mass-market everyday reading stuff -- uses vertical text",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:44): 1f8387eb43f131d7c309a90a4e36b5cb: good to hear that the discussion is going on in the CSS WG",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:44): 1f8387eb43f131d7c309a90a4e36b5cb: is Murakami-san from Antenna House in the gropu?",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:44): Yeah.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:44): ah",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:44): the vertical text stuff was being discussed in the csswg 2000, too",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:44): when i joined the group",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:44): He's an editor of one of the relevant specs, actually.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:44): ok",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:44): we even went to CR once!",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:44): Yeah, the consensus is still sorta *shrug*.",
        "69b0d3dfe919a6b860a9fac82de52a7e (22:44): (and then took it back when fantasai didn't like it)",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:46): well, Murakami-san can argue with some vehemence, for sure. But his an implementor. Not a browser implementor but anyway an implementor of a fairly complex and powerful application",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:47): 1f8387eb43f131d7c309a90a4e36b5cb: I guess it's not reasonable to expect everybody in the group to see vertical text as a hugely higher priority",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:48): maybe a lot of the work on driving it will end up coming from developers on the Chrome team in Japan",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:48): Well, we all want it.  The issue is *how*, because CSS in general contains a lot of assumptions that depend on horizontal text layout.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:48): ah",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:48): I see",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:48): There's the IE approach, frex, where switching the writing mode to vertical just &quot;rotates&quot; everything, so that, for example, padding-top now adds padding to one of the horizontal sides.",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:49): But most people in the group think that's stupid.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:50): &quot;frex&quot; is an odd choice of a name for that",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:50): frex = for example",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:50): ah",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:50): heh",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:50): OK",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:50): I'm inconsistent in my usage of that word.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:50): didn't grok the abbreviation at first",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:50): I picked it up from some message board years ago and it's stuck in my head.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:51): just struck me in this case because in Japanese it's pronounced same as &quot;flex&quot;",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:51): Ah.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:51): no difference in translitering &quot;r&quot; and &quot;l&quot;",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:52): Yeah.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:52): which is why I thought those freaking horn things were called &quot;bubuzera&quot;",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:52): because that's what Japanese TV calls them",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:52): Hahaha.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:52): oh, no difference often between &quot;b&quot; and &quot;v&quot; too",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:52): The correct term is &quot;vulvazookeepers&quot;.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (22:53): heh",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:53): So, back to technical talk.",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:54): Another possible solution is to introduce logical-direction equivalents of every physical-direction property, so you can do padding-before, frex, and have it mean padding-top in horizontal writing and padding-left or whatever in vertical writing.",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:55): This would work &quot;automatically&quot;, but only in relatively limited circumstances where you're not adjusting the layout based on writing mode.",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:55): It also doesn't solve related problems, like the fact that in japanese vertical writing an underline goes on the opposite side of what you'd expect.",
        "1f8387eb43f131d7c309a90a4e36b5cb (22:56): So a third possibility is to have some sort of selector or media query or whatnot that distinguishes between when a document/element is in vertical or horizontal mode and lets you apply arbitrary CSS to it.",
        "a9b326df4e6da61c5b6f5e1058be83a2 (23:14): 1f8387eb43f131d7c309a90a4e36b5cb: would seem like a good use for media queries",
        "1f8387eb43f131d7c309a90a4e36b5cb (23:15): There are complications, but yeah, probably."
    ],
    "person_ids": [
        "1f8387eb43f131d7c309a90a4e36b5cb",
        "f9e12e0466f4d059b78bb3f863633092",
        "a9b326df4e6da61c5b6f5e1058be83a2",
        "69b0d3dfe919a6b860a9fac82de52a7e",
        "65325d50b2e25aca54bc871b89758c9c"
    ]
}