{
    "id": "fdb2cd742a9efa85b811d7f751638ffd",
    "messages": [
        "ab7faae5d7b250ea8606486575f8f79c (15:58): &quot;Woohoo, I'm gonna be famous!&quot; - who's going to break the news to them that that typo was already reported on Bugzilla? :-)",
        "f139aba52f9fa1394b4034a7954b2220 (15:59): ab7faae5d7b250ea8606486575f8f79c, where is that quote from?",
        "ab7faae5d7b250ea8606486575f8f79c (16:00): f139aba52f9fa1394b4034a7954b2220: WHATWG list",
        "b25b6b77a0087ff8385941e5545d32ea (16:00): ab7faae5d7b250ea8606486575f8f79c: I think you are focusing on the wrong misapprehension",
        "a924fb58d2c25874322f4e5126f608b9 (16:04): wonders how many of those typos could be fixed with a spell checker",
        "f139aba52f9fa1394b4034a7954b2220 (16:09): a924fb58d2c25874322f4e5126f608b9, http://www.w3.org/TR/html5/single-page/,spell",
        "590325cab98d895113e22a5a703a0f10 (16:11): ab7faae5d7b250ea8606486575f8f79c: That would have been me. Bah, knew that had to be too easy. :)",
        "590325cab98d895113e22a5a703a0f10 (16:11): Guess I'll just have to work harder for immortality.",
        "b25b6b77a0087ff8385941e5545d32ea (16:12): f139aba52f9fa1394b4034a7954b2220: or, alternatively M-x flyspell-mode",
        "f139aba52f9fa1394b4034a7954b2220 (16:12): b25b6b77a0087ff8385941e5545d32ea, what?",
        "b25b6b77a0087ff8385941e5545d32ea (16:13): f139aba52f9fa1394b4034a7954b2220: Inline spellchecking in Emacs. It seems more useful as a solution since it allows the errors to be corrected",
        "f139aba52f9fa1394b4034a7954b2220 (16:14): there's something weird about that W3C spell checker, since it's freezing Minefield",
        "ab7faae5d7b250ea8606486575f8f79c (16:19): 590325cab98d895113e22a5a703a0f10: You could also hope that Hixie gets confused by timezones and thinks your email was sent before the Bugzilla bug was filed",
        "467f6d43402c6573237052cefcc252db (16:21): that spell checker should ignore &lt;code&gt;",
        "ab7faae5d7b250ea8606486575f8f79c (16:22): That wouldn't help with typos in code comments",
        "467f6d43402c6573237052cefcc252db (16:22): grmbl",
        "467f6d43402c6573237052cefcc252db (16:22): I wrote getElementsByClassName",
        "467f6d43402c6573237052cefcc252db (16:22): hopefully people can read over that",
        "590325cab98d895113e22a5a703a0f10 (16:23): ab7faae5d7b250ea8606486575f8f79c: Ooh, yeah, maybe! :)",
        "590325cab98d895113e22a5a703a0f10 (16:23): Actually I have some other errors up my sleeve.",
        "467f6d43402c6573237052cefcc252db (16:28): 590325cab98d895113e22a5a703a0f10, you'll now be known as the guy that tried to get his name in HTML5 by reporting a spelling error... and failed! :D",
        "590325cab98d895113e22a5a703a0f10 (16:29): 467f6d43402c6573237052cefcc252db: :(",
        "a924fb58d2c25874322f4e5126f608b9 (16:29): That's probably better fame-wise than being one among hundreds of acks in the spec",
        "590325cab98d895113e22a5a703a0f10 (16:29): 467f6d43402c6573237052cefcc252db: Oh well, I'll take it.",
        "467f6d43402c6573237052cefcc252db (16:30): 590325cab98d895113e22a5a703a0f10, I can see how this might not be funny to you. Fortunately you were planning on doing more review :)",
        "590325cab98d895113e22a5a703a0f10 (16:32): It is funny, I just like making sad faces.",
        "590325cab98d895113e22a5a703a0f10 (16:33): Besides, I'm sure the XHTML2 group would be more than happy to receive my spellcheck powers! Ha!",
        "ab7faae5d7b250ea8606486575f8f79c (16:35): But they won't make you famous unless you join their WG",
        "b25b6b77a0087ff8385941e5545d32ea (16:36): You can get famous in the XHTML2 WG? I thought you languished in academic obscurity",
        "590325cab98d895113e22a5a703a0f10 (16:36): Ah well. Never mind then.",
        "ab7faae5d7b250ea8606486575f8f79c (16:36): HTML5 is happy to give equal fame to cats as to browser developers",
        "590325cab98d895113e22a5a703a0f10 (16:36): Maybe I should have my cats report typos then.",
        "590325cab98d895113e22a5a703a0f10 (16:37): My time-travelling cats, that is.",
        "b25b6b77a0087ff8385941e5545d32ea (16:37): Yeah it true that the acknowledgements list is too long. Maybe I should train some cats to kill the other people on it",
        "590325cab98d895113e22a5a703a0f10 (16:37): Anyway, back to work now. I guess I'll report future stuff in Bugzilla.",
        "ab7faae5d7b250ea8606486575f8f79c (16:39): I don't think there's much value in using Bugzilla rather than the list",
        "ab7faae5d7b250ea8606486575f8f79c (16:40): I suppose there might be a bit of value in checking both Bugzilla and the list for duplicates before posting, but that's not too important since we'll let Hixie deal with it :-)",
        "ab7faae5d7b250ea8606486575f8f79c (16:40): so it's probably best to just do whatever's easier",
        "590325cab98d895113e22a5a703a0f10 (16:40): Well, at least I can try to be less redundant by seeing what's already been reported there.",
        "590325cab98d895113e22a5a703a0f10 (16:41): Okay, thanks!",
        "467f6d43402c6573237052cefcc252db (16:43): b8810fee2f4a71f849f3f7409546d1d9, where you put the dual tokens leaks in one way or another",
        "f139aba52f9fa1394b4034a7954b2220 (16:43): using bugzilla for reporting spec bugs is useful because it keeps the volume of traffic on the mailing list lower",
        "467f6d43402c6573237052cefcc252db (16:44): b8810fee2f4a71f849f3f7409546d1d9, so the spec will have to dicate something",
        "ab7faae5d7b250ea8606486575f8f79c (16:44): f139aba52f9fa1394b4034a7954b2220: Why is lowering volume on the mailing list a goal?",
        "b25b6b77a0087ff8385941e5545d32ea (16:45): For typos it generates the same amount of mail",
        "f139aba52f9fa1394b4034a7954b2220 (16:45): because it means discussions like that on bug 6684 don't generate too much noise",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:45): 467f6d43402c6573237052cefcc252db: It doesn't leak if you make createElementNS lowercase and throw upon importing non-lowercase node from an XML doc",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:46): 467f6d43402c6573237052cefcc252db: but I'm not convinced that plugging the leak is worthwhile",
        "f139aba52f9fa1394b4034a7954b2220 (16:46): b25b6b77a0087ff8385941e5545d32ea, that's because bugzilla has been misconfigured to send new bugs to public-html instead of just public-html-bugzilla",
        "ab7faae5d7b250ea8606486575f8f79c (16:47): f139aba52f9fa1394b4034a7954b2220: Almost the entire purpose of the mailing list is to have discussions, so it seems discussions should go there",
        "467f6d43402c6573237052cefcc252db (16:47): b8810fee2f4a71f849f3f7409546d1d9, what exactly is your strategy?",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:47): 467f6d43402c6573237052cefcc252db: do you mean implementation strategy?",
        "ab7faae5d7b250ea8606486575f8f79c (16:47): (Bugzilla might be more useful for things there's no point in anyone except the editor reading and no need for discussion, like typos)",
        "f139aba52f9fa1394b4034a7954b2220 (16:48): ab7faae5d7b250ea8606486575f8f79c, in principle, yet. But experience with public-html suggests that it's useful to try and keep as much unproductive discussion off the list as possible, so that the little bit of productive discussion that goes on there doesn't get drowned out in the noise",
        "467f6d43402c6573237052cefcc252db (16:49): b8810fee2f4a71f849f3f7409546d1d9, what is the alternative to what I posted for getElementsByTagName?",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:51): 467f6d43402c6573237052cefcc252db: the alternative is that each element node has a pointer to an interned compound name struct (aka. node info in Gecko and qualified name in WebKit) and this struct has pointers to four interned items:",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:51): namespace, local name, prefix and ASCII-lowercased local name",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:52): then in XML, selectors preserve case and match against local name",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:52): and in HTML selectors are lower-case and match against ASCII-lowercased local name",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:53): making SVG-in-text/html nodes give the appearance of case-insensitive selector matching",
        "467f6d43402c6573237052cefcc252db (16:54): that's not just a different strategy, that gives different results",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:54): and the third alternative is using a single local name atoms on both sides and magic fixup lists that can't support textArea",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:54): 467f6d43402c6573237052cefcc252db: different results",
        "467f6d43402c6573237052cefcc252db (16:55): i think what bz said makes the most sense",
        "467f6d43402c6573237052cefcc252db (16:55): that's also what i said on IRC yesterday... :)",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:55): so, yeah I guess there's no way around the spec forcing which side you put the dual atoms on",
        "b8810fee2f4a71f849f3f7409546d1d9 (16:56): 467f6d43402c6573237052cefcc252db: yesterday I didn't know that bz would be OK with HTMLness compare plus pointer compare instead of just pointer compare :-)",
        "590325cab98d895113e22a5a703a0f10 (16:56): Hey, shouldn't this page: http://www.whatwg.org/specs/ include the newly separated specs? Or are they listed somewhere else?",
        "467f6d43402c6573237052cefcc252db (16:57): they moved to the W3C",
        "467f6d43402c6573237052cefcc252db (16:57): http://dev.w3.org/html5/",
        "590325cab98d895113e22a5a703a0f10 (16:59): Ah, okay, thanks."
    ],
    "person_ids": [
        "ab7faae5d7b250ea8606486575f8f79c",
        "f139aba52f9fa1394b4034a7954b2220",
        "b25b6b77a0087ff8385941e5545d32ea",
        "a924fb58d2c25874322f4e5126f608b9",
        "590325cab98d895113e22a5a703a0f10",
        "467f6d43402c6573237052cefcc252db",
        "b8810fee2f4a71f849f3f7409546d1d9"
    ]
}