{
    "id": "fe8fbf65fb8b6e193b3ce55b41490811",
    "messages": [
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:03): another 14 &quot;dropped&quot; from the HTML WG...",
        "77db19c1dd94414f199e58aa6ca1827f (19:13): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: did you see that Microsoft submitted their XDomainRequest thing?",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:15): I saw they reposted some notes they posted elsewhere on the interwebs :)",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:16): It seems to offer a lot less functionality than Access Control. It is basically cross-site &lt;form&gt; without cookies/credentials but with the response.",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:17): You can't use it for XSLT or &lt;event-source&gt;, you can't set arbitrary headers, it only works for 200 response codes, etc.",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:18): It requires a new networking interface...",
        "b8810fee2f4a71f849f3f7409546d1d9 (19:20): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: looks like they don't preflight on POST...",
        "139513027e8e90b5582cbc68fc733884 (19:22): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: I would guess the security issue they alluded to is DNS rebinding",
        "139513027e8e90b5582cbc68fc733884 (19:23): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: if any form of permission granting is persistent across multiple requests then there would be a DNS rebinding attack",
        "139513027e8e90b5582cbc68fc733884 (19:23): hmmm",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:23): b8810fee2f4a71f849f3f7409546d1d9, yes, but they don't do cookies/credentials either and they have some intranet weirdness",
        "b8810fee2f4a71f849f3f7409546d1d9 (19:24): 139513027e8e90b5582cbc68fc733884: not if they happen in the same keep-alive",
        "b8810fee2f4a71f849f3f7409546d1d9 (19:24): (which would violate layering, but...)",
        "139513027e8e90b5582cbc68fc733884 (19:24): b8810fee2f4a71f849f3f7409546d1d9: sure, I don't remember how much persistence is in the spec",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:24): 139513027e8e90b5582cbc68fc733884, not if you give the server sufficient information (Access-Control-Origin) to prevent that",
        "139513027e8e90b5582cbc68fc733884 (19:24): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: ok then maybe there is no vulnerability",
        "139513027e8e90b5582cbc68fc733884 (19:25): e3fb62ebfa4f36acf5cbff6a6ed0f2e0: but I think the attempt to prevent non-GET requests without explicit allow might be vulnerable to a rebinding attack",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:25): The editor's draft states that: &quot;In addition to checking the Access-Control-Origin HTTP header authors should also check the Host HTTP header and make sure the host name provided by that header matches the host name of their server. This will provide protection against DNS rebinding attacks.&quot;",
        "139513027e8e90b5582cbc68fc733884 (19:26): but isn't there a separate GET request to allow non-GET?",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:27): there's an OPTIONS request, yes",
        "139513027e8e90b5582cbc68fc733884 (19:27): presumably to protect servers that have not adopted XXX at all from getting surprising non-GET method requests?",
        "139513027e8e90b5582cbc68fc733884 (19:27): right, OPTIONS",
        "139513027e8e90b5582cbc68fc733884 (19:27): couldn't you subvert that with DNS rebinding?",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:28): as long as the server does the checks I'm not sure why",
        "139513027e8e90b5582cbc68fc733884 (19:28): the point of the check is to prevent doing a cross-site POST to a server that has not been changed to do any checks",
        "139513027e8e90b5582cbc68fc733884 (19:28): (the point of the OPTIONS request that is)",
        "139513027e8e90b5582cbc68fc733884 (19:29): so if you arrange for the OPTIONS request to be sent to evil.com",
        "139513027e8e90b5582cbc68fc733884 (19:29): then rebind evil.com to point to victim.com's server",
        "139513027e8e90b5582cbc68fc733884 (19:29): then do a POST to evil.com",
        "139513027e8e90b5582cbc68fc733884 (19:29): victim.com gets an unexpected cross-site POST",
        "139513027e8e90b5582cbc68fc733884 (19:30): I'm not sure if that is any worse in practice than a cross-site form post",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:30): it might be",
        "139513027e8e90b5582cbc68fc733884 (19:30): but it does seem to subvert part of the purpose of the OPTIONS check",
        "139513027e8e90b5582cbc68fc733884 (19:31): similarly, if the OPTIONS result can be cached for a long time, then there's also a potential DNS poisoning attack which lasts even after you leave the network with polluted DNS",
        "b8810fee2f4a71f849f3f7409546d1d9 (19:31): what if evil.com hijacks the DNS and points victim.com to evil.com during OPTIONS and then points it to victim.com",
        "b8810fee2f4a71f849f3f7409546d1d9 (19:31): in that case the Host header will be victim.com",
        "b8810fee2f4a71f849f3f7409546d1d9 (19:31): (although the hijack will be harder)",
        "139513027e8e90b5582cbc68fc733884 (19:32): b8810fee2f4a71f849f3f7409546d1d9: if evil.com can DNS hijack victim.com it can do all sorts of attacks, though of course it is good not to add new ones",
        "b8810fee2f4a71f849f3f7409546d1d9 (19:32): 139513027e8e90b5582cbc68fc733884: fair enough",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:33): ah, this was started because of some e-mails I just started to receive",
        "139513027e8e90b5582cbc68fc733884 (19:33): I guess we can see what MS says about what they think the vulnerabilities are",
        "b8810fee2f4a71f849f3f7409546d1d9 (19:33): how common is it for servers not to reject unknown Host these days?",
        "139513027e8e90b5582cbc68fc733884 (19:33): b8810fee2f4a71f849f3f7409546d1d9: sadly, not common at all",
        "139513027e8e90b5582cbc68fc733884 (19:33): though I think it is important for them to start doing so to defend against rebinding attacks",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:43): so the only trick to work around DNS rebinding of OPTIONS is have some kind nonce I suppose",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:43): hmm",
        "b8810fee2f4a71f849f3f7409546d1d9 (19:46): or mixing layers so that OPTIONS is required for each HTTP connection",
        "b8810fee2f4a71f849f3f7409546d1d9 (19:46): might be a pain for http libraries",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:46): I don't understand",
        "b8810fee2f4a71f849f3f7409546d1d9 (19:46): s/HTTP/TCP/",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:47): I also don't get the MS comments &quot;existing implementations have bugs&quot; with a pointer to a bug in Mozilla about implementing cross-site XMLHttpRequest... and another pointer to Flash which uses a totally different mechanism",
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0 (19:47): (which is indeed insecure)",
        "b8810fee2f4a71f849f3f7409546d1d9 (19:48): i.e. requiring the preflight and the main request to go in a single TCP connection",
        "77db19c1dd94414f199e58aa6ca1827f (19:51): it doesn't have to be a single TCP connection as long as it is the same IP address"
    ],
    "person_ids": [
        "e3fb62ebfa4f36acf5cbff6a6ed0f2e0",
        "77db19c1dd94414f199e58aa6ca1827f",
        "b8810fee2f4a71f849f3f7409546d1d9",
        "139513027e8e90b5582cbc68fc733884"
    ]
}