{
    "id": "fe94198ef67b1ea57781d3d1bd621701",
    "messages": [
        "b9acb5df457f56156060d93d0827b8ac (01:12): edb259c0e0038f38bb200bc20c8cbf7e: I think the heading information for your table is almost right now",
        "b9acb5df457f56156060d93d0827b8ac (01:13): The finalk thing is that the &lt;th&gt;Day 2&lt;/th&gt; has &quot;Day 1&quot; as one of its headings (and so on down the page)",
        "b9acb5df457f56156060d93d0827b8ac (01:13): This is because these headers aren't assigned any heading information from the scope algorithm",
        "b9acb5df457f56156060d93d0827b8ac (01:14): and HTML 4 says &quot;In the absence of header information from either the scope or headers attribute, user agents may construct header information according to the following algorithm&quot;",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:14): how would Day 2 get Day 1? Day 1 has an explicit scope...",
        "b9acb5df457f56156060d93d0827b8ac (01:15): From the implicit algorithm.",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:15): I do get how Day x gets Location, estimated time, etc. although that's not desired",
        "b9acb5df457f56156060d93d0827b8ac (01:15): I think it's an incorrect reading of the HTML 4 spec, but I don't know what the right reading is.",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:16): I'm not sure why you think there's absense of scope or headers attribute",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:17): I suppose I need something like &lt;th scope=rowgroup colspan=4 headers&gt;Day x&lt;/th&gt; to override the Location, Height, ... headings",
        "b9acb5df457f56156060d93d0827b8ac (01:17): Because, at the moment, my implementation assumes that &quot;&quot;In the absence of header information from either the scope or headers attribute&quot; applies to the cell we are trying to assign a heading to",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:17): assuming &lt;th headers&gt; works like that",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:18): b9acb5df457f56156060d93d0827b8ac, yeah, so you look up and find a &lt;th&gt;, but that &lt;th&gt; can't be the header of the header because it has a different scope...",
        "b9acb5df457f56156060d93d0827b8ac (01:18): in the case of the &lt;th&gt; cell containing &quot;Day 2&quot; there is no information from any scope or headers attribute that assigns heading information to that cell",
        "b9acb5df457f56156060d93d0827b8ac (01:19): edb259c0e0038f38bb200bc20c8cbf7e: But does HTML 4 actually say that?",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:19): not sure",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:19): it also seems that the headers given in &lt;thead&gt; are not applied to the four columns...",
        "b9acb5df457f56156060d93d0827b8ac (01:20): My reading is that if a cell has no heading information supplied from headers or scope you then do the row/column search ignoring scope or headers attributes",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:20): this is the case in the HTML5 algorithm though",
        "b9acb5df457f56156060d93d0827b8ac (01:20): edb259c0e0038f38bb200bc20c8cbf7e: agreed",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:20): HTML5 actually has exactly how I want it",
        "b9acb5df457f56156060d93d0827b8ac (01:20): My imp. of the HTML 5 algorithm seems to get that right",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:20): including the scope=rowgroup headers not getting the &lt;thead&gt; headers",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:21): wonders if that always makes sense",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:21): Probably not.",
        "b9acb5df457f56156060d93d0827b8ac (01:21): My conclusion from playing with a few tables on the net is that nothing always makes sense",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:22): You could have a header cell for a rowgroup in a row that contained summary information/totals for the rowgroup",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:22): I think I've seen tables like that in print.",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:22): I'm not sure if that's correct usage though",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:23): correct usage of what?",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:23): of HTML tables",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:23): Why aren't you?",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:24): because it doesn't make much sense to me to put summaries in headers",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:24): edb259c0e0038f38bb200bc20c8cbf7e: I don't see why not. A good example would be demographics.",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:24): say you have area then pop in the thead",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:25): then you have each rowgroup as a continent with total pop",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:25): then you have countries in each rowgroup row",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:25): with their respective pop",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:26): Don't forget that a td can be a header simultaneously with being a data cell.",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:28): that's not actually clear from HTML4",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:28): edb259c0e0038f38bb200bc20c8cbf7e: yes it is. it's stated in the DTD",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:28): is there anything that contradicts that?",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:29): the prose doesn't really support that comment",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:30): edb259c0e0038f38bb200bc20c8cbf7e: I think trying to read the comments against the prose doesn't make much sense. Specifications aren't meant to be read to be self-contradicting. :) (They might be self-contradicting by accident, but you don't seem to be arguing that's the case here.)",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:32): I'm not sure why it doesn't make sense. Comments, notes, examples, etc. are all non-normative. (Although in this specific case nothing much is normative and the whole thing is rather vague.)",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:34): edb259c0e0038f38bb200bc20c8cbf7e: Actually the prose does say: &quot;Note that it's not always possible to make a clean division of cells into headers or data. You should use the TD element for such cells together with the id or scope attributes as appropriate.&quot; Which seems a relatively clear restatement of the principle.",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:34): edb259c0e0038f38bb200bc20c8cbf7e: Yes. But they are all intended to help explain the spec, not contradict it.",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:35): therefore trying to read them as a source of contradictions, like two alternative sources for the same thing, is strange",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:35): (that quote is from 11.4.1)",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:36): edb259c0e0038f38bb200bc20c8cbf7e: also note the example intended to illustrate the scope attribute which features td with the scope=&quot;row&quot;",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:36): followed by the text in the prose: &quot;Although the first cell in each row contains data, not header information, the scope attribute makes the data cell behave like a row header cell.&quot;",
        "cc097e0d7183ae8436e7df709553c8c0 (01:37): is unsure what the benefit is of trying to figure out what the intent of html4 is",
        "cc097e0d7183ae8436e7df709553c8c0 (01:37): isn't it better to focus on figuring out an algorithm for html5 that works with existing tables on the web?",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:37): is not going to add scope=&quot;row&quot; to all his &lt;tr&gt;s",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:37): euh, &lt;td&gt;s",
        "b9acb5df457f56156060d93d0827b8ac (01:37): cc097e0d7183ae8436e7df709553c8c0: I'm interested insofar as it it necessary to show people that vauge = bad + probably illogical",
        "b9acb5df457f56156060d93d0827b8ac (01:38): (illogical in non-trivial cases, that is)",
        "cc097e0d7183ae8436e7df709553c8c0 (01:38): b9acb5df457f56156060d93d0827b8ac: ok",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:39): it's also good to know what use cases HTML4 catered for",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:39): edb259c0e0038f38bb200bc20c8cbf7e: Actually looking through the prose throughout supports that comment.",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:39): I hadn't realised just how supported it was.",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:40): ?",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:41): I can't see how one could construct anything contradicting the comment.",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:41): oh",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:42): cc097e0d7183ae8436e7df709553c8c0: Depends on whether &quot;figuring out an algorithm ... that works with existing tables&quot; without consulting the spec that data table creators used is a realistic task. I suspect it isn't.",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:44): (Although I'd certainly say it would be also worth looking at representations of the spec in major unlearning resources like w3schools.)",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:45): I'm not sure why it's unrealistic to study actual tables out there",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:47): edb259c0e0038f38bb200bc20c8cbf7e: I didn't say it was. I think that's a very important part of the process too.",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:48): edb259c0e0038f38bb200bc20c8cbf7e: What I am saying is it's unrealistic to /only/ do that.",
        "ef6f2287bae00ba79475fbf56c2b6fee (01:50): (because the spec is a guide to well-authored tables that aren't sampled and unlearning resources are a guide to badly authored ones)",
        "edb259c0e0038f38bb200bc20c8cbf7e (01:51): shrugs and goes to bed",
        "840e1d221f99248a378e686b47fdea58 (01:51): speaking of w3schools... http://w3schools.invisionzone.com/index.php?showtopic=15018 *grin*",
        "ab7faae5d7b250ea8606486575f8f79c (01:58): I'm hoping that doesn't count as a legitimate use case for &lt;input usemap&gt;",
        "ab7faae5d7b250ea8606486575f8f79c (01:58): (It's good to see the author has stopped using &lt;font&gt; - now they just need to go a little further and stop using &lt;/font&gt; too...)",
        "edb259c0e0038f38bb200bc20c8cbf7e (02:05): Given the way how HTML5 defines that browsers should present an image (inside an HTML document) you can  theoretically style that page using the Link: HTTP header...",
        "edb259c0e0038f38bb200bc20c8cbf7e (02:05): adds it to a list of silly things to test",
        "edb259c0e0038f38bb200bc20c8cbf7e (02:09): &quot;, and to the #mrt crew, the #mrt.no crew, and the cabal for their ideas and support.&quot;",
        "edb259c0e0038f38bb200bc20c8cbf7e (02:09): lol, I'm pretty sure that read #whatwg before..."
    ],
    "person_ids": [
        "b9acb5df457f56156060d93d0827b8ac",
        "edb259c0e0038f38bb200bc20c8cbf7e",
        "ef6f2287bae00ba79475fbf56c2b6fee",
        "cc097e0d7183ae8436e7df709553c8c0",
        "840e1d221f99248a378e686b47fdea58",
        "ab7faae5d7b250ea8606486575f8f79c"
    ]
}